Функция Создать(Владелец, Наименование = "") Экспорт

	Помещение = СоздатьЭлемент();
	Помещение.Наименование = Наименование;
	Помещение.Владелец = Владелец;
	
	Возврат Помещение;

КонецФункции // ()

Функция ПолучитьНовый(Владелец, Знач Наименование = Неопределено) Экспорт

	Наименование = ?(Наименование = Неопределено, "<>", Наименование);
	Помещение = Создать(Владелец, Наименование);
	Помещение.Записать();
	
	Возврат Помещение.Ссылка;

КонецФункции // ()

Процедура ИзменитьНаименование(Помещение, Наименование) Экспорт

	Объект = Помещение.ПолучитьОбъект();
	Объект.Наименование = Наименование;
	Объект.Записать();

КонецПроцедуры

// Возвращает набор типов имущества по которым определяются возможные свойства
//
// Возвращаемое значение:
//   Массив из ПланВидовХарактеристикСсылка.Имущество  - Допустимые типы для Свойств
//
Функция ДопустимыеВариантыСвойст() Экспорт

	Имущество = ПланыВидовХарактеристик.Имущество;
	Возврат Имущество.ПолучитьВарианты(Имущество.Помещения);

КонецФункции // ()

