
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Замена типов в регистре
	Для Каждого Элемент Из ЭтотОбъект.Объекты Цикл
		Набор = РегистрыСведений.ОтветственныеСотрудники.СоздатьМенеджерЗаписи();
		Набор.Объект = Элемент.Объект;
		Набор.ТипСотрудника = Элемент.ТипСотрудника;
		Набор.Пользователь = Элемент.Сотрудник;
		Попытка
			Набор.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
			Отказ = Истина;
			Возврат;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//Восстановление типов в регистре
	Для Каждого Элемент Из ЭтотОбъект.Объекты Цикл
		Набор = РегистрыСведений.ОтветственныеСотрудники.СоздатьМенеджерЗаписи();
		Набор.Объект = Элемент.Объект;
		Набор.ТипСотрудника = Элемент.ТипСотрудника;
		Набор.Пользователь = ЭтотОбъект.Ответственный;
		Попытка
			Набор.Записать();
		Исключение
			Отказ = Истина;
			Возврат;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения <> Неопределено Тогда
		ТЗ = ДанныеЗаполнения.Объекты;
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		ТипПользователя = ТекПользователь.ТипСотрудника;
		Если ТЗ <> Неопределено Тогда
			Для Каждого Элемент Из ТЗ Цикл
				НовСтр               = Объекты.Добавить();
				НовСтр.Объект        = Элемент.Объект;
				НовСтр.Сотрудник     = ТекПользователь;
				НовСтр.ТипСотрудника = ТипПользователя;	
			КонецЦикла;
		КонецЕсли;
		ДокументОснование = ДанныеЗаполнения;  
	КонецЕсли;
КонецПроцедуры
