
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ИсполнительныеДокументы") Тогда
		Отбор = Новый Структура("Решение", ОбъектыСервер.РазыменоватьСсылку(ПараметрКоманды, "СудебноеРешение"));
		Отбор.Вставить("ЧастьРешения", ОбъектыСервер.РазыменоватьСсылку(ПараметрКоманды, "ЧастьРешения"));
		Структура = Новый Структура("Отбор", Отбор);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		Отбор = Новый Структура("Займ", ПараметрКоманды);	
		Структура = Новый Структура("Отбор", Отбор);
	КонецЕсли;
	ОткрытьФорму("РегистрНакопления.ЗадолженностьПоСудебнымРешениям.ФормаСписка", 
				Структура, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);	
КонецПроцедуры
