
Перем ОбъектыПерерасчета;

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Константы.РасчетНачислений.Получить() Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Для Каждого Элемент Из ОбъектыПерерасчета Цикл
			ПерерасчитатьГрафики(Элемент, Ложь);
		КонецЦикла;
	Иначе 
		Для Каждого Элемент Из ЭтотОбъект Цикл
			ПерерасчитатьГрафики(Элемент, Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Константы.РасчетНачислений.Получить() Тогда
		Возврат;
	КонецЕсли;	
	
	ОбъектыПерерасчета = Новый Массив;
	Если ЭтотОбъект.Количество() = 0 Тогда
		ЭтотОбъект.Прочитать();		
		Для Каждого Элемент Из ЭтотОбъект Цикл
			стр = Новый Структура;
			стр.Вставить("Объект", Элемент.Объект);
			стр.Вставить("Период", Элемент.Период);
			стр.Вставить("Задолженность", Элемент.Задолженность);
			ОбъектыПерерасчета.Добавить(стр);
		КонецЦикла;
		ЭтотОбъект.Очистить();
	КонецЕсли;
КонецПроцедуры

Процедура ПерерасчитатьГрафики(Платеж, Проведение)
	//РасчетЗадолженностиМФО.РассчитатьГрафикПоЗайму(Платеж.Объект, Платеж.Период);
	РасчетЗадолженностиМФО.ПерерасчитатьСУчетомПлатежа(Платеж.Объект, Платеж.Период, Платеж.Задолженность, Проведение);
КонецПроцедуры