
#Область ПрограммныйИнтерфейс

Функция Создать() Экспорт

	Возврат СоздатьНаборЗаписей();

КонецФункции // ()

Процедура Просклонять() Экспорт

	Блокировка = Новый БлокировкаДанных;
	ТаблицаБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСклоненийФИО");
	
	ТаблицаБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Контрагенты = Новый Массив;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Попытка
	
		Блокировка.Заблокировать();
		
		Контрагенты = ПолучитьКонтрагентов();
		ОчиститьВсе();
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		ОтменитьТранзакцию();
		Контрагенты = Новый Массив;
	КонецПопытки;
	
	Если Контрагенты.Количество() = 0 Тогда
	
		Возврат;
	
	КонецЕсли;
	
	ВычислитьПадежи(Контрагенты);

КонецПроцедуры

Функция Пустая() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОчередьСклоненийФИО.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.ОчередьСклоненийФИО КАК ОчередьСклоненийФИО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();

КонецФункции // ()

Функция ПолучитьВсех() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьСклоненийФИО.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.ОчередьСклоненийФИО КАК ОчередьСклоненийФИО";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контрагент");

КонецФункции // ()

Функция ПолучитьКонтрагентов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьСклоненийФИО.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.ОчередьСклоненийФИО КАК ОчередьСклоненийФИО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контрагент");

КонецФункции // ()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьВсе()

	Записи = СоздатьНаборЗаписей();
	Записи.Записать();

КонецПроцедуры

Процедура ВычислитьПадежи(Контрагенты)

	Для каждого Контрагент Из Контрагенты Цикл
	
		РегистрыСведений.СклонениеФИО.ЗаполнитьСклонения(Контрагент);
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
