Процедура _ЗаписатьХранилищеЗначений(НомерСтроки, Хранилище,ИмяТаблицы) Экспорт
	Записать();
	Для Каждого Стр Из ЭтотОбъект.РеквизитыИСвойства Цикл
		Если Стр.НомерСтроки = НомерСтроки Тогда
			Стр.Хранилище = Хранилище;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Записать();
КонецПроцедуры

Процедура Записать_СтрокаХранилище(НомерСтроки, МассивДанных,ИмяТаблицы) Экспорт
	ТаблицаОбъекта = ЭтотОбъект[ИмяТаблицы];
	Записать();
	Для Каждого Стр Из ТаблицаОбъекта Цикл
		Если Стр.НомерСтроки = НомерСтроки Тогда
			Стр.СтрокаХранилище = "";
			Для Каждого СтрМ Из МассивДанных Цикл
				Стр.СтрокаХранилище = Стр.СтрокаХранилище + "[" + СтрМ + "]";
			КонецЦикла;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Записать();
КонецПроцедуры