
&НаКлиенте
Процедура СписокДОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.СписокДО.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.СписокДО.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДолжникМероприятия(Команда)
	// Передать с ключом
	К = Элементы.СписокДО.ТекущиеДанные.Ссылка;
	ФормаМероприятия = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаСписка",,,Новый УникальныйИдентификатор());
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаМероприятия.Список, "Объект", К, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	ФормаМероприятия.Открыть();
КонецПроцедуры

&НаСервере
Процедура РазблокироватьНаСервере()
	ДО = ЭтаФорма.СкрытоеПолеНомерДО.ПолучитьОбъект();
	ДО.ЗапретАвтообзвона = Ложь;
	ДО.НеконтактныеНомера = Ложь;
	ДО.Записать();
КонецПроцедуры

&НаСервере
Процедура РазблокироватьВсеНаСервере()
	// Выгрузить заблокированные по причине неконтактности ДО
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ЗапретАвтообзвона = ИСТИНА
	|	И ДолговыеОбязательства.НеконтактныеНомера = ИСТИНА";
	
	ОбработкаДелДляАвтообзвона(Запрос);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаДелДляАвтообзвона(Знач Запрос)
	
	Перем Выборка, Договор, РезультатЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Договор = Выборка.Ссылка.ПолучитьОбъект();
		// Разблокировать ДО для автообзвона
		Договор.ЗапретАвтообзвона = Ложь;
		Договор.НеконтактныеНомера = Ложь;
		Договор.Записать();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Разблокировать(Команда)
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.СписокДО И Элементы.СписокДО.ТекущиеДанные <> Неопределено Тогда
		ЭтаФорма.СкрытоеПолеНомерДО = Элементы.СписокДО.ТекущиеДанные.Ссылка;
		РазблокироватьНаСервере();
		Для Счетчик = 1 По 100 Цикл
			Состояние("Разблокировка дел", Счетчик, "Пожалуйста, подождите...", БиблиотекаКартинок.NC_Разблокировано);
		КонецЦикла;
		ПоказатьОповещениеПользователя("Блокировщик дел",,"Автообзвон разрешен",БиблиотекаКартинок.NC_Разблокировано);
	Иначе
		Предупреждение("Не выбран объект!",,"Блокировщик дел");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьВсе(Команда)
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.СписокДО И Элементы.СписокДО.ТекущиеДанные <> Неопределено Тогда
		РазблокироватьВсеНаСервере();
		Для Счетчик = 1 По 100 Цикл
			Состояние("Разблокировка дел", Счетчик, "Пожалуйста, подождите...", БиблиотекаКартинок.NC_Разблокировано);
		КонецЦикла;
		ПоказатьОповещениеПользователя("Блокировщик дел",,"Автообзвон разрешен",БиблиотекаКартинок.NC_Разблокировано);
	Иначе
		Предупреждение("Не выбраны объекты!",,"Блокировщик дел");
	КонецЕсли;
КонецПроцедуры