&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Установить даты периода
	Дата = НачалоДня(ТекущаяДата() - 7776000);
	СписокДО.Параметры.УстановитьЗначениеПараметра("Д", Дата);
	Дата = НачалоДня(ТекущаяДата());
	СписокДО.Параметры.УстановитьЗначениеПараметра("Д2", Дата);
КонецПроцедуры

&НаКлиенте
Процедура СписокДОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.СписокДО.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.СписокДО.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДолжникМероприятия(Команда)
	// Передать с ключом
	К = Элементы.СписокДО.ТекущиеДанные.Ссылка;
	ФормаМероприятия = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаСписка",,,Новый УникальныйИдентификатор());
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаМероприятия.Список, "Объект", К, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	ФормаМероприятия.Открыть();
КонецПроцедуры

&НаСервере
Процедура РазблокироватьНаСервере()
	ДО = ЭтаФорма.СкрытоеПолеНомерДО.ПолучитьОбъект();
	ДО.АвтообзвонЗапрещен = Ложь;
	ДО.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Разблокировать(Команда)
	ЭтаФорма.СкрытоеПолеНомерДО = Элементы.СписокДО.ТекущиеДанные.Ссылка;
	РазблокироватьНаСервере();
	ПоказатьОповещениеПользователя("Блокировщик дел",,"Автообзвон разрешен",БиблиотекаКартинок.NC_Разблокировано);
КонецПроцедуры