&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Установить даты периода
	Дата = НачалоДня(ТекущаяДата() - 7776000);
	СписокДО.Параметры.УстановитьЗначениеПараметра("Д", Дата);
	Дата = НачалоДня(ТекущаяДата());
	СписокДО.Параметры.УстановитьЗначениеПараметра("Д2", Дата);
КонецПроцедуры

&НаКлиенте
Процедура СписокДОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.СписокДО.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.СписокДО.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДолжникМероприятия(Команда)
	// Передать с ключом
	К = Элементы.СписокДО.ТекущиеДанные.Ссылка;
	ФормаМероприятия = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаСписка",,,Новый УникальныйИдентификатор());
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаМероприятия.Список, "Объект", К, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	ФормаМероприятия.Открыть();
КонецПроцедуры

&НаСервере
Процедура РазблокироватьНаСервере()
	ДО = ЭтаФорма.СкрытоеПолеНомерДО.ПолучитьОбъект();
	ДО.ЗапретАвтообзвона = Ложь;
	ДО.НеконтактныеНомера = Ложь;
	ДО.Записать();
КонецПроцедуры

&НаСервере
Процедура РазблокироватьВсеНаСервере()
	// Выгрузить заблокированные по причине неконтактности ДО
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ЗапретАвтообзвона = ИСТИНА
	|	И ДолговыеОбязательства.НеконтактныеНомера = ИСТИНА";
	
	ОбработкаДелДляАвтообзвона(Запрос);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаДелДляАвтообзвона(Знач Запрос)
	
	Перем Выборка, Договор, РезультатЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Договор = Выборка.Ссылка.ПолучитьОбъект();
		// Разблокировать ДО для автообзвона
		Договор.ЗапретАвтообзвона = Ложь;
		Договор.Записать();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Разблокировать(Команда)
	ЭтаФорма.СкрытоеПолеНомерДО = Элементы.СписокДО.ТекущиеДанные.Ссылка;
	РазблокироватьНаСервере();
	ПоказатьОповещениеПользователя("Блокировщик дел",,"Автообзвон разрешен",БиблиотекаКартинок.NC_Разблокировано);
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьВсе(Команда)
	Предупреждение("Выполняется снятие запрета на автообзвон... Не прерывайте данную операцию!",15,"Блокировщик дел");
	РазблокироватьВсеНаСервере();
	ПоказатьОповещениеПользователя("Блокировщик дел",,"Автообзвон разрешен",БиблиотекаКартинок.NC_Разблокировано);
КонецПроцедуры