
Процедура УстановитьЗначениеКолонок(ПодчиненныеЭлементы, ИмяТаблицы, СписокСуфиксов = Неопределено) Экспорт

	Для каждого Колонка Из ПодчиненныеЭлементы Цикл
	
		ТекСуфикс = "";
		
		ИмяКолонки = СтрЗаменить(Колонка.Имя, ИмяТаблицы, "");
		
		СписокСуфиксов = ?(СписокСуфиксов = Неопределено, Новый СписокЗначений, СписокСуфиксов);
		Если СписокСуфиксов.Количество() = 0 Тогда
		
			СписокСуфиксов.Добавить("");
		
		КонецЕсли;
		структТипы = Новый Структура;
		
		КонтрольИменТиповЗадолженностиСервер.ПолучитьВыборкуТиповЗадолженности(структТипы);
		Для каждого Суфикс Из СписокСуфиксов Цикл
		
			ИмяКолонкиБезСуфикса = Лев(ИмяКолонки, СтрДлина(ИмяКолонки) - СтрДлина(Суфикс));// + СтрЗаменить(Колонка.Имя, Суфикс, "");
			НаименованиеТипа = КонтрольИменТиповЗадолженностиСервер.НаименованиеТипаЗадолженности(ИмяКолонкиБезСуфикса, структТипы);
			Если НаименованиеТипа <> Неопределено Тогда
			
				ТекСуфикс = Суфикс;
				Прервать;
			
			КонецЕсли;
		
		КонецЦикла;

		Если НаименованиеТипа = Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли;
		Колонка.Заголовок = НаименованиеТипа + " " + ТекСуфикс;
	
	КонецЦикла;

КонецПроцедуры
