
&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФССП_СостояниеИПСрезПоследних.СтатусИП КАК СтатусИП,
		|	ФССП_СостояниеИПСрезПоследних.ОтделСудебныхПриставов КАК ОтделСудебныхПриставов,
		|	ФССП_СостояниеИПСрезПоследних.СудебныйПриставИсполнитель КАК СудебныйПриставИсполнитель,
		|	ФССП_СостояниеИПСрезПоследних.ПричинаОкончания КАК ПричинаОкончания,
		|	ФССП_СостояниеИПСрезПоследних.ДатаОкончания КАК ДатаОкончания,
		|	ФССП_СостояниеИПСрезПоследних.ДатаВозбуждения КАК ДатаВозбуждения,
		|	ФССП_СостояниеИПСрезПоследних.НомерСД КАК НомерСД
		|ИЗ
		|	РегистрСведений.ФССП_СостояниеИП.СрезПоследних(, ИП = &ИП) КАК ФССП_СостояниеИПСрезПоследних";
		
		Запрос.УстановитьПараметр("ИП", Объект.Ссылка);
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда	
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Результат);	
		КонецЕсли;
		
		ЗапросОстатки = Новый Запрос;
		
		ЗапросОстатки.Текст = 
		"ВЫБРАТЬ
		|	ФССП_ЗадолженностьПоПредметамИПОстатки.Предмет КАК Предмет,
		|	ФССП_ЗадолженностьПоПредметамИПОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ФССП_ЗадолженностьПоПредметамИП.Остатки(, ИсполнительноеПроизводство = &ИП) КАК ФССП_ЗадолженностьПоПредметамИПОстатки";
		
		ЗапросОстатки.УстановитьПараметр("ИП", Объект.Ссылка);
		
		РезультатЗапроса = ЗапросОстатки.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		к = 1;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Пред"+к+"", Тип("ДекорацияФормы"),ЭтотОбъект.Элементы.СостояниеИсполнительногоПроизводства);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = Строка(ВыборкаДетальныеЗаписи.Предмет.Наименование) + ":";
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Сум"+к+"", Тип("ДекорацияФормы"),ЭтотОбъект.Элементы.СостояниеИсполнительногоПроизводства);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = ВыборкаДетальныеЗаписи.СуммаОстаток;
            к = к + 1;
		КонецЦикла;
		
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	ОтветчикПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФССП_СостояниеИПСрезПоследних.Период КАК Период,
	                      |	ФССП_СостояниеИПСрезПоследних.Регистратор КАК Регистратор,
	                      |	ФССП_СостояниеИПСрезПоследних.НомерСтроки КАК НомерСтроки,
	                      |	ФССП_СостояниеИПСрезПоследних.Активность КАК Активность,
	                      |	ФССП_СостояниеИПСрезПоследних.ИП КАК ИсполнительноеПроизводство,
	                      |	ФССП_СостояниеИПСрезПоследних.bailiff КАК bailiff,
	                      |	ФССП_СостояниеИПСрезПоследних.department КАК department,
	                      |	ФССП_СостояниеИПСрезПоследних.name КАК name,
	                      |	ФССП_СостояниеИПСрезПоследних.subject КАК subject,
	                      |	ФССП_СостояниеИПСрезПоследних.ip_end КАК ip_end,
	                      |	ФССП_СостояниеИПСрезПоследних.exe_production КАК exe_production,
	                      |	ФССП_СостояниеИПСрезПоследних.details КАК details,
	                      |	ФССП_СостояниеИПСрезПоследних.СтатусИП КАК СтатусИП,
	                      |	ФССП_СостояниеИПСрезПоследних.Завершено КАК Завершено,
	                      |	ФССП_СостояниеИПСрезПоследних.ОтделСудебныхПриставов КАК ОтделСудебныхПриставов,
	                      |	ФССП_СостояниеИПСрезПоследних.СудебныйПриставИсполнитель КАК СудебныйПриставИсполнитель,
	                      |	ФССП_СостояниеИПСрезПоследних.ПричинаОкончания КАК ПричинаОкончания,
	                      |	ФССП_СостояниеИПСрезПоследних.ДатаОкончания КАК ДатаОкончания,
	                      |	ФССП_СостояниеИПСрезПоследних.Предмет1 КАК Предмет1,
	                      |	ФССП_СостояниеИПСрезПоследних.Сумма1 КАК Сумма1,
	                      |	ФССП_СостояниеИПСрезПоследних.Предмет2 КАК Предмет2,
	                      |	ФССП_СостояниеИПСрезПоследних.Сумма2 КАК Сумма2,
	                      |	ФССП_СостояниеИПСрезПоследних.Предмет3 КАК Предмет3,
	                      |	ФССП_СостояниеИПСрезПоследних.Сумма3 КАК Сумма3,
	                      |	ФССП_СостояниеИПСрезПоследних.НомерИД КАК НомерИД,
	                      |	ФССП_СостояниеИПСрезПоследних.НомерСД КАК НомерСД,
	                      |	ФССП_СостояниеИПСрезПоследних.ДатаВозбуждения КАК ДатаВозбуждения
	                      |ИЗ
	                      |	РегистрСведений.ФССП_СостояниеИП.СрезПоследних КАК ФССП_СостояниеИПСрезПоследних
	                      |ГДЕ
	                      |	ФССП_СостояниеИПСрезПоследних.ИП = &ИП");
	Запрос.УстановитьПараметр("ИП", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Если Результат.СтатусИП <> СтатусИП 
			ИЛИ Результат.ОтделСудебныхПриставов <> ОтделСудебныхПриставов 
			ИЛИ Результат.СудебныйПриставИсполнитель <> СудебныйПриставИсполнитель 
			ИЛИ Результат.ПричинаОкончания <> ПричинаОкончания
			ИЛИ Результат.ДатаОкончания <> ДатаОкончания
			ИЛИ Результат.ДатаВозбуждения <> ДатаВозбуждения
			ИЛИ Результат.НомерСД <> НомерСД Тогда
			ОбновитьСостояниеИП();
		КонецЕсли;	
	Иначе
		Если ЗначениеЗаполнено(СтатусИП)
			ИЛИ ЗначениеЗаполнено(ОтделСудебныхПриставов) 
			ИЛИ ЗначениеЗаполнено(СудебныйПриставИсполнитель) 
			ИЛИ ЗначениеЗаполнено(ПричинаОкончания)
			ИЛИ ЗначениеЗаполнено(ДатаОкончания)
			ИЛИ ЗначениеЗаполнено(ДатаВозбуждения)
			ИЛИ ЗначениеЗаполнено(НомерСД) Тогда
			ОбновитьСостояниеИП();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеИП()
	ДокументОбъект = Документы.ОбновлениеИсполнительногоПроизводства.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДата();
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ЭтаФорма);
	ДокументОбъект.Завершено = (СтатусИП = Перечисления.ФССП_СтатусыИП.ОконченоБезИсполнения ИЛИ СтатусИП = Перечисления.ФССП_СтатусыИП.ОконченоИсполнением);
	ДокументОбъект.НомерИД = Объект.НомерИД;
	ДокументОбъект.ИсполнительноеПроизводство = Объект.Ссылка;
	ДокументОбъект.Должник = Объект.Владелец;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновлениеИП");
КонецПроцедуры

&НаСервере
Процедура ОтветчикПриИзмененииНаСервере()
	Объект.ОтветчикФИО = Объект.Владелец.ФИО_Действующее;
	Элементы.ОтветчикФИО.СписокВыбора.Очистить();
	Для Каждого ФИО из Объект.Владелец.ФИО Цикл
		стр = Элементы.ОтветчикФИО.СписокВыбора.Добавить();
		стр.Значение = ФИО.ФИО;
		стр.Представление = ФИО.ФИО;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ОтветчикПриИзменении(Элемент)
	ОтветчикПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//Элементы.ОтветчикФИО.СписокВыбора.Очистить();
	//Для Каждого ФИО из Объект.Владелец.ФИО Цикл
	//	стр = Элементы.ОтветчикФИО.СписокВыбора.Добавить();
	//	стр.Значение = ФИО.ФИО;
	//	стр.Представление = ФИО.ФИО;
	//КонецЦикла;
КонецПроцедуры
