
Процедура ОбработкаПроведения(Отказ, Режим)
		
	ЗаписьВЖурналПродажи(Отказ,Режим);  
	Если не Отказ Тогда
		ВыведениеИзРаботы();
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписьВЖурналПродажи(Отказ, Режим)
	
	// регистр ЖурналПроданныхДоговоров
	Движения.ЖурналПроданныхДоговоров.Записывать = Истина;
	Движения.ЖурналПроданныхДоговоров.Записать();
	Для Каждого ТекСтрокаОбъекты Из Объекты Цикл
		Движение = Движения.ЖурналПроданныхДоговоров.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектУчета = ТекСтрокаОбъекты.Объект;
		Движение.ПриобретательПраваТребования = ПриобретательПраваТребования; 
		КодСобытия = ПолучитьКодПоТипуПродажи();
		КредитныеИстории.ЗаписатьСобытиеСделки(ТекСтрокаОбъекты.Объект, Дата, ЭтотОбъект.Ссылка, КодСобытия);
	КонецЦикла;
	Движения.ЖурналПроданныхДоговоров.Записать();

КонецПроцедуры


Процедура ВыведениеИзРаботы()
	Если ВывестиИзРаботы Тогда 
		Док = Документы.ЗавершениеРаботыОрганизации.СоздатьДокумент();
		Док.Дата = Дата;
		Док.Организация = Организация;
		Док.Автор = Автор;
		Док.Объекты.Загрузить(Объекты.Выгрузить()); 
		Док.Комментарий = Строка(ЭтотОбъект.Ссылка);
		Если Док.Объекты.Количество() > 0 Тогда
			Попытка
				Док.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗавершениеРаботыОрганизации.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗавершениеРаботыОрганизации КАК ЗавершениеРаботыОрганизации
		|ГДЕ
		|	ЗавершениеРаботыОрганизации.Комментарий ПОДОБНО &Комментарий
		|	И ЗавершениеРаботыОрганизации.Автор = &Автор";
	
	Запрос.УстановитьПараметр("Автор", Автор);
	Запрос.УстановитьПараметр("Комментарий", Строка(ЭтотОбъект.Ссылка));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект().Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла; 
	
    КодСобытия = ПолучитьКодПоТипуПродажи();
	Для Каждого ТекСтрокаОбъекты Из Объекты Цикл
		КредитныеИстории.УдалитьСобытиеСделки(ТекСтрокаОбъекты.Объект, Ссылка, КодСобытия);
	КонецЦикла;	
КонецПроцедуры      

Функция ПолучитьКодПоТипуПродажи() 
	КодСобытия = "2.12";
	Если ЭтотОбъект.Цессия Тогда
		КодСобытия = "2.12";
	КонецЕсли;
	
	Если ЭтотОбъект.АгентскаяСхема Тогда
		КодСобытия = "2.11";
	КонецЕсли;   
	
	Если ЭтотОбъект.ЭтоЧастичнаяПередачаПрав Тогда
		КодСобытия = "2.11.1";
	КонецЕсли;	
Конецфункции;	







