
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	ЗаписьВЖурналПродажи(Отказ,Режим);
	Если не Отказ Тогда
		ВыведениеИзРаботы();
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписьВЖурналПродажи(Отказ, Режим)
	
	// регистр ЖурналПроданныхДоговоров
	Движения.ЖурналПроданныхДоговоров.Записывать = Истина;
	Движения.ЖурналПроданныхДоговоров.Записать();
	Для Каждого ТекСтрокаОбъекты Из Объекты Цикл
		Движение = Движения.ЖурналПроданныхДоговоров.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектУчета = ТекСтрокаОбъекты.Объект;
		Движение.ПриобретательПраваТребования = ПриобретательПраваТребования;
	КонецЦикла;
	Движения.ЖурналПроданныхДоговоров.Записать();

КонецПроцедуры


Процедура ВыведениеИзРаботы()
	Если ВывестиИзРаботы Тогда 
		Док = Документы.ЗавершениеРаботыОрганизации.СоздатьДокумент();
		Док.Дата = Дата;
		Док.Организация = Организация;
		Док.Автор = Автор;
		Док.Объекты.Загрузить(Объекты.Выгрузить());
		Если Док.Объекты.Количество() > 0 Тогда
			Попытка
				Док.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры





