
// Возвращает значение по умолчанию по переданному описанию типов
//   Если ОписаниеТипов пустое, возвращает Неопределено
//   Если ОписаниеТипов содержит несколько Типов, при приведении значения возвращается Неопределено
//
// Параметры:
//  ОписаниеТипаДанных  - ОписаниеТипов - Описание типа по которому надо получить значение по умолчанию
//
// Возвращаемое значение:
//   ПроизвольныйТип   - Значение зависит от переданного Описания типа
//
Функция ЗначениеПоУмолчанию(ОписаниеТипаДанных) Экспорт

	НаборТипов = ОписаниеТипаДанных.Типы();
	Если НаборТипов.Количество() = 0 Тогда
	
		Возврат Неопределено;
	
	КонецЕсли;

	Возврат ОписаниеТипаДанных.ПривестиЗначение();

КонецФункции // ()

Функция СодержитТип(ОписаниеТипаДанных, ПроверяемыйТип) Экспорт

	НаборТипов = ОписаниеТипаДанных;
	
	Если ТипЗнч(НаборТипов) = Тип("ОписаниеТипов") Тогда
	
		Возврат НаборТипов.СодержитТип(ПроверяемыйТип);
	
	КонецЕсли;
	
	Если ТипЗнч(НаборТипов) = Тип("Массив") Тогда
	
		Возврат НаборТипов.Найти(ПроверяемыйТип) <> Неопределено;
	
	КонецЕсли;
	
	Возврат НаборТипов = ПроверяемыйТип;

КонецФункции // ()

Процедура ОграничитьТипыЗначения(Свойство, Элемент) Экспорт

	ТипСвойства = Свойство.ТипЗначения;
	Элемент.ОграничениеТипа = ТипСвойства;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуЗначения(Значение) Экспорт

	Если ЭтоБазовыйТип(Значение) Тогда
	
		Возврат;
	
	КонецЕсли;
	
	ОткрытьЗначение(Значение);

КонецПроцедуры

Функция ЭтоБазовыйТип(Значение) Экспорт

	Если Значение = Неопределено Тогда
	
		Возврат Истина;
	
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Булево")
		ИЛИ ТипЗначения = Тип("Число")
		ИЛИ ТипЗначения = Тип("Строка")
		ИЛИ ТипЗначения = Тип("Дата") Тогда
	
		Возврат Истина;
	
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции // ()

// TODO - Избавиться от попытки (ОбщегоНазначения.ПредопределенныйЭлемент() После обновления БСП)
&НаСервере
Функция ПредопределенныйСуществует(Менеджер, ИмяЭлемента) Экспорт

	Попытка
	
		Результат = Менеджер[ИмяЭлемента];
	
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции // ()


#Область Техническая



#КонецОбласти
