
&НаСервере
Процедура ПоместитьМероприятиеВСтроку(НомерСтроки, НомерКолонки, Мероприятие, //остальные параметры последствие переноса
		ТабличныйДокумент, Объект, ГруппироватьМероприятия)
				
	НомерСтроки = НомерСтроки + 3;
	НомерКолонки = НомерКолонки + 1;
	
	Ячейка = ТабличныйДокумент.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C" + Формат(НомерКолонки, "ЧГ="));
	
	// Устанавливаем высоту разделительной строки
	НомерСтроки = НомерСтроки + 1;	
	ТабличныйДокумент.Область("R" + Формат(НомерСтроки, "ЧГ=")).ВысотаСтроки = 3;	
	
	Сч = 0;	
	Пока СокрЛП(Ячейка.Текст) <> "" Цикл		
		НомерСтроки = НомерСтроки + 1;
		Сч = Сч + 1;
		Ячейка = ТабличныйДокумент.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C" + Формат(НомерКолонки, "ЧГ="));
		// Устанавливаем высоту разделительной строки
		НомерСтроки = НомерСтроки + 1;	
		ТабличныйДокумент.Область("R" + Формат(НомерСтроки, "ЧГ=")).ВысотаСтроки = 3;			
	КонецЦикла;
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);
	//Выравнивание колонок
	КоличествоКолонок = (Объект.ДатаКонца - Объект.Дата) / (24*60*60) + 1;
	ШиринаКолонок = Цел(50 / КоличествоКолонок);
	Если ШиринаКолонок < 20 Тогда
		ШиринаКолонок = 20;
	КонецЕсли;

	Если ЗначениеЗаполнено(Мероприятие.ПланируемоеВремя) Тогда
	    Ячейка.Текст = Формат(Мероприятие.ПланируемоеВремя, "DF=ЧЧ:мм") + " ";
	КонецЕсли;
	Ячейка.Текст = Ячейка.Текст + Мероприятие.ТипМероприятия.Наименование;
	
	Если ТипЗнч(Мероприятие.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		Ячейка.Примечание.Текст = Мероприятие.Объект.ВладелецДолжник + " - " + Мероприятие.Объект.Наименование;
	ИначеЕсли ТипЗнч(Мероприятие.Объект) = Тип("СправочникСсылка.ИсполнительныеДокументы") Тогда
		Ячейка.Примечание.Текст = Мероприятие.Объект.Должник.Наименование + " - " + Мероприятие.Объект.Владелец.Наименование;
	Иначе
		Ячейка.Примечание.Текст = Мероприятие.Объект.Наименование;
	КонецЕсли;
	Ячейка.Расшифровка = Мероприятие;
	Ячейка.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	//Ячейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	Ячейка.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	Ячейка.ШиринаКолонки = ШиринаКолонок;
	
	//Объединение и заполнение ячеек
	Ячейка.Обвести(Линия, Линия, Линия, Линия);
	
	//++КазанцевЯА-БП
	КонтрольСроков = Константы.КонтрольСроковМероприятий.Получить();
	//--КазанцевЯА-БП
	Если Мероприятие.Выполнена Тогда
		Ячейка.ЦветФона = WebЦвета.БледноЗеленый;
	//++КазанцевЯА-БП
	ИначеЕсли КонтрольСроков И ЗначениеЗаполнено(Мероприятие.СрокВыполнения) И Мероприятие.СрокВыполнения < ТекущаяДатаСеанса() Тогда
		ЖирныйШрифт = Новый Шрифт(Ячейка.Шрифт,,,Истина);
		Ячейка.Шрифт = ЖирныйШрифт;
		Ячейка.ЦветФона = WebЦвета.Красный;
	ИначеЕсли КонтрольСроков И ЗначениеЗаполнено(Мероприятие.СрокВыполнения) И НачалоДня(Мероприятие.СрокВыполнения) < ТекущаяДатаСеанса() Тогда
		ЖирныйШрифт = Новый Шрифт(Ячейка.Шрифт,,,Истина);
		Ячейка.Шрифт = ЖирныйШрифт;
		Ячейка.ЦветФона = WebЦвета.ГолубойСКраснымОттенком;
	ИначеЕсли НЕ КонтрольСроков И (НачалоДня(Мероприятие.ПланируемаяДата) + (Мероприятие.ПланируемоеВремя - Дата(1,1,1)) < ТекущаяДатаСеанса() - 10
				И Мероприятие.ПланируемоеВремя <> Дата(1,1,1))
			ИЛИ НЕ КонтрольСроков И Мероприятие.ПланируемаяДата < НачалоДня(ТекущаяДатаСеанса()) Тогда
		Ячейка.ЦветФона = WebЦвета.Красный;
	//--КазанцевЯА-БП
	Иначе
		Ячейка.ЦветФона = WebЦвета.БледноМиндальный;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТДНеделя() Экспорт
	/////////////////	
	//////Попытка
	//////	ДрайверКомпоненты = ПолучитьИзВременногоХранилища(ПараметрыСеанса.АдресОбъектаУЭД);
	//////	ДрайверКомпоненты.ОбработатьСтрелки("", "", "", "", "", "");
	//////Исключение
	//////	Сообщить("Компонента печати не была загружена! Работа приложения невозможна!");
	//////	Возврат;		
	//////КонецПопытки;	
	/////////////////
	
	
	//ТабличныйДокумент.Очистить();
	//Макет = Обработки.ПланированиеМероприятий.ПолучитьМакет("МакетНеделя");
	//ОбластьНедели = Макет.ПолучитьОбласть("ШапкаНедели");
	//ОбластьНедели.Параметры.ДатаПН = НачалоНедели(Объект.Дата) + 0 * 3600*24;
	//ОбластьНедели.Параметры.ДатаВТ = НачалоНедели(Объект.Дата) + 1 * 3600*24;
	//ОбластьНедели.Параметры.ДатаСР = НачалоНедели(Объект.Дата) + 2 * 3600*24;
	//ОбластьНедели.Параметры.ДатаЧТ = НачалоНедели(Объект.Дата) + 3 * 3600*24;
	//ОбластьНедели.Параметры.ДатаПТ = НачалоНедели(Объект.Дата) + 4 * 3600*24;
	//ОбластьНедели.Параметры.ДатаСБ = НачалоНедели(Объект.Дата) + 5 * 3600*24;
	//ОбластьНедели.Параметры.ДатаВС = НачалоНедели(Объект.Дата) + 6 * 3600*24;
	//ТабличныйДокумент.Вывести(ОбластьНедели);		
	//
	//НомерДень = ДеньНедели(Объект.Дата) - 1;
	//НомерЧасНачало = Час(Расписание[НомерДень].НачалоРД);
	//НомерЧасКонец = Час(Расписание[НомерДень].КонецРД);
	//
	//Если Минута(Расписание[НомерДень].КонецРД) = 0 Тогда
	//	НомерЧасКонец = НомерЧасКонец - 1; 
	//КонецЕсли;
	//
	//Для Номер = НомерЧасНачало По НомерЧасКонец Цикл
	//	Область = Макет.ПолучитьОбласть("СтрокаЧас");
	//	Область.Параметры.Часы = Номер;
	//	
	//	СписокВремен.Добавить(Дата(1,1,1, Номер,  0, 0), "R" + Формат(2 + 1 + (Номер - НомерЧасНачало) * 8, "ЧГ="));
	//	СписокВремен.Добавить(Дата(1,1,1, Номер, 15, 0), "R" + Формат(2 + 3 + (Номер - НомерЧасНачало) * 8, "ЧГ="));
	//	СписокВремен.Добавить(Дата(1,1,1, Номер, 30, 0), "R" + Формат(2 + 5 + (Номер - НомерЧасНачало) * 8, "ЧГ="));
	//	СписокВремен.Добавить(Дата(1,1,1, Номер, 45, 0), "R" + Формат(2 + 7 + (Номер - НомерЧасНачало) * 8, "ЧГ="));
	//	
	//	ТабличныйДокумент.Вывести(Область);
	//КонецЦикла;
	//
	////Заполнение мероприятиями ///////////////////////////////////////////////////
	//ШиринаКолонок = Цел(50 / КоличествоКолонок);
	//
	//Если ШиринаКолонок < 20 Тогда
	//	ШиринаКолонок = 20;
	//КонецЕсли;
	//
	////Выравнивание колонок
	//Для Номер = 1 По ОбластьНедели.Параметры.Количество() Цикл
	//	
	//	ТабличныйДокумент.Область("C" + Формат(1 + 2 * Номер, "ЧГ=")).ШиринаКолонки = 0.5;
	//	ТабличныйДокумент.Область("C" + Формат(2 + 2 * Номер, "ЧГ=")).ШиринаКолонки = ШиринаКолонок;
	//	
	//КонецЦикла;
	//
	////Объединение и заполнение ячеек
	//Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);
	//ДатаМероприятияЗаНеделю = Новый Массив;
	//ДатаМероприятияЗаНеделю.Добавить(ОбластьНедели.Параметры.ДатаПН);			
	//ДатаМероприятияЗаНеделю.Добавить(ОбластьНедели.Параметры.ДатаВТ);
	//ДатаМероприятияЗаНеделю.Добавить(ОбластьНедели.Параметры.ДатаСР);
	//ДатаМероприятияЗаНеделю.Добавить(ОбластьНедели.Параметры.ДатаЧТ);
	//ДатаМероприятияЗаНеделю.Добавить(ОбластьНедели.Параметры.ДатаПТ);
	//ДатаМероприятияЗаНеделю.Добавить(ОбластьНедели.Параметры.ДатаСБ);
	//ДатаМероприятияЗаНеделю.Добавить(ОбластьНедели.Параметры.ДатаВС);
	//
	//Для СтрокиМассиваДаты = 0 По (ДатаМероприятияЗаНеделю.Количество() - 1) Цикл		
	//	ЗаполнитьСписокМероприятий2(ДатаМероприятияЗаНеделю[СтрокиМассиваДаты]); 
	//	Для Каждого Элемент Из СписокМероприятий Цикл
	//		
	//		Попытка 
	//			ЯчейкаНачало = СписокВремен.НайтиПоЗначению(Элемент.ВремяНачала).Представление + "C" + 
	//			Формат(4 + 2 * Элемент.НомерКолонки + 2 * ((ДеньНедели(ДатаМероприятияЗаНеделю[СтрокиМассиваДаты])) - 1), "ЧГ=");//     + (ДеньНедели(Объект.Дата)), "ЧГ=");
	//			ЯчейкаКонец  = СписокВремен.НайтиПоЗначению(Элемент.ВремяКонца + 1 - 15 * 60).Представление + "C" + 
	//			Формат(4 + 2 * Элемент.НомерКолонки + 2 * ((ДеньНедели(ДатаМероприятияЗаНеделю[СтрокиМассиваДаты])) - 1), "ЧГ=");// + (ДеньНедели(Объект.Дата)), "ЧГ=");
	//		Исключение
	//			Продолжить;
	//		КонецПопытки;
	//		
	//		Элемент.Область = ЯчейкаНачало + ":" + ЯчейкаКонец;
	//		Область = ТабличныйДокумент.Область(Элемент.Область);
	//		
	//		Область.Объединить();	
	//		Область.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	//		Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	//		Область.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	//		Область.Расшифровка = Элемент.Мероприятие;
	//		Область.Текст = Строка(Элемент.Мероприятие.ТипМероприятия);	
	//		Область.Обвести(Линия, Линия, Линия, Линия);
	//		
	//		Если Элемент.Выполнена Тогда
	//			Область.ЦветФона = WebЦвета.БледноЗеленый;
	//		Иначе
	//			Область.ЦветФона = WebЦвета.БледноМиндальный;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТДДень(ТабличныйДокумент, Объект, СписокВремен, Расписание, КоличествоКолонок, // ЗАЩИЩЕНА!
		СписокМероприятий) Экспорт 

	ТабличныйДокумент.Очистить();
	Макет = Обработки.ПланированиеМероприятий.ПолучитьМакет("МакетДень");
	
	НомерДень = ДеньНедели(Объект.Дата) - 1;
	НомерЧасНачало = Час(Расписание[НомерДень].НачалоРД);
	НомерЧасКонец = Час(Расписание[НомерДень].КонецРД);
	Если Минута(Расписание[НомерДень].КонецРД) = 0 Тогда
		НомерЧасКонец = НомерЧасКонец - 1; 
	КонецЕсли;
	
	Для Номер = НомерЧасНачало По НомерЧасКонец Цикл
		Область = Макет.ПолучитьОбласть("СтрокаЧас");
		Область.Параметры.Часы = Номер;
		
		СписокВремен.Добавить(Дата(1,1,1, Номер,  0, 0), "R" + Формат(0 + 1 + (Номер - НомерЧасНачало) * 8, "ЧГ="));
		СписокВремен.Добавить(Дата(1,1,1, Номер, 15, 0), "R" + Формат(0 + 3 + (Номер - НомерЧасНачало) * 8, "ЧГ="));
		СписокВремен.Добавить(Дата(1,1,1, Номер, 30, 0), "R" + Формат(0 + 5 + (Номер - НомерЧасНачало) * 8, "ЧГ="));
		СписокВремен.Добавить(Дата(1,1,1, Номер, 45, 0), "R" + Формат(0 + 7 + (Номер - НомерЧасНачало) * 8, "ЧГ="));
		
		ТабличныйДокумент.Вывести(Область);
	КонецЦикла;
	
	
	//Заполнение мероприятиями ///////////////////////////////////////////////////
	ШиринаКолонок = Цел(50 / КоличествоКолонок);
	Если ШиринаКолонок < 20 Тогда
		ШиринаКолонок = 20;
	КонецЕсли;
	
	//Выравнивание колонок
	Для Номер = 1 По КоличествоКолонок Цикл
		ТабличныйДокумент.Область("C" + Формат(1 + 2 * Номер, "ЧГ=")).ШиринаКолонки = 0.5;
		ТабличныйДокумент.Область("C" + Формат(2 + 2 * Номер, "ЧГ=")).ШиринаКолонки = ШиринаКолонок;
	КонецЦикла;
	
	//Объединение и заполнение ячеек
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);
	Для Каждого Элемент Из СписокМероприятий Цикл
		Попытка 
			ЯчейкаНачало = СписокВремен.НайтиПоЗначению(Элемент.ВремяНачала).Представление + "C" + 
					Формат(4 + 2 * Элемент.НомерКолонки, "ЧГ=");
			ЯчейкаКонец  = СписокВремен.НайтиПоЗначению(Элемент.ВремяКонца + 1 - 15 * 60).Представление + "C" + 
					Формат(4 + 2 * Элемент.НомерКолонки, "ЧГ=");
		Исключение
			Продолжить;
		КонецПопытки;
		Элемент.Область = ЯчейкаНачало + ":" + ЯчейкаКонец;
		Область = ТабличныйДокумент.Область(Элемент.Область);
		
		Область.Объединить();	
		Область.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		Область.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		Область.Расшифровка = Элемент.Мероприятие;
		Если ТипЗнч(Элемент.Мероприятие.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
			Область.Примечание.Текст = Элемент.Мероприятие.Объект.ВладелецДолжник + " - " + 
					Элемент.Мероприятие.Объект.Наименование;
		ИначеЕсли ТипЗнч(Элемент.Мероприятие.Объект) = Тип("СправочникСсылка.ИсполнительныеДокументы") Тогда
			Область.Примечание.Текст = Элемент.Мероприятие.Объект.Должник.Наименование + " - " + 
					Элемент.Мероприятие.Объект.Владелец.Наименование;
		Иначе
			Область.Примечание.Текст = Элемент.Мероприятие.Объект.Наименование;
		КонецЕсли;
		
		Область.Текст = Строка(Элемент.Мероприятие.ТипМероприятия);	
		Область.Обвести(Линия, Линия, Линия, Линия);
		//++КазанцевЯА-БП
		КонтрольСроков = Константы.КонтрольСроковМероприятий.Получить();
		//--КазанцевЯА-БП
		Если Элемент.Выполнена Тогда
			Область.ЦветФона = WebЦвета.БледноЗеленый;
		//++КазанцевЯА-БП
		КонтрольСроков = Константы.КонтрольСроковМероприятий.Получить();
		ИначеЕсли КонтрольСроков И ЗначениеЗаполнено(Элемент.Мероприятие.СрокВыполнения) И Элемент.Мероприятие.СрокВыполнения < ТекущаяДатаСеанса() Тогда
			ЖирныйШрифт = Новый Шрифт(Область.Шрифт,,,Истина);
			Область.Шрифт = ЖирныйШрифт;
			Область.ЦветФона = WebЦвета.Красный;
		ИначеЕсли КонтрольСроков И ЗначениеЗаполнено(Элемент.Мероприятие.СрокВыполнения) И НачалоДня(Элемент.Мероприятие.СрокВыполнения) < ТекущаяДатаСеанса() Тогда
			ЖирныйШрифт = Новый Шрифт(Область.Шрифт,,,Истина);
			Область.Шрифт = ЖирныйШрифт;
			Область.ЦветФона = WebЦвета.ГолубойСКраснымОттенком;
		ИначеЕсли НЕ КонтрольСроков И(НачалоДня(Элемент.Мероприятие.ПланируемаяДата) + (Элемент.Мероприятие.ПланируемоеВремя - Дата(1,1,1)) 
					< ТекущаяДатаСеанса() - 10
					И Элемент.Мероприятие.ПланируемоеВремя <> Дата(1,1,1))
				ИЛИ НЕ КонтрольСроков И Элемент.Мероприятие.ПланируемаяДата < НачалоДня(ТекущаяДатаСеанса()) Тогда
			Область.ЦветФона = WebЦвета.Красный;
		//--КазанцевЯА-БП
		Иначе
			Область.ЦветФона = WebЦвета.БледноМиндальный;
		КонецЕсли;
	КонецЦикла;	 	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТДПроизвольный(ТабличныйДокумент, Объект, СписокПользователей, ОтображатьВыполненные,
		СписокНеотображаемыхТипов, ГруппироватьМероприятия, ЗапланированныеТЗ, НеОбновляемЗапланированныеТЗ) Экспорт

	ТабличныйДокумент.Очистить();
	Макет = Обработки.ПланированиеМероприятий.ПолучитьМакет("МакетПроизвольный");
	ОбластьДень = Макет.ПолучитьОбласть("КолонкаДни");
	ОбластьРазделитель1 = Макет.ПолучитьОбласть("КолонкаРазделитель1");
	ОбластьРазделитель2 = Макет.ПолучитьОбласть("КолонкаРазделитель2");
//	ТабличныйДокумент.Вывести(ОбластьДень);
//	ТабличныйДокумент.Вывести(ОбластьРазделитель2);	
	ДатаЦикл = НачалоДня(Объект.Дата);
	
	Пока ДатаЦикл <= НачалоДня(Объект.ДатаКонца) Цикл
//		ТабличныйДокумент.Область("КолонкаДни").ШиринаКолонки = 0.5;
		ТабличныйДокумент.Вывести(ОбластьРазделитель1);
		ОбластьДень.Параметры.Число = ДатаЦикл;
		ОбластьДень.Параметры.ДеньНедели = ВРег(Формат(ДатаЦикл, "ДФ=ddd"));
		ТабличныйДокумент.Вывести(ОбластьДень);
		ТабличныйДокумент.Вывести(ОбластьРазделитель2);
		ДатаЦикл = ДатаЦикл + 24 * 3600;
	КонецЦикла;
	
	// Настройка констант. Детализация объектов в работе.
	// В зависимости от проставленных флажков, по- разному распределяются мероприятия.		
	ФлагДО          = Константы.ДетализацияПоДО.Получить();
	ФлагИД          = Константы.ДетализацияПоИД.Получить();
	ФлагКА          = Константы.ДетализацияПоКА.Получить();
	ФлагПоДоговорам = Константы.ДетализацияПоДоговорам.Получить();
	ФлагПоУслугам   = Константы.ДетализацияПоУслугам.Получить();
	
	Если ФлагДО И Не (ФлагИД ИЛИ ФлагКА ИЛИ ФлагПоДоговорам ИЛИ ФлагПоУслугам) Тогда
		// Распределение мероприятий ИД на ДО (ТабличныйДокумент).
		РаспределитьМероприятияИД_На_До(
			ТабличныйДокумент,
			Объект,
			СписокПользователей,
			ОтображатьВыполненные,
			ГруппироватьМероприятия);
		// Распределение мероприятий ИД на ДО (ЗапланированныеТЗ).
		ЗапланированныеТЗ_ИД_на_ДО(СписокПользователей, ЗапланированныеТЗ, НеОбновляемЗапланированныеТЗ);
	ИначеЕсли ФлагДО И ФлагИД И Не (ФлагКА ИЛИ ФлагПоДоговорам ИЛИ ФлагПоУслугам) Тогда
		// Мероприятия ИД на ДО не распределяются на ДО (ТабличныйДокумент).
		НеРаспределитьМероприятияИД_На_До(
			ТабличныйДокумент,
			Объект,
			СписокПользователей,
			ОтображатьВыполненные,
			ГруппироватьМероприятия);
		// Мероприятия ИД на ДО не распределяются на ДО (ЗапланированныеТЗ).
		ЗапланированныеТЗ_Не_Распределять_ИД_На_ДО(СписокПользователей, ЗапланированныеТЗ, НеОбновляемЗапланированныеТЗ);
	ИначеЕсли ФлагДО И ФлагКА И ФлагПоДоговорам И Не (ФлагИД ИЛИ ФлагПоУслугам) Тогда
		// Распределение мероприятий ИД на ДО, УслугПоДоговору на ДоговорыКонтрагентов (ТабличныйДокумент).
		РаспределитьМероприятияИД_На_До_УслПоДог_На_ДогКА(
			ТабличныйДокумент,
			Объект,
			СписокПользователей,
			ОтображатьВыполненные,
			ГруппироватьМероприятия);
		// Распределение мероприятий ИД на ДО, УслугПоДоговору на ДоговорыКонтрагентов (ЗапланированныеТЗ).		
		ЗапланированныеТЗ_Распределять_ИД_На_До_УслПоДог_На_ДогКА(
			СписокПользователей,
			ЗапланированныеТЗ,
			НеОбновляемЗапланированныеТЗ);
	ИначеЕсли ФлагДО И ФлагКА И Не (ФлагПоДоговорам ИЛИ ФлагИД ИЛИ ФлагПоУслугам) Тогда
		// Распределение мероприятий ИД на До, УслугПоДоговору и ДоговорыКонтрагентов на Контрагентов (ТабличныйДокумент).	
		Распределить_ИД_на_ДО_УслПоДог_и_ДогКА_на_КА(
			ТабличныйДокумент,
			Объект,
			СписокПользователей,
			ОтображатьВыполненные,
			ГруппироватьМероприятия);
		// Распределение мероприятий ИД на До, УслугПоДоговору и ДоговорыКонтрагентов на Контрагентов (ЗапланированныеТЗ).
		ЗапланированныеТЗ_ИД_на_ДО_УслПоДог_и_ДогКА_на_КА(
			СписокПользователей,
			ЗапланированныеТЗ,
			НеОбновляемЗапланированныеТЗ);
	ИначеЕсли ФлагДО И ФлагКА И ФлагИД И Не (ФлагПоДоговорам ИЛИ ФлагПоУслугам) Тогда
		// Распределение мероприятий УслугПоДоговору и ДоговорыКонтрагентов на Контрагентов (ТабличныйДокумент).
		Распределить_УслПоДог_и_ДогКА_на_КА(
			ТабличныйДокумент,
			Объект,
			СписокПользователей,
			ОтображатьВыполненные,
			ГруппироватьМероприятия);
		// Распределение мероприятий УслугПоДоговору и ДоговорыКонтрагентов на Контрагентов (ЗапланированныеТЗ).		
		ЗапланированныеТЗ_УслПоДог_и_ДогКА_на_КА(
			СписокПользователей,
			ЗапланированныеТЗ,
			НеОбновляемЗапланированныеТЗ);
	Иначе
		// Распределение мероприятий  других комбинациях констант в детализации объектов  работе. 
		// Выбор других комбинаций констан, не регламентирован (на 28.06.2013).
		ВызватьИсключение ("Работа планировщика, при заданной комбинации констант в детализации объектов в работе 
						   |(Администрирование - Сервис - Настройка констант), не предусмотрена.");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроизвольныйСписокМероприятий(ТабличныйДокумент, Объект, СписокПользователей,
		ОтображатьВыполненные, СписокНеотображаемыхТипов, ГруппироватьМероприятия) //изначально параметров нет вообще
	//  получить список мероприятий у которых проставлено планируемое время начала 
	//  список отсортировать по планируемой дате и времени начала
	Если ГруппироватьМероприятия Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ОтветственныеСотрудники.Объект,
		                      |	ОтветственныеСотрудники.ТипСотрудника,
		                      |	ОтветственныеСотрудники.Пользователь,
		                      |	ИСТИНА КАК Главный
		                      |ПОМЕСТИТЬ ОтвСотр
		                      |ИЗ
		                      |	РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	СотрудникиВПомощь.Объект,
		                      |	СотрудникиВПомощь.ТипСотрудника,
		                      |	СотрудникиВПомощь.Пользователь,
		                      |	ЛОЖЬ
		                      |ИЗ
		                      |	РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ОтвСотр.Пользователь,
		                      |	ОтвСотр.Главный,
		                      |	Мероприятие.Ссылка КАК Ссылка,
		                      |	ОтвСотр.ТипСотрудника.Глубина КАК Глубина,
		                      |	Мероприятие.Ответственный,
		                      |	Мероприятие.ПланируемаяДата,
		                      |	Мероприятие.ПланируемоеВремя КАК ВремяНачала,
		                      |	Мероприятие.Выполнена,
		                      |	Мероприятие.Исполнитель
		                      |ПОМЕСТИТЬ ОтвМер
		                      |ИЗ
		                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник В (&Ответственный)) КАК ОбъектыВРаботеОстатки
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
		                      |			ЛЕВОЕ СОЕДИНЕНИЕ ОтвСотр КАК ОтвСотр
		                      |			ПО (ОтвСотр.Объект = Мероприятие.Объект
		                      |					ИЛИ ОтвСотр.Объект = Мероприятие.Объект.Владелец)
		                      |		ПО (ОбъектыВРаботеОстатки.Объект = Мероприятие.Объект
		                      |				ИЛИ ОбъектыВРаботеОстатки.Объект = Мероприятие.Объект.Владелец)
		                      |ГДЕ
		                      |	Мероприятие.ПланируемаяДата >= &ДатаНачало
		                      |	И Мероприятие.ПланируемаяДата <= &ДатаКонец
		                      |	И НЕ Мероприятие.ПометкаУдаления
		                      |	И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
		                      |			ИЛИ НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления)
		                      |	И (НЕ Мероприятие.Выполнена
		                      |			ИЛИ &ОтображатьВыполненные)
		                      |	И НЕ Мероприятие.ТипМероприятия В (&ТипМероприятия)
		                      |	И (Мероприятие.Ответственный.Родители ПОДОБНО ОтвСотр.ТипСотрудника.РодителиШаблон
		                      |			ИЛИ Мероприятие.Ответственный В (&Ответственный)
		                      |			ИЛИ Мероприятие.Исполнитель В (&Ответственный))
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ОтвМер.Ссылка,
		                      |	МАКСИМУМ(ОтвМер.Глубина) КАК Глубина
		                      |ПОМЕСТИТЬ ОтвМакс
		                      |ИЗ
		                      |	ОтвМер КАК ОтвМер
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ОтвМер.Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	МАКСИМУМ(ОтвМер.Главный) КАК Главный,
		                      |	МАКСИМУМ(ОтвМер.Ссылка) КАК Мероприятие,
		                      |	ОтвМер.ПланируемаяДата КАК ПланируемаяДата,
		                      |	МИНИМУМ(ОтвМер.ВремяНачала) КАК ВремяНачала,
		                      |	ОтвМер.Выполнена
		                      |ИЗ
		                      |	ОтвМер КАК ОтвМер
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ ОтвМакс КАК ОтвМакс
		                      |		ПО ОтвМер.Ссылка = ОтвМакс.Ссылка
		                      |			И ОтвМер.Глубина = ОтвМакс.Глубина
		                      |ГДЕ
		                      |	(ОтвМер.Пользователь В (&Ответственный)
		                      |				И НЕ ОтвМакс.Ссылка ЕСТЬ NULL 
		                      |			ИЛИ ОтвМер.Ответственный В (&Ответственный)
		                      |			ИЛИ ОтвМер.Исполнитель В (&Ответственный))
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ОтвМер.ПланируемаяДата,
		                      |	ОтвМер.Выполнена
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ПланируемаяДата,
		                      |	ВремяНачала");
	Иначе		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Пользователи.Ссылка КАК Ссылка
		                      |ПОМЕСТИТЬ ВТ_Ответственный
		                      |ИЗ
		                      |	Справочник.Пользователи КАК Пользователи
		                      |ГДЕ
		                      |	Пользователи.Ссылка В(&Ответственный)
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ОбъектыВРаботеОстатки.Объект КАК Объект
		                      |ПОМЕСТИТЬ ОбъектыВРаботе
		                      |ИЗ
		                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		                      |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Объект
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ИсполнительныеДокументы.Ссылка КАК Объект,
		                      |	ИсполнительныеДокументы.Владелец КАК Владелец
		                      |ПОМЕСТИТЬ ВсеОбъектыВРаботе
		                      |ИЗ
		                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
		                      |		ПО ОбъектыВРаботе.Объект = ИсполнительныеДокументы.Владелец
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	УслугиПоДоговору.Ссылка,
		                      |	УслугиПоДоговору.Владелец
		                      |ИЗ
		                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УслугиПоДоговору КАК УслугиПоДоговору
		                      |		ПО ОбъектыВРаботе.Объект = УслугиПоДоговору.Владелец
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	ОбъектыВРаботе.Объект,
		                      |	NULL
		                      |ИЗ
		                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Объект
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
		                      |	ВсеОбъектыВРаботе.Владелец,
		                      |	БизнесПроцессы.Ссылка
		                      |ПОМЕСТИТЬ БезПлохихБП
		                      |ИЗ
		                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
		                      |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
		                      |ГДЕ
		                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL 
		                      |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
		                      |				И БизнесПроцессы.Завершен = ЛОЖЬ)
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Объект
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Мероприятие.Ссылка,
		                      |	Мероприятие.Объект,
		                      |	Мероприятие.ПланируемаяДата,
		                      |	Мероприятие.ПланируемоеВремя КАК ВремяНачала,
		                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
		                      |	Мероприятие.Ответственный,
		                      |	Мероприятие.Выполнена,
		                      |	БезПлохихБП.Владелец
		                      |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
		                      |ИЗ
		                      |	Задача.Мероприятие КАК Мероприятие
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
		                      |		ПО Мероприятие.Объект = БезПлохихБП.Объект
		                      |ГДЕ
		                      |	Мероприятие.ПометкаУдаления = ЛОЖЬ
		                      |	И (Мероприятие.Выполнена = ЛОЖЬ
		                      |			ИЛИ &ОтображатьВыполненные)
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	ТипМероприятия
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ТипыМероприятий.Ссылка КАК Ссылка
		                      |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
		                      |ИЗ
		                      |	Справочник.ТипыМероприятий КАК ТипыМероприятий
		                      |ГДЕ
		                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
		                      |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	МероприятияБезТиповМероприятий.Ссылка,
		                      |	МероприятияБезТиповМероприятий.Объект,
		                      |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
		                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
		                      |	МероприятияБезТиповМероприятий.Выполнена,
		                      |	МероприятияБезТиповМероприятий.ВремяНачала,
		                      |	МероприятияБезТиповМероприятий.Владелец
		                      |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
		                      |ИЗ
		                      |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
		                      |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
		                      |ГДЕ
		                      |	МероприятияБезТиповМероприятий.ПланируемаяДата >= &ДатаНачало
		                      |	И МероприятияБезТиповМероприятий.ПланируемаяДата <= &ДатаКонец
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ответственный
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ИСТИНА КАК Главный,
		                      |	МероприятияБезТипаСотрудника.Ссылка,
		                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
		                      |	МероприятияБезТипаСотрудника.Выполнена,
		                      |	МероприятияБезТипаСотрудника.ВремяНачала
		                      |ПОМЕСТИТЬ ОтборПервый
		                      |ИЗ
		                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ТипыСотрудников.Ссылка КАК Ссылка,
		                      |	ТипыСотрудников.Глубина,
		                      |	ТипыСотрудников.РодителиШаблон
		                      |ПОМЕСТИТЬ ПВХ_ТипСотрудника
		                      |ИЗ
		                      |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
		                      |ГДЕ
		                      |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	МероприятияБезТипаСотрудника.Ссылка,
		                      |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
		                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
		                      |	МероприятияБезТипаСотрудника.Выполнена,
		                      |	МероприятияБезТипаСотрудника.ВремяНачала,
		                      |	ПВХ_ТипСотрудника.РодителиШаблон,
		                      |	ПВХ_ТипСотрудника.Глубина
		                      |ПОМЕСТИТЬ Замена_Владельца_На_ДО
		                      |ИЗ
		                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
		                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Объект
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Замена_Владельца_На_ДО.РодителиШаблон,
		                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
		                      |	ИСТИНА КАК Главный,
		                      |	Замена_Владельца_На_ДО.Ссылка,
		                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
		                      |	Замена_Владельца_На_ДО.Выполнена,
		                      |	Замена_Владельца_На_ДО.ВремяНачала,
		                      |	ОтветственныеСотрудники.Пользователь
		                      |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
		                      |ИЗ
		                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
		                      |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	Замена_Владельца_На_ДО.РодителиШаблон,
		                      |	СотрудникиВПомощь.ТипСотрудника,
		                      |	ЛОЖЬ,
		                      |	Замена_Владельца_На_ДО.Ссылка,
		                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
		                      |	Замена_Владельца_На_ДО.Выполнена,
		                      |	Замена_Владельца_На_ДО.ВремяНачала,
		                      |	СотрудникиВПомощь.Пользователь
		                      |ИЗ
		                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
		                      |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	ТипСотрудника
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
		                      |	Без_Шаблона_Отв_Сотр.Пользователь,
		                      |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
		                      |	Без_Шаблона_Отв_Сотр.Главный,
		                      |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
		                      |	Без_Шаблона_Отв_Сотр.Выполнена,
		                      |	Без_Шаблона_Отв_Сотр.ВремяНачала
		                      |ПОМЕСТИТЬ Без_Глубины
		                      |ИЗ
		                      |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
		                      |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
		                      |ГДЕ
		                      |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка,
		                      |	Глубина
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Без_Глубины.Ссылка КАК Ссылка,
		                      |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
		                      |ПОМЕСТИТЬ Глубина_Макс
		                      |ИЗ
		                      |	Без_Глубины КАК Без_Глубины
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	Без_Глубины.Ссылка
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка,
		                      |	Глубина
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Без_Глубины.Пользователь КАК Пользователь,
		                      |	Без_Глубины.Главный,
		                      |	Без_Глубины.Ссылка,
		                      |	Без_Глубины.ПланируемаяДата,
		                      |	Без_Глубины.ВремяНачала,
		                      |	Без_Глубины.Выполнена
		                      |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
		                      |ИЗ
		                      |	Без_Глубины КАК Без_Глубины
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
		                      |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
		                      |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Пользователь
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Главный,
		                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
		                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
		                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ВремяНачала КАК ВремяНачала,
		                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Выполнена
		                      |ИЗ
		                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		                      |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	ОтборПервый.Главный,
		                      |	ОтборПервый.Ссылка,
		                      |	ОтборПервый.ПланируемаяДата,
		                      |	ОтборПервый.ВремяНачала,
		                      |	ОтборПервый.Выполнена
		                      |ИЗ
		                      |	ОтборПервый КАК ОтборПервый
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ПланируемаяДата,
		                      |	ВремяНачала");
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаНачало", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаКонец", КонецДня(Объект.ДатаКонца));
	Запрос.УстановитьПараметр("Ответственный", СписокПользователей);
	Запрос.УстановитьПараметр("ОтображатьВыполненные", ОтображатьВыполненные);
	Запрос.УстановитьПараметр("ТипМероприятия", СписокНеотображаемыхТипов);
	Результат = Запрос.Выполнить().Выбрать();	
	Пока Результат.Следующий() Цикл
		ВремяМероприятия = Результат.ВремяНачала;
		НомерСтроки = 1;
		НомерКолонки = РассчитатьНомерКолонки(Результат.ПланируемаяДата, Объект); 
		//1+(Стр.ПланируемаяДата - НачалоДня(НачПериода))/(24*3600);
		ПоместитьМероприятиеВСтроку(НомерСтроки, НомерКолонки, Результат.Мероприятие, ТабличныйДокумент, Объект, 
				ГруппироватьМероприятия);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция РассчитатьНомерКолонки(ПланируемаяДата,
		Объект) //только для защиты
	НомерКолонки = -2;
	ДатаЦикл = Объект.Дата;
	
	//СтруктураОтбораГрафика = Новый Структура("ГрафикРаботы,Дата");;
	//СтруктураОтбораГрафика.ГрафикРаботы = Справочники.ГрафикиРаботы.НайтиПоНаименованию("Основной");	
	Пока ДатаЦикл <= ПланируемаяДата Цикл
		//Если (НЕ ГрафикРаботы = Справочники.ГрафикиРаботы.ПустаяСсылка()) И (Не ПоказыватьВыходные) Тогда
		//	СтруктураОтбораГрафика.Дата = ДатаЦикл;
		//	ЗаписьРегистра = РегистрыСведений.ГрафикиРаботы.Получить(СтруктураОтбораГрафика);
		//	Если НЕ ЗаписьРегистра.Выходной Тогда
		//		НомерКолонки = НомерКолонки + 1;
		//	КонецЕсли;
		//Иначе
			НомерКолонки = НомерКолонки + 3;
		//КонецЕсли;
		ДатаЦикл = ДатаЦикл + 24*3600;
	КонецЦикла;	
	Возврат НомерКолонки;	
КонецФункции

&НаСервере
Функция ПолучитьСписокМероприятий(Пользователь) Экспорт

	// Настройка констант. Детализация объектов в работе.
	// В зависимости от проставленных флажков, по- разному распределяются мероприятия.		
	ФлагДО          = Константы.ДетализацияПоДО.Получить();
	ФлагИД          = Константы.ДетализацияПоИД.Получить();
	ФлагКА          = Константы.ДетализацияПоКА.Получить();
	ФлагПоДоговорам = Константы.ДетализацияПоДоговорам.Получить();
	ФлагПоУслугам   = Константы.ДетализацияПоУслугам.Получить();
	
	Если ФлагДО И ФлагКА И Не (ФлагПоДоговорам Или ФлагИД или ФлагПоУслугам) Тогда			
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Пользователи.Ссылка КАК Ссылка
		                      |ПОМЕСТИТЬ ВТ_Ответственный
		                      |ИЗ
		                      |	Справочник.Пользователи КАК Пользователи
		                      |ГДЕ
		                      |	Пользователи.Ссылка В(&Ответственный)
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ОбъектыВРаботеОстатки.Объект КАК Объект
		                      |ПОМЕСТИТЬ ОбъектыВРаботе
		                      |ИЗ
		                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		                      |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Объект
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Контрагенты.Ссылка КАК Объект,
		                      |	NULL КАК Владелец,
		                      |	Контрагенты.Ссылка КАК Должник
		                      |ПОМЕСТИТЬ ВсеОбъектыВРаботе
		                      |ИЗ
		                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		                      |		ПО ОбъектыВРаботе.Объект = Контрагенты.Ссылка
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	ДолговыеОбязательства.Ссылка,
		                      |	NULL,
		                      |	ДолговыеОбязательства.Должник
		                      |ИЗ
		                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
		                      |		ПО ОбъектыВРаботе.Объект = ДолговыеОбязательства.Ссылка
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	ИсполнительныеДокументы.Ссылка,
		                      |	ИсполнительныеДокументы.Владелец,
		                      |	ИсполнительныеДокументы.Должник
		                      |ИЗ
		                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
		                      |		ПО ОбъектыВРаботе.Объект = ИсполнительныеДокументы.Владелец
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Объект
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
		                      |	ВсеОбъектыВРаботе.Владелец,
		                      |	ВсеОбъектыВРаботе.Должник,
		                      |	БизнесПроцессы.Ссылка
		                      |ПОМЕСТИТЬ БезПлохихБП
		                      |ИЗ
		                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
		                      |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
		                      |ГДЕ
		                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL 
		                      |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
		                      |				И БизнесПроцессы.Завершен = ЛОЖЬ)
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Объект
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Мероприятие.Ссылка,
		                      |	Мероприятие.Объект,
		                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
		                      |	Мероприятие.Ответственный,
		                      |	БезПлохихБП.Владелец,
		                      |	БезПлохихБП.Должник
		                      |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
		                      |ИЗ
		                      |	Задача.Мероприятие КАК Мероприятие
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
		                      |		ПО Мероприятие.Объект = БезПлохихБП.Объект
		                      |			И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
		                      |				ИЛИ Мероприятие.БизнесПроцесс = БезПлохихБП.Ссылка)
		                      |ГДЕ
		                      |	Мероприятие.ПометкаУдаления = ЛОЖЬ
		                      |	И Мероприятие.Выполнена = ЛОЖЬ
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	ТипМероприятия
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ТипыМероприятий.Ссылка КАК Ссылка
		                      |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
		                      |ИЗ
		                      |	Справочник.ТипыМероприятий КАК ТипыМероприятий
		                      |ГДЕ
		                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
		                      |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	МероприятияБезТиповМероприятий.ТипМероприятия,
		                      |	МероприятияБезТиповМероприятий.Должник,
		                      |	МероприятияБезТиповМероприятий.Ссылка,
		                      |	МероприятияБезТиповМероприятий.Объект,
		                      |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
		                      |	МероприятияБезТиповМероприятий.Владелец
		                      |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
		                      |ИЗ
		                      |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
		                      |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	МероприятияБезТиповМероприятий.Ссылка,
		                      |	МероприятияБезТиповМероприятий.Объект,
		                      |	МероприятияБезТиповМероприятий.Ответственный,
		                      |	МероприятияБезТиповМероприятий.Владелец,
		                      |	МероприятияБезТиповМероприятий.Должник,
		                      |	МероприятияБезТиповМероприятий.ТипМероприятия
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ответственный
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	МероприятияБезТипаСотрудника.ТипМероприятия,
		                      |	МероприятияБезТипаСотрудника.Должник,
		                      |	МероприятияБезТипаСотрудника.Ссылка
		                      |ПОМЕСТИТЬ ОтборПервый
		                      |ИЗ
		                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ТипыСотрудников.Ссылка КАК Ссылка,
		                      |	ТипыСотрудников.Глубина,
		                      |	ТипыСотрудников.РодителиШаблон
		                      |ПОМЕСТИТЬ ПВХ_ТипСотрудника
		                      |ИЗ
		                      |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
		                      |ГДЕ
		                      |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	МероприятияБезТипаСотрудника.Ссылка,
		                      |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
		                      |	ПВХ_ТипСотрудника.РодителиШаблон,
		                      |	ПВХ_ТипСотрудника.Глубина,
		                      |	МероприятияБезТипаСотрудника.Должник,
		                      |	МероприятияБезТипаСотрудника.ТипМероприятия
		                      |ПОМЕСТИТЬ Замена_Владельца_На_ДО
		                      |ИЗ
		                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
		                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Объект
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Замена_Владельца_На_ДО.РодителиШаблон,
		                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
		                      |	Замена_Владельца_На_ДО.Ссылка,
		                      |	ОтветственныеСотрудники.Пользователь,
		                      |	Замена_Владельца_На_ДО.Должник,
		                      |	Замена_Владельца_На_ДО.ТипМероприятия
		                      |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
		                      |ИЗ
		                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
		                      |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	Замена_Владельца_На_ДО.РодителиШаблон,
		                      |	СотрудникиВПомощь.ТипСотрудника,
		                      |	Замена_Владельца_На_ДО.Ссылка,
		                      |	СотрудникиВПомощь.Пользователь,
		                      |	Замена_Владельца_На_ДО.Должник,
		                      |	Замена_Владельца_На_ДО.ТипМероприятия
		                      |ИЗ
		                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
		                      |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	ТипСотрудника
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
		                      |	Без_Шаблона_Отв_Сотр.Пользователь,
		                      |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
		                      |	Без_Шаблона_Отв_Сотр.Должник,
		                      |	Без_Шаблона_Отв_Сотр.ТипМероприятия
		                      |ПОМЕСТИТЬ Без_Глубины
		                      |ИЗ
		                      |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
		                      |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
		                      |ГДЕ
		                      |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка,
		                      |	Глубина
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Без_Глубины.Ссылка КАК Ссылка,
		                      |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
		                      |ПОМЕСТИТЬ Глубина_Макс
		                      |ИЗ
		                      |	Без_Глубины КАК Без_Глубины
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	Без_Глубины.Ссылка
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка,
		                      |	Глубина
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Без_Глубины.Пользователь КАК Пользователь,
		                      |	Без_Глубины.Ссылка,
		                      |	Без_Глубины.Должник,
		                      |	Без_Глубины.ТипМероприятия
		                      |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
		                      |ИЗ
		                      |	Без_Глубины КАК Без_Глубины
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
		                      |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
		                      |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Пользователь
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ТипМероприятия,
		                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Должник,
		                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие
		                      |ПОМЕСТИТЬ БезГруппировки
		                      |ИЗ
		                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		                      |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	ОтборПервый.ТипМероприятия,
		                      |	ОтборПервый.Должник,
		                      |	ОтборПервый.Ссылка
		                      |ИЗ
		                      |	ОтборПервый КАК ОтборПервый
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	БезГруппировки.ТипМероприятия,
		                      |	БезГруппировки.Должник,
		                      |	БезГруппировки.Мероприятие
		                      |ИЗ
		                      |	БезГруппировки КАК БезГруппировки
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	БезГруппировки.ТипМероприятия,
		                      |	БезГруппировки.Должник,
		                      |	БезГруппировки.Мероприятие");
						
		Запрос.УстановитьПараметр("Ответственный", Пользователь);
		// ТЗ "ЗаполнитьЗапрос" используется, чтобы не выполнять заного запрос при заполнении полей в обработке.
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Пользователи.Ссылка КАК Ссылка
		                      |ПОМЕСТИТЬ ВТ_Ответственный
		                      |ИЗ
		                      |	Справочник.Пользователи КАК Пользователи
		                      |ГДЕ
		                      |	Пользователи.Ссылка В(&Ответственный)
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ОбъектыВРаботеОстатки.Объект КАК Объект
		                      |ПОМЕСТИТЬ ОбъектыВРаботе
		                      |ИЗ
		                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		                      |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Объект
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Контрагенты.Ссылка КАК Объект,
		                      |	Контрагенты.Ссылка КАК Должник
		                      |ПОМЕСТИТЬ ВсеОбъектыВРаботе
		                      |ИЗ
		                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		                      |		ПО ОбъектыВРаботе.Объект = Контрагенты.Ссылка
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	ДолговыеОбязательства.Ссылка,
		                      |	ДолговыеОбязательства.Должник
		                      |ИЗ
		                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
		                      |		ПО ОбъектыВРаботе.Объект = ДолговыеОбязательства.Ссылка
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	ИсполнительныеДокументы.Ссылка,
		                      |	ИсполнительныеДокументы.Должник
		                      |ИЗ
		                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
		                      |		ПО ОбъектыВРаботе.Объект = ИсполнительныеДокументы.Ссылка
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Объект
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
		                      |	ВсеОбъектыВРаботе.Должник,
		                      |	БизнесПроцессы.Ссылка
		                      |ПОМЕСТИТЬ БезПлохихБП
		                      |ИЗ
		                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
		                      |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
		                      |ГДЕ
		                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
		                      |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
		                      |				И БизнесПроцессы.Завершен = ЛОЖЬ)
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Объект
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Мероприятие.Ссылка,
		                      |	Мероприятие.Объект,
		                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
		                      |	Мероприятие.Ответственный,
		                      |	БезПлохихБП.Должник
		                      |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
		                      |ИЗ
		                      |	Задача.Мероприятие КАК Мероприятие
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
		                      |		ПО Мероприятие.Объект = БезПлохихБП.Объект
							  |			И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
		                      |				ИЛИ Мероприятие.БизнесПроцесс = БезПлохихБП.Ссылка)
		                      |ГДЕ
		                      |	Мероприятие.ПометкаУдаления = ЛОЖЬ
		                      |	И Мероприятие.Выполнена = ЛОЖЬ
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	ТипМероприятия
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ТипыМероприятий.Ссылка КАК Ссылка
		                      |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
		                      |ИЗ
		                      |	Справочник.ТипыМероприятий КАК ТипыМероприятий
		                      |ГДЕ
		                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
		                      |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	МероприятияБезТиповМероприятий.ТипМероприятия,
		                      |	МероприятияБезТиповМероприятий.Должник,
		                      |	МероприятияБезТиповМероприятий.Ссылка,
		                      |	МероприятияБезТиповМероприятий.Объект,
		                      |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный
		                      |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
		                      |ИЗ
		                      |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
		                      |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	МероприятияБезТиповМероприятий.Ссылка,
		                      |	МероприятияБезТиповМероприятий.Объект,
		                      |	МероприятияБезТиповМероприятий.Ответственный,
		                      |	МероприятияБезТиповМероприятий.Должник,
		                      |	МероприятияБезТиповМероприятий.ТипМероприятия
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ответственный
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	МероприятияБезТипаСотрудника.ТипМероприятия,
		                      |	МероприятияБезТипаСотрудника.Должник,
		                      |	МероприятияБезТипаСотрудника.Ссылка
		                      |ПОМЕСТИТЬ ОтборПервый
		                      |ИЗ
		                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ТипыСотрудников.Ссылка КАК Ссылка,
		                      |	ТипыСотрудников.Глубина,
		                      |	ТипыСотрудников.РодителиШаблон
		                      |ПОМЕСТИТЬ ПВХ_ТипСотрудника
		                      |ИЗ
		                      |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
		                      |ГДЕ
		                      |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	МероприятияБезТипаСотрудника.Ссылка,
		                      |	МероприятияБезТипаСотрудника.Объект КАК Объект,
		                      |	ПВХ_ТипСотрудника.РодителиШаблон,
		                      |	ПВХ_ТипСотрудника.Глубина,
		                      |	МероприятияБезТипаСотрудника.Должник,
		                      |	МероприятияБезТипаСотрудника.ТипМероприятия
		                      |ПОМЕСТИТЬ Замена_Владельца_На_ДО
		                      |ИЗ
		                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
		                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Объект
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Замена_Владельца_На_ДО.РодителиШаблон,
		                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
		                      |	Замена_Владельца_На_ДО.Ссылка,
		                      |	ОтветственныеСотрудники.Пользователь,
		                      |	Замена_Владельца_На_ДО.Должник,
		                      |	Замена_Владельца_На_ДО.ТипМероприятия
		                      |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
		                      |ИЗ
		                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
		                      |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	Замена_Владельца_На_ДО.РодителиШаблон,
		                      |	СотрудникиВПомощь.ТипСотрудника,
		                      |	Замена_Владельца_На_ДО.Ссылка,
		                      |	СотрудникиВПомощь.Пользователь,
		                      |	Замена_Владельца_На_ДО.Должник,
		                      |	Замена_Владельца_На_ДО.ТипМероприятия
		                      |ИЗ
		                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
		                      |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	ТипСотрудника
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
		                      |	Без_Шаблона_Отв_Сотр.Пользователь,
		                      |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
		                      |	Без_Шаблона_Отв_Сотр.Должник,
		                      |	Без_Шаблона_Отв_Сотр.ТипМероприятия
		                      |ПОМЕСТИТЬ Без_Глубины
		                      |ИЗ
		                      |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
		                      |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
		                      |ГДЕ
		                      |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка,
		                      |	Глубина
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Без_Глубины.Ссылка КАК Ссылка,
		                      |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
		                      |ПОМЕСТИТЬ Глубина_Макс
		                      |ИЗ
		                      |	Без_Глубины КАК Без_Глубины
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	Без_Глубины.Ссылка
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Ссылка,
		                      |	Глубина
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Без_Глубины.Пользователь КАК Пользователь,
		                      |	Без_Глубины.Ссылка,
		                      |	Без_Глубины.Должник,
		                      |	Без_Глубины.ТипМероприятия
		                      |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
		                      |ИЗ
		                      |	Без_Глубины КАК Без_Глубины
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
		                      |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
		                      |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
		                      |
		                      |ИНДЕКСИРОВАТЬ ПО
		                      |	Пользователь
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ТипМероприятия,
		                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Должник,
		                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие
		                      |ИЗ
		                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		                      |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	ОтборПервый.ТипМероприятия,
		                      |	ОтборПервый.Должник,
		                      |	ОтборПервый.Ссылка
		                      |ИЗ
		                      |	ОтборПервый КАК ОтборПервый");
		Запрос.УстановитьПараметр("Ответственный", Пользователь);
		// ТЗ "ЗаполнитьЗапрос" используется, чтобы не выполнять заного запрос при заполнении полей в обработке.
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;
КонецФункции

&НаСервере
Процедура РаспределитьМероприятияИД_На_До(ТабличныйДокумент, Объект, СписокПользователей, ОтображатьВыполненные, ГруппироватьМероприятия)
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	Пользователи.Ссылка КАК Ссылка
	//                      |ПОМЕСТИТЬ ВТ_Ответственный
	//                      |ИЗ
	//                      |	Справочник.Пользователи КАК Пользователи
	//                      |ГДЕ
	//                      |	Пользователи.Ссылка В(&Ответственный)
	//                      |
	//                      |ИНДЕКСИРОВАТЬ ПО
	//                      |	Ссылка
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ОбъектыВРаботеОстатки.Объект КАК Объект
	//                      |ПОМЕСТИТЬ ОбъектыВРаботе
	//                      |ИЗ
	//                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	//                      |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
	//                      |
	//                      |ИНДЕКСИРОВАТЬ ПО
	//                      |	Объект
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ИсполнительныеДокументы.Ссылка КАК Объект,
	//                      |	ИсполнительныеДокументы.Владелец КАК Владелец
	//                      |ПОМЕСТИТЬ ВсеОбъектыВРаботе
	//                      |ИЗ
	//                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
	//                      |		ПО ОбъектыВРаботе.Объект = ИсполнительныеДокументы.Владелец
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	ОбъектыВРаботе.Объект,
	//                      |	NULL
	//                      |ИЗ
	//                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	//                      |
	//                      |ИНДЕКСИРОВАТЬ ПО
	//                      |	Объект
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
	//                      |	ВсеОбъектыВРаботе.Владелец,
	//                      |	БизнесПроцессы.Ссылка
	//                      |ПОМЕСТИТЬ БезПлохихБП
	//                      |ИЗ
	//                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	//                      |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
	//                      |ГДЕ
	//                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
	//                      |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
	//                      |				И БизнесПроцессы.Завершен = ЛОЖЬ)
	//                      |
	//                      |ИНДЕКСИРОВАТЬ ПО
	//                      |	Объект
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	Мероприятие.Ссылка,
	//                      |	Мероприятие.Объект,
	//                      |	Мероприятие.ПланируемаяДата,
	//                      |	Мероприятие.ПланируемоеВремя КАК ВремяНачала,
	//                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	//                      |	Мероприятие.Ответственный,
	//                      |	Мероприятие.Выполнена,
	//                      |	БезПлохихБП.Владелец
	//                      |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
	//                      |ИЗ
	//                      |	Задача.Мероприятие КАК Мероприятие
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
	//                      |		ПО Мероприятие.Объект = БезПлохихБП.Объект
	//                      |ГДЕ
	//                      |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	//                      |	И (Мероприятие.Выполнена = ЛОЖЬ
	//                      |			ИЛИ &ОтображатьВыполненные)
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	БезПлохихБП.Владелец,
	//                      |	Мероприятие.Ссылка,
	//                      |	Мероприятие.Объект,
	//                      |	Мероприятие.ПланируемаяДата,
	//                      |	Мероприятие.ПланируемоеВремя,
	//                      |	Мероприятие.ТипМероприятия,
	//                      |	Мероприятие.Ответственный,
	//                      |	Мероприятие.Выполнена
	//                      |
	//                      |ИНДЕКСИРОВАТЬ ПО
	//                      |	ТипМероприятия
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ТипыМероприятий.Ссылка КАК Ссылка
	//                      |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
	//                      |ИЗ
	//                      |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	//                      |ГДЕ
	//                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	//                      |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
	//                      |
	//                      |ИНДЕКСИРОВАТЬ ПО
	//                      |	Ссылка
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	МероприятияБезТиповМероприятий.Ссылка,
	//                      |	МероприятияБезТиповМероприятий.Объект,
	//                      |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
	//                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	//                      |	МероприятияБезТиповМероприятий.Выполнена,
	//                      |	МероприятияБезТиповМероприятий.ВремяНачала,
	//                      |	МероприятияБезТиповМероприятий.Владелец
	//                      |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
	//                      |ИЗ
	//                      |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
	//                      |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
	//                      |ГДЕ
	//                      |	МероприятияБезТиповМероприятий.ПланируемаяДата >= &ДатаНачало
	//                      |	И МероприятияБезТиповМероприятий.ПланируемаяДата <= &ДатаКонец
	//                      |
	//                      |ИНДЕКСИРОВАТЬ ПО
	//                      |	Ответственный
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	МероприятияБезТипаСотрудника.Ссылка,
	//                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	//                      |	МероприятияБезТипаСотрудника.Выполнена,
	//                      |	МероприятияБезТипаСотрудника.ВремяНачала
	//                      |ПОМЕСТИТЬ ОтборПервый
	//                      |ИЗ
	//                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	//                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ТипыСотрудников.Ссылка КАК Ссылка,
	//                      |	ТипыСотрудников.Глубина,
	//                      |	ТипыСотрудников.РодителиШаблон
	//                      |ПОМЕСТИТЬ ПВХ_ТипСотрудника
	//                      |ИЗ
	//                      |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	//                      |ГДЕ
	//                      |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
	//                      |
	//                      |ИНДЕКСИРОВАТЬ ПО
	//                      |	Ссылка
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	МероприятияБезТипаСотрудника.Ссылка,
	//                      |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
	//                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	//                      |	МероприятияБезТипаСотрудника.Выполнена,
	//                      |	МероприятияБезТипаСотрудника.ВремяНачала,
	//                      |	ПВХ_ТипСотрудника.РодителиШаблон,
	//                      |	ПВХ_ТипСотрудника.Глубина
	//                      |ПОМЕСТИТЬ Замена_Владельца_На_ДО
	//                      |ИЗ
	//                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	//                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
	//                      |
	//                      |ИНДЕКСИРОВАТЬ ПО
	//                      |	Объект
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	//                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	//                      |	Замена_Владельца_На_ДО.Ссылка,
	//                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	//                      |	Замена_Владельца_На_ДО.Выполнена,
	//                      |	Замена_Владельца_На_ДО.ВремяНачала,
	//                      |	ОтветственныеСотрудники.Пользователь
	//                      |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
	//                      |ИЗ
	//                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	//                      |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	//                      |	СотрудникиВПомощь.ТипСотрудника,
	//                      |	Замена_Владельца_На_ДО.Ссылка,
	//                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	//                      |	Замена_Владельца_На_ДО.Выполнена,
	//                      |	Замена_Владельца_На_ДО.ВремяНачала,
	//                      |	СотрудникиВПомощь.Пользователь
	//                      |ИЗ
	//                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	//                      |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
	//                      |
	//                      |ИНДЕКСИРОВАТЬ ПО
	//                      |	ТипСотрудника
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
	//                      |	Без_Шаблона_Отв_Сотр.Пользователь,
	//                      |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
	//                      |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
	//                      |	Без_Шаблона_Отв_Сотр.Выполнена,
	//                      |	Без_Шаблона_Отв_Сотр.ВремяНачала
	//                      |ПОМЕСТИТЬ Без_Глубины
	//                      |ИЗ
	//                      |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	//                      |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
	//                      |ГДЕ
	//                      |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
	//                      |
	//                      |ИНДЕКСИРОВАТЬ ПО
	//                      |	Ссылка,
	//                      |	Глубина
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	Без_Глубины.Ссылка КАК Ссылка,
	//                      |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
	//                      |ПОМЕСТИТЬ Глубина_Макс
	//                      |ИЗ
	//                      |	Без_Глубины КАК Без_Глубины
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	Без_Глубины.Ссылка
	//                      |
	//                      |ИНДЕКСИРОВАТЬ ПО
	//                      |	Ссылка,
	//                      |	Глубина
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	Без_Глубины.Пользователь КАК Пользователь,
	//                      |	Без_Глубины.Ссылка,
	//                      |	Без_Глубины.ПланируемаяДата,
	//                      |	Без_Глубины.ВремяНачала,
	//                      |	Без_Глубины.Выполнена
	//                      |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
	//                      |ИЗ
	//                      |	Без_Глубины КАК Без_Глубины
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
	//                      |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
	//                      |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
	//                      |
	//                      |ИНДЕКСИРОВАТЬ ПО
	//                      |	Пользователь
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
	//                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
	//                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ВремяНачала КАК ВремяНачала,
	//                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Выполнена
	//                      |ИЗ
	//                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	//                      |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	ОтборПервый.Ссылка,
	//                      |	ОтборПервый.ПланируемаяДата,
	//                      |	ОтборПервый.ВремяНачала,
	//                      |	ОтборПервый.Выполнена
	//                      |ИЗ
	//                      |	ОтборПервый КАК ОтборПервый
	//                      |
	//                      |УПОРЯДОЧИТЬ ПО
	//                      |	ПланируемаяДата,
	//                      |	ВремяНачала");

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ_Ответственный
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.Ссылка В(&Ответственный)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект КАК Объект
	                      |ПОМЕСТИТЬ ОбъектыВРаботе
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ИсполнительныеДокументы.Ссылка КАК Объект,
	                      |	ИсполнительныеДокументы.Владелец КАК Владелец
	                      |ПОМЕСТИТЬ ВсеОбъектыВРаботе
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
	                      |		ПО ОбъектыВРаботе.Объект = ИсполнительныеДокументы.Владелец
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботе.Объект,
	                      |	NULL
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                    |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Мероприятие.Ссылка) КАК КолВоМероприятий
	                      |ПОМЕСТИТЬ КоличествоМероприятийБезБП
	                      |ИЗ
	                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	                      |		ПО ВсеОбъектыВРаботе.Объект = Мероприятие.Объект
	                      |ГДЕ
	                      |	Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |	И Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВсеОбъектыВРаботе.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КоличествоМероприятийБезБП.Объект КАК Объект,
	                      |	ВсеОбъектыВРаботе.Владелец КАК Владелец
	                      |ПОМЕСТИТЬ ОбъектыСМероприятиямиИВладелец
	                      |ИЗ
	                      |	КоличествоМероприятийБезБП КАК КоличествоМероприятийБезБП
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ПО КоличествоМероприятийБезБП.Объект = ВсеОбъектыВРаботе.Объект
	                      |ГДЕ
	                      |	КоличествоМероприятийБезБП.КолВоМероприятий > 0
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
	                      |	ВсеОбъектыВРаботе.Владелец КАК Владелец,
	                      |	БизнесПроцессы.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ БезПлохихБП
	                      |ИЗ
	                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	                      |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
	                      |ГДЕ
	                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
	                      |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
	                      |				И БизнесПроцессы.Завершен = ЛОЖЬ)
	                      |
	                      |ОБЪЕДИНИТЬ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОбъектыСМероприятиямиИВладелец.Объект,
	                      |	ОбъектыСМероприятиямиИВладелец.Владелец,
	                      |	NULL
	                      |ИЗ
	                      |	ОбъектыСМероприятиямиИВладелец КАК ОбъектыСМероприятиямиИВладелец
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Мероприятие.Ссылка,
	                      |	Мероприятие.Объект,
	                      |	Мероприятие.ПланируемаяДата,
	                      |	Мероприятие.ПланируемоеВремя КАК ВремяНачала,
	                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	                      |	Мероприятие.Ответственный,
	                      |	Мероприятие.Выполнена,
	                      |	БезПлохихБП.Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
	                      |		ПО Мероприятие.Объект = БезПлохихБП.Объект
	                      |ГДЕ
	                      |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И (Мероприятие.БизнесПроцесс.ПометкаУдаления = ЛОЖЬ
	                      |			ИЛИ Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяССылка))
	                      |	И (Мероприятие.Выполнена = ЛОЖЬ
	                      |			ИЛИ &ОтображатьВыполненные)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	БезПлохихБП.Владелец,
	                      |	Мероприятие.Ссылка,
	                      |	Мероприятие.Объект,
	                      |	Мероприятие.ПланируемаяДата,
	                      |	Мероприятие.ПланируемоеВремя,
	                      |	Мероприятие.ТипМероприятия,
	                      |	Мероприятие.Ответственный,
	                      |	Мероприятие.Выполнена
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипМероприятия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыМероприятий.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
	                      |ИЗ
	                      |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	                      |ГДЕ
	                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	                      |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	                      |	МероприятияБезТиповМероприятий.Выполнена,
	                      |	МероприятияБезТиповМероприятий.ВремяНачала,
	                      |	МероприятияБезТиповМероприятий.Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
	                      |ИЗ
	                      |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
	                      |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
	                      |ГДЕ
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата >= &ДатаНачало
	                      |	И МероприятияБезТиповМероприятий.ПланируемаяДата <= &ДатаКонец
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ответственный
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	МероприятияБезТипаСотрудника.Выполнена,
	                      |	МероприятияБезТипаСотрудника.ВремяНачала
	                      |ПОМЕСТИТЬ ОтборПервый
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыСотрудников.Ссылка КАК Ссылка,
	                      |	ТипыСотрудников.Глубина,
	                      |	ТипыСотрудников.РодителиШаблон
	                      |ПОМЕСТИТЬ ПВХ_ТипСотрудника
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	                      |ГДЕ
	                      |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	МероприятияБезТипаСотрудника.Выполнена,
	                      |	МероприятияБезТипаСотрудника.ВремяНачала,
	                      |	ПВХ_ТипСотрудника.РодителиШаблон,
	                      |	ПВХ_ТипСотрудника.Глубина
	                      |ПОМЕСТИТЬ Замена_Владельца_На_ДО
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	Замена_Владельца_На_ДО.Выполнена,
	                      |	Замена_Владельца_На_ДО.ВремяНачала,
	                      |	ОтветственныеСотрудники.Пользователь
	                      |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	СотрудникиВПомощь.ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	Замена_Владельца_На_ДО.Выполнена,
	                      |	Замена_Владельца_На_ДО.ВремяНачала,
	                      |	СотрудникиВПомощь.Пользователь
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	                      |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипСотрудника
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
	                      |	Без_Шаблона_Отв_Сотр.Пользователь,
	                      |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
	                      |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
	                      |	Без_Шаблона_Отв_Сотр.Выполнена,
	                      |	Без_Шаблона_Отв_Сотр.ВремяНачала
	                      |ПОМЕСТИТЬ Без_Глубины
	                      |ИЗ
	                      |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
	                      |ГДЕ
	                      |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Ссылка КАК Ссылка,
	                      |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
	                      |ПОМЕСТИТЬ Глубина_Макс
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Без_Глубины.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Пользователь КАК Пользователь,
	                      |	Без_Глубины.Ссылка,
	                      |	Без_Глубины.ПланируемаяДата,
	                      |	Без_Глубины.ВремяНачала,
	                      |	Без_Глубины.Выполнена
	                      |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
	                      |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
	                      |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ВремяНачала КАК ВремяНачала,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Выполнена
	                      |ИЗ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОтборПервый.Ссылка,
	                      |	ОтборПервый.ПланируемаяДата,
	                      |	ОтборПервый.ВремяНачала,
	                      |	ОтборПервый.Выполнена
	                      |ИЗ
	                      |	ОтборПервый КАК ОтборПервый
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПланируемаяДата,
	                      |	ВремяНачала");

	Запрос.УстановитьПараметр("ДатаНачало", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаКонец", КонецДня(Объект.ДатаКонца));
	Запрос.УстановитьПараметр("Ответственный", СписокПользователей);
	Запрос.УстановитьПараметр("ОтображатьВыполненные", ОтображатьВыполненные);
	Результат = Запрос.Выполнить().Выбрать();	
	Пока Результат.Следующий() Цикл
		ВремяМероприятия = Результат.ВремяНачала;
		НомерСтроки = 1;
		НомерКолонки = РассчитатьНомерКолонки(Результат.ПланируемаяДата, Объект); 
		//1+(Стр.ПланируемаяДата - НачалоДня(НачПериода))/(24*3600);
		ПоместитьМероприятиеВСтроку(НомерСтроки, НомерКолонки, Результат.Мероприятие, ТабличныйДокумент, Объект, 
				ГруппироватьМероприятия);
	КонецЦикла;
КонецПроцедуры

 &НаСервере
Процедура НеРаспределитьМероприятияИД_На_До(ТабличныйДокумент, Объект, СписокПользователей, ОтображатьВыполненные,
		ГруппироватьМероприятия)
	Запрос = Новый Запрос
	//("ВЫБРАТЬ
	//					  |	Пользователи.Ссылка КАК Ссылка
	//					  |ПОМЕСТИТЬ ВТ_Ответственный
	//					  |ИЗ
	//					  |	Справочник.Пользователи КАК Пользователи
	//					  |ГДЕ
	//					  |	Пользователи.Ссылка В(&Ответственный)
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Ссылка
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	ОбъектыВРаботеОстатки.Объект КАК Объект
	//					  |ПОМЕСТИТЬ ВсеОбъектыВРаботе
	//					  |ИЗ
	//					  |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	//					  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	//					  |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Объект
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	ВсеОбъектыВРаботе.Объект КАК Объект,
	//					  |	БизнесПроцессы.Ссылка
	//					  |ПОМЕСТИТЬ БезПлохихБП
	//					  |ИЗ
	//					  |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	//					  |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	//					  |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
	//					  |ГДЕ
	//					  |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
	//					  |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
	//					  |				И БизнесПроцессы.Завершен = ЛОЖЬ)
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Объект
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	Мероприятие.Ссылка,
	//					  |	Мероприятие.Объект,
	//					  |	Мероприятие.ПланируемаяДата,
	//					  |	Мероприятие.ПланируемоеВремя КАК ВремяНачала,
	//					  |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	//					  |	Мероприятие.Ответственный,
	//					  |	Мероприятие.Выполнена
	//					  |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
	//					  |ИЗ
	//					  |	Задача.Мероприятие КАК Мероприятие
	//					  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
	//					  |		ПО Мероприятие.Объект = БезПлохихБП.Объект
	//					  |ГДЕ
	//					  |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	//					  |	И (Мероприятие.Выполнена = ЛОЖЬ
	//					  |			ИЛИ &ОтображатьВыполненные)
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	ТипМероприятия
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	ТипыМероприятий.Ссылка КАК Ссылка
	//					  |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
	//					  |ИЗ
	//					  |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	//					  |ГДЕ
	//					  |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	//					  |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Ссылка
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	МероприятияБезТиповМероприятий.Ссылка,
	//					  |	МероприятияБезТиповМероприятий.Объект,
	//					  |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
	//					  |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	//					  |	МероприятияБезТиповМероприятий.Выполнена,
	//					  |	МероприятияБезТиповМероприятий.ВремяНачала
	//					  |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
	//					  |ИЗ
	//					  |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
	//					  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
	//					  |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
	//					  |ГДЕ
	//					  |	МероприятияБезТиповМероприятий.ПланируемаяДата >= &ДатаНачало
	//					  |	И МероприятияБезТиповМероприятий.ПланируемаяДата <= &ДатаКонец
	//					  |
	//					  |СГРУППИРОВАТЬ ПО
	//					  |	МероприятияБезТиповМероприятий.Ссылка,
	//					  |	МероприятияБезТиповМероприятий.Объект,
	//					  |	МероприятияБезТиповМероприятий.Ответственный,
	//					  |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	//					  |	МероприятияБезТиповМероприятий.Выполнена,
	//					  |	МероприятияБезТиповМероприятий.ВремяНачала
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Ответственный
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	МероприятияБезТипаСотрудника.Ссылка,
	//					  |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	//					  |	МероприятияБезТипаСотрудника.Выполнена,
	//					  |	МероприятияБезТипаСотрудника.ВремяНачала
	//					  |ПОМЕСТИТЬ ОтборПервый
	//					  |ИЗ
	//					  |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	//					  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	//					  |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	ТипыСотрудников.Ссылка КАК Ссылка,
	//					  |	ТипыСотрудников.Глубина,
	//					  |	ТипыСотрудников.РодителиШаблон
	//					  |ПОМЕСТИТЬ ПВХ_ТипСотрудника
	//					  |ИЗ
	//					  |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	//					  |ГДЕ
	//					  |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Ссылка
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	МероприятияБезТипаСотрудника.Ссылка,
	//					  |	МероприятияБезТипаСотрудника.Объект КАК Объект,
	//					  |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	//					  |	МероприятияБезТипаСотрудника.Выполнена,
	//					  |	МероприятияБезТипаСотрудника.ВремяНачала,
	//					  |	ПВХ_ТипСотрудника.РодителиШаблон,
	//					  |	ПВХ_ТипСотрудника.Глубина
	//					  |ПОМЕСТИТЬ Замена_Владельца_На_ДО
	//					  |ИЗ
	//					  |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	//					  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	//					  |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Объект
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	Замена_Владельца_На_ДО.РодителиШаблон,
	//					  |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	//					  |	Замена_Владельца_На_ДО.Ссылка,
	//					  |	Замена_Владельца_На_ДО.ПланируемаяДата,
	//					  |	Замена_Владельца_На_ДО.Выполнена,
	//					  |	Замена_Владельца_На_ДО.ВремяНачала,
	//					  |	ОтветственныеСотрудники.Пользователь
	//					  |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
	//					  |ИЗ
	//					  |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	//					  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	//					  |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
	//					  |
	//					  |ОБЪЕДИНИТЬ ВСЕ
	//					  |
	//					  |ВЫБРАТЬ
	//					  |	Замена_Владельца_На_ДО.РодителиШаблон,
	//					  |	СотрудникиВПомощь.ТипСотрудника,
	//					  |	Замена_Владельца_На_ДО.Ссылка,
	//					  |	Замена_Владельца_На_ДО.ПланируемаяДата,
	//					  |	Замена_Владельца_На_ДО.Выполнена,
	//					  |	Замена_Владельца_На_ДО.ВремяНачала,
	//					  |	СотрудникиВПомощь.Пользователь
	//					  |ИЗ
	//					  |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	//					  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	//					  |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	ТипСотрудника
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
	//					  |	Без_Шаблона_Отв_Сотр.Пользователь,
	//					  |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
	//					  |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
	//					  |	Без_Шаблона_Отв_Сотр.Выполнена,
	//					  |	Без_Шаблона_Отв_Сотр.ВремяНачала
	//					  |ПОМЕСТИТЬ Без_Глубины
	//					  |ИЗ
	//					  |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
	//					  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	//					  |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
	//					  |ГДЕ
	//					  |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Ссылка,
	//					  |	Глубина
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	Без_Глубины.Ссылка КАК Ссылка,
	//					  |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
	//					  |ПОМЕСТИТЬ Глубина_Макс
	//					  |ИЗ
	//					  |	Без_Глубины КАК Без_Глубины
	//					  |
	//					  |СГРУППИРОВАТЬ ПО
	//					  |	Без_Глубины.Ссылка
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Ссылка,
	//					  |	Глубина
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	Без_Глубины.Пользователь КАК Пользователь,
	//					  |	Без_Глубины.Ссылка,
	//					  |	Без_Глубины.ПланируемаяДата,
	//					  |	Без_Глубины.ВремяНачала,
	//					  |	Без_Глубины.Выполнена
	//					  |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
	//					  |ИЗ
	//					  |	Без_Глубины КАК Без_Глубины
	//					  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
	//					  |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
	//					  |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Пользователь
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
	//					  |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
	//					  |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ВремяНачала КАК ВремяНачала,
	//					  |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Выполнена
	//					  |ИЗ
	//					  |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
	//					  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	//					  |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
	//					  |
	//					  |ОБЪЕДИНИТЬ ВСЕ
	//					  |
	//					  |ВЫБРАТЬ
	//					  |	ОтборПервый.Ссылка,
	//					  |	ОтборПервый.ПланируемаяДата,
	//					  |	ОтборПервый.ВремяНачала,
	//					  |	ОтборПервый.Выполнена
	//					  |ИЗ
	//					  |	ОтборПервый КАК ОтборПервый
	//					  |
	//					  |УПОРЯДОЧИТЬ ПО
	//					  |	ПланируемаяДата,
	//					  |	ВремяНачала");
	
	
	//19.06
	//("ВЫБРАТЬ
	// |	Пользователи.Ссылка КАК Ссылка
	// |ПОМЕСТИТЬ ВТ_Ответственный
	// |ИЗ
	// |	Справочник.Пользователи КАК Пользователи
	// |ГДЕ
	// |	Пользователи.Ссылка В(&Ответственный)
	// |
	// |ИНДЕКСИРОВАТЬ ПО
	// |	Ссылка
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ
	// |	ОбъектыВРаботеОстатки.Объект КАК Объект
	// |ПОМЕСТИТЬ ОбъектыВРаботе
	// |ИЗ
	// |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	// |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	// |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
	// |
	// |ИНДЕКСИРОВАТЬ ПО
	// |	Объект
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ
	// |	ИсполнительныеДокументы.Ссылка КАК Объект,
	// |	ИсполнительныеДокументы.Владелец КАК Владелец
	// |ПОМЕСТИТЬ ВсеОбъектыВРаботе
	// |ИЗ
	// |	ОбъектыВРаботе КАК ОбъектыВРаботе
	// |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
	// |		ПО ОбъектыВРаботе.Объект = ИсполнительныеДокументы.Владелец
	// |
	// |ОБЪЕДИНИТЬ ВСЕ
	// |
	// |ВЫБРАТЬ
	// |	ОбъектыВРаботе.Объект,
	// |	NULL
	// |ИЗ
	// |	ОбъектыВРаботе КАК ОбъектыВРаботе
	// |
	// |ИНДЕКСИРОВАТЬ ПО
	// |	Объект
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ
	// |	ВсеОбъектыВРаботе.Объект КАК Объект,
	// |	ВсеОбъектыВРаботе.Владелец,
	// |	БизнесПроцессы.Ссылка
	// |ПОМЕСТИТЬ БезПлохихБП
	// |ИЗ
	// |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	// |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	// |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
	// |ГДЕ
	// |	(БизнесПроцессы.Ссылка ЕСТЬ NULL 
	// |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
	// |				И БизнесПроцессы.Завершен = ЛОЖЬ)
	// |
	// |ИНДЕКСИРОВАТЬ ПО
	// |	Объект
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ
	// |	Мероприятие.Ссылка,
	// |	Мероприятие.Объект,
	// |	Мероприятие.ПланируемаяДата,
	// |	Мероприятие.ПланируемоеВремя КАК ВремяНачала,
	// |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	// |	Мероприятие.Ответственный,
	// |	Мероприятие.Выполнена,
	// |	БезПлохихБП.Владелец
	// |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
	// |ИЗ
	// |	Задача.Мероприятие КАК Мероприятие
	// |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
	// |		ПО Мероприятие.Объект = БезПлохихБП.Объект
	// |ГДЕ
	// |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	// |	И (Мероприятие.Выполнена = ЛОЖЬ
	// |			ИЛИ &ОтображатьВыполненные)
	// |
	// |СГРУППИРОВАТЬ ПО
	// |	БезПлохихБП.Владелец,
	// |	Мероприятие.Ссылка,
	// |	Мероприятие.Объект,
	// |	Мероприятие.ПланируемаяДата,
	// |	Мероприятие.ПланируемоеВремя,
	// |	Мероприятие.ТипМероприятия,
	// |	Мероприятие.Ответственный,
	// |	Мероприятие.Выполнена
	// |
	// |ИНДЕКСИРОВАТЬ ПО
	// |	ТипМероприятия
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ
	// |	ТипыМероприятий.Ссылка КАК Ссылка
	// |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
	// |ИЗ
	// |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	// |ГДЕ
	// |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	// |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
	// |
	// |ИНДЕКСИРОВАТЬ ПО
	// |	Ссылка
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ
	// |	МероприятияБезТиповМероприятий.Ссылка,
	// |	МероприятияБезТиповМероприятий.Объект,
	// |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
	// |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	// |	МероприятияБезТиповМероприятий.Выполнена,
	// |	МероприятияБезТиповМероприятий.ВремяНачала,
	// |	МероприятияБезТиповМероприятий.Владелец
	// |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
	// |ИЗ
	// |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
	// |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
	// |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
	// |ГДЕ
	// |	МероприятияБезТиповМероприятий.ПланируемаяДата >= &ДатаНачало
	// |	И МероприятияБезТиповМероприятий.ПланируемаяДата <= &ДатаКонец
	// |
	// |ИНДЕКСИРОВАТЬ ПО
	// |	Ответственный
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ
	// |	МероприятияБезТипаСотрудника.Ссылка,
	// |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	// |	МероприятияБезТипаСотрудника.Выполнена,
	// |	МероприятияБезТипаСотрудника.ВремяНачала
	// |ПОМЕСТИТЬ ОтборПервый
	// |ИЗ
	// |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	// |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	// |		ПО (ВЫБОР
	// |				КОГДА МероприятияБезТипаСотрудника.Выполнена
	// |					ТОГДА МероприятияБезТипаСотрудника.Ссылка.Исполнитель = ВТ_Ответственный.Ссылка
	// |				ИНАЧЕ МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
	// |			КОНЕЦ)
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ
	// |	ТипыСотрудников.Ссылка КАК Ссылка,
	// |	ТипыСотрудников.Глубина,
	// |	ТипыСотрудников.РодителиШаблон,
	// |	ТипыСотрудников.Родители
	// |ПОМЕСТИТЬ ПВХ_ТипСотрудника
	// |ИЗ
	// |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	// |ГДЕ
	// |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
	// |
	// |ИНДЕКСИРОВАТЬ ПО
	// |	Ссылка
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ
	// |	МероприятияБезТипаСотрудника.Ссылка,
	// |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
	// |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	// |	МероприятияБезТипаСотрудника.Выполнена,
	// |	МероприятияБезТипаСотрудника.ВремяНачала,
	// |	ПВХ_ТипСотрудника.Родители КАК РодителиШаблон,
	// |	ПВХ_ТипСотрудника.Глубина
	// |ПОМЕСТИТЬ Замена_Владельца_На_ДО
	// |ИЗ
	// |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	// |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	// |		ПО (ВЫБОР
	// |				КОГДА МероприятияБезТипаСотрудника.Выполнена
	// |					ТОГДА ЛОЖЬ
	// |				ИНАЧЕ МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
	// |			КОНЕЦ)
	// |
	// |ИНДЕКСИРОВАТЬ ПО
	// |	Объект
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ
	// |	Замена_Владельца_На_ДО.РодителиШаблон,
	// |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	// |	Замена_Владельца_На_ДО.Ссылка,
	// |	Замена_Владельца_На_ДО.ПланируемаяДата,
	// |	Замена_Владельца_На_ДО.Выполнена,
	// |	Замена_Владельца_На_ДО.ВремяНачала,
	// |	ОтветственныеСотрудники.Пользователь
	// |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
	// |ИЗ
	// |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	// |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	// |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
	// |
	// |ОБЪЕДИНИТЬ ВСЕ
	// |
	// |ВЫБРАТЬ
	// |	Замена_Владельца_На_ДО.РодителиШаблон,
	// |	СотрудникиВПомощь.ТипСотрудника,
	// |	Замена_Владельца_На_ДО.Ссылка,
	// |	Замена_Владельца_На_ДО.ПланируемаяДата,
	// |	Замена_Владельца_На_ДО.Выполнена,
	// |	Замена_Владельца_На_ДО.ВремяНачала,
	// |	СотрудникиВПомощь.Пользователь
	// |ИЗ
	// |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	// |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	// |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
	// |
	// |ИНДЕКСИРОВАТЬ ПО
	// |	ТипСотрудника
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ
	// |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
	// |	Без_Шаблона_Отв_Сотр.Пользователь,
	// |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
	// |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
	// |	Без_Шаблона_Отв_Сотр.Выполнена,
	// |	Без_Шаблона_Отв_Сотр.ВремяНачала,
	// |	Без_Шаблона_Отв_Сотр.РодителиШаблон
	// |ПОМЕСТИТЬ Без_Глубины
	// |ИЗ
	// |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
	// |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	// |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
	// |ГДЕ
	// |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
	// |
	// |ИНДЕКСИРОВАТЬ ПО
	// |	Ссылка,
	// |	Глубина
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ
	// |	Без_Глубины.Ссылка КАК Ссылка,
	// |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
	// |ПОМЕСТИТЬ Глубина_Макс
	// |ИЗ
	// |	Без_Глубины КАК Без_Глубины
	// |
	// |СГРУППИРОВАТЬ ПО
	// |	Без_Глубины.Ссылка
	// |
	// |ИНДЕКСИРОВАТЬ ПО
	// |	Ссылка,
	// |	Глубина
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ
	// |	Без_Глубины.Пользователь КАК Пользователь,
	// |	Без_Глубины.Ссылка,
	// |	Без_Глубины.ПланируемаяДата,
	// |	Без_Глубины.ВремяНачала,
	// |	Без_Глубины.Выполнена
	// |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
	// |ИЗ
	// |	Без_Глубины КАК Без_Глубины
	// |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
	// |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
	// |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
	// |
	// |ИНДЕКСИРОВАТЬ ПО
	// |	Пользователь
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ
	// |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
	// |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
	// |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ВремяНачала КАК ВремяНачала,
	// |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Выполнена
	// |ИЗ
	// |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
	// |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	// |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
	// |
	// |ОБЪЕДИНИТЬ ВСЕ
	// |
	// |ВЫБРАТЬ
	// |	ОтборПервый.Ссылка,
	// |	ОтборПервый.ПланируемаяДата,
	// |	ОтборПервый.ВремяНачала,
	// |	ОтборПервый.Выполнена
	// |ИЗ
	// |	ОтборПервый КАК ОтборПервый
	// |
	// |УПОРЯДОЧИТЬ ПО
	// |	ПланируемаяДата,
	// |	ВремяНачала");

	("ВЫБРАТЬ
	 |	Пользователи.Ссылка КАК Ссылка
	 |ПОМЕСТИТЬ ВТ_Ответственный
	 |ИЗ
	 |	Справочник.Пользователи КАК Пользователи
	 |ГДЕ
	 |	Пользователи.Ссылка В(&Ответственный)
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ОбъектыВРаботеОстатки.Объект КАК Объект
	 |ПОМЕСТИТЬ ОбъектыВРаботе
	 |ИЗ
	 |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	 |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Объект
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ИсполнительныеДокументы.Ссылка КАК Объект,
	 |	ИсполнительныеДокументы.Владелец КАК Владелец
	 |ПОМЕСТИТЬ ВсеОбъектыВРаботе
	 |ИЗ
	 |	ОбъектыВРаботе КАК ОбъектыВРаботе
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
	 |		ПО ОбъектыВРаботе.Объект = ИсполнительныеДокументы.Владелец
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ОбъектыВРаботе.Объект,
	 |	NULL
	 |ИЗ
	 |	ОбъектыВРаботе КАК ОбъектыВРаботе
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Объект
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВсеОбъектыВРаботе.Объект КАК Объект,
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Мероприятие.Ссылка) КАК КолВоМероприятий
	 |ПОМЕСТИТЬ КоличествоМероприятийБезБП
	 |ИЗ
	 |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	 |		ПО ВсеОбъектыВРаботе.Объект = Мероприятие.Объект
	 |ГДЕ
	 |	Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	 |	И Мероприятие.ПометкаУдаления = ЛОЖЬ
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВсеОбъектыВРаботе.Объект
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Объект
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КоличествоМероприятийБезБП.Объект КАК Объект,
	 |	ВсеОбъектыВРаботе.Владелец КАК Владелец
	 |ПОМЕСТИТЬ ОбъектыСМероприятиямиИВладелец
	 |ИЗ
	 |	КоличествоМероприятийБезБП КАК КоличествоМероприятийБезБП
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	 |		ПО КоличествоМероприятийБезБП.Объект = ВсеОбъектыВРаботе.Объект
	 |ГДЕ
	 |	КоличествоМероприятийБезБП.КолВоМероприятий > 0
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Объект
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВсеОбъектыВРаботе.Объект КАК Объект,
	 |	ВсеОбъектыВРаботе.Владелец КАК Владелец,
	 |	БизнесПроцессы.Ссылка КАК Ссылка
	 |ПОМЕСТИТЬ БезПлохихБП
	 |ИЗ
	 |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	 |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	 |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
	 |ГДЕ
	 |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
	 |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
	 |				И БизнесПроцессы.Завершен = ЛОЖЬ)
	 |
	 |ОБЪЕДИНИТЬ
	 |
	 |ВЫБРАТЬ
	 |	ОбъектыСМероприятиямиИВладелец.Объект,
	 |	ОбъектыСМероприятиямиИВладелец.Владелец,
	 |	NULL
	 |ИЗ
	 |	ОбъектыСМероприятиямиИВладелец КАК ОбъектыСМероприятиямиИВладелец
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Объект
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Мероприятие.Ссылка,
	 |	Мероприятие.Объект,
	 |	Мероприятие.ПланируемаяДата,
	 |	Мероприятие.ПланируемоеВремя КАК ВремяНачала,
	 |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	 |	Мероприятие.Ответственный,
	 |	Мероприятие.Выполнена,
	 |	БезПлохихБП.Владелец
	 |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
	 |ИЗ
	 |	Задача.Мероприятие КАК Мероприятие
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
	 |		ПО Мероприятие.Объект = БезПлохихБП.Объект
	 |ГДЕ
	 |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	 |	И (Мероприятие.БизнесПроцесс.ПометкаУдаления = ЛОЖЬ
	 |			ИЛИ Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяССылка))
	 |	И (Мероприятие.Выполнена = ЛОЖЬ
	 |			ИЛИ &ОтображатьВыполненные)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	БезПлохихБП.Владелец,
	 |	Мероприятие.Ссылка,
	 |	Мероприятие.Объект,
	 |	Мероприятие.ПланируемаяДата,
	 |	Мероприятие.ПланируемоеВремя,
	 |	Мероприятие.ТипМероприятия,
	 |	Мероприятие.Ответственный,
	 |	Мероприятие.Выполнена
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	ТипМероприятия
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ТипыМероприятий.Ссылка КАК Ссылка
	 |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
	 |ИЗ
	 |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	 |ГДЕ
	 |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	 |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	МероприятияБезТиповМероприятий.Ссылка,
	 |	МероприятияБезТиповМероприятий.Объект,
	 |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
	 |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	 |	МероприятияБезТиповМероприятий.Выполнена,
	 |	МероприятияБезТиповМероприятий.ВремяНачала,
	 |	МероприятияБезТиповМероприятий.Владелец
	 |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
	 |ИЗ
	 |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
	 |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
	 |ГДЕ
	 |	МероприятияБезТиповМероприятий.ПланируемаяДата >= &ДатаНачало
	 |	И МероприятияБезТиповМероприятий.ПланируемаяДата <= &ДатаКонец
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Ответственный
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	МероприятияБезТипаСотрудника.Ссылка,
	 |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	 |	МероприятияБезТипаСотрудника.Выполнена,
	 |	МероприятияБезТипаСотрудника.ВремяНачала
	 |ПОМЕСТИТЬ ОтборПервый
	 |ИЗ
	 |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	 |		ПО (ВЫБОР
	 |				КОГДА МероприятияБезТипаСотрудника.Выполнена
	 |					ТОГДА МероприятияБезТипаСотрудника.Ссылка.Исполнитель = ВТ_Ответственный.Ссылка
	 |				ИНАЧЕ МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
	 |			КОНЕЦ)
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ТипыСотрудников.Ссылка КАК Ссылка,
	 |	ТипыСотрудников.Глубина,
	 |	ТипыСотрудников.РодителиШаблон,
	 |	ТипыСотрудников.Родители
	 |ПОМЕСТИТЬ ПВХ_ТипСотрудника
	 |ИЗ
	 |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	 |ГДЕ
	 |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	МероприятияБезТипаСотрудника.Ссылка,
	 |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
	 |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	 |	МероприятияБезТипаСотрудника.Выполнена,
	 |	МероприятияБезТипаСотрудника.ВремяНачала,
	 |	ПВХ_ТипСотрудника.Родители КАК РодителиШаблон,
	 |	ПВХ_ТипСотрудника.Глубина
	 |ПОМЕСТИТЬ Замена_Владельца_На_ДО
	 |ИЗ
	 |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	 |		ПО (ВЫБОР
	 |				КОГДА МероприятияБезТипаСотрудника.Выполнена
	 |					ТОГДА ЛОЖЬ
	 |				ИНАЧЕ МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
	 |			КОНЕЦ)
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Объект
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Замена_Владельца_На_ДО.РодителиШаблон,
	 |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	 |	Замена_Владельца_На_ДО.Ссылка,
	 |	Замена_Владельца_На_ДО.ПланируемаяДата,
	 |	Замена_Владельца_На_ДО.Выполнена,
	 |	Замена_Владельца_На_ДО.ВремяНачала,
	 |	ОтветственныеСотрудники.Пользователь
	 |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
	 |ИЗ
	 |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	 |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	Замена_Владельца_На_ДО.РодителиШаблон,
	 |	СотрудникиВПомощь.ТипСотрудника,
	 |	Замена_Владельца_На_ДО.Ссылка,
	 |	Замена_Владельца_На_ДО.ПланируемаяДата,
	 |	Замена_Владельца_На_ДО.Выполнена,
	 |	Замена_Владельца_На_ДО.ВремяНачала,
	 |	СотрудникиВПомощь.Пользователь
	 |ИЗ
	 |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	 |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	ТипСотрудника
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
	 |	Без_Шаблона_Отв_Сотр.Пользователь,
	 |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
	 |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
	 |	Без_Шаблона_Отв_Сотр.Выполнена,
	 |	Без_Шаблона_Отв_Сотр.ВремяНачала,
	 |	Без_Шаблона_Отв_Сотр.РодителиШаблон
	 |ПОМЕСТИТЬ Без_Глубины
	 |ИЗ
	 |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	 |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
	 |ГДЕ
	 |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Ссылка,
	 |	Глубина
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Без_Глубины.Ссылка КАК Ссылка,
	 |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
	 |ПОМЕСТИТЬ Глубина_Макс
	 |ИЗ
	 |	Без_Глубины КАК Без_Глубины
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	Без_Глубины.Ссылка
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Ссылка,
	 |	Глубина
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Без_Глубины.Пользователь КАК Пользователь,
	 |	Без_Глубины.Ссылка,
	 |	Без_Глубины.ПланируемаяДата,
	 |	Без_Глубины.ВремяНачала,
	 |	Без_Глубины.Выполнена
	 |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
	 |ИЗ
	 |	Без_Глубины КАК Без_Глубины
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
	 |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
	 |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Пользователь
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
	 |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
	 |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ВремяНачала КАК ВремяНачала,
	 |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Выполнена
	 |ИЗ
	 |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	 |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ОтборПервый.Ссылка,
	 |	ОтборПервый.ПланируемаяДата,
	 |	ОтборПервый.ВремяНачала,
	 |	ОтборПервый.Выполнена
	 |ИЗ
	 |	ОтборПервый КАК ОтборПервый
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	ПланируемаяДата,
	 |	ВремяНачала");
	

	Запрос.УстановитьПараметр("ДатаНачало", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаКонец", КонецДня(Объект.ДатаКонца));
	Запрос.УстановитьПараметр("Ответственный", СписокПользователей);
	Запрос.УстановитьПараметр("ОтображатьВыполненные", ОтображатьВыполненные);
	Результат = Запрос.Выполнить().Выбрать();	
	Пока Результат.Следующий() Цикл
		ВремяМероприятия = Результат.ВремяНачала;
		НомерСтроки = 1;
		НомерКолонки = РассчитатьНомерКолонки(Результат.ПланируемаяДата, Объект); 
		//1+(Стр.ПланируемаяДата - НачалоДня(НачПериода))/(24*3600);
		ПоместитьМероприятиеВСтроку(НомерСтроки, НомерКолонки, Результат.Мероприятие, ТабличныйДокумент, Объект, 
				ГруппироватьМероприятия);
	КонецЦикла;
КонецПроцедуры

 &НаСервере
Процедура РаспределитьМероприятияИД_На_До_УслПоДог_На_ДогКА(ТабличныйДокумент, Объект, СписокПользователей, ОтображатьВыполненные,
	 	ГруппироватьМероприятия)
		//Запрос = Новый Запрос("ВЫБРАТЬ
		//                  |	Пользователи.Ссылка КАК Ссылка
		//                  |ПОМЕСТИТЬ ВТ_Ответственный
		//                  |ИЗ
		//                  |	Справочник.Пользователи КАК Пользователи
		//                  |ГДЕ
		//                  |	Пользователи.Ссылка В(&Ответственный)
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Ссылка
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	ОбъектыВРаботеОстатки.Объект КАК Объект
		//                  |ПОМЕСТИТЬ ОбъектыВРаботе
		//                  |ИЗ
		//                  |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		//                  |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Объект
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	ИсполнительныеДокументы.Ссылка КАК Объект,
		//                  |	ИсполнительныеДокументы.Владелец КАК Владелец
		//                  |ПОМЕСТИТЬ ВсеОбъектыВРаботе
		//                  |ИЗ
		//                  |	ОбъектыВРаботе КАК ОбъектыВРаботе
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
		//                  |		ПО ОбъектыВРаботе.Объект = ИсполнительныеДокументы.Владелец
		//                  |
		//                  |ОБЪЕДИНИТЬ ВСЕ
		//                  |
		//                  |ВЫБРАТЬ
		//                  |	УслугиПоДоговору.Ссылка,
		//                  |	УслугиПоДоговору.Владелец
		//                  |ИЗ
		//                  |	ОбъектыВРаботе КАК ОбъектыВРаботе
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УслугиПоДоговору КАК УслугиПоДоговору
		//                  |		ПО ОбъектыВРаботе.Объект = УслугиПоДоговору.Владелец
		//                  |
		//                  |ОБЪЕДИНИТЬ ВСЕ
		//                  |
		//                  |ВЫБРАТЬ
		//                  |	ОбъектыВРаботе.Объект,
		//                  |	NULL
		//                  |ИЗ
		//                  |	ОбъектыВРаботе КАК ОбъектыВРаботе
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Объект
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	ВсеОбъектыВРаботе.Объект КАК Объект,
		//                  |	ВсеОбъектыВРаботе.Владелец,
		//                  |	БизнесПроцессы.Ссылка
		//                  |ПОМЕСТИТЬ БезПлохихБП
		//                  |ИЗ
		//                  |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
		//                  |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
		//                  |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
		//                  |ГДЕ
		//                  |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
		//                  |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
		//                  |				И БизнесПроцессы.Завершен = ЛОЖЬ)
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Объект
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	Мероприятие.Ссылка,
		//                  |	Мероприятие.Объект,
		//                  |	Мероприятие.ПланируемаяДата,
		//                  |	Мероприятие.ПланируемоеВремя КАК ВремяНачала,
		//                  |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
		//                  |	Мероприятие.Ответственный,
		//                  |	Мероприятие.Выполнена,
		//                  |	БезПлохихБП.Владелец
		//                  |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
		//                  |ИЗ
		//                  |	Задача.Мероприятие КАК Мероприятие
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
		//                  |		ПО Мероприятие.Объект = БезПлохихБП.Объект
		//                  |ГДЕ
		//                  |	Мероприятие.ПометкаУдаления = ЛОЖЬ
		//                  |	И (Мероприятие.Выполнена = ЛОЖЬ
		//                  |			ИЛИ &ОтображатьВыполненные)
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	ТипМероприятия
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	ТипыМероприятий.Ссылка КАК Ссылка
		//                  |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
		//                  |ИЗ
		//                  |	Справочник.ТипыМероприятий КАК ТипыМероприятий
		//                  |ГДЕ
		//                  |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
		//                  |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Ссылка
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	МероприятияБезТиповМероприятий.Ссылка,
		//                  |	МероприятияБезТиповМероприятий.Объект,
		//                  |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
		//                  |	МероприятияБезТиповМероприятий.ПланируемаяДата,
		//                  |	МероприятияБезТиповМероприятий.Выполнена,
		//                  |	МероприятияБезТиповМероприятий.ВремяНачала,
		//                  |	МероприятияБезТиповМероприятий.Владелец
		//                  |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
		//                  |ИЗ
		//                  |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
		//                  |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
		//                  |ГДЕ
		//                  |	МероприятияБезТиповМероприятий.ПланируемаяДата >= &ДатаНачало
		//                  |	И МероприятияБезТиповМероприятий.ПланируемаяДата <= &ДатаКонец
		//                  |
		//                  |СГРУППИРОВАТЬ ПО
		//                  |	МероприятияБезТиповМероприятий.Ссылка,
		//                  |	МероприятияБезТиповМероприятий.Объект,
		//                  |	МероприятияБезТиповМероприятий.Ответственный,
		//                  |	МероприятияБезТиповМероприятий.ПланируемаяДата,
		//                  |	МероприятияБезТиповМероприятий.Выполнена,
		//                  |	МероприятияБезТиповМероприятий.ВремяНачала,
		//                  |	МероприятияБезТиповМероприятий.Владелец
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Ответственный
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	МероприятияБезТипаСотрудника.Ссылка,
		//                  |	МероприятияБезТипаСотрудника.ПланируемаяДата,
		//                  |	МероприятияБезТипаСотрудника.Выполнена,
		//                  |	МероприятияБезТипаСотрудника.ВремяНачала
		//                  |ПОМЕСТИТЬ ОтборПервый
		//                  |ИЗ
		//                  |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		//                  |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	ТипыСотрудников.Ссылка КАК Ссылка,
		//                  |	ТипыСотрудников.Глубина,
		//                  |	ТипыСотрудников.РодителиШаблон
		//                  |ПОМЕСТИТЬ ПВХ_ТипСотрудника
		//                  |ИЗ
		//                  |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
		//                  |ГДЕ
		//                  |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Ссылка
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	МероприятияБезТипаСотрудника.Ссылка,
		//                  |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
		//                  |	МероприятияБезТипаСотрудника.ПланируемаяДата,
		//                  |	МероприятияБезТипаСотрудника.Выполнена,
		//                  |	МероприятияБезТипаСотрудника.ВремяНачала,
		//                  |	ПВХ_ТипСотрудника.РодителиШаблон,
		//                  |	ПВХ_ТипСотрудника.Глубина
		//                  |ПОМЕСТИТЬ Замена_Владельца_На_ДО
		//                  |ИЗ
		//                  |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
		//                  |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Объект
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	Замена_Владельца_На_ДО.РодителиШаблон,
		//                  |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
		//                  |	Замена_Владельца_На_ДО.Ссылка,
		//                  |	Замена_Владельца_На_ДО.ПланируемаяДата,
		//                  |	Замена_Владельца_На_ДО.Выполнена,
		//                  |	Замена_Владельца_На_ДО.ВремяНачала,
		//                  |	ОтветственныеСотрудники.Пользователь
		//                  |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
		//                  |ИЗ
		//                  |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
		//                  |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
		//                  |
		//                  |ОБЪЕДИНИТЬ ВСЕ
		//                  |
		//                  |ВЫБРАТЬ
		//                  |	Замена_Владельца_На_ДО.РодителиШаблон,
		//                  |	СотрудникиВПомощь.ТипСотрудника,
		//                  |	Замена_Владельца_На_ДО.Ссылка,
		//                  |	Замена_Владельца_На_ДО.ПланируемаяДата,
		//                  |	Замена_Владельца_На_ДО.Выполнена,
		//                  |	Замена_Владельца_На_ДО.ВремяНачала,
		//                  |	СотрудникиВПомощь.Пользователь
		//                  |ИЗ
		//                  |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
		//                  |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	ТипСотрудника
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
		//                  |	Без_Шаблона_Отв_Сотр.Пользователь,
		//                  |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
		//                  |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
		//                  |	Без_Шаблона_Отв_Сотр.Выполнена,
		//                  |	Без_Шаблона_Отв_Сотр.ВремяНачала
		//                  |ПОМЕСТИТЬ Без_Глубины
		//                  |ИЗ
		//                  |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
		//                  |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
		//                  |ГДЕ
		//                  |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Ссылка,
		//                  |	Глубина
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	Без_Глубины.Ссылка КАК Ссылка,
		//                  |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
		//                  |ПОМЕСТИТЬ Глубина_Макс
		//                  |ИЗ
		//                  |	Без_Глубины КАК Без_Глубины
		//                  |
		//                  |СГРУППИРОВАТЬ ПО
		//                  |	Без_Глубины.Ссылка
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Ссылка,
		//                  |	Глубина
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	Без_Глубины.Пользователь КАК Пользователь,
		//                  |	Без_Глубины.Ссылка,
		//                  |	Без_Глубины.ПланируемаяДата,
		//                  |	Без_Глубины.ВремяНачала,
		//                  |	Без_Глубины.Выполнена
		//                  |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
		//                  |ИЗ
		//                  |	Без_Глубины КАК Без_Глубины
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
		//                  |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
		//                  |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Пользователь
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
		//                  |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
		//                  |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ВремяНачала КАК ВремяНачала,
		//                  |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Выполнена
		//                  |ИЗ
		//                  |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		//                  |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
		//                  |
		//                  |ОБЪЕДИНИТЬ ВСЕ
		//                  |
		//                  |ВЫБРАТЬ
		//                  |	ОтборПервый.Ссылка,
		//                  |	ОтборПервый.ПланируемаяДата,
		//                  |	ОтборПервый.ВремяНачала,
		//                  |	ОтборПервый.Выполнена
		//                  |ИЗ
		//                  |	ОтборПервый КАК ОтборПервый
		//                  |
		//                  |УПОРЯДОЧИТЬ ПО
		//                  |	ПланируемаяДата,
		//                  |	ВремяНачала");

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ_Ответственный
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.Ссылка В(&Ответственный)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект КАК Объект
	                      |ПОМЕСТИТЬ ОбъектыВРаботе
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ИсполнительныеДокументы.Ссылка КАК Объект,
	                      |	ИсполнительныеДокументы.Владелец КАК Владелец
	                      |ПОМЕСТИТЬ ВсеОбъектыВРаботе
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
	                      |		ПО ОбъектыВРаботе.Объект = ИсполнительныеДокументы.Владелец
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	УслугиПоДоговору.Ссылка,
	                      |	УслугиПоДоговору.Владелец
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УслугиПоДоговору КАК УслугиПоДоговору
	                      |		ПО ОбъектыВРаботе.Объект = УслугиПоДоговору.Владелец
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботе.Объект,
	                      |	NULL
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Мероприятие.Ссылка) КАК КолВоМероприятий
	                      |ПОМЕСТИТЬ КоличествоМероприятийБезБП
	                      |ИЗ
	                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	                      |		ПО ВсеОбъектыВРаботе.Объект = Мероприятие.Объект
	                      |ГДЕ
	                      |	Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |	И Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВсеОбъектыВРаботе.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КоличествоМероприятийБезБП.Объект КАК Объект,
	                      |	ВсеОбъектыВРаботе.Владелец КАК Владелец
	                      |ПОМЕСТИТЬ ОбъектыСМероприятиямиИВладелец
	                      |ИЗ
	                      |	КоличествоМероприятийБезБП КАК КоличествоМероприятийБезБП
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ПО КоличествоМероприятийБезБП.Объект = ВсеОбъектыВРаботе.Объект
	                      |ГДЕ
	                      |	КоличествоМероприятийБезБП.КолВоМероприятий > 0
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
	                      |	ВсеОбъектыВРаботе.Владелец КАК Владелец,
	                      |	БизнесПроцессы.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ БезПлохихБП
	                      |ИЗ
	                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	                      |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
	                      |ГДЕ
	                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
	                      |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
	                      |				И БизнесПроцессы.Завершен = ЛОЖЬ)
	                      |
	                      |ОБЪЕДИНИТЬ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОбъектыСМероприятиямиИВладелец.Объект,
	                      |	ОбъектыСМероприятиямиИВладелец.Владелец,
	                      |	NULL
	                      |ИЗ
	                      |	ОбъектыСМероприятиямиИВладелец КАК ОбъектыСМероприятиямиИВладелец
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Мероприятие.Ссылка КАК Ссылка,
	                      |	Мероприятие.Объект КАК Объект,
	                      |	Мероприятие.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Мероприятие.ПланируемоеВремя КАК ВремяНачала,
	                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	                      |	Мероприятие.Ответственный КАК Ответственный,
	                      |	Мероприятие.Выполнена КАК Выполнена,
	                      |	БезПлохихБП.Владелец КАК Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
	                      |		ПО Мероприятие.Объект = БезПлохихБП.Объект
	                      |ГДЕ
	                      |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И (Мероприятие.БизнесПроцесс.ПометкаУдаления = ЛОЖЬ
	                      |			ИЛИ Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяССылка))
	                      |	И (Мероприятие.Выполнена = ЛОЖЬ
	                      |			ИЛИ &ОтображатьВыполненные)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипМероприятия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыМероприятий.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
	                      |ИЗ
	                      |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	                      |ГДЕ
	                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	                      |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	                      |	МероприятияБезТиповМероприятий.Выполнена,
	                      |	МероприятияБезТиповМероприятий.ВремяНачала,
	                      |	МероприятияБезТиповМероприятий.Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
	                      |ИЗ
	                      |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
	                      |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
	                      |ГДЕ
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата >= &ДатаНачало
	                      |	И МероприятияБезТиповМероприятий.ПланируемаяДата <= &ДатаКонец
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	                      |	МероприятияБезТиповМероприятий.Выполнена,
	                      |	МероприятияБезТиповМероприятий.ВремяНачала,
	                      |	МероприятияБезТиповМероприятий.Владелец
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ответственный
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	МероприятияБезТипаСотрудника.Выполнена,
	                      |	МероприятияБезТипаСотрудника.ВремяНачала
	                      |ПОМЕСТИТЬ ОтборПервый
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыСотрудников.Ссылка КАК Ссылка,
	                      |	ТипыСотрудников.Глубина,
	                      |	ТипыСотрудников.РодителиШаблон
	                      |ПОМЕСТИТЬ ПВХ_ТипСотрудника
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	                      |ГДЕ
	                      |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	МероприятияБезТипаСотрудника.Выполнена,
	                      |	МероприятияБезТипаСотрудника.ВремяНачала,
	                      |	ПВХ_ТипСотрудника.РодителиШаблон,
	                      |	ПВХ_ТипСотрудника.Глубина
	                      |ПОМЕСТИТЬ Замена_Владельца_На_ДО
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	Замена_Владельца_На_ДО.Выполнена,
	                      |	Замена_Владельца_На_ДО.ВремяНачала,
	                      |	ОтветственныеСотрудники.Пользователь
	                      |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	СотрудникиВПомощь.ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	Замена_Владельца_На_ДО.Выполнена,
	                      |	Замена_Владельца_На_ДО.ВремяНачала,
	                      |	СотрудникиВПомощь.Пользователь
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	                      |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипСотрудника
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
	                      |	Без_Шаблона_Отв_Сотр.Пользователь,
	                      |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
	                      |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
	                      |	Без_Шаблона_Отв_Сотр.Выполнена,
	                      |	Без_Шаблона_Отв_Сотр.ВремяНачала
	                      |ПОМЕСТИТЬ Без_Глубины
	                      |ИЗ
	                      |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
	                      |ГДЕ
	                      |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Ссылка КАК Ссылка,
	                      |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
	                      |ПОМЕСТИТЬ Глубина_Макс
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Без_Глубины.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Пользователь КАК Пользователь,
	                      |	Без_Глубины.Ссылка,
	                      |	Без_Глубины.ПланируемаяДата,
	                      |	Без_Глубины.ВремяНачала,
	                      |	Без_Глубины.Выполнена
	                      |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
	                      |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
	                      |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ВремяНачала КАК ВремяНачала,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Выполнена
	                      |ИЗ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОтборПервый.Ссылка,
	                      |	ОтборПервый.ПланируемаяДата,
	                      |	ОтборПервый.ВремяНачала,
	                      |	ОтборПервый.Выполнена
	                      |ИЗ
	                      |	ОтборПервый КАК ОтборПервый
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПланируемаяДата,
	                      |	ВремяНачала");

	Запрос.УстановитьПараметр("ДатаНачало", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаКонец", КонецДня(Объект.ДатаКонца));
	Запрос.УстановитьПараметр("Ответственный", СписокПользователей);
	Запрос.УстановитьПараметр("ОтображатьВыполненные", ОтображатьВыполненные);
	Результат = Запрос.Выполнить().Выбрать();	
	Пока Результат.Следующий() Цикл
		ВремяМероприятия = Результат.ВремяНачала;
		НомерСтроки = 1;
		НомерКолонки = РассчитатьНомерКолонки(Результат.ПланируемаяДата, Объект); 
		//1+(Стр.ПланируемаяДата - НачалоДня(НачПериода))/(24*3600);
		ПоместитьМероприятиеВСтроку(НомерСтроки, НомерКолонки, Результат.Мероприятие, ТабличныйДокумент, Объект, 
				ГруппироватьМероприятия);
	КонецЦикла;
КонецПроцедуры

 &НаСервере
Процедура Распределить_ИД_на_ДО_УслПоДог_и_ДогКА_на_КА(ТабличныйДокумент, Объект, СписокПользователей,
	 	ОтображатьВыполненные, ГруппироватьМероприятия)
			//Запрос = Новый Запрос("ВЫБРАТЬ
			//              |	Пользователи.Ссылка КАК Ссылка
			//              |ПОМЕСТИТЬ ВТ_Ответственный
			//              |ИЗ
			//              |	Справочник.Пользователи КАК Пользователи
			//              |ГДЕ
			//              |	Пользователи.Ссылка В(&Ответственный)
			//              |
			//              |ИНДЕКСИРОВАТЬ ПО
			//              |	Ссылка
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	ОбъектыВРаботеОстатки.Объект КАК Объект
			//              |ПОМЕСТИТЬ ОбъектыВРаботе
			//              |ИЗ
			//              |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
			//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
			//              |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
			//              |
			//              |ИНДЕКСИРОВАТЬ ПО
			//              |	Объект
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	Контрагенты.Ссылка
			//              |ПОМЕСТИТЬ ОбъектыКонтрагент
			//              |ИЗ
			//              |	ОбъектыВРаботе КАК ОбъектыВРаботе
			//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			//              |		ПО ОбъектыВРаботе.Объект = Контрагенты.Ссылка
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	ДоговорыКонтрагентов.Ссылка,
			//              |	ДоговорыКонтрагентов.Контрагент
			//              |ПОМЕСТИТЬ Объекты_ДогКонтрагентов_и_УслугПоДоговору
			//              |ИЗ
			//              |	ОбъектыКонтрагент КАК ОбъектыКонтрагент
			//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			//              |		ПО ОбъектыКонтрагент.Ссылка = ДоговорыКонтрагентов.Контрагент
			//              |
			//              |ОБЪЕДИНИТЬ ВСЕ
			//              |
			//              |ВЫБРАТЬ
			//              |	УслугиПоДоговору.Ссылка,
			//              |	УслугиПоДоговору.Контрагент
			//              |ИЗ
			//              |	ОбъектыКонтрагент КАК ОбъектыКонтрагент
			//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УслугиПоДоговору КАК УслугиПоДоговору
			//              |		ПО ОбъектыКонтрагент.Ссылка = УслугиПоДоговору.Контрагент
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	ИсполнительныеДокументы.Ссылка КАК Объект,
			//              |	ИсполнительныеДокументы.Владелец КАК Владелец
			//              |ПОМЕСТИТЬ ВсеОбъектыВРаботе
			//              |ИЗ
			//              |	ОбъектыВРаботе КАК ОбъектыВРаботе
			//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
			//              |		ПО ОбъектыВРаботе.Объект = ИсполнительныеДокументы.Владелец
			//              |
			//              |ОБЪЕДИНИТЬ ВСЕ
			//              |
			//              |ВЫБРАТЬ
			//              |	Объекты_ДогКонтрагентов_и_УслугПоДоговору.Ссылка,
			//              |	Объекты_ДогКонтрагентов_и_УслугПоДоговору.Контрагент
			//              |ИЗ
			//              |	Объекты_ДогКонтрагентов_и_УслугПоДоговору КАК Объекты_ДогКонтрагентов_и_УслугПоДоговору
			//              |
			//              |ОБЪЕДИНИТЬ ВСЕ
			//              |
			//              |ВЫБРАТЬ
			//              |	ОбъектыВРаботе.Объект,
			//              |	NULL
			//              |ИЗ
			//              |	ОбъектыВРаботе КАК ОбъектыВРаботе
			//              |
			//              |ИНДЕКСИРОВАТЬ ПО
			//              |	Объект
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	ВсеОбъектыВРаботе.Объект КАК Объект,
			//              |	ВсеОбъектыВРаботе.Владелец,
			//              |	БизнесПроцессы.Ссылка
			//              |ПОМЕСТИТЬ БезПлохихБП
			//              |ИЗ
			//              |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
			//              |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
			//              |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
			//              |ГДЕ
			//              |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
			//              |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
			//              |				И БизнесПроцессы.Завершен = ЛОЖЬ)
			//              |
			//              |ИНДЕКСИРОВАТЬ ПО
			//              |	Объект
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	Мероприятие.Ссылка,
			//              |	Мероприятие.Объект,
			//              |	Мероприятие.ПланируемаяДата,
			//              |	Мероприятие.ПланируемоеВремя КАК ВремяНачала,
			//              |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
			//              |	Мероприятие.Ответственный,
			//              |	Мероприятие.Выполнена,
			//              |	БезПлохихБП.Владелец
			//              |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
			//              |ИЗ
			//              |	Задача.Мероприятие КАК Мероприятие
			//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
			//              |		ПО Мероприятие.Объект = БезПлохихБП.Объект
			//              |ГДЕ
			//              |	Мероприятие.ПометкаУдаления = ЛОЖЬ
			//              |	И (Мероприятие.Выполнена = ЛОЖЬ
			//              |			ИЛИ &ОтображатьВыполненные)
			//              |
			//              |ИНДЕКСИРОВАТЬ ПО
			//              |	ТипМероприятия
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	ТипыМероприятий.Ссылка КАК Ссылка
			//              |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
			//              |ИЗ
			//              |	Справочник.ТипыМероприятий КАК ТипыМероприятий
			//              |ГДЕ
			//              |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
			//              |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
			//              |
			//              |ИНДЕКСИРОВАТЬ ПО
			//              |	Ссылка
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	МероприятияБезТиповМероприятий.Ссылка,
			//              |	МероприятияБезТиповМероприятий.Объект,
			//              |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
			//              |	МероприятияБезТиповМероприятий.ПланируемаяДата,
			//              |	МероприятияБезТиповМероприятий.Выполнена,
			//              |	МероприятияБезТиповМероприятий.ВремяНачала,
			//              |	МероприятияБезТиповМероприятий.Владелец
			//              |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
			//              |ИЗ
			//              |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
			//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
			//              |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
			//              |ГДЕ
			//              |	МероприятияБезТиповМероприятий.ПланируемаяДата >= &ДатаНачало
			//              |	И МероприятияБезТиповМероприятий.ПланируемаяДата <= &ДатаКонец
			//              |
			//              |СГРУППИРОВАТЬ ПО
			//              |	МероприятияБезТиповМероприятий.Ссылка,
			//              |	МероприятияБезТиповМероприятий.Объект,
			//              |	МероприятияБезТиповМероприятий.Ответственный,
			//              |	МероприятияБезТиповМероприятий.ПланируемаяДата,
			//              |	МероприятияБезТиповМероприятий.Выполнена,
			//              |	МероприятияБезТиповМероприятий.ВремяНачала,
			//              |	МероприятияБезТиповМероприятий.Владелец
			//              |
			//              |ИНДЕКСИРОВАТЬ ПО
			//              |	Ответственный
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	МероприятияБезТипаСотрудника.Ссылка,
			//              |	МероприятияБезТипаСотрудника.ПланируемаяДата,
			//              |	МероприятияБезТипаСотрудника.Выполнена,
			//              |	МероприятияБезТипаСотрудника.ВремяНачала
			//              |ПОМЕСТИТЬ ОтборПервый
			//              |ИЗ
			//              |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
			//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
			//              |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	ТипыСотрудников.Ссылка КАК Ссылка,
			//              |	ТипыСотрудников.Глубина,
			//              |	ТипыСотрудников.РодителиШаблон
			//              |ПОМЕСТИТЬ ПВХ_ТипСотрудника
			//              |ИЗ
			//              |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
			//              |ГДЕ
			//              |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
			//              |
			//              |ИНДЕКСИРОВАТЬ ПО
			//              |	Ссылка
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	МероприятияБезТипаСотрудника.Ссылка,
			//              |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
			//              |	МероприятияБезТипаСотрудника.ПланируемаяДата,
			//              |	МероприятияБезТипаСотрудника.Выполнена,
			//              |	МероприятияБезТипаСотрудника.ВремяНачала,
			//              |	ПВХ_ТипСотрудника.РодителиШаблон,
			//              |	ПВХ_ТипСотрудника.Глубина
			//              |ПОМЕСТИТЬ Замена_Владельца_На_ДО
			//              |ИЗ
			//              |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
			//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
			//              |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
			//              |
			//              |ИНДЕКСИРОВАТЬ ПО
			//              |	Объект
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	Замена_Владельца_На_ДО.РодителиШаблон,
			//              |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
			//              |	Замена_Владельца_На_ДО.Ссылка,
			//              |	Замена_Владельца_На_ДО.ПланируемаяДата,
			//              |	Замена_Владельца_На_ДО.Выполнена,
			//              |	Замена_Владельца_На_ДО.ВремяНачала,
			//              |	ОтветственныеСотрудники.Пользователь
			//              |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
			//              |ИЗ
			//              |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
			//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
			//              |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
			//              |
			//              |ОБЪЕДИНИТЬ ВСЕ
			//              |
			//              |ВЫБРАТЬ
			//              |	Замена_Владельца_На_ДО.РодителиШаблон,
			//              |	СотрудникиВПомощь.ТипСотрудника,
			//              |	Замена_Владельца_На_ДО.Ссылка,
			//              |	Замена_Владельца_На_ДО.ПланируемаяДата,
			//              |	Замена_Владельца_На_ДО.Выполнена,
			//              |	Замена_Владельца_На_ДО.ВремяНачала,
			//              |	СотрудникиВПомощь.Пользователь
			//              |ИЗ
			//              |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
			//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
			//              |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
			//              |
			//              |ИНДЕКСИРОВАТЬ ПО
			//              |	ТипСотрудника
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
			//              |	Без_Шаблона_Отв_Сотр.Пользователь,
			//              |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
			//              |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
			//              |	Без_Шаблона_Отв_Сотр.Выполнена,
			//              |	Без_Шаблона_Отв_Сотр.ВремяНачала
			//              |ПОМЕСТИТЬ Без_Глубины
			//              |ИЗ
			//              |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
			//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
			//              |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
			//              |ГДЕ
			//              |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
			//              |
			//              |ИНДЕКСИРОВАТЬ ПО
			//              |	Ссылка,
			//              |	Глубина
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	Без_Глубины.Ссылка КАК Ссылка,
			//              |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
			//              |ПОМЕСТИТЬ Глубина_Макс
			//              |ИЗ
			//              |	Без_Глубины КАК Без_Глубины
			//              |
			//              |СГРУППИРОВАТЬ ПО
			//              |	Без_Глубины.Ссылка
			//              |
			//              |ИНДЕКСИРОВАТЬ ПО
			//              |	Ссылка,
			//              |	Глубина
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	Без_Глубины.Пользователь КАК Пользователь,
			//              |	Без_Глубины.Ссылка,
			//              |	Без_Глубины.ПланируемаяДата,
			//              |	Без_Глубины.ВремяНачала,
			//              |	Без_Глубины.Выполнена
			//              |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
			//              |ИЗ
			//              |	Без_Глубины КАК Без_Глубины
			//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
			//              |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
			//              |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
			//              |
			//              |ИНДЕКСИРОВАТЬ ПО
			//              |	Пользователь
			//              |;
			//              |
			//              |////////////////////////////////////////////////////////////////////////////////
			//              |ВЫБРАТЬ
			//              |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
			//              |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
			//              |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ВремяНачала КАК ВремяНачала,
			//              |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Выполнена
			//              |ИЗ
			//              |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
			//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
			//              |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
			//              |
			//              |ОБЪЕДИНИТЬ ВСЕ
			//              |
			//              |ВЫБРАТЬ
			//              |	ОтборПервый.Ссылка,
			//              |	ОтборПервый.ПланируемаяДата,
			//              |	ОтборПервый.ВремяНачала,
			//              |	ОтборПервый.Выполнена
			//              |ИЗ
			//              |	ОтборПервый КАК ОтборПервый
			//              |
			//              |УПОРЯДОЧИТЬ ПО
			//              |	ПланируемаяДата,
			//              |	ВремяНачала");

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ_Ответственный
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.Ссылка В(&Ответственный)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект КАК Объект
	                      |ПОМЕСТИТЬ ОбъектыВРаботе
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Контрагенты.Ссылка
	                      |ПОМЕСТИТЬ ОбъектыКонтрагент
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	                      |		ПО ОбъектыВРаботе.Объект = Контрагенты.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДоговорыКонтрагентов.Ссылка,
	                      |	ДоговорыКонтрагентов.Контрагент
	                      |ПОМЕСТИТЬ Объекты_ДогКонтрагентов_и_УслугПоДоговору
	                      |ИЗ
	                      |	ОбъектыКонтрагент КАК ОбъектыКонтрагент
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                      |		ПО ОбъектыКонтрагент.Ссылка = ДоговорыКонтрагентов.Контрагент
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	УслугиПоДоговору.Ссылка,
	                      |	УслугиПоДоговору.Контрагент
	                      |ИЗ
	                      |	ОбъектыКонтрагент КАК ОбъектыКонтрагент
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УслугиПоДоговору КАК УслугиПоДоговору
	                      |		ПО ОбъектыКонтрагент.Ссылка = УслугиПоДоговору.Контрагент
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ИсполнительныеДокументы.Ссылка КАК Объект,
	                      |	ИсполнительныеДокументы.Владелец КАК Владелец
	                      |ПОМЕСТИТЬ ВсеОбъектыВРаботе
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
	                      |		ПО ОбъектыВРаботе.Объект = ИсполнительныеДокументы.Владелец
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Объекты_ДогКонтрагентов_и_УслугПоДоговору.Ссылка,
	                      |	Объекты_ДогКонтрагентов_и_УслугПоДоговору.Контрагент
	                      |ИЗ
	                      |	Объекты_ДогКонтрагентов_и_УслугПоДоговору КАК Объекты_ДогКонтрагентов_и_УслугПоДоговору
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботе.Объект,
	                      |	NULL
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                       |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Мероприятие.Ссылка) КАК КолВоМероприятий
	                      |ПОМЕСТИТЬ КоличествоМероприятийБезБП
	                      |ИЗ
	                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	                      |		ПО ВсеОбъектыВРаботе.Объект = Мероприятие.Объект
	                      |ГДЕ
	                      |	Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |	И Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВсеОбъектыВРаботе.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КоличествоМероприятийБезБП.Объект КАК Объект,
	                      |	ВсеОбъектыВРаботе.Владелец КАК Владелец
	                      |ПОМЕСТИТЬ ОбъектыСМероприятиямиИВладелец
	                      |ИЗ
	                      |	КоличествоМероприятийБезБП КАК КоличествоМероприятийБезБП
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ПО КоличествоМероприятийБезБП.Объект = ВсеОбъектыВРаботе.Объект
	                      |ГДЕ
	                      |	КоличествоМероприятийБезБП.КолВоМероприятий > 0
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
	                      |	ВсеОбъектыВРаботе.Владелец КАК Владелец,
	                      |	БизнесПроцессы.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ БезПлохихБП
	                      |ИЗ
	                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	                      |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
	                      |ГДЕ
	                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
	                      |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
	                      |				И БизнесПроцессы.Завершен = ЛОЖЬ)
	                      |
	                      |ОБЪЕДИНИТЬ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОбъектыСМероприятиямиИВладелец.Объект,
	                      |	ОбъектыСМероприятиямиИВладелец.Владелец,
	                      |	NULL
	                      |ИЗ
	                      |	ОбъектыСМероприятиямиИВладелец КАК ОбъектыСМероприятиямиИВладелец
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Мероприятие.Ссылка КАК Ссылка,
	                      |	Мероприятие.Объект КАК Объект,
	                      |	Мероприятие.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Мероприятие.ПланируемоеВремя КАК ВремяНачала,
	                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	                      |	Мероприятие.Ответственный КАК Ответственный,
	                      |	Мероприятие.Выполнена КАК Выполнена,
	                      |	БезПлохихБП.Владелец КАК Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
	                      |		ПО Мероприятие.Объект = БезПлохихБП.Объект
	                      |ГДЕ
	                      |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И (Мероприятие.БизнесПроцесс.ПометкаУдаления = ЛОЖЬ
	                      |			ИЛИ Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяССылка))
	                      |	И (Мероприятие.Выполнена = ЛОЖЬ
	                      |			ИЛИ &ОтображатьВыполненные)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипМероприятия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////						  
	                      |ВЫБРАТЬ
	                      |	ТипыМероприятий.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
	                      |ИЗ
	                      |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	                      |ГДЕ
	                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	                      |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	                      |	МероприятияБезТиповМероприятий.Выполнена,
	                      |	МероприятияБезТиповМероприятий.ВремяНачала,
	                      |	МероприятияБезТиповМероприятий.Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
	                      |ИЗ
	                      |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
	                      |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
	                      |ГДЕ
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата >= &ДатаНачало
	                      |	И МероприятияБезТиповМероприятий.ПланируемаяДата <= &ДатаКонец
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	                      |	МероприятияБезТиповМероприятий.Выполнена,
	                      |	МероприятияБезТиповМероприятий.ВремяНачала,
	                      |	МероприятияБезТиповМероприятий.Владелец
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ответственный
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	МероприятияБезТипаСотрудника.Выполнена,
	                      |	МероприятияБезТипаСотрудника.ВремяНачала
	                      |ПОМЕСТИТЬ ОтборПервый
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыСотрудников.Ссылка КАК Ссылка,
	                      |	ТипыСотрудников.Глубина,
	                      |	ТипыСотрудников.РодителиШаблон
	                      |ПОМЕСТИТЬ ПВХ_ТипСотрудника
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	                      |ГДЕ
	                      |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	МероприятияБезТипаСотрудника.Выполнена,
	                      |	МероприятияБезТипаСотрудника.ВремяНачала,
	                      |	ПВХ_ТипСотрудника.РодителиШаблон,
	                      |	ПВХ_ТипСотрудника.Глубина
	                      |ПОМЕСТИТЬ Замена_Владельца_На_ДО
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	Замена_Владельца_На_ДО.Выполнена,
	                      |	Замена_Владельца_На_ДО.ВремяНачала,
	                      |	ОтветственныеСотрудники.Пользователь
	                      |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	СотрудникиВПомощь.ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	Замена_Владельца_На_ДО.Выполнена,
	                      |	Замена_Владельца_На_ДО.ВремяНачала,
	                      |	СотрудникиВПомощь.Пользователь
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	                      |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипСотрудника
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
	                      |	Без_Шаблона_Отв_Сотр.Пользователь,
	                      |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
	                      |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
	                      |	Без_Шаблона_Отв_Сотр.Выполнена,
	                      |	Без_Шаблона_Отв_Сотр.ВремяНачала
	                      |ПОМЕСТИТЬ Без_Глубины
	                      |ИЗ
	                      |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
	                      |ГДЕ
	                      |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Ссылка КАК Ссылка,
	                      |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
	                      |ПОМЕСТИТЬ Глубина_Макс
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Без_Глубины.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Пользователь КАК Пользователь,
	                      |	Без_Глубины.Ссылка,
	                      |	Без_Глубины.ПланируемаяДата,
	                      |	Без_Глубины.ВремяНачала,
	                      |	Без_Глубины.Выполнена
	                      |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
	                      |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
	                      |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ВремяНачала КАК ВремяНачала,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Выполнена
	                      |ИЗ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОтборПервый.Ссылка,
	                      |	ОтборПервый.ПланируемаяДата,
	                      |	ОтборПервый.ВремяНачала,
	                      |	ОтборПервый.Выполнена
	                      |ИЗ
	                      |	ОтборПервый КАК ОтборПервый
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПланируемаяДата,
	                      |	ВремяНачала");

	Запрос.УстановитьПараметр("ДатаНачало", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаКонец", КонецДня(Объект.ДатаКонца));
	Запрос.УстановитьПараметр("Ответственный", СписокПользователей);
	Запрос.УстановитьПараметр("ОтображатьВыполненные", ОтображатьВыполненные);
	Результат = Запрос.Выполнить().Выбрать();	
	Пока Результат.Следующий() Цикл
		ВремяМероприятия = Результат.ВремяНачала;
		НомерСтроки = 1;
		НомерКолонки = РассчитатьНомерКолонки(Результат.ПланируемаяДата, Объект); 
		//1+(Стр.ПланируемаяДата - НачалоДня(НачПериода))/(24*3600);
		ПоместитьМероприятиеВСтроку(НомерСтроки, НомерКолонки, Результат.Мероприятие, ТабличныйДокумент, Объект, 
				ГруппироватьМероприятия);
	КонецЦикла;
КонецПроцедуры

 &НаСервере
Процедура Распределить_УслПоДог_и_ДогКА_на_КА(ТабличныйДокумент, Объект, СписокПользователей, ОтображатьВыполненные, ГруппироватьМероприятия)
		//Запрос = Новый Запрос("ВЫБРАТЬ
		//                  |	Пользователи.Ссылка КАК Ссылка
		//                  |ПОМЕСТИТЬ ВТ_Ответственный
		//                  |ИЗ
		//                  |	Справочник.Пользователи КАК Пользователи
		//                  |ГДЕ
		//                  |	Пользователи.Ссылка В(&Ответственный)
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Ссылка
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	ОбъектыВРаботеОстатки.Объект КАК Объект
		//                  |ПОМЕСТИТЬ ОбъектыВРаботе
		//                  |ИЗ
		//                  |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		//                  |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Объект
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	Контрагенты.Ссылка
		//                  |ПОМЕСТИТЬ ОбъектыКонтрагент
		//                  |ИЗ
		//                  |	ОбъектыВРаботе КАК ОбъектыВРаботе
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		//                  |		ПО ОбъектыВРаботе.Объект = Контрагенты.Ссылка
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	ДоговорыКонтрагентов.Ссылка,
		//                  |	ДоговорыКонтрагентов.Контрагент
		//                  |ПОМЕСТИТЬ Объекты_ДогКонтрагентов_и_УслугПоДоговору
		//                  |ИЗ
		//                  |	ОбъектыКонтрагент КАК ОбъектыКонтрагент
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		//                  |		ПО ОбъектыКонтрагент.Ссылка = ДоговорыКонтрагентов.Контрагент
		//                  |
		//                  |ОБЪЕДИНИТЬ ВСЕ
		//                  |
		//                  |ВЫБРАТЬ
		//                  |	УслугиПоДоговору.Ссылка,
		//                  |	УслугиПоДоговору.Контрагент
		//                  |ИЗ
		//                  |	ОбъектыКонтрагент КАК ОбъектыКонтрагент
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УслугиПоДоговору КАК УслугиПоДоговору
		//                  |		ПО ОбъектыКонтрагент.Ссылка = УслугиПоДоговору.Контрагент
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	Объекты_ДогКонтрагентов_и_УслугПоДоговору.Ссылка КАК Объект,
		//                  |	Объекты_ДогКонтрагентов_и_УслугПоДоговору.Контрагент КАК Владелец
		//                  |ПОМЕСТИТЬ ВсеОбъектыВРаботе
		//                  |ИЗ
		//                  |	Объекты_ДогКонтрагентов_и_УслугПоДоговору КАК Объекты_ДогКонтрагентов_и_УслугПоДоговору
		//                  |
		//                  |ОБЪЕДИНИТЬ ВСЕ
		//                  |
		//                  |ВЫБРАТЬ
		//                  |	ОбъектыВРаботе.Объект,
		//                  |	NULL
		//                  |ИЗ
		//                  |	ОбъектыВРаботе КАК ОбъектыВРаботе
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Объект
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	ВсеОбъектыВРаботе.Объект КАК Объект,
		//                  |	ВсеОбъектыВРаботе.Владелец,
		//                  |	БизнесПроцессы.Ссылка
		//                  |ПОМЕСТИТЬ БезПлохихБП
		//                  |ИЗ
		//                  |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
		//                  |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
		//                  |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
		//                  |ГДЕ
		//                  |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
		//                  |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
		//                  |				И БизнесПроцессы.Завершен = ЛОЖЬ)
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Объект
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	Мероприятие.Ссылка,
		//                  |	Мероприятие.Объект,
		//                  |	Мероприятие.ПланируемаяДата,
		//                  |	Мероприятие.ПланируемоеВремя КАК ВремяНачала,
		//                  |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
		//                  |	Мероприятие.Ответственный,
		//                  |	Мероприятие.Выполнена,
		//                  |	БезПлохихБП.Владелец
		//                  |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
		//                  |ИЗ
		//                  |	Задача.Мероприятие КАК Мероприятие
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
		//                  |		ПО Мероприятие.Объект = БезПлохихБП.Объект
		//                  |ГДЕ
		//                  |	Мероприятие.ПометкаУдаления = ЛОЖЬ
		//                  |	И (Мероприятие.Выполнена = ЛОЖЬ
		//                  |			ИЛИ &ОтображатьВыполненные)
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	ТипМероприятия
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	ТипыМероприятий.Ссылка КАК Ссылка
		//                  |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
		//                  |ИЗ
		//                  |	Справочник.ТипыМероприятий КАК ТипыМероприятий
		//                  |ГДЕ
		//                  |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
		//                  |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Ссылка
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	МероприятияБезТиповМероприятий.Ссылка,
		//                  |	МероприятияБезТиповМероприятий.Объект,
		//                  |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
		//                  |	МероприятияБезТиповМероприятий.ПланируемаяДата,
		//                  |	МероприятияБезТиповМероприятий.Выполнена,
		//                  |	МероприятияБезТиповМероприятий.ВремяНачала,
		//                  |	МероприятияБезТиповМероприятий.Владелец
		//                  |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
		//                  |ИЗ
		//                  |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
		//                  |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
		//                  |ГДЕ
		//                  |	МероприятияБезТиповМероприятий.ПланируемаяДата >= &ДатаНачало
		//                  |	И МероприятияБезТиповМероприятий.ПланируемаяДата <= &ДатаКонец
		//                  |
		//                  |СГРУППИРОВАТЬ ПО
		//                  |	МероприятияБезТиповМероприятий.Ссылка,
		//                  |	МероприятияБезТиповМероприятий.Объект,
		//                  |	МероприятияБезТиповМероприятий.Ответственный,
		//                  |	МероприятияБезТиповМероприятий.ПланируемаяДата,
		//                  |	МероприятияБезТиповМероприятий.Выполнена,
		//                  |	МероприятияБезТиповМероприятий.ВремяНачала,
		//                  |	МероприятияБезТиповМероприятий.Владелец
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Ответственный
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	МероприятияБезТипаСотрудника.Ссылка,
		//                  |	МероприятияБезТипаСотрудника.ПланируемаяДата,
		//                  |	МероприятияБезТипаСотрудника.Выполнена,
		//                  |	МероприятияБезТипаСотрудника.ВремяНачала
		//                  |ПОМЕСТИТЬ ОтборПервый
		//                  |ИЗ
		//                  |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		//                  |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	ТипыСотрудников.Ссылка КАК Ссылка,
		//                  |	ТипыСотрудников.Глубина,
		//                  |	ТипыСотрудников.РодителиШаблон
		//                  |ПОМЕСТИТЬ ПВХ_ТипСотрудника
		//                  |ИЗ
		//                  |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
		//                  |ГДЕ
		//                  |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Ссылка
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	МероприятияБезТипаСотрудника.Ссылка,
		//                  |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
		//                  |	МероприятияБезТипаСотрудника.ПланируемаяДата,
		//                  |	МероприятияБезТипаСотрудника.Выполнена,
		//                  |	МероприятияБезТипаСотрудника.ВремяНачала,
		//                  |	ПВХ_ТипСотрудника.РодителиШаблон,
		//                  |	ПВХ_ТипСотрудника.Глубина
		//                  |ПОМЕСТИТЬ Замена_Владельца_На_ДО
		//                  |ИЗ
		//                  |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
		//                  |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Объект
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	Замена_Владельца_На_ДО.РодителиШаблон,
		//                  |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
		//                  |	Замена_Владельца_На_ДО.Ссылка,
		//                  |	Замена_Владельца_На_ДО.ПланируемаяДата,
		//                  |	Замена_Владельца_На_ДО.Выполнена,
		//                  |	Замена_Владельца_На_ДО.ВремяНачала,
		//                  |	ОтветственныеСотрудники.Пользователь
		//                  |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
		//                  |ИЗ
		//                  |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
		//                  |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
		//                  |
		//                  |ОБЪЕДИНИТЬ ВСЕ
		//                  |
		//                  |ВЫБРАТЬ
		//                  |	Замена_Владельца_На_ДО.РодителиШаблон,
		//                  |	СотрудникиВПомощь.ТипСотрудника,
		//                  |	Замена_Владельца_На_ДО.Ссылка,
		//                  |	Замена_Владельца_На_ДО.ПланируемаяДата,
		//                  |	Замена_Владельца_На_ДО.Выполнена,
		//                  |	Замена_Владельца_На_ДО.ВремяНачала,
		//                  |	СотрудникиВПомощь.Пользователь
		//                  |ИЗ
		//                  |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
		//                  |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	ТипСотрудника
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
		//                  |	Без_Шаблона_Отв_Сотр.Пользователь,
		//                  |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
		//                  |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
		//                  |	Без_Шаблона_Отв_Сотр.Выполнена,
		//                  |	Без_Шаблона_Отв_Сотр.ВремяНачала
		//                  |ПОМЕСТИТЬ Без_Глубины
		//                  |ИЗ
		//                  |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
		//                  |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
		//                  |ГДЕ
		//                  |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Ссылка,
		//                  |	Глубина
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	Без_Глубины.Ссылка КАК Ссылка,
		//                  |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
		//                  |ПОМЕСТИТЬ Глубина_Макс
		//                  |ИЗ
		//                  |	Без_Глубины КАК Без_Глубины
		//                  |
		//                  |СГРУППИРОВАТЬ ПО
		//                  |	Без_Глубины.Ссылка
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Ссылка,
		//                  |	Глубина
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	Без_Глубины.Пользователь КАК Пользователь,
		//                  |	Без_Глубины.Ссылка,
		//                  |	Без_Глубины.ПланируемаяДата,
		//                  |	Без_Глубины.ВремяНачала,
		//                  |	Без_Глубины.Выполнена
		//                  |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
		//                  |ИЗ
		//                  |	Без_Глубины КАК Без_Глубины
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
		//                  |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
		//                  |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
		//                  |
		//                  |ИНДЕКСИРОВАТЬ ПО
		//                  |	Пользователь
		//                  |;
		//                  |
		//                  |////////////////////////////////////////////////////////////////////////////////
		//                  |ВЫБРАТЬ
		//                  |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
		//                  |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
		//                  |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ВремяНачала КАК ВремяНачала,
		//                  |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Выполнена
		//                  |ИЗ
		//                  |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
		//                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
		//                  |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
		//                  |
		//                  |ОБЪЕДИНИТЬ ВСЕ
		//                  |
		//                  |ВЫБРАТЬ
		//                  |	ОтборПервый.Ссылка,
		//                  |	ОтборПервый.ПланируемаяДата,
		//                  |	ОтборПервый.ВремяНачала,
		//                  |	ОтборПервый.Выполнена
		//                  |ИЗ
		//                  |	ОтборПервый КАК ОтборПервый
		//                  |
		//                  |УПОРЯДОЧИТЬ ПО
		//                  |	ПланируемаяДата,
		//                  |	ВремяНачала");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ_Ответственный
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.Ссылка В(&Ответственный)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект КАК Объект
	                      |ПОМЕСТИТЬ ОбъектыВРаботе
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Контрагенты.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ОбъектыКонтрагент
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	                      |		ПО ОбъектыВРаботе.Объект = Контрагенты.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	                      |	ДоговорыКонтрагентов.Контрагент КАК Контрагент
	                      |ПОМЕСТИТЬ Объекты_ДогКонтрагентов_и_УслугПоДоговору
	                      |ИЗ
	                      |	ОбъектыКонтрагент КАК ОбъектыКонтрагент
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                      |		ПО ОбъектыКонтрагент.Ссылка = ДоговорыКонтрагентов.Контрагент
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	УслугиПоДоговору.Ссылка,
	                      |	УслугиПоДоговору.Контрагент
	                      |ИЗ
	                      |	ОбъектыКонтрагент КАК ОбъектыКонтрагент
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УслугиПоДоговору КАК УслугиПоДоговору
	                      |		ПО ОбъектыКонтрагент.Ссылка = УслугиПоДоговору.Контрагент
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Объекты_ДогКонтрагентов_и_УслугПоДоговору.Ссылка КАК Объект,
	                      |	Объекты_ДогКонтрагентов_и_УслугПоДоговору.Контрагент КАК Владелец
	                      |ПОМЕСТИТЬ ВсеОбъектыВРаботе
	                      |ИЗ
	                      |	Объекты_ДогКонтрагентов_и_УслугПоДоговору КАК Объекты_ДогКонтрагентов_и_УслугПоДоговору
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботе.Объект,
	                      |	NULL
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Мероприятие.Ссылка) КАК КолВоМероприятий
	                      |ПОМЕСТИТЬ КоличествоМероприятийБезБП
	                      |ИЗ
	                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	                      |		ПО ВсеОбъектыВРаботе.Объект = Мероприятие.Объект
	                      |ГДЕ
	                      |	Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |	И Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВсеОбъектыВРаботе.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КоличествоМероприятийБезБП.Объект КАК Объект,
	                      |	ВсеОбъектыВРаботе.Владелец КАК Владелец
	                      |ПОМЕСТИТЬ ОбъектыСМероприятиямиИВладелец
	                      |ИЗ
	                      |	КоличествоМероприятийБезБП КАК КоличествоМероприятийБезБП
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ПО КоличествоМероприятийБезБП.Объект = ВсеОбъектыВРаботе.Объект
	                      |ГДЕ
	                      |	КоличествоМероприятийБезБП.КолВоМероприятий > 0
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
	                      |	ВсеОбъектыВРаботе.Владелец КАК Владелец,
	                      |	БизнесПроцессы.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ БезПлохихБП
	                      |ИЗ
	                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	                      |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
	                      |ГДЕ
	                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
	                      |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
	                      |				И БизнесПроцессы.Завершен = ЛОЖЬ)
	                      |
	                      |ОБЪЕДИНИТЬ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОбъектыСМероприятиямиИВладелец.Объект,
	                      |	ОбъектыСМероприятиямиИВладелец.Владелец,
	                      |	NULL
	                      |ИЗ
	                      |	ОбъектыСМероприятиямиИВладелец КАК ОбъектыСМероприятиямиИВладелец
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Мероприятие.Ссылка КАК Ссылка,
	                      |	Мероприятие.Объект КАК Объект,
	                      |	Мероприятие.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Мероприятие.ПланируемоеВремя КАК ВремяНачала,
	                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	                      |	Мероприятие.Ответственный КАК Ответственный,
	                      |	Мероприятие.Выполнена КАК Выполнена,
	                      |	БезПлохихБП.Владелец КАК Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
	                      |		ПО Мероприятие.Объект = БезПлохихБП.Объект
	                      |ГДЕ
	                      |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И (Мероприятие.БизнесПроцесс.ПометкаУдаления = ЛОЖЬ
	                      |			ИЛИ Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяССылка))
	                      |	И (Мероприятие.Выполнена = ЛОЖЬ
	                      |			ИЛИ &ОтображатьВыполненные)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипМероприятия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыМероприятий.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
	                      |ИЗ
	                      |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	                      |ГДЕ
	                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	                      |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТиповМероприятий.Ссылка КАК Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект КАК Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата КАК ПланируемаяДата,
	                      |	МероприятияБезТиповМероприятий.Выполнена КАК Выполнена,
	                      |	МероприятияБезТиповМероприятий.ВремяНачала КАК ВремяНачала,
	                      |	МероприятияБезТиповМероприятий.Владелец КАК Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
	                      |ИЗ
	                      |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
	                      |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
	                      |ГДЕ
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата >= &ДатаНачало
	                      |	И МероприятияБезТиповМероприятий.ПланируемаяДата <= &ДатаКонец
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	                      |	МероприятияБезТиповМероприятий.Выполнена,
	                      |	МероприятияБезТиповМероприятий.ВремяНачала,
	                      |	МероприятияБезТиповМероприятий.Владелец
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ответственный
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка КАК Ссылка,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата КАК ПланируемаяДата,
	                      |	МероприятияБезТипаСотрудника.Выполнена КАК Выполнена,
	                      |	МероприятияБезТипаСотрудника.ВремяНачала КАК ВремяНачала
	                      |ПОМЕСТИТЬ ОтборПервый
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыСотрудников.Ссылка КАК Ссылка,
	                      |	ТипыСотрудников.Глубина КАК Глубина,
	                      |	ТипыСотрудников.РодителиШаблон КАК РодителиШаблон
	                      |ПОМЕСТИТЬ ПВХ_ТипСотрудника
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	                      |ГДЕ
	                      |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка КАК Ссылка,
	                      |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата КАК ПланируемаяДата,
	                      |	МероприятияБезТипаСотрудника.Выполнена КАК Выполнена,
	                      |	МероприятияБезТипаСотрудника.ВремяНачала КАК ВремяНачала,
	                      |	ПВХ_ТипСотрудника.РодителиШаблон КАК РодителиШаблон,
	                      |	ПВХ_ТипСотрудника.Глубина КАК Глубина
	                      |ПОМЕСТИТЬ Замена_Владельца_На_ДО
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон КАК РодителиШаблон,
	                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка КАК Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Замена_Владельца_На_ДО.Выполнена КАК Выполнена,
	                      |	Замена_Владельца_На_ДО.ВремяНачала КАК ВремяНачала,
	                      |	ОтветственныеСотрудники.Пользователь КАК Пользователь
	                      |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	СотрудникиВПомощь.ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	Замена_Владельца_На_ДО.Выполнена,
	                      |	Замена_Владельца_На_ДО.ВремяНачала,
	                      |	СотрудникиВПомощь.Пользователь
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	                      |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипСотрудника
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
	                      |	Без_Шаблона_Отв_Сотр.Пользователь КАК Пользователь,
	                      |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
	                      |	Без_Шаблона_Отв_Сотр.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Без_Шаблона_Отв_Сотр.Выполнена КАК Выполнена,
	                      |	Без_Шаблона_Отв_Сотр.ВремяНачала КАК ВремяНачала
	                      |ПОМЕСТИТЬ Без_Глубины
	                      |ИЗ
	                      |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
	                      |ГДЕ
	                      |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Ссылка КАК Ссылка,
	                      |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
	                      |ПОМЕСТИТЬ Глубина_Макс
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Без_Глубины.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Пользователь КАК Пользователь,
	                      |	Без_Глубины.Ссылка КАК Ссылка,
	                      |	Без_Глубины.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Без_Глубины.ВремяНачала КАК ВремяНачала,
	                      |	Без_Глубины.Выполнена КАК Выполнена
	                      |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
	                      |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
	                      |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ВремяНачала КАК ВремяНачала,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Выполнена КАК Выполнена
	                      |ИЗ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОтборПервый.Ссылка,
	                      |	ОтборПервый.ПланируемаяДата,
	                      |	ОтборПервый.ВремяНачала,
	                      |	ОтборПервый.Выполнена
	                      |ИЗ
	                      |	ОтборПервый КАК ОтборПервый
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПланируемаяДата,
	                      |	ВремяНачала");

	Запрос.УстановитьПараметр("ДатаНачало", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаКонец", КонецДня(Объект.ДатаКонца));
	Запрос.УстановитьПараметр("Ответственный", СписокПользователей);
	Запрос.УстановитьПараметр("ОтображатьВыполненные", ОтображатьВыполненные);
	Результат = Запрос.Выполнить().Выбрать();	
	Пока Результат.Следующий() Цикл
		ВремяМероприятия = Результат.ВремяНачала;
		НомерСтроки = 1;
		НомерКолонки = РассчитатьНомерКолонки(Результат.ПланируемаяДата, Объект); 
		//1+(Стр.ПланируемаяДата - НачалоДня(НачПериода))/(24*3600);
		ПоместитьМероприятиеВСтроку(НомерСтроки, НомерКолонки, Результат.Мероприятие, ТабличныйДокумент, Объект, 
				ГруппироватьМероприятия);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗапланированныеТЗ_ИД_на_ДО(СписокПользователей, ЗапланированныеТЗ, НеОбновляемЗапланированныеТЗ)
	Если НеОбновляемЗапланированныеТЗ Тогда
		Возврат;	
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ_Ответственный
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.Ссылка В(&Ответственный)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект КАК Объект
	                      |ПОМЕСТИТЬ ОбъектыВРаботе
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ИсполнительныеДокументы.Ссылка КАК Объект,
	                      |	ИсполнительныеДокументы.Владелец КАК Владелец
	                      |ПОМЕСТИТЬ ВсеОбъектыВРаботе
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
	                      |		ПО ОбъектыВРаботе.Объект = ИсполнительныеДокументы.Владелец
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботе.Объект,
	                      |	NULL
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
	                      |	ВсеОбъектыВРаботе.Владелец,
	                      |	БизнесПроцессы.Ссылка
	                      |ПОМЕСТИТЬ БезПлохихБП
	                      |ИЗ
	                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	                      |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
	                      |ГДЕ
	                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
	                      |				И БизнесПроцессы.Завершен = ЛОЖЬ)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Мероприятие.Ссылка,
	                      |	Мероприятие.Объект,
	                      |	Мероприятие.ПланируемаяДата,
	                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	                      |	Мероприятие.Ответственный,
	                      |	БезПлохихБП.Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
	                      |		ПО Мероприятие.Объект = БезПлохихБП.Объект
	                      |ГДЕ
	                      |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И Мероприятие.Выполнена = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	БезПлохихБП.Владелец,
	                      |	Мероприятие.Ссылка,
	                      |	Мероприятие.Объект,
	                      |	Мероприятие.ПланируемаяДата,
	                      |	Мероприятие.ТипМероприятия,
	                      |	Мероприятие.Ответственный
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипМероприятия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыМероприятий.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
	                      |ИЗ
	                      |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	                      |ГДЕ
	                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	                      |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	                      |	МероприятияБезТиповМероприятий.Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
	                      |ИЗ
	                      |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
	                      |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ответственный
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	ВТ_Ответственный.Ссылка КАК Пользователь,
	                      |	МероприятияБезТипаСотрудника.Объект
	                      |ПОМЕСТИТЬ ОтборПервый
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыСотрудников.Ссылка КАК Ссылка,
	                      |	ТипыСотрудников.Глубина,
	                      |	ТипыСотрудников.РодителиШаблон
	                      |ПОМЕСТИТЬ ПВХ_ТипСотрудника
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	                      |ГДЕ
	                      |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	ПВХ_ТипСотрудника.РодителиШаблон,
	                      |	ПВХ_ТипСотрудника.Глубина
	                      |ПОМЕСТИТЬ Замена_Владельца_На_ДО
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	ОтветственныеСотрудники.Пользователь,
	                      |	Замена_Владельца_На_ДО.Объект
	                      |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	СотрудникиВПомощь.ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	СотрудникиВПомощь.Пользователь,
	                      |	Замена_Владельца_На_ДО.Объект
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	                      |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипСотрудника
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
	                      |	Без_Шаблона_Отв_Сотр.Пользователь,
	                      |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
	                      |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
	                      |	Без_Шаблона_Отв_Сотр.Объект
	                      |ПОМЕСТИТЬ Без_Глубины
	                      |ИЗ
	                      |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
	                      |ГДЕ
	                      |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Ссылка КАК Ссылка,
	                      |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
	                      |ПОМЕСТИТЬ Глубина_Макс
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Без_Глубины.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.ПланируемаяДата,
	                      |	Без_Глубины.Ссылка,
	                      |	Без_Глубины.Пользователь КАК Пользователь,
	                      |	Без_Глубины.Объект
	                      |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
	                      |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
	                      |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Объект
	                      |ИЗ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОтборПервый.ПланируемаяДата,
	                      |	ОтборПервый.Ссылка,
	                      |	ОтборПервый.Пользователь,
	                      |	ОтборПервый.Объект
	                      |ИЗ
	                      |	ОтборПервый КАК ОтборПервый
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПланируемаяДата");

	Запрос.УстановитьПараметр("Ответственный", СписокПользователей);
	Результат = Запрос.Выполнить().Выбрать();	
	Пока Результат.Следующий() Цикл
		СтрТЧ = ЗапланированныеТЗ.Добавить(); 
		СтрТЧ.ПланируемаяДата         = Результат.ПланируемаяДата;
		СтрТЧ.Ссылка                  = Результат.Мероприятие;
       	СтрТЧ.Пользователь            = Результат.Пользователь;
		СтрТЧ.Объект                  = Результат.Объект;    
		СтрТЧ.Контрагент              = Результат.Объект;
		СтрТЧ.ДоговорыКонтрагентов    = Результат.Объект;
		СтрТЧ.УслугиПоДоговору        = Результат.Объект;
		СтрТЧ.ДолговыеОбязательства   = Результат.Объект;
		СтрТЧ.ИсполнительныеДокументы = Результат.Объект;	
	КонецЦикла;
КонецПроцедуры

 &НаСервере
Процедура ЗапланированныеТЗ_Не_Распределять_ИД_На_ДО(СписокПользователей, ЗапланированныеТЗ, НеОбновляемЗапланированныеТЗ)
	Если НеОбновляемЗапланированныеТЗ Тогда
		Возврат;	
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ_Ответственный
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.Ссылка В(&Ответственный)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект КАК Объект
	                      |ПОМЕСТИТЬ ВсеОбъектыВРаботе
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
	                      |	БизнесПроцессы.Ссылка
	                      |ПОМЕСТИТЬ БезПлохихБП
	                      |ИЗ
	                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	                      |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
	                      |ГДЕ
	                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
	                      |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
	                      |				И БизнесПроцессы.Завершен = ЛОЖЬ)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Мероприятие.Ссылка,
	                      |	Мероприятие.Объект,
	                      |	Мероприятие.ПланируемаяДата,
	                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	                      |	Мероприятие.Ответственный
	                      |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
	                      |		ПО Мероприятие.Объект = БезПлохихБП.Объект
	                      |ГДЕ
	                      |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И Мероприятие.Выполнена = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипМероприятия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыМероприятий.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
	                      |ИЗ
	                      |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	                      |ГДЕ
	                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	                      |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата
	                      |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
	                      |ИЗ
	                      |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
	                      |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ответственный
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	МероприятияБезТипаСотрудника.Ответственный,
	                      |	МероприятияБезТипаСотрудника.Объект
	                      |ПОМЕСТИТЬ ОтборПервый
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыСотрудников.Ссылка КАК Ссылка,
	                      |	ТипыСотрудников.Глубина,
	                      |	ТипыСотрудников.РодителиШаблон
	                      |ПОМЕСТИТЬ ПВХ_ТипСотрудника
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	                      |ГДЕ
	                      |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	МероприятияБезТипаСотрудника.Объект КАК Объект,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	ПВХ_ТипСотрудника.РодителиШаблон,
	                      |	ПВХ_ТипСотрудника.Глубина
	                      |ПОМЕСТИТЬ Замена_Владельца_На_ДО
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	ОтветственныеСотрудники.Пользователь,
	                      |	Замена_Владельца_На_ДО.Объект
	                      |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	СотрудникиВПомощь.ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	СотрудникиВПомощь.Пользователь,
	                      |	Замена_Владельца_На_ДО.Объект
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	                      |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипСотрудника
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
	                      |	Без_Шаблона_Отв_Сотр.Пользователь,
	                      |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
	                      |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
	                      |	Без_Шаблона_Отв_Сотр.Объект
	                      |ПОМЕСТИТЬ Без_Глубины
	                      |ИЗ
	                      |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
	                      |ГДЕ
	                      |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Ссылка КАК Ссылка,
	                      |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
	                      |ПОМЕСТИТЬ Глубина_Макс
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Без_Глубины.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.ПланируемаяДата,
	                      |	Без_Глубины.Ссылка,
	                      |	Без_Глубины.Пользователь КАК Пользователь,
	                      |	Без_Глубины.Объект
	                      |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
	                      |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
	                      |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Объект
	                      |ИЗ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОтборПервый.Ссылка,
	                      |	ОтборПервый.ПланируемаяДата,
	                      |	ОтборПервый.Ответственный,
	                      |	ОтборПервый.Объект
	                      |ИЗ
	                      |	ОтборПервый КАК ОтборПервый
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПланируемаяДата");

	Запрос.УстановитьПараметр("Ответственный", СписокПользователей);
	Результат = Запрос.Выполнить().Выбрать();	
	Пока Результат.Следующий() Цикл
		СтрТЧ = ЗапланированныеТЗ.Добавить(); 
		СтрТЧ.ПланируемаяДата         = Результат.ПланируемаяДата;
		СтрТЧ.Ссылка                  = Результат.Мероприятие;
       	СтрТЧ.Пользователь            = Результат.Пользователь;
		СтрТЧ.Объект                  = Результат.Объект;    
		СтрТЧ.Контрагент              = Результат.Объект;
		СтрТЧ.ДоговорыКонтрагентов    = Результат.Объект;
		СтрТЧ.УслугиПоДоговору        = Результат.Объект;
		СтрТЧ.ДолговыеОбязательства   = Результат.Объект;
		СтрТЧ.ИсполнительныеДокументы = Результат.Объект;	
	КонецЦикла;
КонецПроцедуры

 &НаСервере
Процедура ЗапланированныеТЗ_Распределять_ИД_На_До_УслПоДог_На_ДогКА(СписокПользователей, ЗапланированныеТЗ, НеОбновляемЗапланированныеТЗ)
	Если НеОбновляемЗапланированныеТЗ Тогда
		Возврат;	
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ_Ответственный
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.Ссылка В(&Ответственный)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект КАК Объект
	                      |ПОМЕСТИТЬ ОбъектыВРаботе
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ИсполнительныеДокументы.Ссылка КАК Объект,
	                      |	ИсполнительныеДокументы.Владелец КАК Владелец
	                      |ПОМЕСТИТЬ ВсеОбъектыВРаботе
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
	                      |		ПО ОбъектыВРаботе.Объект = ИсполнительныеДокументы.Владелец
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	УслугиПоДоговору.Ссылка,
	                      |	УслугиПоДоговору.Владелец
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УслугиПоДоговору КАК УслугиПоДоговору
	                      |		ПО ОбъектыВРаботе.Объект = УслугиПоДоговору.Владелец
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботе.Объект,
	                      |	NULL
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
	                      |	ВсеОбъектыВРаботе.Владелец,
	                      |	БизнесПроцессы.Ссылка
	                      |ПОМЕСТИТЬ БезПлохихБП
	                      |ИЗ
	                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	                      |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
	                      |ГДЕ
	                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
	                      |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
	                      |				И БизнесПроцессы.Завершен = ЛОЖЬ)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Мероприятие.Ссылка,
	                      |	Мероприятие.Объект,
	                      |	Мероприятие.ПланируемаяДата,
	                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	                      |	Мероприятие.Ответственный,
	                      |	БезПлохихБП.Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
	                      |		ПО Мероприятие.Объект = БезПлохихБП.Объект
	                      |ГДЕ
	                      |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И Мероприятие.Выполнена = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипМероприятия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыМероприятий.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
	                      |ИЗ
	                      |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	                      |ГДЕ
	                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	                      |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	                      |	МероприятияБезТиповМероприятий.Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
	                      |ИЗ
	                      |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
	                      |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	                      |	МероприятияБезТиповМероприятий.Владелец
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ответственный
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	МероприятияБезТипаСотрудника.Ответственный,
	                      |	МероприятияБезТипаСотрудника.Объект
	                      |ПОМЕСТИТЬ ОтборПервый
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыСотрудников.Ссылка КАК Ссылка,
	                      |	ТипыСотрудников.Глубина,
	                      |	ТипыСотрудников.РодителиШаблон
	                      |ПОМЕСТИТЬ ПВХ_ТипСотрудника
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	                      |ГДЕ
	                      |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	ПВХ_ТипСотрудника.РодителиШаблон,
	                      |	ПВХ_ТипСотрудника.Глубина
	                      |ПОМЕСТИТЬ Замена_Владельца_На_ДО
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	ОтветственныеСотрудники.Пользователь,
	                      |	Замена_Владельца_На_ДО.Объект
	                      |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	СотрудникиВПомощь.ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	СотрудникиВПомощь.Пользователь,
	                      |	Замена_Владельца_На_ДО.Объект
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	                      |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипСотрудника
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
	                      |	Без_Шаблона_Отв_Сотр.Пользователь,
	                      |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
	                      |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
	                      |	Без_Шаблона_Отв_Сотр.Объект
	                      |ПОМЕСТИТЬ Без_Глубины
	                      |ИЗ
	                      |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
	                      |ГДЕ
	                      |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Ссылка КАК Ссылка,
	                      |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
	                      |ПОМЕСТИТЬ Глубина_Макс
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Без_Глубины.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Пользователь КАК Пользователь,
	                      |	Без_Глубины.Ссылка,
	                      |	Без_Глубины.ПланируемаяДата,
	                      |	Без_Глубины.Объект
	                      |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
	                      |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
	                      |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Объект
	                      |ИЗ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОтборПервый.Ссылка,
	                      |	ОтборПервый.ПланируемаяДата,
	                      |	ОтборПервый.Ответственный,
	                      |	ОтборПервый.Объект
	                      |ИЗ
	                      |	ОтборПервый КАК ОтборПервый
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПланируемаяДата");

	Запрос.УстановитьПараметр("Ответственный", СписокПользователей);
	Результат = Запрос.Выполнить().Выбрать();	
	Пока Результат.Следующий() Цикл
		СтрТЧ = ЗапланированныеТЗ.Добавить(); 
		СтрТЧ.ПланируемаяДата         = Результат.ПланируемаяДата;
		СтрТЧ.Ссылка                  = Результат.Мероприятие;
       	СтрТЧ.Пользователь            = Результат.Пользователь;
		СтрТЧ.Объект                  = Результат.Объект;    
		СтрТЧ.Контрагент              = Результат.Объект;
		СтрТЧ.ДоговорыКонтрагентов    = Результат.Объект;
		СтрТЧ.УслугиПоДоговору        = Результат.Объект;
		СтрТЧ.ДолговыеОбязательства   = Результат.Объект;
		СтрТЧ.ИсполнительныеДокументы = Результат.Объект;	
	КонецЦикла;
КонецПроцедуры

 &НаСервере
Процедура ЗапланированныеТЗ_ИД_на_ДО_УслПоДог_и_ДогКА_на_КА(СписокПользователей, ЗапланированныеТЗ, НеОбновляемЗапланированныеТЗ)
	Если НеОбновляемЗапланированныеТЗ Тогда
		Возврат;	
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ_Ответственный
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.Ссылка В(&Ответственный)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект КАК Объект
	                      |ПОМЕСТИТЬ ОбъектыВРаботе
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Контрагенты.Ссылка
	                      |ПОМЕСТИТЬ ОбъектыКонтрагент
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	                      |		ПО ОбъектыВРаботе.Объект = Контрагенты.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДоговорыКонтрагентов.Ссылка,
	                      |	ДоговорыКонтрагентов.Контрагент
	                      |ПОМЕСТИТЬ Объекты_ДогКонтрагентов_и_УслугПоДоговору
	                      |ИЗ
	                      |	ОбъектыКонтрагент КАК ОбъектыКонтрагент
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                      |		ПО ОбъектыКонтрагент.Ссылка = ДоговорыКонтрагентов.Контрагент
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	УслугиПоДоговору.Ссылка,
	                      |	УслугиПоДоговору.Контрагент
	                      |ИЗ
	                      |	ОбъектыКонтрагент КАК ОбъектыКонтрагент
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УслугиПоДоговору КАК УслугиПоДоговору
	                      |		ПО ОбъектыКонтрагент.Ссылка = УслугиПоДоговору.Контрагент
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ИсполнительныеДокументы.Ссылка КАК Объект,
	                      |	ИсполнительныеДокументы.Владелец КАК Владелец
	                      |ПОМЕСТИТЬ ВсеОбъектыВРаботе
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
	                      |		ПО ОбъектыВРаботе.Объект = ИсполнительныеДокументы.Владелец
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Объекты_ДогКонтрагентов_и_УслугПоДоговору.Ссылка,
	                      |	Объекты_ДогКонтрагентов_и_УслугПоДоговору.Контрагент
	                      |ИЗ
	                      |	Объекты_ДогКонтрагентов_и_УслугПоДоговору КАК Объекты_ДогКонтрагентов_и_УслугПоДоговору
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботе.Объект,
	                      |	NULL
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
	                      |	ВсеОбъектыВРаботе.Владелец,
	                      |	БизнесПроцессы.Ссылка
	                      |ПОМЕСТИТЬ БезПлохихБП
	                      |ИЗ
	                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	                      |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
	                      |ГДЕ
	                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
	                      |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
	                      |				И БизнесПроцессы.Завершен = ЛОЖЬ)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Мероприятие.Ссылка,
	                      |	Мероприятие.Объект,
	                      |	Мероприятие.ПланируемаяДата,
	                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	                      |	Мероприятие.Ответственный,
	                      |	БезПлохихБП.Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
	                      |		ПО Мероприятие.Объект = БезПлохихБП.Объект
	                      |ГДЕ
	                      |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И Мероприятие.Выполнена = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипМероприятия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыМероприятий.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
	                      |ИЗ
	                      |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	                      |ГДЕ
	                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	                      |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	                      |	МероприятияБезТиповМероприятий.Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
	                      |ИЗ
	                      |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
	                      |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	                      |	МероприятияБезТиповМероприятий.Владелец
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ответственный
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	МероприятияБезТипаСотрудника.Ответственный,
	                      |	МероприятияБезТипаСотрудника.Объект
	                      |ПОМЕСТИТЬ ОтборПервый
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыСотрудников.Ссылка КАК Ссылка,
	                      |	ТипыСотрудников.Глубина,
	                      |	ТипыСотрудников.РодителиШаблон
	                      |ПОМЕСТИТЬ ПВХ_ТипСотрудника
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	                      |ГДЕ
	                      |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	ПВХ_ТипСотрудника.РодителиШаблон,
	                      |	ПВХ_ТипСотрудника.Глубина
	                      |ПОМЕСТИТЬ Замена_Владельца_На_ДО
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	ОтветственныеСотрудники.Пользователь,
	                      |	Замена_Владельца_На_ДО.Объект
	                      |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	СотрудникиВПомощь.ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	СотрудникиВПомощь.Пользователь,
	                      |	Замена_Владельца_На_ДО.Объект
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	                      |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипСотрудника
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
	                      |	Без_Шаблона_Отв_Сотр.Пользователь,
	                      |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
	                      |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
	                      |	Без_Шаблона_Отв_Сотр.Объект
	                      |ПОМЕСТИТЬ Без_Глубины
	                      |ИЗ
	                      |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
	                      |ГДЕ
	                      |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Ссылка КАК Ссылка,
	                      |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
	                      |ПОМЕСТИТЬ Глубина_Макс
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Без_Глубины.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Пользователь КАК Пользователь,
	                      |	Без_Глубины.Ссылка,
	                      |	Без_Глубины.ПланируемаяДата,
	                      |	Без_Глубины.Объект
	                      |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
	                      |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
	                      |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Объект
	                      |ИЗ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОтборПервый.Ссылка,
	                      |	ОтборПервый.ПланируемаяДата,
	                      |	ОтборПервый.Ответственный,
	                      |	ОтборПервый.Объект
	                      |ИЗ
	                      |	ОтборПервый КАК ОтборПервый
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПланируемаяДата");

	Запрос.УстановитьПараметр("Ответственный", СписокПользователей);
	Результат = Запрос.Выполнить().Выбрать();	
	Пока Результат.Следующий() Цикл
		СтрТЧ = ЗапланированныеТЗ.Добавить(); 
		СтрТЧ.ПланируемаяДата         = Результат.ПланируемаяДата;
		СтрТЧ.Ссылка                  = Результат.Мероприятие;
       	СтрТЧ.Пользователь            = Результат.Пользователь;
		СтрТЧ.Объект                  = Результат.Объект;    
		СтрТЧ.Контрагент              = Результат.Объект;
		СтрТЧ.ДоговорыКонтрагентов    = Результат.Объект;
		СтрТЧ.УслугиПоДоговору        = Результат.Объект;
		СтрТЧ.ДолговыеОбязательства   = Результат.Объект;
		СтрТЧ.ИсполнительныеДокументы = Результат.Объект;	
	КонецЦикла;
КонецПроцедуры

 &НаСервере
Процедура ЗапланированныеТЗ_УслПоДог_и_ДогКА_на_КА(СписокПользователей, ЗапланированныеТЗ, НеОбновляемЗапланированныеТЗ)
	Если НеОбновляемЗапланированныеТЗ Тогда
		Возврат;	
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ_Ответственный
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.Ссылка В(&Ответственный)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект КАК Объект
	                      |ПОМЕСТИТЬ ОбъектыВРаботе
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО ОбъектыВРаботеОстатки.Сотрудник = ВТ_Ответственный.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Контрагенты.Ссылка
	                      |ПОМЕСТИТЬ ОбъектыКонтрагент
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	                      |		ПО ОбъектыВРаботе.Объект = Контрагенты.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДоговорыКонтрагентов.Ссылка,
	                      |	ДоговорыКонтрагентов.Контрагент
	                      |ПОМЕСТИТЬ Объекты_ДогКонтрагентов_и_УслугПоДоговору
	                      |ИЗ
	                      |	ОбъектыКонтрагент КАК ОбъектыКонтрагент
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                      |		ПО ОбъектыКонтрагент.Ссылка = ДоговорыКонтрагентов.Контрагент
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	УслугиПоДоговору.Ссылка,
	                      |	УслугиПоДоговору.Контрагент
	                      |ИЗ
	                      |	ОбъектыКонтрагент КАК ОбъектыКонтрагент
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УслугиПоДоговору КАК УслугиПоДоговору
	                      |		ПО ОбъектыКонтрагент.Ссылка = УслугиПоДоговору.Контрагент
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Объекты_ДогКонтрагентов_и_УслугПоДоговору.Ссылка КАК Объект,
	                      |	Объекты_ДогКонтрагентов_и_УслугПоДоговору.Контрагент КАК Владелец
	                      |ПОМЕСТИТЬ ВсеОбъектыВРаботе
	                      |ИЗ
	                      |	Объекты_ДогКонтрагентов_и_УслугПоДоговору КАК Объекты_ДогКонтрагентов_и_УслугПоДоговору
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботе.Объект,
	                      |	NULL
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВсеОбъектыВРаботе.Объект КАК Объект,
	                      |	ВсеОбъектыВРаботе.Владелец,
	                      |	БизнесПроцессы.Ссылка
	                      |ПОМЕСТИТЬ БезПлохихБП
	                      |ИЗ
	                      |	ВсеОбъектыВРаботе КАК ВсеОбъектыВРаботе
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	                      |		ПО ВсеОбъектыВРаботе.Объект = БизнесПроцессы.Объект
	                      |ГДЕ
	                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
	                      |			ИЛИ БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
	                      |				И БизнесПроцессы.Завершен = ЛОЖЬ)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Мероприятие.Ссылка,
	                      |	Мероприятие.Объект,
	                      |	Мероприятие.ПланируемаяДата,
	                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	                      |	Мероприятие.Ответственный,
	                      |	БезПлохихБП.Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТиповМероприятий
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БезПлохихБП КАК БезПлохихБП
	                      |		ПО Мероприятие.Объект = БезПлохихБП.Объект
	                      |ГДЕ
	                      |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И Мероприятие.Выполнена = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипМероприятия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыМероприятий.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ДопустимыеТипыМероприятий
	                      |ИЗ
	                      |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	                      |ГДЕ
	                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	                      |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный КАК Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	                      |	МероприятияБезТиповМероприятий.Владелец
	                      |ПОМЕСТИТЬ МероприятияБезТипаСотрудника
	                      |ИЗ
	                      |	МероприятияБезТиповМероприятий КАК МероприятияБезТиповМероприятий
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопустимыеТипыМероприятий КАК ДопустимыеТипыМероприятий
	                      |		ПО МероприятияБезТиповМероприятий.ТипМероприятия = ДопустимыеТипыМероприятий.Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	МероприятияБезТиповМероприятий.Ссылка,
	                      |	МероприятияБезТиповМероприятий.Объект,
	                      |	МероприятияБезТиповМероприятий.Ответственный,
	                      |	МероприятияБезТиповМероприятий.ПланируемаяДата,
	                      |	МероприятияБезТиповМероприятий.Владелец
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ответственный
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	МероприятияБезТипаСотрудника.Ответственный,
	                      |	МероприятияБезТипаСотрудника.Объект
	                      |ПОМЕСТИТЬ ОтборПервый
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ВТ_Ответственный.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыСотрудников.Ссылка КАК Ссылка,
	                      |	ТипыСотрудников.Глубина,
	                      |	ТипыСотрудников.РодителиШаблон
	                      |ПОМЕСТИТЬ ПВХ_ТипСотрудника
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	                      |ГДЕ
	                      |	ТипыСотрудников.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МероприятияБезТипаСотрудника.Ссылка,
	                      |	ЕСТЬNULL(МероприятияБезТипаСотрудника.Владелец, МероприятияБезТипаСотрудника.Объект) КАК Объект,
	                      |	МероприятияБезТипаСотрудника.ПланируемаяДата,
	                      |	ПВХ_ТипСотрудника.РодителиШаблон,
	                      |	ПВХ_ТипСотрудника.Глубина
	                      |ПОМЕСТИТЬ Замена_Владельца_На_ДО
	                      |ИЗ
	                      |	МероприятияБезТипаСотрудника КАК МероприятияБезТипаСотрудника
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО МероприятияБезТипаСотрудника.Ответственный = ПВХ_ТипСотрудника.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	ОтветственныеСотрудники.Пользователь,
	                      |	Замена_Владельца_На_ДО.Объект
	                      |ПОМЕСТИТЬ Без_Шаблона_Отв_Сотр
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |		ПО Замена_Владельца_На_ДО.Объект = ОтветственныеСотрудники.Объект
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Замена_Владельца_На_ДО.РодителиШаблон,
	                      |	СотрудникиВПомощь.ТипСотрудника,
	                      |	Замена_Владельца_На_ДО.Ссылка,
	                      |	Замена_Владельца_На_ДО.ПланируемаяДата,
	                      |	СотрудникиВПомощь.Пользователь,
	                      |	Замена_Владельца_На_ДО.Объект
	                      |ИЗ
	                      |	Замена_Владельца_На_ДО КАК Замена_Владельца_На_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	                      |		ПО Замена_Владельца_На_ДО.Объект = СотрудникиВПомощь.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипСотрудника
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПВХ_ТипСотрудника.Глубина КАК Глубина,
	                      |	Без_Шаблона_Отв_Сотр.Пользователь,
	                      |	Без_Шаблона_Отв_Сотр.Ссылка КАК Ссылка,
	                      |	Без_Шаблона_Отв_Сотр.ПланируемаяДата,
	                      |	Без_Шаблона_Отв_Сотр.Объект
	                      |ПОМЕСТИТЬ Без_Глубины
	                      |ИЗ
	                      |	Без_Шаблона_Отв_Сотр КАК Без_Шаблона_Отв_Сотр
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПВХ_ТипСотрудника КАК ПВХ_ТипСотрудника
	                      |		ПО Без_Шаблона_Отв_Сотр.ТипСотрудника = ПВХ_ТипСотрудника.Ссылка
	                      |ГДЕ
	                      |	Без_Шаблона_Отв_Сотр.РодителиШаблон ПОДОБНО ПВХ_ТипСотрудника.РодителиШаблон
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Ссылка КАК Ссылка,
	                      |	МАКСИМУМ(Без_Глубины.Глубина) КАК Глубина
	                      |ПОМЕСТИТЬ Глубина_Макс
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Без_Глубины.Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Ссылка,
	                      |	Глубина
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Без_Глубины.Пользователь КАК Пользователь,
	                      |	Без_Глубины.Ссылка,
	                      |	Без_Глубины.ПланируемаяДата,
	                      |	Без_Глубины.Объект
	                      |ПОМЕСТИТЬ Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |ИЗ
	                      |	Без_Глубины КАК Без_Глубины
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Глубина_Макс КАК Глубина_Макс
	                      |		ПО Без_Глубины.Ссылка = Глубина_Макс.Ссылка
	                      |			И Без_Глубины.Глубина = Глубина_Макс.Глубина
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.ПланируемаяДата КАК ПланируемаяДата,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Ссылка КАК Мероприятие,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь,
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю.Объект
	                      |ИЗ
	                      |	Тип_Сотрудника_Без_Отбора_По_Пользователю КАК Тип_Сотрудника_Без_Отбора_По_Пользователю
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	                      |		ПО Тип_Сотрудника_Без_Отбора_По_Пользователю.Пользователь = ВТ_Ответственный.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОтборПервый.ПланируемаяДата,
	                      |	ОтборПервый.Ссылка,
	                      |	ОтборПервый.Ответственный,
	                      |	ОтборПервый.Объект
	                      |ИЗ
	                      |	ОтборПервый КАК ОтборПервый
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПланируемаяДата");

	Запрос.УстановитьПараметр("Ответственный", СписокПользователей);
	Результат = Запрос.Выполнить().Выбрать();	
	Пока Результат.Следующий() Цикл
		СтрТЧ = ЗапланированныеТЗ.Добавить(); 
		СтрТЧ.ПланируемаяДата         = Результат.ПланируемаяДата;
		СтрТЧ.Ссылка                  = Результат.Мероприятие;
       	СтрТЧ.Пользователь            = Результат.Пользователь;
		СтрТЧ.Объект                  = Результат.Объект;    
		СтрТЧ.Контрагент              = Результат.Объект;
		СтрТЧ.ДоговорыКонтрагентов    = Результат.Объект;
		СтрТЧ.УслугиПоДоговору        = Результат.Объект;
		СтрТЧ.ДолговыеОбязательства   = Результат.Объект;
		СтрТЧ.ИсполнительныеДокументы = Результат.Объект;	
	КонецЦикла;
КонецПроцедуры
