
Функция ПроставитьЗначенияДопСвойств(Данные, Источник) Экспорт
	Возврат Истина; //
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ФункцииДополнительныхСвойств.Ссылка,
	//                      |	ФункцииДополнительныхСвойств.Свойство,
	//                      |	ФункцииДополнительныхСвойств.Функция,
	//                      |	ФункцииДополнительныхСвойств.ОбъектНаКоторыйЗавязаноСвойство КАК ОбъектРодитель
	//                      |ИЗ
	//                      |	Справочник.ФункцииДополнительныхСвойств КАК ФункцииДополнительныхСвойств
	//                      |ГДЕ
	//                      |	ТИПЗНАЧЕНИЯ(ФункцииДополнительныхСвойств.ОбъектНаКоторыйЗавязаноСвойство) В (&МассивТипов)
	//                      |	И НЕ ФункцииДополнительныхСвойств.ПометкаУдаления
	//                      |	И ФункцииДополнительныхСвойств.Используется");
	//Массив = Новый Массив();					  
	//ОбъектВх = Новый ТаблицаЗначений();
	//ОбъектВх.Колонки.Добавить("Объект", Новый ОписаниеТипов(""));
	//ОбъектВх.Колонки.Добавить("Значение", Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Тип);
	//
	////
	//Если Источник = Перечисления.ИнициаторыСобытийДляДопСвойств.ОбъектыВРаботе Тогда		
	//	Массив.Добавить(Тип("СправочникСсылка.Организации"));
	//	Массив.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
	//	Массив.Добавить(Тип("СправочникСсылка.Пользователи"));
	//	
	//	Для Каждого Элемент Из Данные Цикл
	//		ОбъектВх.Добавить().Объект = Элемент.Объект;
	//	КонецЦикла;
	//	Запрос2 = Новый Запрос("ВЫБРАТЬ
	//	                       |	Таблица.Объект,
	//	                       |	Таблица.Значение
	//	                       |ПОМЕСТИТЬ Таблица
	//	                       |ИЗ
	//	                       |	&Таблица КАК Таблица
	//	                       |;
	//	                       |
	//	                       |////////////////////////////////////////////////////////////////////////////////
	//	                       |ВЫБРАТЬ
	//	                       |	Таблица.Объект,
	//	                       |	Таблица.Значение КАК Значение
	//	                       |ИЗ
	//	                       |	Таблица КАК Таблица
	//	                       |
	//	                       |СГРУППИРОВАТЬ ПО
	//	                       |	Таблица.Объект,
	//	                       |	Таблица.Значение");
	//	ОбъектВх = Запрос2.Выполнить().Выгрузить();
	//	
	//ИначеЕсли Источник = Перечисления.ИнициаторыСобытийДляДопСвойств.СостоянияПоКатегориям Тогда
	//	Массив.Добавить(Тип("СправочникСсылка.Категории"));
	//	Массив.Добавить(Тип("ПланВидовХарактеристикСсылка.ВидыСкоринга"));
	//	
	//	Для Каждого Элемент Из Данные Цикл
	//		ОбъектВх.Добавить().Объект = Элемент.Объект;
	//	КонецЦикла;
	//	Запрос2 = Новый Запрос("ВЫБРАТЬ
	//	               |	Таблица.Объект,
	//	               |	Таблица.Значение
	//	               |ПОМЕСТИТЬ Таблица
	//	               |ИЗ
	//	               |	&Таблица КАК Таблица
	//	               |;
	//	               |
	//	               |////////////////////////////////////////////////////////////////////////////////
	//	               |ВЫБРАТЬ
	//	               |	Таблица.Объект,
	//	               |	Таблица.Значение КАК Значение
	//	               |ИЗ
	//	               |	Таблица КАК Таблица
	//	               |
	//	               |СГРУППИРОВАТЬ ПО
	//	               |	Таблица.Объект,
	//	               |	Таблица.Значение");
	//	ОбъектВх = Запрос2.Выполнить().Выгрузить();
	//	
	//ИначеЕсли Источник = Перечисления.ИнициаторыСобытийДляДопСвойств.БизнесПроцесс Тогда
	//	Массив.Добавить(Тип("СправочникСсылка.КартыМаршрутов"));
	//	ОбъектВх.Добавить().Объект = Данные.Объект;
	//	
	//ИначеЕсли Источник = Перечисления.ИнициаторыСобытийДляДопСвойств.Мероприятие Тогда
	//	Массив.Добавить(Тип("СправочникСсылка.ТипыМероприятий"));
	//	Массив.Добавить(Тип("СправочникСсылка.РезультатыМероприятий"));	
	//	ОбъектВх.Добавить().Объект = Данные.Объект;
	//КонецЕсли;
	//
	////
	//Запрос.УстановитьПараметр("МассивТипов", Массив);
	//Результат = Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() Цикл
	//	ОбъектВх.ЗаполнитьЗначения(Неопределено, "Значение");
	//	ВычислитьФункцию(Результат.Функция, ОбъектВх, Результат.Свойство, Результат.ОбъектРодитель);
	//	
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	Таблица.Объект,
	//	               |	Таблица.Значение
	//	               |ПОМЕСТИТЬ Таблица
	//	               |ИЗ
	//	               |	&Таблица КАК Таблица
	//	               |;
	//	               |
	//	               |////////////////////////////////////////////////////////////////////////////////
	//	               |ВЫБРАТЬ
	//	               |	Таблица.Объект,
	//	               |	Таблица.Значение 
	//	               |ИЗ
	//	               |	Таблица КАК Таблица
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	//	               |		ПО (ДополнительныеСведения.Свойство = &Свойство)
	//	               |			И (ДополнительныеСведения.Объект = Таблица.Объект)
	//	               |ГДЕ
	//	               |	Таблица.Значение <> ДополнительныеСведения.Значение";
	//	Запрос.УстановитьПараметр("Свойство", Результат.Свойство);
	//	Результат3 = Запрос.Выполнить().Выбрать();
	//	Пока Результат3.Следующий() Цикл
	//		Набор = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	//		Набор.Объект = Результат3.Объект;
	//		Набор.Свойство = Результат.Свойство;
	//		Набор.Значение = Результат3.Значение;
	//		Попытка
	//			Набор.Записать();
	//		Исключение
	//			Возврат Ложь;
	//		КонецПопытки;
	//	КонецЦикла;
	//КонецЦикла;
	//
	//Возврат Истина;
КонецФункции

Функция ВычислитьФункцию(Знач Запрос, Знач ОбъектВх, Знач Свойство, Знач ОбъектРодитель)
	Попытка
		Выполнить(Запрос);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Возврат ОбъектВх;
КонецФункции
