

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбновитьВремя", 1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запись.Дата = ТекущаяДата();
	Запись.Время = ТекущаяДата();
	Запись.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

&НаКлиенте
Процедура ВсеЗадачи(Команда)
	ФормаУчета = ПолучитьФорму("РегистрСведений.УчетРабочегоВремени.ФормаСписка");
	ФормаУчета.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВремя()
	Запись.Время = ТекущаяДата();
КонецПроцедуры
