
Процедура ПровестиПоследовательность(ЭтотОбъект) Экспорт
	//Корректировка последовательности, поиск первого документа актуализации и его ПРОГРАММНОЕ перепроведение
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПоступлениеПлатежа.Ссылка КАК Ссылка,
	|	ПоступлениеПлатежа.ДатаПлатежа КАК ДатаПлатежа
	|ИЗ
	|	Документ.ПоступлениеПлатежа КАК ПоступлениеПлатежа
	|ГДЕ
	|	ПоступлениеПлатежа.Займ = &Займ
	|	И ПоступлениеПлатежа.ДатаПлатежа >= &МоментВремени
	|	И ПоступлениеПлатежа.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеПлатежа.ДатаПлатежа,
	|	Ссылка");
	Запрос.УстановитьПараметр("Займ", ЭтотОбъект.Займ);
	Запрос.УстановитьПараметр("МоментВремени", ?(ЗначениеЗаполнено(ЭтотОбъект.ДатаВступленияВЗаконнуюСилу), ЭтотОбъект.ДатаВступленияВЗаконнуюСилу, ЭтотОбъект.ДатаИска));
	Результат = Запрос.Выполнить().Выгрузить();
	//к = Результат.Количество() - 1;
	//Для н = 0 по к Цикл
	//	ДокументОбъект = Результат[к - н].Ссылка.ПолучитьОбъект();
	//	ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//КонецЦикла;  

	//НетПлатежей =  (Результат.Количество() = 0);  
	МенеджерКорректировки = РегистрыСведений.ОчередьПерепроведенияЗадолженности;
	ЭтоПервый = 0; 
	
	ОбъектыСервер.ЗаписатьТекущиеПараметрыЗадолженностиОбработчик(ЭтотОбъект);

	
	Для Каждого стр Из Результат Цикл
		
		ЗаписьНаКорректировку = МенеджерКорректировки.СоздатьМенеджерЗаписи();
		ЗаписьНаКорректировку.ДокументИсточник = ЭтотОбъект.Ссылка;
		ЗаписьНаКорректировку.ДокументНаКорректировку = стр.Ссылка;
		ЗаписьНаКорректировку.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		ЗаписьНаКорректировку.Порядок = ЭтоПервый;
		ЗаписьНаКорректировку.Записать();  
		Если ЭтоПервый = 0 Тогда
			ДокументСтарт = стр.Ссылка;
		КонецЕсли;
		ЭтоПервый = ЭтоПервый + 1; 
	КонецЦикла;  
	
	Если ЗначениеЗаполнено(ДокументСтарт) Тогда
		Документы.ПоступлениеПлатежа.ПровестиПоследовательность(ЭтотОбъект);
	КонецЕсли;
		
	
	
КонецПроцедуры     


