
&НаСервере
Функция ПредопределенноеЗначениеТипаЗадолженности(ИмяКолонки) Экспорт

	Возврат ПланыВидовХарактеристик.ТипыЗадолженности[ИмяКолонки].Наименование;

КонецФункции // ()

&НаСервере
Функция ПолучитьВыборкуТиповЗадолженности(тзТипы) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипыЗадолженности.Наименование КАК Наименование,
		|	ТипыЗадолженности.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	ПланВидовХарактеристик.ТипыЗадолженности КАК ТипыЗадолженности
		|ГДЕ
		|	ТипыЗадолженности.Предопределенный = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		тзТипы.Вставить(ВыборкаДетальныеЗаписи.ИмяПредопределенныхДанных, ВыборкаДетальныеЗаписи.Наименование);
	
	КонецЦикла;

	Возврат Истина;
	

КонецФункции // ()


&НаСервере
Функция НаименованиеТипаЗадолженности(ИмяКолонки, Выборка) Экспорт

	ЗначениеТипа = Неопределено;
	Если Выборка.Свойство(ИмяКолонки, ЗначениеТипа) Тогда
	
		Возврат ЗначениеТипа;
	
	КонецЕсли;

	Возврат Неопределено;

КонецФункции // ()
