&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьЗначенияПараметров();
	
	ИмяКолонкиВладельца = Параметры.ИмяЗаполняемойКолонки;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы = Неопределено Тогда
		Элементы.Добавить.Видимость = Ложь;
		ВидПодбораПоУмолчанию(Объект.ВидПодбораОбъектов);
		ВидСправочникаПоУмолчанию(Объект.ВидСправочника);
		//Объект.ВидСправочника = ПредопределенноеЗначение("Перечисление.ВидыСправочникаДляПодбора.ДолговыеОбязательства");
		//Объект.ВидПодбораОбъектов = ПредопределенноеЗначение("Перечисление.ВидыПодбораОбъектов.ТолькоОбъектыВРаботе");
	КонецЕсли;
	ПерезаполнитьЗапрос();
КонецПроцедуры

&НаКлиенте
Процедура Отобрать(Команда)
	ОтобратьПоДинамическомуСписку();
	УстановитьФлажки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ПомеченныеСтроки = Объект.Объекты.НайтиСтроки(Новый Структура("Пометка", Истина));
		
	Если ПомеченныеСтроки.Количество() = 0 Тогда
		Сообщить("Ничего не отмечено!");
	Иначе
		
		ИмяКолонки = "Объект";
		Если Не ПустаяСтрока(ИмяКолонкиВладельца) Тогда
		
			ИмяКолонки = ИмяКолонкиВладельца;
		
		КонецЕсли;
		
		Для Каждого Элемент Из ПомеченныеСтроки Цикл
			Нов = ВладелецФормы.Объект.Объекты.Добавить();
			Нов[ИмяКолонки] = Элемент.Объект;	
			Попытка
				Нов.Контрагент = Элемент.Объект;
				Нов.ДоговорКонтрагента = Элемент.Объект;	
				Нов.УслугаПоДоговору = Элемент.Объект;
				Нов.ДолговоеОбязательство = Элемент.Объект;
				Нов.ИсполнительныйДокумент = Элемент.Объект;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		Оповестить("УдалитьДублиОбъектов", "ФормаПодборДО");
		ЭтаФорма.Закрыть();

	КонецЕсли;  	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	Если Объект.НастройкаПодбор <> ПредопределенноеЗначение("Справочник.НастройкиПодборДО.ПустаяСсылка") Тогда
		ЗаписатьНастройку();		
	Иначе
		Форма = ПолучитьФорму("Справочник.НастройкиПодборДО.Форма.ФормаЭлемента", Новый Структура("Настройка", НастройкиПодбора()), 
		ЭтаФорма);
		
		Форма.Объект.НомерСтроки = Объект.НомерСтроки;
		Форма.Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначениеНастроекОтбора.ПодборДО");
		Форма.Объект.ВидПодбораОбъектов = Объект.ВидПодбораОбъектов;
		Форма.Объект.ВидСправочника = Объект.ВидСправочника;
		
		Форма.ОткрытьМодально();	
		Если Не Форма.Объект.Ссылка.Пустая() Тогда
			Объект.НастройкаПодбор = Форма.Объект.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьВыделение(Команда)
	Список.Очистить();
	Для Каждого Стр Из Элементы.СписокДО.ВыделенныеСтроки Цикл
		Список.Добавить(Элементы.СписокДО.ДанныеСтроки(стр).Объект);
	КонецЦикла;
	
	ОтобратьПоДинамическомуСпискуСУчетомВыделения();
	УстановитьФлажки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Элемент Из Объект.Объекты Цикл
		Элемент.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Элемент Из Объект.Объекты Цикл
		Элемент.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастрйкиКак(Команда)
	Форма = ПолучитьФорму("Справочник.НастройкиПодборДО.Форма.ФормаЭлемента", Новый Структура("Настройка", НастройкиПодбора()), 
	ЭтаФорма);
	
	Форма.Объект.НомерСтроки = Объект.НомерСтроки;
	Форма.Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначениеНастроекОтбора.ПодборДО");
	Форма.Объект.ВидПодбораОбъектов = Объект.ВидПодбораОбъектов;
	Форма.Объект.ВидСправочника = Объект.ВидСправочника;
	
	Форма.ОткрытьМодально();	
	Если Не Форма.Объект.Ссылка.Пустая() Тогда
		Объект.НастройкаПодбор = Форма.Объект.Ссылка;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидПодбораОбъектовПриИзменении(Элемент)
	ПерезаполнитьЗапрос();
КонецПроцедуры

&НаКлиенте
Процедура ВидСправочникаПриИзменении(Элемент)
	ПерезаполнитьЗапрос();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодборПриИзменении(Элемент)    
	Если ЗначениеЗаполнено(Объект.НастройкаПодбор) Тогда
		Если Объект.ВидПодбораОбъектов <> ОбъектыСервер.РазыменоватьСсылку(Объект.НастройкаПодбор, "ВидПодбораОбъектов") ИЛИ Объект.ВидСправочника <> ОбъектыСервер.РазыменоватьСсылку(Объект.НастройкаПодбор, "ВидСправочника") Тогда
			Объект.ВидПодбораОбъектов = ОбъектыСервер.РазыменоватьСсылку(Объект.НастройкаПодбор, "ВидПодбораОбъектов");
			Объект.ВидСправочника = ОбъектыСервер.РазыменоватьСсылку(Объект.НастройкаПодбор, "ВидСправочника");
			ПерезаполнитьЗапрос();
		КонецЕсли;
		Массив = ОбъектыСервер.РазыменоватьСсылку(Объект.НастройкаПодбор, "Настройка.Получить()");
		СписокДО.КомпоновщикНастроек.ЗагрузитьНастройки(Массив[0]);
		УстановитьЗначенияПараметров();
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ОтобратьПоДинамическомуСписку()
	Схема     = Элементы.СписокДО.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.СписокДО.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаРезультат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Объект.Объекты.Загрузить(ТаблицаРезультат);
КонецПроцедуры

&НаСервере
Процедура ОтобратьПоДинамическомуСпискуСУчетомВыделения()
	Схема     = Элементы.СписокДО.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.СписокДО.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	Если Элементы.СписокДО.ВыделенныеСтроки.Количество() > 0 Тогда
		 Отбор = Настройки.Отбор.Элементы;
		 ЭлементОтбора = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		 ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
		 ЭлементОтбора.ПравоеЗначение = Список;
		 ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаРезультат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Объект.Объекты.Загрузить(ТаблицаРезультат);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройку()
	СпрОбъект = Объект.НастройкаПодбор.ПолучитьОбъект();
	СпрОбъект.ВидСправочника = Объект.ВидСправочника;
	СпрОбъект.ВидПодбораОбъектов = Объект.ВидПодбораОбъектов;
	СпрОбъект.Настройка = Новый ХранилищеЗначения(НастройкиПодбора());
	СпрОбъект.Записать();
КонецПроцедуры

&НаСервере
Функция НастройкиПодбора()
	Массив = Новый Массив();
	Настройки = Элементы.СписокДО.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	Массив.Добавить(Настройки);
	Схема = Элементы.СписокДО.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Массив.Добавить(Схема);
	Возврат Массив;	
КонецФункции

#Область УправлениеПараметрами

&НаСервере
Процедура УстановитьЗначенияПараметров()

	УстановитьСписокВыбораВидаСправочника();
	
	Если Параметры.Свойство("ЗаполнениеСудебныхУчастковДолжников") Тогда 
		
		ВидПодбораПоУмолчанию(Объект.ВидПодбораОбъектов);
		ВидСправочникаПоУмолчанию(Объект.ВидСправочника);
		//Объект.ВидПодбораОбъектов = Перечисления.ВидыПодбораОбъектов.ТолькоОбъектыВРаботе);
		//Объект.ВидСправочника = Перечисления.ВидыСправочникаДляПодбора.ДолговыеОбязательства);
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВидПодбораПоУмолчанию(ВидПодбораОбъектов)

	ВидПодбораОбъектов = ПредопределенноеЗначение("Перечисление.ВидыПодбораОбъектов.ТолькоОбъектыВРаботе");

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВидСправочникаПоУмолчанию(ВидСправочника)

	ВидСправочника = ПредопределенноеЗначение("Перечисление.ВидыСправочникаДляПодбора.ДолговыеОбязательства");

КонецПроцедуры // ()

&НаСервере
Процедура УстановитьСписокВыбораВидаСправочника()

	СписокСправочников = Элементы.ВидСправочника.СписокВыбора;
	
	СписокСправочников.Добавить(Перечисления.ВидыСправочникаДляПодбора.ДолговыеОбязательства);
	
	ИспользуетсяФССП = ПолучитьФункциональнуюОпцию("ИспользованиеИнтеграцииФССП");
	Если ИспользуетсяФССП Тогда
	
		СписокСправочников.Добавить(Перечисления.ВидыСправочникаДляПодбора.ИсполнительныеДокументы);
		СписокСправочников.Добавить(Перечисления.ВидыСправочникаДляПодбора.ИсполнительныеПроизводства);
	
	КонецЕсли;
	ИспользуетсяСудебныйБлок = ПолучитьФункциональнуюОпцию("ИспользованиеСудебногоБлока");
	Если ИспользуетсяСудебныйБлок Тогда
	
		СписокСправочников.Добавить(Перечисления.ВидыСправочникаДляПодбора.СудебныеДела);
	
	КонецЕсли;

КонецПроцедуры


#КонецОбласти


&НаСервере
Процедура ПерезаполнитьЗапрос()
	СписокДО.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();
	СписокДО.ТекстЗапроса = УправлениеСвойствами.ПолучитьТекстЗапроса1(Объект.ВидПодбораОбъектов, Объект.ВидСправочника);
КонецПроцедуры

