
&НаКлиенте
Процедура Отправить(Команда)
	// Отправить сообщение через API
	Предупреждение("Выполняется отправка сообщения...",1,"Интеграция с WhatsApp");
	КомандаОтправить = "whatsapp://send/?phone="+Номер+"&text="+Сообщение;
    ЗапуститьПриложение(КомандаОтправить);
	Оповестить("ШаблонИзмененВЦ");
КонецПроцедуры

&НаКлиенте
Процедура ПоискДолжника(Команда) Экспорт
	// Найти контакт через API
	КомандаПоиск = "whatsapp://send/?phone="+Номер;
    ЗапуститьПриложение(КомандаПоиск);
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныСМС(Команда)
	// Открыть форму списка шаблонов
	ФормаСпискаШаблонов = ПолучитьФорму("Справочник.ШаблоныТекстаДляАвтоинформирования.Форма.ФормаСписка");
	ФормаСпискаШаблонов.СкрытоеПолеНомерДО = ЭтаФорма.Договор;
	ФормаСпискаШаблонов.Открыть();
КонецПроцедуры
