
#Область ПрограммныйИнтерфейс

// Расчитывает минимальную длину фамилии из существующих в системе
//   См.Справочники.Контрагенты.МинимальнаяДлинаФамилии()
//   Если База пустая, выставляет значение по умолчанию
//
// Возвращаемое значение:
//   Число   - Минимальная длина фамилии
//
Функция МинимальнаяДлинаФамилии() Экспорт

	РекомендованнаяМинДлина = 4;
	
	МинДлина = Справочники.Контрагенты.МинимальнаяДлинаФамилии();
	Если МинДлина = 0 Тогда
	
		МинДлина = РекомендованнаяМинДлина;
	
	КонецЕсли;
	
	Возврат МинДлина;

КонецФункции

// Переводит данные настройки в структуру
//
// Параметры:
//  Настройка  - СправочникСсылка.НастройкиПарсингаДокументов - 
//                 ссылка для конвертации
//
// Возвращаемое значение:
//   Структура   - Представление настройки
//
Функция ДанныеНастройки(Настройка) Экспорт

	РеквизитыНастройки = РеквизитыНастройки(Настройка);
	Настройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Настройка,
		РеквизитыНастройки
	);
	
	Возврат Настройки;

КонецФункции // ()

#КонецОбласти

Функция РеквизитыНастройки(Настройка)
	
	РеквизитыНастройки = Новый Массив();
	Для Каждого Реквизит Из Настройка.Метаданные().Реквизиты Цикл
		РеквизитыНастройки.Добавить(Реквизит.Имя);
	КонецЦикла;
	
	Возврат РеквизитыНастройки;
КонецФункции
