
Перем ТекстИзменений;

Процедура ПередЗаписью(Отказ)
	Наименование = ?(ПустаяСтрока(СерияНомерИД), НомерДела, НомерДела + " (" + СерияНомерИД + ")");
	
	Если Не ЭтотОбъект.ЭтоГруппа И Не ЗначениеЗаполнено(ЭтотОбъект.ДатаСоздания) Тогда
		ЭтотОбъект.ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	//
	ТекстИзменений = ОбъектыСервер.ПроверитьИзмененияВОбъекте(ЭтотОбъект);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Справочники.Пользователи.ОтслеживаниеИзменений(Отказ, Ссылка, ТекстИзменений);
	РасчетЗадолженностиСудопроизводство.ОбновитьСуммыЗадолженностиПоИД(ЭтотОбъект.Ссылка);
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ИсполнительныеДокументы") Тогда
		Оригинал = ДанныеЗаполнения;
		СудебноеРешение = ДанныеЗаполнения.СудебноеРешение;
		ЧастьРешения = ДанныеЗаполнения.ЧастьРешения;
		ВидОтветчика = ДанныеЗаполнения.ВидОтветчика;
		Должник = ДанныеЗаполнения.Должник;
		ОтветчикФИО = ДанныеЗаполнения.Должник.ФИО_Действующее;
		ВидИД = ДанныеЗаполнения.ВидИД;		
		ТипИД = ДанныеЗаполнения.ТипИД;
		Взыскатель = ДанныеЗаполнения.Взыскатель;
		Дубликат = Истина;
		Владелец = ДанныеЗаполнения.Владелец;
		СтавкаРефинансирование = ДанныеЗаполнения.СтавкаРефинансирования;		
	ИначеЕсли ТипЗНч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		ВидОтветчика = Перечисления.ВидыОтветчиков.Должник;
		Должник = ДанныеЗаполнения.Должник;
		ОтветчикФИО = ДанныеЗаполнения.Должник.ФИО_Действующее;
		Взыскатель = ДанныеЗаполнения.Организация;
		Владелец = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры

