
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		// Заполнение шапки   
		ОбъектУчета = ДанныеЗаполнения.Ссылка; 
		
		НаборЗаписей = РегистрыСведений.КредитныеИсторииДанныеСделки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сделка.Установить(ОбъектУчета); 
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			УИДКИ = НаборЗаписей[0].UID;
        КонецЕсли;
		
		УИДСделкиИлиОбращения = УИДКИ;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДоговорМикрозайма") Тогда
		// Заполнение шапки
		УИДСделкиИлиОбращения = ДанныеЗаполнения.UIDНБКИ;
		ОбъектУчета = ДанныеЗаполнения.Займ; 
		РасчитаноПоПотребительскомуЗайму = Истина;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
