
&НаСервере
Процедура ВыгрузитьДанныеНаСервере(РучнаяЗагрузка)
	Если Объект.Объекты.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одного объекта для выгрузки! Операция отменена.");
		Возврат;
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(Объект.НастройкаВыгрузки) Тогда
		Сообщить("Выберете настройку выгрузки!");
		Возврат;
	КонецЕсли;	
	НомерСтроки = 0;
	ОбъектыОдногоТипа = ПроверитьТипыОбъектовВыгрузки(НомерСтроки);
	Если НЕ ОбъектыОдногоТипа Тогда
		Сообщить("Объект в строке "+ НомерСтроки+" не соответствует типу, заданному в настройке в поле На примере документа. Операция отменена.");
		Возврат;
	КонецЕсли;	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьДанныеВФайл(РучнаяЗагрузка);
	Сообщить("Файл выгрузки сформирован!");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	РучнаяЗагрузка = Истина;
	ВыгрузитьДанныеНаСервере(РучнаяЗагрузка);
КонецПроцедуры

&НаСервере
Функция ПроверитьТипыОбъектовВыгрузки(НомерСтроки)
	ОдинТип = Истина;
	ТипОбъектаНастройка = ТипЗнч(Объект.НастройкаВыгрузки.НаПримереДокумента);
	Для каждого Стр Из Объект.Объекты Цикл
		Если ТипОбъектаНастройка <> ТипЗнч(Стр.Объект) Тогда
			НомерСтроки = Стр.НомерСтроки;
			ОдинТип = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ОдинТип; 
			
КонецФункции

&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПерезаписатьДатуНаСервере()
	Если Не ЗначениеЗаполнено(Объект.НастройкаВыгрузки) Тогда
		Сообщить("Выберете настройку выгрузки!");
		Возврат;
	КонецЕсли;	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПерезаписатьДатуПередачи(ПолеИсходнойТаблицы,Объект.НастройкаВыгрузки,ТекстФайлаОшибок,Объект.ПоЖурналу);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПерезаписатьДату(Команда)
	ПерезаписатьДатуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьНомераСтолбцов();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	Объект.ПоЖурналу = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиДляОбъектовНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьРСНастройкиВыгрузки();
	Сообщить("Настройки определены для объектов учета!");

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиДляОбъектов(Команда)
	ЗаполнитьНастройкиДляОбъектовНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПодборПоНастройкам(Команда)
	//ОбъектыКлиент.ПодборПоНастройкам(ЭтаФорма);
	ФормаПодбор = ПолучитьФорму("Обработка.ПодборДО.Форма.Форма",, ЭтаФорма); 
	ФормаПодбор.Объект.ТипИсточника = Неопределено;
	//Чуров
	ОткрытьФорму(ФормаПодбор)
КонецПроцедуры
