
&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоНастройкам(Команда)
	ОбъектыКлиент.ПодборПоНастройкам(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПриИзменении(Элемент)
	ТекДанные = Элементы.Объекты.ТекущиеДанные;
	Если ТипЗнч(ТекДанные.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда 
		ТекДанные.Должник = ДолжникДО(ТекДанные.Объект);
	Иначе
		ТекДанные.Должник = ТекДанные.Объект;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДолжникДО(ДО)
	Возврат ДО.Должник;
КонецФункции // ДолжникДО()

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры

