
&НаКлиенте
Процедура ВыгрузитьНаАТС(Команда)
	Если ПроверитьЗаполнение() Тогда
		стрСостояниеВыполнения = "";
		стрОшибка = "";
		бит_АТСВыгрузкаИзменений.ВыполнитьВыгрузкуИзмененийНаАТС(УзелОбмена, стрСостояниеВыполнения, стрОшибка);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = стрСостояниеВыполнения;
		Если ЗначениеЗаполнено(стрОшибка) Тогда
			Сообщение.Текст = Сообщение.Текст + Символы.ПС + Символы.ПС + "Ошибка выгрузки:" + Символы.ПС + стрОшибка;
		КонецЕсли;
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьБазуНаАТС(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	бит_ТелефонияКлиентПереопределяемый.ПоказВопрос("Вы действительно хотите очистить таблицы номеров телефонов, менеджеров и названий контрагентов?" +
					Символы.ПС + "Вся информация на БИТ.АТС будет удалена.",
					РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, ,
					"БитАТС_ОчисткаБазыКлиентМенеджера");
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьБазуНаАТСЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ответ = РезультатВопроса;
	Если ответ = КодВозвратаДиалога.Да Тогда
		стрСостояниеВыполнения = "";
		стрОшибка = "";
		бит_АТСВыгрузкаИзменений.ОчиститьБазуДанныхНаАТС(УзелОбмена, стрСостояниеВыполнения, стрОшибка);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = стрСостояниеВыполнения;
		Если ЗначениеЗаполнено(стрОшибка) Тогда
			Сообщение.Текст = Сообщение.Текст + Символы.ПС + Символы.ПС + "Ошибка очистки:" + Символы.ПС + стрОшибка;
		КонецЕсли;
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВывестиВерсию(Команда)
	бит_ТелефонияКлиентПереопределяемый.ПоказПредупреждение("Механизм синхронизации с БИТ.АТС, версия " + бит_АТСВыгрузкаИзменений.ПолучитьВерсиюМеханизмаСинхронизации());
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "БитАТС_ОчисткаБазыКлиентМенеджера" Тогда
		ОчиститьБазуНаАТСЗавершение(Параметр.Результат, Параметр.ПараметрОповещения);
	КонецЕсли;
КонецПроцедуры

