
Функция СформироватьУИДПоПравиламЦБ() Экспорт 
	
	Адаптеры = ПолучитьИнформациюОСетевыхАдаптерах();
	Адаптер = Адаптеры[0];	
	АдресСетевойКарты = Адаптер.MACАдрес;
	УУИД = ОбъектыСервер.СформироватьUUIDver1(ТекущаяДата(), АдресСетевойКарты);
	КонтрольныйСимвол = ОбъектыСервер.СгенерироватьКонтрольныйСимвол(СтрЗаменить(УУИД, "-", ""));
	Возврат УУИД + "-" + КонтрольныйСимвол;
	
КонецФункции

Функция ПолучитьОстатокПСЗ(Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.СуммаДООстаток, 0) КАК СуммаДООстаток
	|ИЗ
	|	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки КАК ЗадолженностьПоОбъектамОстатки
	|ГДЕ
	|	ЗадолженностьПоОбъектамОстатки.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Объект);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если Выборка.СуммаДООстаток <> Неопределено Тогда
		Если Выборка.СуммаДООстаток < 0 Тогда
			Возврат 0;
		Иначе
			Возврат Выборка.СуммаДООстаток;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции