&НаКлиенте
Функция ВидКатегорииКорректен(Вид, Категория, Конверт)

	//Письмо 1-класса заказное
	Если Вид = "LETTER_CLASS_1" И Категория = "ORDERED" И (Конверт = "A6" ИЛИ Конверт = "A7") Тогда
		Возврат Ложь;
	КонецЕсли;
	//Бандероль заказная
	Если Вид = "BANDEROL" И Категория = "ORDERED" И (Конверт = "A6" ИЛИ Конверт = "DL") Тогда
		Возврат Ложь;
	КонецЕсли;
	//Бандероль 1-класса заказная
	Если Вид = "BANDEROL_CLASS_1" И Категория = "ORDERED" И (Конверт = "A6" ИЛИ Конверт = "DL" ИЛИ Конверт = "A7") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // ()

&НаКлиенте
Процедура КонтрольВесаРПО() 
	
	Сообщение = Новый СообщениеПользователю;
	ТекстСообщения = "";

	Если Запись.ВесРПО >= 100 И (Запись.ВидРПО = "LETTER" ИЛИ Запись.ВидРПО = "LETTER_CLASS_1") Тогда
		ТекстСообщения = "Отправления весом более 100 граммов являются бандеролями!";
		Запись.ВидРПО = "BANDEROL";
	КонецЕсли;  
	
	Если Запись.ВесРПО < 100 И (Запись.ВидРПО = "BANDEROL" ИЛИ Запись.ВидРПО = "BANDEROL_CLASS_1") Тогда
		ТекстСообщения = "Отправления весом менее 100 граммов являются письмами!";
		Запись.ВидРПО = "LETTER";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();    
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПроверкаВидКатегоряКонверт();
	
	Вид = Запись.ВидРПО;
	Категория = Запись.КатегорияРПО;
	Конверт = Запись.ТипКонверта;
	ТекстСообщения = "Несоответствующий тип конверта для данных категории и вида РПО!";
	
	Если НЕ ВидКатегорииКорректен(Вид, Категория, Конверт) Тогда
	
		Запись.ТипКонверта = "";
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	
	КонецЕсли;

КонецПроцедуры	


&НаКлиенте
Процедура ВидРПОПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ВесРПО) Тогда
		КонтрольВесаРПО();
	КонецЕсли;
	
	ПроверкаВидКатегоряКонверт();
КонецПроцедуры

&НаКлиенте
Процедура КатегорияРПОПриИзменении(Элемент)
	Если Запись.КатегорияРПО = "SIMPLE" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Внимание! Для простых отправлений нельзя получить ШПИ!";
		Сообщение.Сообщить();
	КонецЕсли;
	ПроверкаВидКатегоряКонверт();
КонецПроцедуры

&НаКлиенте
Процедура ТипКонвертаПриИзменении(Элемент)
	ПроверкаВидКатегоряКонверт();
КонецПроцедуры

&НаКлиенте
Процедура ВесРПОПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.ВидРПО) Тогда
		КонтрольВесаРПО();
	КонецЕсли;
КонецПроцедуры
