
Процедура СоздатьНаСервере(ДОСсылка) Экспорт

	Договор = Документы.ДоговорМикрозайма.СоздатьДокумент();
	Договор.Дата = ТекущаяДатаСеанса();
	Договор.Займ = ДОСсылка;
	Договор.ПрограммаРасчета = Справочники.ПрограммыРасчетаЗайма.НайтиПоКоду("000000001");
	Договор.ДатаВыдачиЗайма = ОбъектыСервер.ПолучитьЗначениеСвойства(ДОСсылка, "0063     ");
	Договор.ДатаДоговора = ОбъектыСервер.ПолучитьЗначениеСвойства(ДОСсылка, "0061     ");
	Договор.ДатаПогашения = ОбъектыСервер.ПолучитьЗначениеСвойства(ДОСсылка, "0079     ");
	Договор.Срок = (Договор.ДатаПогашения - Договор.ДатаВыдачиЗайма) / 3600 / 24;

	Договор.СуммаВыданногоЗайма = ОбъектыСервер.ПолучитьЗначениеСвойства(ДОСсылка, "0062     ");
	Договор.ПроцентнаяСтавка = ОбъектыСервер.ПолучитьЗначениеСвойства(ДОСсылка, "0064     ");
	Договор.ВидПлатежа = Перечисления.ВидыПлатежей.Дифференцированный;
	Договор.ВидПроцентнойСтавки = Перечисления.ВидыПроцентнойСтавки.ФиксированнаяПроцентнаяСтавка;
	Договор.НомерДоговора = ДОСсылка.Наименование;
	Договор.ПериодичностьПроцентнойСтавки = Перечисления.ПериодичностьПроцентнойСтавки.День;
	Договор.ПериодичностьСрокаЗайма = Перечисления.ПериодичностьСрокаЗайма.День;
	Договор.КоличествоПериодичностей = 1;
	Договор.СпособПогашения = Перечисления.СпособыПогашенияЗаймов.НаДатуОкончанияДоговора;
	
	Список = РасчетЗадолженностиМФО.РассчитатьСписокПлатежей(Договор);
	График = РасчетЗадолженностиМФО.РассчитатьГрафикПлановыхПогашений(Договор, Список);	
	Для Каждого стр Из График Цикл
		стрТаб = Договор.ГрафикПлатежей.Добавить();
		ЗаполнитьЗначенияСвойств(стрТаб, стр);
	КонецЦикла;
	
	//Лебедева: Если загружены остатки на Дату цессии, раскомментировать
	
	//Договор.УчитыватьОстаткиНаДатуЦессии = Истина;

	//ЗаполнитьОстатки(Договор, ДОСсылка);
	Договор.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	РасчетЗадолженностиМФО.РассчитатьГрафикПоЗайму(Договор.Займ, Договор.ДатаВыдачиЗайма);

КонецПроцедуры

Процедура ЗаполнитьОстатки(Договор, ДО)	
	Договор.ОстаткиДата = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,"0052     ");
	Договор.ОстаткиОсновнойДолг = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,"0053     ");
	Договор.ОстаткиПросроченныеПроценты = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,"0054     ");
	//Договор.ОстаткиПроценты = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,"0054     ");
	//Какие проценты вы по факту загружаете  в ДО в рекв 54, по умолчанию это скорее всего просроченные проценты
	Договор.ОстаткиШтрафы = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,"0055     ");
	Договор.ОстаткиПени = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,"0056     ");
	Договор.ДниПросрочки  = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,"0087     ");
	Договор.ОстаткиСумма = Договор.ОстаткиОсновнойДолг + Договор.ОстаткиПросроченныеПроценты + Договор.ОстаткиПроценты + Договор.ОстаткиШтрафы + Договор.ОстаткиПени;
КонецПроцедуры

Процедура СоздатьДоговорМикрозаймаПриЗаписи(Источник, Отказ) Экспорт
	Если РасчетЗадолженностиМФО.ПолучитьТекущийДоговор(Источник.Ссылка, ТекущаяДатаСеанса()) = Неопределено Тогда
		СоздатьНаСервере(Источник.Ссылка);
		РасчетЗадолженностиМФО.РассчитатьГрафикПоЗайму(Источник.Ссылка, ТекущаяДатаСеанса());
	КонецЕсли;
КонецПроцедуры
	
Функция ПолучитьСписокМикрозаймов() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДолговыеОбязательства.Ссылка КАК Займ
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(&ТекущаяДата) КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	                      |		ПО ОбъектыВРаботеОстатки.Объект = ДолговыеОбязательства.Ссылка");
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции

Функция ПроизводитьРасчетыПоДанномуДолговомуОбязательству(ДО) Экспорт
	Возврат Истина;	
КонецФункции