
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДополнительныеРеквизитыИСведения.Ссылка,
	                      |	МАКСИМУМ(ЕСТьNULL(ДополнительныеРеквизитыИСведения1.Ссылка, 0)) КАК КолВо
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения1
	                      |		ПО ДополнительныеРеквизитыИСведения.Ссылка = ДополнительныеРеквизитыИСведения1.Родитель
	                      |			И (ДополнительныеРеквизитыИСведения1.ЭтоГруппа)
	                      |ГДЕ
	                      |	ДополнительныеРеквизитыИСведения.ЭтоГруппа
	                      |	И ДополнительныеРеквизитыИСведения.Предопределенный
	                      |	И ДополнительныеРеквизитыИСведения.Наименование ПОДОБНО ""%сведения%""
	                      |	И ДополнительныеРеквизитыИСведения.Родитель.Предопределенный
	                      |	 
	                      |СГРУППИРОВАТЬ ПО
	                      |	ДополнительныеРеквизитыИСведения.Ссылка");
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если Результат.КолВо = 0 Тогда
			Об = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьГруппу();
			Об.Родитель = Результат.Ссылка;
			Об.Наименование = "Основная";
			Об.ЭтоДополнительноеСведение = Истина;
			Об.ПорядковыйНомер = 1;
			Об.Записать();
		КонецЕсли;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДополнительныеРеквизитыИСведения.Ссылка
		               |ИЗ
		               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		               |ГДЕ
		               |	НЕ ДополнительныеРеквизитыИСведения.ЭтоГруппа
		               |	И ДополнительныеРеквизитыИСведения.Родитель = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Результат.Ссылка);
		Результат2 = Запрос.Выполнить().Выбрать();
		Пока Результат2.Следующий() Цикл
			Об2 = Результат2.Ссылка.ПолучитьОбъект();
			Об2.Родитель = ?(Результат.КолВо = 0, Об.Ссылка, Результат.КолВо);
			Об2.Записать();
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры
