
Процедура ПередЗаписью(Отказ)
	//
	////Если Код < "000000100" Тогда
	////	Запрос = Новый Запрос("ВЫБРАТЬ
	////						  |	МАКСИМУМ(ДополнительныеРеквизитыИСведения.Код) КАК Код
	////						  |ИЗ
	////						  |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения");
	////	Результат = Запрос.Выполнить().Выбрать();
	////	Результат.Следующий();
	////	КодНомер = Макс(Число(Результат.Код), 100) + 1;
	////	Код = Прав("000000" + Формат(КодНомер, "ЧН=; ЧГ="), 9);	
	////КонецЕсли;
	
	//
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Родитель", ЭтотОбъект.Родитель);
	Запрос.УстановитьПараметр("ПорядковыйНомер", ЭтотОбъект.ПорядковыйНомер);
	
	Если ЭтотОбъект.Предопределенный Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДополнительныеРеквизитыИСведения.Родитель КАК Родитель
		               |ИЗ
		               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		               |ГДЕ
		               |	ДополнительныеРеквизитыИСведения.Ссылка = &Ссылка";
		ЭтотОбъект.Родитель = Запрос.Выполнить().Выгрузить()[0].Родитель;
		Если ЭтотОбъект.ПорядковыйНомер = 0 Тогда
			ЭтотОбъект.ПорядковыйНомер = Число(ЭтотОбъект.Код);
		КонецЕсли;
	Иначе
		Если ЭтотОбъект.Ссылка.Пустая() И ЭтотОбъект.ПорядковыйНомер = 0 Тогда
			ЭтотОбъект.ПорядковыйНомер = ПолучитьПорядковыйНомер();		
		Иначе //Проверить что нет дублирования по порядковому номеру
			//Запрос.Текст = "ВЫБРАТЬ
			//			   |	КОЛИЧЕСТВО(*) КАК КолВо
			//			   |ИЗ
			//			   |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
			//			   |ГДЕ
			//			   |	ДополнительныеРеквизитыИСведения.Родитель = &Родитель
			//			   |	И ДополнительныеРеквизитыИСведения.ПорядковыйНомер = &ПорядковыйНомер"; 
			//Если Запрос.Выполнить().Выгрузить()[0].КолВо > 1 Тогда
			//	ЭтотОбъект.ПорядковыйНомер = ПолучитьПорядковыйНомер();			   
			//КонецЕсли;				   
		КонецЕсли;
	КонецЕсли;	
	
	
	//// ТУТ ОШИБКА!!!!!!
	
	// Проверить уникальность наименования доп.реквизита/сведения
	Если ЭтотОбъект.Ссылка <> ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка() Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ДополнительныеРеквизитыИСведения.Ссылка
		                      |ИЗ
		                      |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		                      |ГДЕ
		                      |	ДополнительныеРеквизитыИСведения.ЭтоГруппа = ЛОЖЬ
		                      |	И ДополнительныеРеквизитыИСведения.Наименование = &Наименование
		                      |	И ДополнительныеРеквизитыИСведения.Ссылка <> &Ссылка");
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ДополнительныеРеквизитыИСведения.Ссылка
		                      |ИЗ
		                      |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		                      |ГДЕ
		                      |	ДополнительныеРеквизитыИСведения.ЭтоГруппа = ЛОЖЬ
		                      |	И ДополнительныеРеквизитыИСведения.Наименование = &Наименование");						  
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.Наименование);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Сообщить("Дополнительный реквизит/сведение с таким наименованием уже существует!");
		Отказ = Истина;
	КонецЕсли;
		
	// Проверить уникальность наименования группы доп.сведений в рамках родителя
	Если ЭтотОбъект.Ссылка <> ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка() Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ДополнительныеРеквизитыИСведения.Ссылка
		                      |ИЗ
		                      |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		                      |ГДЕ
		                      |	ДополнительныеРеквизитыИСведения.ЭтоГруппа = ИСТИНА
		                      |	И ДополнительныеРеквизитыИСведения.Родитель = &Родитель
		                      |	И ДополнительныеРеквизитыИСведения.Наименование = &Наименование
		                      |	И ДополнительныеРеквизитыИСведения.Ссылка <> &Ссылка");
	Иначе 		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ДополнительныеРеквизитыИСведения.Ссылка
		                      |ИЗ
		                      |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		                      |ГДЕ
		                      |	ДополнительныеРеквизитыИСведения.ЭтоГруппа = ИСТИНА
		                      |	И ДополнительныеРеквизитыИСведения.Родитель = &Родитель
		                      |	И ДополнительныеРеквизитыИСведения.Наименование = &Наименование");
	КонецЕсли;
	Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.Наименование);
	Запрос.УстановитьПараметр("Родитель", ЭтотОбъект.Родитель);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Сообщить("Группа дополнительных сведений с таким наименованием уже существует для данного справочника!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


//Процедура ПередЗаписью(Отказ)
//	//
//	////Если Код < "000000100" Тогда
//	////	Запрос = Новый Запрос("ВЫБРАТЬ
//	////						  |	МАКСИМУМ(ДополнительныеРеквизитыИСведения.Код) КАК Код
//	////						  |ИЗ
//	////						  |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения");
//	////	Результат = Запрос.Выполнить().Выбрать();
//	////	Результат.Следующий();
//	////	КодНомер = Макс(Число(Результат.Код), 100) + 1;
//	////	Код = Прав("000000" + Формат(КодНомер, "ЧН=; ЧГ="), 9);	
//	////КонецЕсли;
//	
//	//
//	Запрос = Новый Запрос();
//	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
//	Запрос.УстановитьПараметр("Родитель", ЭтотОбъект.Родитель);
//	Запрос.УстановитьПараметр("ПорядковыйНомер", ЭтотОбъект.ПорядковыйНомер);
//	
//	Если ЭтотОбъект.Предопределенный Тогда
//		Запрос.Текст = "ВЫБРАТЬ
//		               |	ДополнительныеРеквизитыИСведения.Родитель КАК Родитель
//		               |ИЗ
//		               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
//		               |ГДЕ
//		               |	ДополнительныеРеквизитыИСведения.Ссылка = &Ссылка";
//		ЭтотОбъект.Родитель = Запрос.Выполнить().Выгрузить()[0].Родитель;
//		Если ЭтотОбъект.ПорядковыйНомер = 0 Тогда
//			ЭтотОбъект.ПорядковыйНомер = Число(ЭтотОбъект.Код);
//		КонецЕсли;
//	Иначе
//		Если ЭтотОбъект.Ссылка.Пустая() И ЭтотОбъект.ПорядковыйНомер = 0 Тогда
//			ЭтотОбъект.ПорядковыйНомер = ПолучитьПорядковыйНомер();		
//		Иначе //Проверить что нет дублирования по порядковому номеру
//			//Запрос.Текст = "ВЫБРАТЬ
//			//			   |	КОЛИЧЕСТВО(*) КАК КолВо
//			//			   |ИЗ
//			//			   |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
//			//			   |ГДЕ
//			//			   |	ДополнительныеРеквизитыИСведения.Родитель = &Родитель
//			//			   |	И ДополнительныеРеквизитыИСведения.ПорядковыйНомер = &ПорядковыйНомер"; 
//			//Если Запрос.Выполнить().Выгрузить()[0].КолВо > 1 Тогда
//			//	ЭтотОбъект.ПорядковыйНомер = ПолучитьПорядковыйНомер();			   
//			//КонецЕсли;				   
//		КонецЕсли;
//	КонецЕсли;	
//КонецПроцедуры


Функция ПолучитьПорядковыйНомер()
	Запрос = Новый Запрос();	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДополнительныеРеквизитыИСведения.ПорядковыйНомер КАК ПорядковыйНомер
	               |ИЗ
	               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	               |ГДЕ
	               |	ДополнительныеРеквизитыИСведения.Родитель = &Родитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПорядковыйНомер УБЫВ";
	Запрос.УстановитьПараметр("Родитель", ЭтотОбъект.Родитель);			   
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ПорядковыйНомер + 1;
	Иначе
		Возврат 1;
	КонецЕсли;
КонецФункции

Процедура ПередУдалением(Отказ)
	//Удаление из Спр. НаборыСвойств
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НаборыСвойствДополнительныеРеквизиты.Ссылка
	                      |ИЗ
	                      |	Справочник.НаборыСвойств.ДополнительныеРеквизиты КАК НаборыСвойствДополнительныеРеквизиты
	                      |ГДЕ
	                      |	НаборыСвойствДополнительныеРеквизиты.Свойство = &Свойство
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	НаборыСвойствДополнительныеРеквизиты.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	НаборыСвойствДополнительныеСведения.Ссылка
	                      |ИЗ
	                      |	Справочник.НаборыСвойств.ДополнительныеСведения КАК НаборыСвойствДополнительныеСведения
	                      |ГДЕ
	                      |	НаборыСвойствДополнительныеСведения.Свойство = &Свойство
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТипыДолговыхОбязательствДополнительныеРеквизиты.Ссылка
	                      |ИЗ
	                      |	Справочник.ТипыДолговыхОбязательств.ДополнительныеРеквизиты КАК ТипыДолговыхОбязательствДополнительныеРеквизиты
	                      |ГДЕ
	                      |	ТипыДолговыхОбязательствДополнительныеРеквизиты.Свойство = &Свойство
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТипыДолговыхОбязательствДополнительныеСведения.Ссылка
	                      |ИЗ
	                      |	Справочник.ТипыДолговыхОбязательств.ДополнительныеСведения КАК ТипыДолговыхОбязательствДополнительныеСведения
	                      |ГДЕ
	                      |	ТипыДолговыхОбязательствДополнительныеСведения.Свойство = &Свойство
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЮрФизЛицоДополнительныеРеквизиты.Ссылка
	                      |ИЗ
	                      |	Справочник.ЮрФизЛицо.ДополнительныеРеквизиты КАК ЮрФизЛицоДополнительныеРеквизиты
	                      |ГДЕ
	                      |	ЮрФизЛицоДополнительныеРеквизиты.Свойство = &Свойство
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЮрФизЛицоДополнительныеСведения.Ссылка
	                      |ИЗ
	                      |	Справочник.ЮрФизЛицо.ДополнительныеСведения КАК ЮрФизЛицоДополнительныеСведения
	                      |ГДЕ
	                      |	ЮрФизЛицоДополнительныеСведения.Свойство = &Свойство
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТипыДоговоровКонтрагентовДополнительныеРеквизиты.Ссылка
	                      |ИЗ
	                      |	Справочник.ТипыДоговоровКонтрагентов.ДополнительныеРеквизиты КАК ТипыДоговоровКонтрагентовДополнительныеРеквизиты
	                      |ГДЕ
	                      |	ТипыДоговоровКонтрагентовДополнительныеРеквизиты.Свойство = &Свойство
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТипыДоговоровКонтрагентовДополнительныеСведения.Ссылка
	                      |ИЗ
	                      |	Справочник.ТипыДоговоровКонтрагентов.ДополнительныеСведения КАК ТипыДоговоровКонтрагентовДополнительныеСведения
	                      |ГДЕ
	                      |	ТипыДоговоровКонтрагентовДополнительныеСведения.Свойство = &Свойство
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РезультатыМероприятийДополнительныеРеквизиты.Ссылка
	                      |ИЗ
	                      |	Справочник.РезультатыМероприятий.ДополнительныеРеквизиты КАК РезультатыМероприятийДополнительныеРеквизиты
	                      |ГДЕ
	                      |	РезультатыМероприятийДополнительныеРеквизиты.Свойство = &Свойство");
	Запрос.УстановитьПараметр("Свойство", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		НаборОбъект = Результат.Ссылка.ПолучитьОбъект();
		Строки = НаборОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ЭтотОбъект.Ссылка));
		Для Каждого Элемент Из Строки Цикл
			НаборОбъект.ДополнительныеРеквизиты.Удалить(Элемент);
		КонецЦикла;
		Строки = НаборОбъект.ДополнительныеСведения.НайтиСтроки(Новый Структура("Свойство", ЭтотОбъект.Ссылка));
		Для Каждого Элемент Из Строки Цикл
			НаборОбъект.ДополнительныеСведения.Удалить(Элемент);
		КонецЦикла;
		НаборОбъект.Записать();	
	КонецЦикла;	
	
	//Удаление из РС. ДополнительныеСведения
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Объект,
	               |	ДополнительныеСведения.Свойство
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |ГДЕ
	               |	ДополнительныеСведения.Свойство = &Свойство";
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
        Набор = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		Набор.Объект = Результат.Объект;
		Набор.Свойство = Результат.Свойство;
		Набор.Прочитать();
		Набор.Удалить();
	КонецЦикла;	
	
	//Удаление из доп. реквизитов справочников
	Если (Не ЭтотОбъект.ЭтоГруппа) И (Не ЭтотОбъект.ЭтоДополнительноеСведение) Тогда
		Стр = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьИмяПредопределенного(
				ЭтотОбъект.СправочникВладелец);
	    Стр = СтрЗаменить(Стр, "_", ".");
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таблица.Ссылка
		               |ИЗ
		               |	" + Стр + ".ДополнительныеРеквизиты КАК Таблица
		               |ГДЕ
		               |	Таблица.Свойство = &Свойство";
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
	        ЭлементОбъект = Результат.Ссылка.ПолучитьОбъект();
			Строки = ЭлементОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ЭтотОбъект.Ссылка));
			Для Каждого Элемент Из Строки Цикл
				ЭлементОбъект.ДополнительныеРеквизиты.Удалить(Элемент);
			КонецЦикла;
			ЭлементОбъект.Записать();
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры
