
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика. 
	//УсловияОтбора = Новый Структура("Займ", ПараметрКоманды);
	//ПараметрыФормы = Новый Структура("Отбор", УсловияОтбора);
	ПараметрыФормы = Новый Структура("Займ", ПараметрКоманды);
	ОткрытьФорму("РегистрНакопления.РасчетыПоДоговорам.Форма.ФормаРасчетИсковыхТребований",ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
