&НаСервере
Процедура ЗаполнитьДанныеПлательщиковНаСервере()
	Бит_Мандарин.ЗаполнитьРегистрДанныеПлательщиков();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПлательщиков(Команда)
	//Бит_Мандарин.ЗаполнитьРегистрДанныеПлательщиков(ВидТелефона,РеквизитEmail);
	ДлительнаяОперация = ВыполнитьФоновоеЗаданиеНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	// указываем необходимость вывода прогресса состояния
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	// указываем интервал обновления состояния в секундах, если не указать, 
	// то интервал будет увеличиваться при каждой итерации в 1.4 раза.
	ПараметрыОжидания.Интервал = 2;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,Новый ОписаниеОповещения("ВыполнитьПроцедуруФоновоВыполнено", ЭтотОбъект),ПараметрыОжидания);
КонецПроцедуры


&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидТелефона",ВидТелефона);
	СтруктураПараметров.Вставить("РеквизитEmail",РеквизитEmail);

		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'ЗаполнитьРегистрДанныеПлательщиков'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("Бит_Мандарин.ЗаполнитьРегистрДанныеПлательщиков",СтруктураПараметров,ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
КонецФункции

&НаКлиенте
Процедура ВыполнитьПроцедуруФоновоВыполнено(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Сообщить("При выполнении задачи Бит_Мандарин.ЗаполнитьРегистрДанныеПлательщиков произошла ошибка!");
	ИначеЕсли Результат = Ложь Тогда
		Сообщить("При заполнении данных о плательщиках произошла ошибка!");
	Иначе
		Сообщить("Данные плательщиков заполнены!");
		//ЭтаФорма.ОбновитьОтображениеДанных();
	КонецЕсли;

КонецПроцедуры
