
#Область ПрограммныйИнтерфейс

Функция РасчетСклоненийДлительнаяОперация(УникальныйИдентификатор) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Расчет склонений ФИО'");

	ПараметрыПроцедуры = Новый Структура;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбработкаСклоненияФИО.ДлительныйРасчет",
		ПараметрыПроцедуры,
		ПараметрыВыполнения
	);

	Возврат ДлительнаяОперация;

КонецФункции

Процедура ДлительныйРасчет(Параметры, Адрес) Экспорт

	РасчетСклоненийФИО();

КонецПроцедуры

Процедура РасчетСклоненийФИОВФоне() Экспорт

	РасчетСклоненийДлительнаяОперация(Новый УникальныйИдентификатор());

КонецПроцедуры

Процедура РасчетСклоненийФИО() Экспорт

	РегистрыСведений.ОчередьСклоненийФИО.Просклонять();

КонецПроцедуры

Процедура ДобавитьВОчередьВФоне(Контрагенты) Экспорт

	Параметры = Новый Массив;
	Параметры.Добавить(Контрагенты);
	ФоновыеЗадания.Выполнить(
		"ОбработкаСклоненияФИО.ДобавитьВОчередь",
		Параметры,
		Новый УникальныйИдентификатор(),
		"Добавление в очередь склонений ФИО"
	);

КонецПроцедуры

Процедура ДобавитьВОчередь(Контрагенты) Экспорт

	РегистрыСведений.ОчередьСклоненийФИО
		.Создать()
		.Контрагенты(Контрагенты)
		.Зафиксировать()
	;

КонецПроцедуры

Функция ЕстьНовыеДанные() Экспорт

	Возврат Не РегистрыСведений.ОчередьСклоненийФИО.Пустая();

КонецФункции // ()

#КонецОбласти
