Функция УровеньСтатуса(Статус) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БЛогер_Уровни.Порядок КАК Порядок
		|ИЗ
		|	Перечисление.БЛогер_Уровни КАК БЛогер_Уровни
		|ГДЕ
		|	БЛогер_Уровни.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Статус);
	РезультатЗапроса = Запрос.Выполнить();
	Результат = РезультатЗапроса.Выгрузить();
	
	Возврат Результат[0].Порядок;

КонецФункции // ()

Функция УровеньЖурнала(Статус) Экспорт

	Если Статус = Инфо Тогда
	
		Возврат УровеньЖурналаРегистрации.Информация;
	
	КонецЕсли;
	
	Если Статус = Внимание Тогда
	
		Возврат УровеньЖурналаРегистрации.Предупреждение;
	
	КонецЕсли;
	
	Если Статус = Ошибка Тогда
	
		Возврат УровеньЖурналаРегистрации.Ошибка;
	
	КонецЕсли;
	
	Возврат УровеньЖурналаРегистрации.Примечание;

КонецФункции // ()
