#Область ПрограммныйИнтерфейс

Функция НовыйФильтр() Экспорт

	Фильтр = Новый Структура;
	Фильтр.Вставить("НачалоПериода", Неопределено);
	Фильтр.Вставить("КонецПериода", Неопределено);
	Фильтр.Вставить("Количество", Неопределено);
	
	Возврат Фильтр;

КонецФункции // ()

Функция История(Клиент, Фильтр = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ &КоличествоЗаписей
		|	ХранилищеИсторииЧатов.Период КАК Дата,
		|	ХранилищеИсторииЧатов.Клиент КАК Клиент,
		|	ХранилищеИсторииЧатов.Мессенджер КАК Мессенджер,
		|	ХранилищеИсторииЧатов.НастройкаСохранения КАК НастройкаСохранения
		|ИЗ
		|	РегистрСведений.ХранилищеИсторииЧатов КАК ХранилищеИсторииЧатов
		|ГДЕ
		|	ХранилищеИсторииЧатов.ИмяАкаунта = &ИмяАкаунта
		|	&ПериодИстории
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	ВладелецЧата = УправлениеМетаданными.МенеджерОбъектаПоСсылке(Клиент)
		.ВладелецМесенджера(Клиент);
	Данные = РегистрыСведений.ИдентификаторыЧатовТелеграм
		.ДанныеАкаунта(ВладелецЧата);
	
	ИмяАкаунта = ?(ЗначениеЗаполнено(Данные), Данные["ИмяАкаунта"], Неопределено);
	Запрос.УстановитьПараметр("ИмяАкаунта", ИмяАкаунта);
	
	КоличествоЗаписей = ?(Фильтр["Количество"] = Неопределено, "", "ПЕРВЫЕ " + Фильтр["Количество"]);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&КоличествоЗаписей", КоличествоЗаписей);
	
	НачалоПериода = ?(Фильтр["НачалоПериода"] = Неопределено, "", " И ХранилищеИсторииЧатов.Период >= &Начало");
	КонецПериода = ?(Фильтр["КонецПериода"] = Неопределено, "", " И ХранилищеИсторииЧатов.Период <= &Конец");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПериодИстории", НачалоПериода + КонецПериода);

	Запрос.УстановитьПараметр("Начало", Фильтр["НачалоПериода"]);
	Запрос.УстановитьПараметр("Конец", Фильтр["КонецПериода"]);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции // ()

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти