
&НаКлиенте
Процедура ХранилищеФайловНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбработатьВыбранныйКаталог = Новый ОписаниеОповещения(
		"ОбработатьВыбранныйКаталог",
		ЭтотОбъект);
	
	КаталогНаСервере = ПолучитьКаталогПрикрепляемыхФайлов(
		Объект.ХранилищеФайлов);
	
	ФайловаяСистемаКлиент.ВыбратьКаталог(
		ОбработатьВыбранныйКаталог,
		"Выберете каталог сохранения истории общения в мессенджерах",
		КаталогНаСервере);
	
КонецПроцедуры

&НаКлиенте
Функция ОбработатьВыбранныйКаталог(ПутьККаталогу, ДополнительныеПараметры) Экспорт

	Если Не ПустаяСтрока(ПутьККаталогу) Тогда
	
		Объект.ХранилищеФайлов = ПутьККаталогу;
	
	КонецЕсли;

КонецФункции // ()

&НаСервереБезКонтекста
Функция ПолучитьКаталогПрикрепляемыхФайлов(ХранилищеФайлов)

	Если ПустаяСтрока(ХранилищеФайлов) Тогда
	
		Возврат Справочники.НастройкиИсторииЧатовФайловаяСистема
			.КаталогПоУмолчанию();
	
	КонецЕсли;
	
	Возврат ХранилищеФайлов;

КонецФункции // ()
