
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Объект.Назначение = "" Тогда
		Назначение = УЭДСервер.ПолучитьТипИзСтроки(Объект.Назначение);
		мсТекущийТип = Новый Массив;
		мсТекущийТип.Добавить(Назначение);
		ЭтаФорма.ДопустимыеТипы = Новый ОписаниеТипов(мсТекущийТип);
	КонецЕсли;
	Элементы.ШаблоныПечатныхФормИсходящийНомер.Видимость = ОбъектыСервер.ПолучитьЗначениеКонстанты("АвторегистрацияПечатныхФорм") И Не Объект.СклеиватьВОдинФайл;
	Элементы.ШаблоныПечатныхФормПрикреплять.Видимость = Не Объект.СклеиватьВОдинФайл;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Назначение = Строка(ДопустимыеТипы);
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПечатныхФормПрикреплятьПриИзменении(Элемент)
	Если ТипЗнч(Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.ШаблонПечатнойФормы) = Тип("СправочникСсылка.тсШаблоныПечатныхДокументов") Тогда
		Если Не Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.Прикреплять Тогда
			Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.ИсходящийНомер = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.Прикреплять = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПечатныхФормИсходящийНомерПриИзменении(Элемент)
	Если ТипЗнч(Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.ШаблонПечатнойФормы) = Тип("СправочникСсылка.тсШаблоныПечатныхДокументов") Тогда
		Если Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.ИсходящийНомер Тогда
			Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.Прикреплять = Истина;
		КонецЕсли;
	Иначе
		Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.ИсходящийНомер = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПечатныхФормШаблонПечатнойФормыПриИзменении(Элемент)
	Если ТипЗнч(Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.ШаблонПечатнойФормы) <> Тип("СправочникСсылка.тсШаблоныПечатныхДокументов") Тогда
		Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.ИсходящийНомер = Ложь;
		Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.Прикреплять = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СклеиватьВОдинФайлПриИзменении(Элемент)
	Для Каждого Эл Из Объект.ШаблоныПечатныхФорм Цикл
		Эл.Прикреплять = Ложь;
		Эл.ИсходящийНомер = Ложь;
	КонецЦикла;
	Элементы.ШаблоныПечатныхФормИсходящийНомер.Видимость = ОбъектыСервер.ПолучитьЗначениеКонстанты("АвторегистрацияПечатныхФорм") И Не Объект.СклеиватьВОдинФайл;
	Элементы.ШаблоныПечатныхФормПрикреплять.Видимость = Не Объект.СклеиватьВОдинФайл;
КонецПроцедуры
