
&НаКлиенте
Процедура Подбор(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьРеквизитыПослеПодбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ЗаполнениеСудебныхУчастковДолжников", "");
	ОткрытьФорму("Обработка.ПодборДО.Форма.ФормаДинамическийСписок",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПослеПодбора(РезультатЗакрытия,Параметры) Экспорт	
	ЗаполнитьАдресаДолжников();
	ЗаполнитьСУДолжников();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресаДолжников()
	ПВХСУ = Константы.АдресДляСудебногоУчастка.Получить();
	ВладелецПВХАдреса = ПВХСУ.СправочникВладелец;
	Если ВладелецПВХАдреса = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Контрагенты Тогда 
		Для Каждого Элемент Из Объект.Объекты Цикл
			Должник = Элемент.Объект.Должник;
			Элемент.Адрес = ОбъектыСервер.ПолучитьЗначениеСвойства(Должник,Константы.АдресДляСудебногоУчастка.Получить().Код); 
			Элемент.Должник = Должник; 
		КонецЦикла;
	Иначе
		Для Каждого Элемент Из Объект.Объекты Цикл
			Элемент.Адрес = ОбъектыСервер.ПолучитьЗначениеСвойства(Элемент.Объект,Константы.АдресДляСудебногоУчастка.Получить().Код);
			Элемент.Должник = Элемент.Объект.Должник;
		КонецЦикла;	
	КонецЕсли;	
	
	Если ПВХСУ.ВидСтроки = Перечисления.ВидыТипаСтрока.АдресФИАС Тогда
		Для Каждого Элемент Из Объект.Объекты Цикл
			Если ЗначениеЗаполнено(Элемент.Адрес) Тогда
				СтруктураJSON = бит_ИнтеграцияПочтаРФ.ПолучитьСтруктуруАдреса(Элемент.Адрес);
				Элемент.Адрес = Строка(СтруктураJSON.value);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ПВХСУ.ВидСтроки = Перечисления.ВидыТипаСтрока.Адрес Тогда
		Для Каждого Элемент Из Объект.Объекты Цикл
			Элемент.Адрес = бит_АдресныйКлассификатор.ПолучитьЧастьАдресаИзКЛАДР(Элемент.Адрес,"Представление");
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСУДолжников()	
	ВладелецПВХСУ = Константы.СудебныйУчастокОбъекта.Получить().СправочникВладелец;
	Если ВладелецПВХСУ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Контрагенты Тогда 
		Для Каждого Элемент Из Объект.Объекты Цикл
			Должник = Элемент.Объект.Должник;
			Элемент.СудебныйУчасток = ОбъектыСервер.ПолучитьЗначениеСвойства(Должник,Константы.СудебныйУчастокОбъекта.Получить().Код); 
		КонецЦикла;
	Иначе
		Для Каждого Элемент Из Объект.Объекты Цикл
			Элемент.СудебныйУчасток = ОбъектыСервер.ПолучитьЗначениеСвойства(Элемент.Объект,Константы.СудебныйУчастокОбъекта.Получить().Код); 
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ПользовательУслуги) Тогда
		ПользовательУслуги = Константы.СервисСУЛогин.Получить();	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
		Объект.Статус = Перечисления.ВидСтатусаЗаполненияСУ.ВПодготовке;
	ИначеЕсли Объект.Статус <> Перечисления.ВидСтатусаЗаполненияСУ.ВПодготовке Тогда
		Элементы.ОбъектыУдалитьОбъектыСУ.Видимость = Ложь;
		ТолькоПросмотрСИсключением();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТолькоПросмотрСИсключением()
	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") ИЛИ ТипЗнч(Элемент) = Тип("ТаблицаФормы") Тогда
			Элемент.ТолькоПросмотр = Истина;
		ИначеЕсли ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
			Элемент.Доступность = Ложь;
		КонецЕсли;
	КонецЦикла;
	Элементы.Объекты.ТолькоПросмотр = Ложь;
	Элементы.ОбъектыПометка.ТолькоПросмотр = Ложь;
	Элементы.ОбъектыСудебныйУчасток.ТолькоПросмотр = Ложь;
	Элементы.ОбъектыУстановитьФлажки.Доступность = Истина;
	Элементы.ОбъектыСнятьФлажки.Доступность = Истина;
	Элементы.ОбъектыПрименитьСудебныеУчастки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Элемент Из Объект.Объекты Цикл
		Элемент.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Элемент Из Объект.Объекты Цикл
		Элемент.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОбъектыСУ(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеУдалитьОбъектыСУ",ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Удалить объекты с заполненным судебным участком?",РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдалитьОбъектыСУ(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбТЧ = Объект.Объекты;
		Сч = ОбТЧ.Количество()-1;
		Пока Сч >= 0 Цикл
			ТекСтрока = ОбТЧ.Получить(Сч);
			Если ЗначениеЗаполнено(ТекСтрока.СудебныйУчасток) Тогда
				ОбТЧ.Удалить(Сч);
			КонецЕсли;
			Сч = Сч - 1;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВСервис(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеОтправитьВСервис",ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Отправить запрос в сервис? (после документ будет нельзя изменить!!!)",РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтправитьВСервис(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ИзменитьСтатусНаОтправленКлиент();
 		ТолькоПросмотрСИсключением();
		СервисСудебныеУчастки.ФоновоеЗаданиеСервис_СудебныеУчастки();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусНаОтправленКлиент()
	Объект.Статус = Перечисления.ВидСтатусаЗаполненияСУ.КОтправкеКлиент;
	ЭтотОбъект.Записать();
КонецПроцедуры

&НаСервере
Процедура ПрименитьСудебныеУчасткиНаСервере()
	ВладелецПВХСУ = Константы.СудебныйУчастокОбъекта.Получить().СправочникВладелец;
	мУстановитьУчастки = Объект.Объекты.НайтиСтроки(Новый Структура("Пометка",Истина));
	Если ВладелецПВХСУ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Контрагенты Тогда 
		Для Каждого СУ Из мУстановитьУчастки Цикл
			ОбъектыСервер.ЗаписатьЗначениеСвойства(СУ.Должник,Константы.СудебныйУчастокОбъекта.Получить().Код,СУ.СудебныйУчасток);			
		КонецЦикла;
	Иначе
		Для Каждого СУ Из мУстановитьУчастки Цикл
			ОбъектыСервер.ЗаписатьЗначениеСвойства(СУ.Объект,Константы.СудебныйУчастокОбъекта.Получить().Код,СУ.СудебныйУчасток);			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьСудебныеУчастки(Команда)
	ПрименитьСудебныеУчасткиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектПриИзменении(Элемент)
	 ТекущиеДанные = Элементы.Объекты.ТекущиеДанные;
	 ТекущиеДанные.Должник = ПолучитьДолжникаПоДОНаСервере(ТекущиеДанные.Объект);
	 ТекущиеДанные.СудебныйУчасток = ПолучитьСУПоДОНаСервере(ТекущиеДанные.Объект);
	 ТекущиеДанные.Адрес = ПолучитьАдресПоДОНаСервере(ТекущиеДанные.Объект);
КонецПроцедуры

&НаСервере
Функция ПолучитьДолжникаПоДОНаСервере(ДО)
	Должник = ДО.Должник;
	Возврат Должник;				 
КонецФункции

&НаСервере
Функция ПолучитьСУПоДОНаСервере(ДО)
	ВладелецПВХСУ = Константы.СудебныйУчастокОбъекта.Получить().СправочникВладелец;
	Если ВладелецПВХСУ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Контрагенты Тогда 
		Должник = ДО.Должник;
		СудебныйУчасток = ОбъектыСервер.ПолучитьЗначениеСвойства(Должник,Константы.СудебныйУчастокОбъекта.Получить().Код); 
	Иначе
		СудебныйУчасток = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,Константы.СудебныйУчастокОбъекта.Получить().Код); 
	КонецЕсли;	
	Возврат СудебныйУчасток;				 
КонецФункции

&НаСервере
Функция ПолучитьАдресПоДОНаСервере(ДО)
	ПВХСУ = Константы.АдресДляСудебногоУчастка.Получить();
	ВладелецПВХСУ = ПВХСУ.СправочникВладелец;
	Если ВладелецПВХСУ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Контрагенты Тогда 
		Должник = ДО.Должник;
		АдресДляСудебногоУчастка = ОбъектыСервер.ПолучитьЗначениеСвойства(Должник,Константы.АдресДляСудебногоУчастка.Получить().Код); 
	Иначе
		АдресДляСудебногоУчастка = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,Константы.АдресДляСудебногоУчастка.Получить().Код); 
	КонецЕсли;	
	Если ЗначениеЗаполнено(АдресДляСудебногоУчастка) И ПВХСУ.ВидСтроки = Перечисления.ВидыТипаСтрока.АдресФИАС Тогда
		СтруктураJSON = бит_ИнтеграцияПочтаРФ.ПолучитьСтруктуруАдреса(АдресДляСудебногоУчастка);
		АдресДляСудебногоУчастка = Строка(СтруктураJSON.value);	
	ИначеЕсли ПВХСУ.ВидСтроки = Перечисления.ВидыТипаСтрока.Адрес Тогда 
		АдресДляСудебногоУчастка = бит_АдресныйКлассификатор.ПолучитьЧастьАдресаИзКЛАДР(АдресДляСудебногоУчастка,"Представление");
	КонецЕсли;
	Возврат АдресДляСудебногоУчастка;				 
КонецФункции

&НаКлиенте
Процедура ОбъектыСудебныйУчастокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если НЕ Объект.Статус = ПредопределенноеЗначение("Перечисление.ВидСтатусаЗаполненияСУ.ВПодготовке") Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыСудебныйУчастокОчистка(Элемент, СтандартнаяОбработка)
	Если НЕ Объект.Статус = ПредопределенноеЗначение("Перечисление.ВидСтатусаЗаполненияСУ.ВПодготовке") Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры


