&НаКлиенте
Процедура Отбор_История()
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		Попытка
			ТекШПИ = Элементы.Список.ТекущиеДанные.ШПИ;
		Исключение
			ТекШПИ = Неопределено;
		КонецПопытки;	
	Иначе
		ТекШПИ = Неопределено;
	КонецЕсли;
	ИсторияТрекаТекущегоШПИ.Параметры.УстановитьЗначениеПараметра("ШПИ", ТекШПИ); 				
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Использовать = ИспользоватьИнтеграциюПочтаРФ();
	Если Использовать Тогда
		Отбор_История();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ИсторияТрекаТекущегоШПИ.Видимость = Константы.ИспользоватьИнтеграциюПочтаРФ.Получить();
КонецПроцедуры

&НаСервере
Функция ИспользоватьИнтеграциюПочтаРФ()
	Возврат Константы.ИспользоватьИнтеграциюПочтаРФ.Получить();
КонецФункции
