
Процедура ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийОбъекты, ТаблицаДвиженийСобытия, Отказ) Экспорт
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);					  

	ПараметрыПринятияВРаботу = Новый Структура("ГраницаДоДокумента, Период, Сотрудник, Подразделение,
			| Организация, Автор, Ссылка",
			ЭтотОбъект.Ссылка.МоментВремени(), ЭтотОбъект.Дата, 
			ЭтотОбъект.СотрудникПринимающий, ЭтотОбъект.ПодразделениеПринимающее, 
			ЭтотОбъект.Организация, ЭтотОбъект.Автор, ЭтотОбъект.Ссылка);
	ПараметрыЗавершенияРаботы = Новый Структура("ГраницаДоДокумента, Период, Сотрудник, Подразделение,
			| Организация, Автор, Ссылка",
			ЭтотОбъект.Ссылка.МоментВремени(), ЭтотОбъект.Дата, 
			ЭтотОбъект.СотрудникПередающий, ЭтотОбъект.ПодразделениеПередающее, 
			ЭтотОбъект.Организация, ЭтотОбъект.Автор, ЭтотОбъект.Ссылка);	
	
	ТаблицаДОПринятияВРаботу        = Неопределено;
	ТаблицаСобытийПринятияВРаботу   = Неопределено;
	ТаблицаДОЗавершенияРаботы       = Неопределено;
	ТаблицаСобытийЗавершенияРаботы  = Неопределено;
	
	//проследить вариант с одинаковыми подразделениями
	
	Если Не ИнициализироватьДанныеПринятияВРаботу(ПараметрыПринятияВРаботу, ТаблицаДОПринятияВРаботу, 
			ТаблицаСобытийПринятияВРаботу) Тогда
		Отказ = Истина;
	КонецЕсли;
	Если Не ИнициализироватьДанныеЗавершенияРаботы(ПараметрыЗавершенияРаботы, ТаблицаДОЗавершенияРаботы, 
			ТаблицаСобытийЗавершенияРаботы) Тогда
		Отказ = Истина;	
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТаблицаДОПринятияВРаботу", ТаблицаДОПринятияВРаботу);
	Запрос.УстановитьПараметр("ТаблицаСобытийПринятияВРаботу", ТаблицаСобытийПринятияВРаботу);
	Запрос.УстановитьПараметр("ТаблицаДОЗавершенияРаботы", ТаблицаДОЗавершенияРаботы);
	Запрос.УстановитьПараметр("ТаблицаСобытийЗавершенияРаботы", ТаблицаСобытийЗавершенияРаботы);
	
	Если ТаблицаДОПринятияВРаботу <> Неопределено Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Сотрудник,
		               |	Таблица.Объект,
		               |	Таблица.Количество,
		               |	Таблица.НомерСтроки,
		               |	Таблица.Организация,
		               |	Таблица.Подразделение
					   |ПОМЕСТИТЬ ТаблицаДОПринятияВРаботу
		               |ИЗ
		               |	&ТаблицаДОПринятияВРаботу КАК Таблица";
		Если ПараметрыПринятияВРаботу.Подразделение = ПараметрыЗавершенияРаботы.Подразделение Тогда
			Запрос.Текст = Запрос.Текст + "
					   |ГДЕ 
					   |    Таблица.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)"
		КонецЕсли;				   
		Запрос.Текст = Запрос.Текст + "
					   |;
					   |
		               |ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Объект,
		               |	Таблица.ВидСобытия,
		               |	Таблица.ИсточникСобытия,
		               |	Таблица.Сотрудник,
		               |	Таблица.Подразделение,
					   |	Таблица.Автор,
		               |	Таблица.НомерСтроки
		               |ПОМЕСТИТЬ ТаблицаСобытийПринятияВРаботу
		               |ИЗ
		               |	&ТаблицаСобытийПринятияВРаботу КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаСобытийПринятияВРаботу.Период,
		               |	ТаблицаСобытийПринятияВРаботу.ВидДвижения,
		               |	ТаблицаСобытийПринятияВРаботу.Объект,
		               |	ТаблицаСобытийПринятияВРаботу.ВидСобытия,
		               |	ТаблицаСобытийПринятияВРаботу.ИсточникСобытия,
		               |	ТаблицаСобытийПринятияВРаботу.Сотрудник,
		               |	ТаблицаСобытийПринятияВРаботу.Автор,
		               |	ТаблицаСобытийПринятияВРаботу.НомерСтроки,
					   |    ТаблицаСобытийПринятияВРаботу.Подразделение
		               |ИЗ
		               |	ТаблицаСобытийПринятияВРаботу КАК ТаблицаСобытийПринятияВРаботу
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДОПринятияВРаботу КАК ТаблицаДОПринятияВРаботу
		               |		ПО ТаблицаСобытийПринятияВРаботу.Объект = ТаблицаДОПринятияВРаботу.Объект
		               |			И ТаблицаСобытийПринятияВРаботу.Сотрудник = ТаблицаДОПринятияВРаботу.Сотрудник
		               |			И ТаблицаСобытийПринятияВРаботу.Подразделение = ТаблицаДОПринятияВРаботу.Подразделение
					   |;
					   |
					   |ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Сотрудник,
		               |	Таблица.Объект,
		               |	Таблица.Количество,
		               |	Таблица.НомерСтроки,
		               |	Таблица.Организация,
		               |	Таблица.Подразделение
		               |ИЗ
		               |	ТаблицаДОПринятияВРаботу КАК Таблица";
		Результат = Запрос.ВыполнитьПакет();
		ТаблицаСобытийПринятияВРаботу = Результат[2].Выгрузить();
		ТаблицаДОПринятияВРаботу = Результат[3].Выгрузить();
	КонецЕсли;	
	Если ТаблицаДОЗавершенияРаботы <> Неопределено Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Сотрудник,
		               |	Таблица.Объект,
		               |	Таблица.Количество,
		               |	Таблица.НомерСтроки,
		               |	Таблица.Организация,
		               |	Таблица.Подразделение
					   |ПОМЕСТИТЬ ТаблицаДОЗавершенияРаботы
		               |ИЗ
		               |	&ТаблицаДОЗавершенияРаботы КАК Таблица";
		Если ПараметрыПринятияВРаботу.Подразделение = ПараметрыЗавершенияРаботы.Подразделение Тогда
			Запрос.Текст = Запрос.Текст + "
					   |ГДЕ 
					   |    Таблица.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)"
		КонецЕсли;				   
		Запрос.Текст = Запрос.Текст + "
					   |;   
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Объект,
		               |	Таблица.ВидСобытия,
		               |	Таблица.ИсточникСобытия,
		               |	Таблица.Сотрудник,
		               |	Таблица.Подразделение,
		               |	Таблица.Автор,
		               |	Таблица.НомерСтроки
		               |ПОМЕСТИТЬ ТаблицаСобытийЗавершенияРаботы
		               |ИЗ
		               |	&ТаблицаСобытийЗавершенияРаботы КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаСобытийЗавершенияРаботы.Период,
		               |	ТаблицаСобытийЗавершенияРаботы.ВидДвижения,
					   |	ТаблицаСобытийЗавершенияРаботы.Объект,
		               |	ТаблицаСобытийЗавершенияРаботы.ВидСобытия,
		               |	ТаблицаСобытийЗавершенияРаботы.ИсточникСобытия,
		               |	ТаблицаСобытийЗавершенияРаботы.Сотрудник,
		               |	ТаблицаСобытийЗавершенияРаботы.Автор,
		               |	ТаблицаСобытийЗавершенияРаботы.НомерСтроки,
					   |    ТаблицаСобытийЗавершенияРаботы.Подразделение
		               |ИЗ
		               |	ТаблицаСобытийЗавершенияРаботы КАК ТаблицаСобытийЗавершенияРаботы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДОЗавершенияРаботы КАК ТаблицаДОЗавершенияРаботы
		               |		ПО ТаблицаСобытийЗавершенияРаботы.Объект = ТаблицаДОЗавершенияРаботы.Объект
		               |			И ТаблицаСобытийЗавершенияРаботы.Сотрудник = ТаблицаДОЗавершенияРаботы.Сотрудник
		               |			И ТаблицаСобытийЗавершенияРаботы.Подразделение = ТаблицаДОЗавершенияРаботы.Подразделение
					   |;
					   |
					   |ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Сотрудник,
		               |	Таблица.Объект,
		               |	Таблица.Количество,
		               |	Таблица.НомерСтроки,
		               |	Таблица.Организация,
		               |	Таблица.Подразделение
					   |ИЗ
		               |	ТаблицаДОЗавершенияРаботы КАК Таблица";
		Результат = Запрос.ВыполнитьПакет();
		ТаблицаСобытийЗавершенияРаботы = Результат[2].Выгрузить();
		ТаблицаДОЗавершенияРаботы = Результат[3].Выгрузить();
	КонецЕсли;
	
	Если ТаблицаДОПринятияВРаботу <> Неопределено И ТаблицаДОЗавершенияРаботы <> Неопределено Тогда
		Запрос.УстановитьПараметр("ТаблицаДОПринятияВРаботу", ТаблицаДОПринятияВРаботу);
		Запрос.УстановитьПараметр("ТаблицаСобытийПринятияВРаботу", ТаблицаСобытийПринятияВРаботу);
		Запрос.УстановитьПараметр("ТаблицаДОЗавершенияРаботы", ТаблицаДОЗавершенияРаботы);
		Запрос.УстановитьПараметр("ТаблицаСобытийЗавершенияРаботы", ТаблицаСобытийЗавершенияРаботы);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Сотрудник,
		               |	Таблица.Объект,
		               |	Таблица.Количество,
		               |	Таблица.НомерСтроки,
		               |	Таблица.Организация,
		               |	Таблица.Подразделение
		               |ПОМЕСТИТЬ ТаблицаДОЗавершенияРаботы
		               |ИЗ
		               |	&ТаблицаДОЗавершенияРаботы КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Объект,
		               |	Таблица.ВидСобытия,
		               |	Таблица.ИсточникСобытия,
		               |	Таблица.Сотрудник,
		               |	Таблица.Подразделение,
		               |	Таблица.Автор,
		               |	Таблица.НомерСтроки
		               |ПОМЕСТИТЬ ТаблицаСобытийЗавершенияРаботы
		               |ИЗ
		               |	&ТаблицаСобытийЗавершенияРаботы КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Сотрудник,
		               |	Таблица.Объект,
		               |	Таблица.Количество,
		               |	Таблица.НомерСтроки,
		               |	Таблица.Организация,
		               |	Таблица.Подразделение
		               |ПОМЕСТИТЬ ТаблицаДОПринятияВРаботу
		               |ИЗ
		               |	&ТаблицаДОПринятияВРаботу КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Объект,
		               |	Таблица.ВидСобытия,
		               |	Таблица.ИсточникСобытия,
		               |	Таблица.Сотрудник,
		               |	Таблица.Подразделение,
		               |	Таблица.Автор,
		               |	Таблица.НомерСтроки
		               |ПОМЕСТИТЬ ТаблицаСобытийПринятияВРаботу
		               |ИЗ
		               |	&ТаблицаСобытийПринятияВРаботу КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаДОЗавершенияРаботы.Период,
		               |	ТаблицаДОЗавершенияРаботы.ВидДвижения,
		               |	ТаблицаДОЗавершенияРаботы.Сотрудник,
		               |	ТаблицаДОЗавершенияРаботы.Объект,
		               |	ТаблицаДОЗавершенияРаботы.Количество,
		               |	ТаблицаДОЗавершенияРаботы.НомерСтроки,
		               |	ТаблицаДОЗавершенияРаботы.Организация,
		               |	ТаблицаДОЗавершенияРаботы.Подразделение
		               |ИЗ
		               |	ТаблицаДОЗавершенияРаботы КАК ТаблицаДОЗавершенияРаботы
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ТаблицаДОПринятияВРаботу.Период,
		               |	ТаблицаДОПринятияВРаботу.ВидДвижения,
		               |	ТаблицаДОПринятияВРаботу.Сотрудник,
		               |	ТаблицаДОПринятияВРаботу.Объект,
		               |	ТаблицаДОПринятияВРаботу.Количество,
		               |	ТаблицаДОПринятияВРаботу.НомерСтроки,
		               |	ТаблицаДОПринятияВРаботу.Организация,
		               |	ТаблицаДОПринятияВРаботу.Подразделение
		               |ИЗ
		               |	ТаблицаДОПринятияВРаботу КАК ТаблицаДОПринятияВРаботу
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаСобытийЗавершенияРаботы.Период,
		               |	ТаблицаСобытийЗавершенияРаботы.ВидДвижения,
		               |	ТаблицаСобытийЗавершенияРаботы.Объект,
		               |	ТаблицаСобытийЗавершенияРаботы.ВидСобытия,
		               |	ТаблицаСобытийЗавершенияРаботы.ИсточникСобытия,
		               |	ТаблицаСобытийЗавершенияРаботы.Сотрудник,
		               |	ТаблицаСобытийЗавершенияРаботы.Автор,
		               |	ТаблицаСобытийЗавершенияРаботы.НомерСтроки
		               |ИЗ
		               |	ТаблицаСобытийЗавершенияРаботы КАК ТаблицаСобытийЗавершенияРаботы
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ТаблицаСобытийПринятияВРаботу.Период,
		               |	ТаблицаСобытийПринятияВРаботу.ВидДвижения,
		               |	ТаблицаСобытийПринятияВРаботу.Объект,
		               |	ТаблицаСобытийПринятияВРаботу.ВидСобытия,
		               |	ТаблицаСобытийПринятияВРаботу.ИсточникСобытия,
		               |	ТаблицаСобытийПринятияВРаботу.Сотрудник,
		               |	ТаблицаСобытийПринятияВРаботу.Автор,
		               |	ТаблицаСобытийПринятияВРаботу.НомерСтроки
		               |ИЗ
		               |	ТаблицаСобытийПринятияВРаботу КАК ТаблицаСобытийПринятияВРаботу";
		Результат = Запрос.ВыполнитьПакет();
		ТаблицаДвиженийОбъекты = Результат[4].Выгрузить();
		ТаблицаДвиженийСобытия = Результат[5].Выгрузить();
	ИначеЕсли ТаблицаДОЗавершенияРаботы <> Неопределено Тогда
		ТаблицаДвиженийОбъекты = ТаблицаДОЗавершенияРаботы;
		ТаблицаДвиженийСобытия = ТаблицаСобытийЗавершенияРаботы;
	Иначе
		ТаблицаДвиженийОбъекты = ТаблицаДОПринятияВРаботу;
		ТаблицаДвиженийСобытия = ТаблицаСобытийПринятияВРаботу;
	КонецЕсли;
КонецПроцедуры

Функция ИнициализироватьДанныеЗавершенияРаботы(Параметры, ТаблицаДолговыхОбязательств, ТаблицаСобытий)
	Если Параметры.Подразделение.Пустая() И Параметры.Сотрудник.Пустая() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос();	
	Запрос.УстановитьПараметр("ГраницаДоДокумента",	Параметры.ГраницаДоДокумента);
	Запрос.УстановитьПараметр("Период",	Параметры.Период);
	Запрос.УстановитьПараметр("Сотрудник", Параметры.Сотрудник);
	Запрос.УстановитьПараметр("Подразделение", Параметры.Подразделение);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("Автор", Параметры.Автор);
	Запрос.УстановитьПараметр("Ссылка", Параметры.Ссылка);
		
	Если Параметры.Подразделение.Пустая() Тогда
		Запрос.Текст = "";
	ИначеЕсли Параметры.Сотрудник.Пустая() Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		               |		ИНАЧЕ АктПередачиОбъекты.Объект
		               |	КОНЕЦ КАК Объект,
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) КАК ОстатокВРаботе,
		               |	МИНИМУМ(АктПередачиОбъекты.НомерСтроки) КАК НомерСтроки,
		               |	ОбъектыВРаботеОстатки.Сотрудник
		               |ПОМЕСТИТЬ Таблица
		               |ИЗ
		               |	Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(&ГраницаДоДокумента, Подразделение = &Подразделение) КАК ОбъектыВРаботеОстатки
		               |		ПО (АктПередачиОбъекты.Объект = ОбъектыВРаботеОстатки.Объект
		               |				ИЛИ ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец = ОбъектыВРаботеОстатки.Объект)
		               |ГДЕ
		               |	АктПередачиОбъекты.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		               |		ИНАЧЕ АктПередачиОбъекты.Объект
		               |	КОНЕЦ,
		               |	ОбъектыВРаботеОстатки.Сотрудник,
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		               |	&Подразделение КАК Подразделение,
		               |	Таблица.Объект,
		               |	1 КАК Количество,
		               |	Таблица.НомерСтроки,
		               |	ВЫБОР
		               |		КОГДА Таблица.ОстатокВРаботе > 0
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК ОтказПоПодразделению,
		               |	&Организация,
		               |	Таблица.Сотрудник
		               |ИЗ
		               |	Таблица КАК Таблица
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ОтказПоПодразделению,
		               |	Таблица.НомерСтроки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		               |	Таблица.Объект,
		               |	ВЫБОР
		               |		КОГДА Таблица.Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗавершенаРаботаПодразделения)
		               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗавершенаРаботаСотрудника)
		               |	КОНЕЦ КАК ВидСобытия,
		               |	&Ссылка КАК ИсточникСобытия,
		               |	&Подразделение КАК Подразделение,
		               |	&Автор,
		               |	Таблица.НомерСтроки КАК НомерСтроки,
		               |	Таблица.Сотрудник КАК Сотрудник
		               |ИЗ
		               |	Таблица КАК Таблица
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Сотрудник УБЫВ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ Таблица";
	Иначе //Подразеделине и Отвественный не пустые
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		               |		ИНАЧЕ АктПередачиОбъекты.Объект
		               |	КОНЕЦ КАК Объект,
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) КАК ОстатокВРаботе,
		               |	МИНИМУМ(АктПередачиОбъекты.НомерСтроки) КАК НомерСтроки
		               |ПОМЕСТИТЬ Таблица
		               |ИЗ
		               |	Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		               |				&ГраницаДоДокумента,
		               |				Подразделение = &Подразделение
		               |					И Сотрудник = &Сотрудник) КАК ОбъектыВРаботеОстатки
		               |		ПО (АктПередачиОбъекты.Объект = ОбъектыВРаботеОстатки.Объект
		               |				ИЛИ ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец = ОбъектыВРаботеОстатки.Объект)
		               |ГДЕ
		               |	АктПередачиОбъекты.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		               |		ИНАЧЕ АктПередачиОбъекты.Объект
		               |	КОНЕЦ,
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		               |	&Сотрудник КАК Сотрудник,
		               |	Таблица.Объект,
		               |	1 КАК Количество,
		               |	Таблица.НомерСтроки,
		               |	ВЫБОР
		               |		КОГДА Таблица.ОстатокВРаботе > 0
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК ОтказПоСотруднику,
		               |	&Организация,
		               |	&Подразделение
		               |ИЗ
		               |	Таблица КАК Таблица
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ОтказПоСотруднику УБЫВ,
		               |	Таблица.НомерСтроки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		               |	Таблица.Объект,
		               |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗавершенаРаботаСотрудника) КАК ВидСобытия,
		               |	&Ссылка КАК ИсточникСобытия,
		               |	&Сотрудник КАК Сотрудник,
		               |	&Подразделение,
		               |	&Автор,
		               |	Таблица.НомерСтроки КАК НомерСтроки
		               |ИЗ
		               |	Таблица КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ Таблица";
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();                             
	ТаблицаДолговыхОбязательств = Результат[1].Выгрузить();
	ТаблицаСобытий = Результат[2].Выгрузить();
	 
	Если ТаблицаДолговыхОбязательств.Количество() > 0 Тогда
		Попытка 
			Если ТаблицаДолговыхОбязательств[0].ОтказПоСотруднику = Истина Тогда
				ШаблонСообщения = НСтр("ru = ""Объект: %Объект% не числится в работе у сотрудника %Сотрудник%.""");
				ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Объект%", ТаблицаДолговыхОбязательств[0].Объект);	
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Сотрудник%", ТаблицаДолговыхОбязательств[0].Сотрудник);	
				УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Параметры.Ссылка,,,);
				Возврат Ложь;
			КонецЕсли;
		Исключение
		КонецПопытки;
		Попытка
			Если ТаблицаДолговыхОбязательств[0].ОтказПоПодразделению = Истина Тогда
				ШаблонСообщения = НСтр("ru = ""Объект: %Объект% не числится в работе у подразделения %Подразделение%.""");
	            ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Объект%", ТаблицаДолговыхОбязательств[0].Объект);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Подразделение%", ТаблицаДолговыхОбязательств[0].Подразделение);		
				УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Параметры.Ссылка,,,);
		    	Возврат Ложь;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;	
	Возврат Истина;
КонецФункции

Функция ИнициализироватьДанныеПринятияВРаботу(Параметры, ТаблицаДолговыхОбязательств, ТаблицаСобытий)
	Если Параметры.Подразделение.Пустая() И Параметры.Сотрудник.Пустая() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос();	
	Запрос.УстановитьПараметр("ГраницаДоДокумента",	Параметры.ГраницаДоДокумента);
	Запрос.УстановитьПараметр("Период",	Параметры.Период);
	Запрос.УстановитьПараметр("Сотрудник", Параметры.Сотрудник);
	Запрос.УстановитьПараметр("Подразделение", Параметры.Подразделение);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("Автор", Параметры.Автор);
	Запрос.УстановитьПараметр("Ссылка", Параметры.Ссылка);
		
	Если Параметры.Подразделение.Пустая() Тогда
        Запрос.Текст = ""; 
		//Проверка на В РАБОТЕ организации
		//Исключить те, у которых уже есть в работе Сотр
	ИначеЕсли Параметры.Сотрудник.Пустая() Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		               |		ИНАЧЕ АктПередачиОбъекты.Объект
		               |	КОНЕЦ КАК Объект,
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) КАК ОстатокВРаботе,
		               |	МИНИМУМ(АктПередачиОбъекты.НомерСтроки) КАК НомерСтроки
		               |ПОМЕСТИТЬ Таблица
		               |ИЗ
		               |	Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		               |				&ГраницаДоДокумента,
		               |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		               |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		               |		ПО (АктПередачиОбъекты.Объект = ОбъектыВРаботеОстатки.Объект
		               |				ИЛИ ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец = ОбъектыВРаботеОстатки.Объект)
		               |ГДЕ
		               |	АктПередачиОбъекты.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		               |		ИНАЧЕ АктПередачиОбъекты.Объект
		               |	КОНЕЦ,
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		               |	&Подразделение КАК Подразделение,
		               |	Таблица.Объект,
		               |	1 КАК Количество,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК ОтказПоПодразделению,
		               |	Таблица.ОстатокВРаботе КАК ОстатокВРаботе,
		               |	Таблица.НомерСтроки КАК НомерСтроки,
		               |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец КАК Организация,
		               |	&Сотрудник
		               |ИЗ
		               |	Таблица КАК Таблица
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		               |				&ГраницаДоДокумента,
		               |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		               |					И Подразделение = &Подразделение
		               |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		               |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		               |ГДЕ
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	&Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		               |	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
		               |	Таблица.Объект,
		               |	1,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ,
		               |	Таблица.ОстатокВРаботе,
		               |	Таблица.НомерСтроки,
		               |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец,
		               |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		               |ИЗ
		               |	Таблица КАК Таблица
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		               |				&ГраницаДоДокумента,
		               |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		               |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		               |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		               |ГДЕ
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ОстатокВРаботе,
		               |	ОтказПоПодразделению,
		               |	НомерСтроки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		               |	Таблица.Объект,
		               |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ПринятоВРаботуПодразделения) КАК ВидСобытия,
		               |	&Ссылка КАК ИсточникСобытия,
		               |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Сотрудник,
		               |	&Подразделение КАК Подразделение,
		               |	&Сотрудник КАК Сотрудник1,
		               |	&Автор,
		               |	Таблица.НомерСтроки КАК НомерСтроки
		               |ИЗ
		               |	Таблица КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ Таблица";
		//Проверка на В РАБОТЕ организации
        //Исключить те, которые есть в работе Подр
	Иначе //Подразделение и Сотрудник не пустые
		 //////////////////Запрос.Текст = "ВЫБРАТЬ
		 //////////////////               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		 //////////////////               |		КОГДА ТИП(Справочник.ИсполнительныеДокументы)
		 //////////////////               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.ИсполнительныеДокументы).Владелец
		 //////////////////               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		 //////////////////               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		 //////////////////               |		ИНАЧЕ АктПередачиОбъекты.Объект
		 //////////////////               |	КОНЕЦ КАК Объект,
		 //////////////////               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) КАК ОстатокВРаботе,
		 //////////////////               |	МИНИМУМ(АктПередачиОбъекты.НомерСтроки) КАК НомерСтроки
		 //////////////////               |ПОМЕСТИТЬ Таблица
		 //////////////////               |ИЗ
		 //////////////////               |	Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		 //////////////////               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		 //////////////////               |				&ГраницаДоДокумента,
		 //////////////////               |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		 //////////////////               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		 //////////////////               |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		 //////////////////               |		ПО (АктПередачиОбъекты.Объект = ОбъектыВРаботеОстатки.Объект
		 //////////////////               |				ИЛИ ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.ИсполнительныеДокументы).Владелец = ОбъектыВРаботеОстатки.Объект
		 //////////////////               |				ИЛИ ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец = ОбъектыВРаботеОстатки.Объект)
		 //////////////////               |ГДЕ
		 //////////////////               |	АктПередачиОбъекты.Ссылка = &Ссылка
		 //////////////////               |
		 //////////////////               |СГРУППИРОВАТЬ ПО
		 //////////////////               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		 //////////////////               |		КОГДА ТИП(Справочник.ИсполнительныеДокументы)
		 //////////////////               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.ИсполнительныеДокументы).Владелец
		 //////////////////               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		 //////////////////               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		 //////////////////               |		ИНАЧЕ АктПередачиОбъекты.Объект
		 //////////////////               |	КОНЕЦ,
		 //////////////////               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0)
		 //////////////////               |;
		 //////////////////               |
		 //////////////////               |////////////////////////////////////////////////////////////////////////////////
		 //////////////////               |ВЫБРАТЬ
		 //////////////////               |	&Период,
		 //////////////////               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		 //////////////////               |	&Подразделение КАК Подразделение,
		 //////////////////               |	Таблица.Объект,
		 //////////////////               |	1 КАК Количество,
		 //////////////////               |	ЛОЖЬ КАК ОтказПоСотруднику,
		 //////////////////               |	ВЫБОР
		 //////////////////               |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		 //////////////////               |			ТОГДА ИСТИНА
		 //////////////////               |		ИНАЧЕ ЛОЖЬ
		 //////////////////               |	КОНЕЦ КАК ОтказПоПодразделению,
		 //////////////////               |	Таблица.ОстатокВРаботе КАК ОстатокВРаботе,
		 //////////////////               |	Таблица.НомерСтроки КАК НомерСтроки,
		 //////////////////               |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец КАК Организация,
		 //////////////////               |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Сотрудник
		 //////////////////               |ИЗ
		 //////////////////               |	Таблица КАК Таблица
		 //////////////////               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		 //////////////////               |				&ГраницаДоДокумента,
		 //////////////////               |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		 //////////////////               |					И Подразделение = &Подразделение
		 //////////////////               |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		 //////////////////               |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		 //////////////////               |ГДЕ
		 //////////////////               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		 //////////////////               |
		 //////////////////               |ОБЪЕДИНИТЬ ВСЕ
		 //////////////////               |
		 //////////////////               |ВЫБРАТЬ
		 //////////////////               |	&Период,
		 //////////////////               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		 //////////////////               |	&Подразделение,
		 //////////////////               |	Таблица.Объект,
		 //////////////////               |	1,
		 //////////////////               |	ВЫБОР
		 //////////////////               |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		 //////////////////               |			ТОГДА ИСТИНА
		 //////////////////               |		ИНАЧЕ ЛОЖЬ
		 //////////////////               |	КОНЕЦ,
		 //////////////////               |	ВЫБОР
		 //////////////////               |		КОГДА Таблица.ОстатокВРаботе > 0
		 //////////////////               |			ТОГДА ЛОЖЬ
		 //////////////////               |		ИНАЧЕ ИСТИНА
		 //////////////////               |	КОНЕЦ,
		 //////////////////               |	Таблица.ОстатокВРаботе,
		 //////////////////               |	Таблица.НомерСтроки,
		 //////////////////               |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец,
		 //////////////////               |	&Сотрудник
		 //////////////////               |ИЗ
		 //////////////////               |	Таблица КАК Таблица
		 //////////////////               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		 //////////////////               |				&ГраницаДоДокумента,
		 //////////////////               |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		 //////////////////               |					И Подразделение = &Подразделение
		 //////////////////               |					И Сотрудник = &Сотрудник) КАК ОбъектыВРаботеОстатки
		 //////////////////               |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		 //////////////////               |ГДЕ
		 //////////////////               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		 //////////////////               |
		 //////////////////               |ОБЪЕДИНИТЬ ВСЕ
		 //////////////////               |
		 //////////////////               |ВЫБРАТЬ
		 //////////////////               |	&Период,
		 //////////////////               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		 //////////////////               |	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
		 //////////////////               |	Таблица.Объект,
		 //////////////////               |	1,
		 //////////////////               |	ВЫБОР
		 //////////////////               |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		 //////////////////               |			ТОГДА ИСТИНА
		 //////////////////               |		ИНАЧЕ ЛОЖЬ
		 //////////////////               |	КОНЕЦ,
		 //////////////////               |	ВЫБОР
		 //////////////////               |		КОГДА Таблица.ОстатокВРаботе > 0
		 //////////////////               |			ТОГДА ЛОЖЬ
		 //////////////////               |		ИНАЧЕ ИСТИНА
		 //////////////////               |	КОНЕЦ,
		 //////////////////               |	Таблица.ОстатокВРаботе,
		 //////////////////               |	Таблица.НомерСтроки,
		 //////////////////               |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец,
		 //////////////////               |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		 //////////////////               |ИЗ
		 //////////////////               |	Таблица КАК Таблица
		 //////////////////               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		 //////////////////               |				&ГраницаДоДокумента,
		 //////////////////               |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		 //////////////////               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		 //////////////////               |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		 //////////////////               |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		 //////////////////               |ГДЕ
		 //////////////////               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		 //////////////////               |
		 //////////////////               |УПОРЯДОЧИТЬ ПО
		 //////////////////               |	ОстатокВРаботе,
		 //////////////////               |	ОтказПоПодразделению,
		 //////////////////               |	ОтказПоСотруднику,
		 //////////////////               |	НомерСтроки
		 //////////////////               |;
		 //////////////////               |
		 //////////////////               |////////////////////////////////////////////////////////////////////////////////
		 //////////////////               |ВЫБРАТЬ
		 //////////////////               |	&Период,
		 //////////////////               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		 //////////////////               |	Таблица.Объект,
		 //////////////////               |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ПринятоВРаботуПодразделения) КАК ВидСобытия,
		 //////////////////               |	&Ссылка КАК ИсточникСобытия,
		 //////////////////               |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Сотрудник,
		 //////////////////               |	&Подразделение КАК Подразделение,
		 //////////////////               |	&Автор,
		 //////////////////               |	Таблица.НомерСтроки КАК НомерСтроки
		 //////////////////               |ИЗ
		 //////////////////               |	Таблица КАК Таблица
		 //////////////////               |
		 //////////////////               |ОБЪЕДИНИТЬ ВСЕ
		 //////////////////               |
		 //////////////////               |ВЫБРАТЬ
		 //////////////////               |	&Период,
		 //////////////////               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		 //////////////////               |	Таблица.Объект,
		 //////////////////               |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ПринятоВРаботуСотрудником),
		 //////////////////               |	&Ссылка,
		 //////////////////               |	&Сотрудник,
		 //////////////////               |	&Подразделение,
		 //////////////////               |	&Автор,
		 //////////////////               |	Таблица.НомерСтроки
		 //////////////////               |ИЗ
		 //////////////////               |	Таблица КАК Таблица
		 //////////////////               |;
		 //////////////////               |
		 //////////////////               |////////////////////////////////////////////////////////////////////////////////
		 //////////////////               |УНИЧТОЖИТЬ Таблица";
						
						
						
		 Запрос.Текст = "ВЫБРАТЬ
		                |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		                |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		                |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		                |		ИНАЧЕ АктПередачиОбъекты.Объект
		                |	КОНЕЦ КАК Объект,
		                |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) КАК ОстатокВРаботе,
		                |	МИНИМУМ(АктПередачиОбъекты.НомерСтроки) КАК НомерСтроки
		                |ПОМЕСТИТЬ Таблица
		                |ИЗ
		                |	Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		                |				&ГраницаДоДокумента,
		                |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		                |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		                |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		                |					И Объект В
		                |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		                |							АктПередачиОбъекты.Ссылка
		                |						ИЗ
		                |							Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		                |						ГДЕ
		                |							АктПередачиОбъекты.Ссылка = &Ссылка)) КАК ОбъектыВРаботеОстатки
		                |		ПО (АктПередачиОбъекты.Объект = ОбъектыВРаботеОстатки.Объект
		                |				ИЛИ ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец = ОбъектыВРаботеОстатки.Объект)
		                |ГДЕ
		                |	АктПередачиОбъекты.Ссылка = &Ссылка
		                |
		                |СГРУППИРОВАТЬ ПО
		                |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		                |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		                |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		                |		ИНАЧЕ АктПередачиОбъекты.Объект
		                |	КОНЕЦ,
		                |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0)
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ
		                |	&Период,
		                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		                |	&Подразделение КАК Подразделение,
		                |	Таблица.Объект,
		                |	1 КАК Количество,
		                |	ЛОЖЬ КАК ОтказПоСотруднику,
		                |	ВЫБОР
		                |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		                |			ТОГДА ИСТИНА
		                |		ИНАЧЕ ЛОЖЬ
		                |	КОНЕЦ КАК ОтказПоПодразделению,
		                |	Таблица.ОстатокВРаботе КАК ОстатокВРаботе,
		                |	Таблица.НомерСтроки КАК НомерСтроки,
		                |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец КАК Организация,
		                |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Сотрудник
		                |ИЗ
		                |	Таблица КАК Таблица
		                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		                |				&ГраницаДоДокумента,
		                |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		                |					И Подразделение = &Подразделение
		                |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		                |					И Объект В
		                |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		                |							АктПередачиОбъекты.Ссылка
		                |						ИЗ
		                |							Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		                |						ГДЕ
		                |							АктПередачиОбъекты.Ссылка = &Ссылка)) КАК ОбъектыВРаботеОстатки
		                |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		                |ГДЕ
		                |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	&Период,
		                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		                |	&Подразделение,
		                |	Таблица.Объект,
		                |	1,
		                |	ВЫБОР
		                |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		                |			ТОГДА ИСТИНА
		                |		ИНАЧЕ ЛОЖЬ
		                |	КОНЕЦ,
		                |	ВЫБОР
		                |		КОГДА Таблица.ОстатокВРаботе > 0
		                |			ТОГДА ЛОЖЬ
		                |		ИНАЧЕ ИСТИНА
		                |	КОНЕЦ,
		                |	Таблица.ОстатокВРаботе,
		                |	Таблица.НомерСтроки,
		                |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец,
		                |	&Сотрудник
		                |ИЗ
		                |	Таблица КАК Таблица
		                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		                |				&ГраницаДоДокумента,
		                |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		                |					И Подразделение = &Подразделение
		                |					И Сотрудник = &Сотрудник
		                |					И Объект В
		                |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		                |							АктПередачиОбъекты.Ссылка
		                |						ИЗ
		                |							Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		                |						ГДЕ
		                |							АктПередачиОбъекты.Ссылка = &Ссылка)) КАК ОбъектыВРаботеОстатки
		                |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		                |ГДЕ
		                |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	&Период,
		                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		                |	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
		                |	Таблица.Объект,
		                |	1,
		                |	ВЫБОР
		                |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		                |			ТОГДА ИСТИНА
		                |		ИНАЧЕ ЛОЖЬ
		                |	КОНЕЦ,
		                |	ВЫБОР
		                |		КОГДА Таблица.ОстатокВРаботе > 0
		                |			ТОГДА ЛОЖЬ
		                |		ИНАЧЕ ИСТИНА
		                |	КОНЕЦ,
		                |	Таблица.ОстатокВРаботе,
		                |	Таблица.НомерСтроки,
		                |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец,
		                |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		                |ИЗ
		                |	Таблица КАК Таблица
		                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		                |				&ГраницаДоДокумента,
		                |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		                |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		                |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		                |					И Объект В
		                |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		                |							АктПередачиОбъекты.Ссылка
		                |						ИЗ
		                |							Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		                |						ГДЕ
		                |							АктПередачиОбъекты.Ссылка = &Ссылка)) КАК ОбъектыВРаботеОстатки
		                |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		                |ГДЕ
		                |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		                |
		                |УПОРЯДОЧИТЬ ПО
		                |	ОстатокВРаботе,
		                |	ОтказПоПодразделению,
		                |	ОтказПоСотруднику,
		                |	НомерСтроки
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ
		                |	&Период,
		                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		                |	Таблица.Объект,
		                |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ПринятоВРаботуПодразделения) КАК ВидСобытия,
		                |	&Ссылка КАК ИсточникСобытия,
		                |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Сотрудник,
		                |	&Подразделение КАК Подразделение,
		                |	&Автор,
		                |	Таблица.НомерСтроки КАК НомерСтроки
		                |ИЗ
		                |	Таблица КАК Таблица
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	&Период,
		                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		                |	Таблица.Объект,
		                |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ПринятоВРаботуСотрудником),
		                |	&Ссылка,
		                |	&Сотрудник,
		                |	&Подразделение,
		                |	&Автор,
		                |	Таблица.НомерСтроки
		                |ИЗ
		                |	Таблица КАК Таблица
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |УНИЧТОЖИТЬ Таблица";
						
		//Проверка на В РАБОТЕ организации
        //Исключить те, которые есть в работе Подр и Сотр
	КонецЕсли;
		
	Результат = Запрос.ВыполнитьПакет();                             
	ТаблицаДолговыхОбязательств = Результат[1].Выгрузить();
	ТаблицаСобытий = Результат[2].Выгрузить();
	
	//Если ТаблицаДолговыхОбязательств.Количество() > 0 И ТаблицаДолговыхОбязательств[0].ОстатокВРаботе <> 1 Тогда
	//	ШаблонСообщения = НСтр("ru = ""Объект: %Объект% не числится в работе!""");	
	//	ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Объект%", 
	//			ТаблицаДолговыхОбязательств[0].Объект);
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Параметры.Ссылка,,,);
	//	Возврат Ложь;
	//КонецЕсли;
	Возврат Истина;
КонецФункции
