
&НаСервере
Процедура ЗаписатьНаСервере(Ответственный)
	ДО = ЭтаФорма.ДО;
	Код = "0181";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("СТОП");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0182";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Ручной обзвон");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение);
	Код = "0183";
	Значение = ЭтаФорма.Ответственный;
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение);
	ЭтаФорма.ЗаписьПроизведена = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Если ЗначениеЗаполнено(ЭтаФорма.Ответственный) Тогда
		ПоказатьОповещениеПользователя("Закрепление должника",,"Должник закреплен",БиблиотекаКартинок.NC_Портфель);
		ЗаписатьНаСервере(Неопределено);
		ЭтаФорма.Закрыть();
	Иначе
		Предупреждение("Не выбран ответственный!",,"Ошибка записи");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЭтаФорма.ЗаписьПроизведена = Ложь Тогда
		Предупреждение("Не записан ответственный!",,"Предупреждение");
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры
