
&НаСервере
Процедура ЗагрузитьНаСервере()
	НачатьТранзакцию();
	Попытка
		ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
		ЗначениеОбъект.ЗагрузитьДанные(ПолеИсходнойТаблицы, Ложь);
		ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
		Сообщить("Загрузка успешно выполнена!");
		ЗафиксироватьТранзакцию();
	Исключение
		Сообщить("При загрузке данных произошла ошибка!");
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФайлИмпортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл ИПЦ...";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Табличный документ(*.xls, *.xlsx, *.ods)|*.xls?;*.ods|";
	//МассивПутейДокументов = Новый Массив;
	Если Диалог.Выбрать() Тогда
		ФайлИмпорта = Диалог.ПолноеИмяФайла;
		ДД = новый ДвоичныеДанные(ФайлИмпорта);
		ЗагрузитьТабличныйДокумент(ПолеИсходнойТаблицы,ДД);	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТабличныйДокумент(ПолеИсходнойТаблицы,ДД)
	Попытка
		ПолеИсходнойТаблицы.Прочитать(ФайлИмпорта);
	Исключение
		//Сообщить(ОписаниеОшибки());
		//Загружено = РаботаСДокументами.мПрочитатьТабличныйДокументИзExcel(ПолеИсходнойТаблицы, ФайлИмпорта, 1);
		Загружено = РаботаСДокументами.ПрочитатьТабличныйДокументExcelизДвоичныхДанных(ПолеИсходнойТаблицы,ДД,1);
	КонецПопытки	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьСписокТерриторийФССП(Элементы.Территория.СписокВыбора);
	Объект.Территория = "Российская Федерация";
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСписокТерриторийФССП(Список)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФССП_СлужбыСудебныхПриставов.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ФССП_СлужбыСудебныхПриставов КАК ФССП_СлужбыСудебныхПриставов
		|ГДЕ
		|	ФССП_СлужбыСудебныхПриставов.ЭтоГруппа
		|	И НЕ ФССП_СлужбыСудебныхПриставов.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	
	Для каждого Стр из РезультатЗапроса Цикл
		Позиция = стрНайти(Стр.Наименование, " - ",,,);
		Если Позиция > 0 Тогда
			Стр.Наименование = СокрЛП(Лев(Стр.Наименование,Позиция));
		КонецЕсли;
	КонецЦикла;
	РезультатЗапроса.Свернуть("Наименование");
	Для каждого Стр из РезультатЗапроса Цикл
		Список.Добавить(Стр.Наименование);
	КонецЦикла;	
	Список.Добавить("Российская Федерация");
КонецПроцедуры

&НаСервере
Процедура ПримерРеестраИПЦНаСервере(ТабДок) 
	Макет = Обработки.ЗагрузкаЗначенийИПЦ.ПолучитьМакет("Макет");
	ТабДок.Вывести(Макет);	
КонецПроцедуры

&НаКлиенте
Процедура ПримерРеестраИПЦ(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПримерРеестраИПЦНаСервере(ТабДок);
	ТабДок.Показать("Пример реестра ИПЦ по региону");
КонецПроцедуры
