
&НаСервере
Процедура ЗагрузитьНаСервере()
	НачатьТранзакцию();
	Попытка
		ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
		ЗначениеОбъект.ЗагрузитьДанные(ПолеИсходнойТаблицы, Ложь);
		ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
		Сообщить("Загрузка успешно выполнена!");
		ЗафиксироватьТранзакцию();
	Исключение
		Сообщить("При загрузке данных произошла ошибка!");
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

#Область СчитатьФайл

&НаКлиенте
Асинх Процедура ФайлИмпортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Чтец = УправлениеЧтениеФайловКлиент;
	Попытка
	
		ОписаниеФайла = Ждать Чтец.ВыбратьИПоместитьНаСерверТабличныйДокумент(ЭтаФорма.УникальныйИдентификатор);
	
	Исключение
		СообщениеПользователю("Операция не удалась: " + ОписаниеОшибки());
		ОчиститьДанныеФайла();
		Возврат;
	КонецПопытки;
	
	Если ОписаниеФайла = Неопределено Тогда
	
		Возврат;
	
	КонецЕсли;
	
	АдресФайлИмпорта = ОписаниеФайла["Адрес"];
	ФайлИмпорта = ОписаниеФайла["СсылкаНаФайл"]["Имя"];
	
	Результат = УправлениеЗагрузкойСервер.ЗаполнитьТабличныйДокументИзАрхива(ФайлИмпорта, АдресФайлИмпорта);
	Если Результат["Ошибка"] = Неопределено Тогда
	
		ПолеИсходнойТаблицы = Результат["ТабличныйДокумент"];
	
	КонецЕсли;
	
	УдалитьВременныйФайл(Результат["ИмяФайла"]);
	СообщениеПользователю(Результат["Сообщение"]);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВременныйФайл(ИмяФайла)

	ФайловаяСистема.УдалитьВременныйФайл(ИмяФайла);

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеФайла()

	ФайлExcel = Неопределено;
	АдресФайлИмпорта = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура СообщениеПользователю(ТекстСообщения)

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти

//#Область СчитатьФайл

//&НаКлиенте
//Асинх Процедура ПрочитатьФайлСКлиента()

//	ДанныеПрочитанногоФайла = Неопределено;
//	Попытка
//	
//		ДанныеПрочитанногоФайла = Ждать УправлениеЗагрузкойКлиент.ИмпортироватьФайл(ЭтаФорма.УникальныйИдентификатор);
//	
//	Исключение
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = ОписаниеОшибки();
//		Сообщение.Сообщить();
//	КонецПопытки;
//	
//	Если НЕ ЗначениеЗаполнено(ДанныеПрочитанногоФайла) Тогда
//	
//		Возврат;
//	
//	КонецЕсли;
//	
//	ПолеИсходнойТаблицы = ДанныеПрочитанногоФайла["ТабличныйДокумент"];
//	ФайлИмпорта = ДанныеПрочитанногоФайла["ПутьФайлаНаКлиенте"];

//КонецПроцедуры

//&НаКлиенте
//Процедура ФайлИмпортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	ПрочитатьФайлСКлиента();
//	
//КонецПроцедуры

//#КонецОбласти


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьСписокТерриторийФССП(Элементы.Территория.СписокВыбора);
	Объект.Территория = "Российская Федерация";
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСписокТерриторийФССП(Список)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФССП_СлужбыСудебныхПриставов.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ФССП_СлужбыСудебныхПриставов КАК ФССП_СлужбыСудебныхПриставов
		|ГДЕ
		|	ФССП_СлужбыСудебныхПриставов.ЭтоГруппа
		|	И НЕ ФССП_СлужбыСудебныхПриставов.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	
	Для каждого Стр из РезультатЗапроса Цикл
		Позиция = стрНайти(Стр.Наименование, " - ",,,);
		Если Позиция > 0 Тогда
			Стр.Наименование = СокрЛП(Лев(Стр.Наименование,Позиция));
		КонецЕсли;
	КонецЦикла;
	РезультатЗапроса.Свернуть("Наименование");
	Для каждого Стр из РезультатЗапроса Цикл
		Список.Добавить(Стр.Наименование);
	КонецЦикла;	
	Список.Добавить("Российская Федерация");
КонецПроцедуры

&НаСервере
Процедура ПримерРеестраИПЦНаСервере(ТабДок) 
	Макет = Обработки.ЗагрузкаЗначенийИПЦ.ПолучитьМакет("Макет");
	ТабДок.Вывести(Макет);	
КонецПроцедуры

&НаКлиенте
Процедура ПримерРеестраИПЦ(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПримерРеестраИПЦНаСервере(ТабДок);
	ТабДок.Показать("Пример реестра ИПЦ по региону");
КонецПроцедуры
