
&НаСервере
Процедура ЗагрузитьНаСервере()
	НачатьТранзакцию();
	Попытка
		ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
		ЗначениеОбъект.ЗагрузитьДанные(ПолеИсходнойТаблицы, Ложь);
		ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
		Сообщить("Загрузка успешно выполнена!");
		ЗафиксироватьТранзакцию();
	Исключение
		Сообщить("При загрузке данных произошла ошибка!");
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры     

#Область СчитатьФайл

&НаКлиенте
Асинх Процедура ПрочитатьФайлСКлиента()
	
	ДанныеПрочитанногоФайла = Неопределено;
	Попытка
		
		ДанныеПрочитанногоФайла = Ждать УправлениеЗагрузкойКлиент.ИмпортироватьФайл(ЭтаФорма.УникальныйИдентификатор);
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ДанныеПрочитанногоФайла) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПолеИсходнойТаблицы = ДанныеПрочитанногоФайла["ТабличныйДокумент"];
	ФайлИмпорта = ДанныеПрочитанногоФайла["ПутьФайлаНаКлиенте"];
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлИмпортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПрочитатьФайлСКлиента();
	
КонецПроцедуры

#КонецОбласти


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
	ЗначениеОбъект.ЗаполнитьНомераСтолбцов();
	ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
	
	Объект.ТолькоУникальныеКлассификационныеКоды = Истина;
КонецПроцедуры


&НаСервере
Процедура ПроставитьЕдиныйБанкНаСервере()
	ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
	ЗначениеОбъект.ЕдиныйБанкНаОплатуГП();
	ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
	Сообщить("Единый банк назначен для участков!");
	
КонецПроцедуры


&НаКлиенте
Процедура ПроставитьЕдиныйБанк(Команда)
	ПроставитьЕдиныйБанкНаСервере();
КонецПроцедуры

