
&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Истина);
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор(Поле, Значение)
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(Поле);	
	Для Каждого ЭлементОтбора Из Категории.Отбор.Элементы Цикл		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			ЭлементОтбора.ПравоеЗначение = Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтбор("Владелец", Объект);
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	ТестСервер();
КонецПроцедуры

&НаСервере
Процедура ТестСервер()
	ВыходОбъект.Очистить();	
	ВыходОбъект.Загрузить(ВходОбъект.Выгрузить());
	Таблица = ВыходОбъект.Выгрузить();
	Если Не ПланыВидовХарактеристик.ВидыСкоринга.ВыполнитьПроцедуру(ТекстовыйДокумент.ПолучитьТекст(), Таблица) Тогда
		ВыходОбъект.Очистить(); 
	Иначе
		ВыходОбъект.Загрузить(Таблица);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонструкторЗапроса(Команда)
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		Конструктор = Новый КонструкторЗапроса();
		Конструктор.РежимКомпоновкиДанных = Ложь;
		Конструктор.АвтоДобавлениеПредставлений=Ложь;
		                     
		СтарыйЗапрос = Ложь;	
		ИсходныйТекстЗапроса = "";
		Элементы.ТекстовыйДокумент.УстановитьГраницыВыделения(1, 1, 5000, 800);
		ИсходныйТекст = Элементы.ТекстовыйДокумент.ВыделенныйТекст;	
		// Определяем нужно ли вставить только текст запроса (по выделению). 
		// Если выделенияе ест, то дополнительные фразы писать не будем и попытаемся получить текст
		// старого запроса.
		Если НЕ ИсходныйТекст = "" Тогда
			СтарыйЗапрос = истина;
			Если Найти(ИсходныйТекст, "ВЫБРАТЬ") <> Неопределено Тогда
				ИсходныйТекстЗапроса = СтрЗаменить(ИсходныйТекст, "|", " ");
			КонецЕсли;
		КонецЕсли;	
		// Пробуем передать в конструктор текст старого запроса.
		Если ИсходныйТекстЗапроса <> "" Тогда
			Попытка
				Конструктор.Текст = ИсходныйТекстЗапроса;
			Исключение		
			КонецПопытки;
		КонецЕсли;
		
		//Чуров
		Конструктор.Показать(Новый ОписаниеОповещения("КонструкторЗапросаЗавершение", ЭтаФорма, Новый Структура("СтарыйЗапрос", СтарыйЗапрос)));
		
		//Если Конструктор.ОткрытьМодально() Тогда
		//	ТекстЗапроса = Конструктор.Текст;
		//Иначе
		//	Возврат;
		//КонецЕсли;	
		//Если ТекстЗапроса = Неопределено Или ТекстЗапроса = "" Тогда
		//	Возврат;	
		//КонецЕсли; 
		//
		////Добавляем разделители
		//ТекстЗапросаСРазделителями = "";
		//КоличествоСтрок = СтрЧислоСтрок(ТекстЗапроса);
		//Для Счетчик = 1 По КоличествоСтрок Цикл
		//	Если Счетчик = 1 И СтарыйЗапрос = Истина Тогда
		//		ТекСтрока = "" + СтрПолучитьСтроку(ТекстЗапроса, Счетчик);
		//	Иначе
		//		ТекСтрока = "|" + СтрПолучитьСтроку(ТекстЗапроса, Счетчик);		
		//	КонецЕсли;			
		//	Если Не Счетчик = КоличествоСтрок  Тогда 			
		//		ТекСтрока = ТекСтрока + Символы.ПС;
		//	КонецЕсли;	
		//	ТекстЗапросаСРазделителями = ТекстЗапросаСРазделителями + ТекСтрока;		
		//КонецЦикла;

		//ВспомогательнаяЧасть = ТекстовыйДокумент.ПолучитьТекст();
		//Если ЗначениеЗаполнено(ВспомогательнаяЧасть) Тогда
		//	ВспомогательнаяЧасть = ВспомогательнаяЧасть + Символы.ПС;	
		//КонецЕсли;
		//						
		//Если СтарыйЗапрос Тогда
		//	ДобавленныйТекст = ТекстЗапросаСРазделителями;
		//Иначе
		//	ДобавленныйТекст =  
		//		"Запрос = Новый Запрос();" + Символы.ПС +
		//		"Запрос.Текст = """ + Символы.ПС +
		//		ТекстЗапросаСРазделителями +
		//		""";" + Символы.ПС +
		//		"Запрос.УстановитьПараметр("""", );" + Символы.ПС +
		//		"Результат = Запрос.Выполнить();" + Символы.ПС +
		//		"Значение = Результат.Выгрузить();";
		//КонецЕсли;
		//
		//Если НЕ Элементы.ТекстовыйДокумент.ВыделенныйТекст = "" Тогда										
		//	Элементы.ТекстовыйДокумент.ВыделенныйТекст = ДобавленныйТекст;
		//Иначе
		//	Элементы.ТекстовыйДокумент.ВыделенныйТекст = Элементы.ТекстовыйДокумент.ВыделенныйТекст + ДобавленныйТекст;
		//КонецЕсли;	
	#Иначе
		Сообщить("Конструктор запроса работает только под Толстый клиент (управляемое приложение)!");
	#КонецЕсли
КонецПроцедуры
//Чуров++
&НаКлиенте
Процедура КонструкторЗапросаЗавершение(ТекстЗапроса, ДополнительныеПараметры) Экспорт
		
		Если ТекстЗапроса = Неопределено Или ТекстЗапроса = "" Тогда
			Возврат;	
		КонецЕсли; 
		
		//Добавляем разделители
		ТекстЗапросаСРазделителями = "";
		КоличествоСтрок = СтрЧислоСтрок(ТекстЗапроса);
		Для Счетчик = 1 По КоличествоСтрок Цикл
			Если Счетчик = 1 И ДополнительныеПараметры.СтарыйЗапрос = Истина Тогда
				ТекСтрока = "" + СтрПолучитьСтроку(ТекстЗапроса, Счетчик);
			Иначе
				ТекСтрока = "|" + СтрПолучитьСтроку(ТекстЗапроса, Счетчик);		
			КонецЕсли;			
			Если Не Счетчик = КоличествоСтрок  Тогда 			
				ТекСтрока = ТекСтрока + Символы.ПС;
			КонецЕсли;	
			ТекстЗапросаСРазделителями = ТекстЗапросаСРазделителями + ТекСтрока;		
		КонецЦикла;

		ВспомогательнаяЧасть = ТекстовыйДокумент.ПолучитьТекст();
		Если ЗначениеЗаполнено(ВспомогательнаяЧасть) Тогда
			ВспомогательнаяЧасть = ВспомогательнаяЧасть + Символы.ПС;	
		КонецЕсли;
								
		Если ДополнительныеПараметры.СтарыйЗапрос Тогда
			ДобавленныйТекст = ТекстЗапросаСРазделителями;
		Иначе
			ДобавленныйТекст =  
				"Запрос = Новый Запрос();" + Символы.ПС +
				"Запрос.Текст = """ + Символы.ПС +
				ТекстЗапросаСРазделителями +
				""";" + Символы.ПС +
				"Запрос.УстановитьПараметр("""", );" + Символы.ПС +
				"Результат = Запрос.Выполнить();" + Символы.ПС +
				"Значение = Результат.Выгрузить();";
		КонецЕсли;
		
		Если НЕ Элементы.ТекстовыйДокумент.ВыделенныйТекст = "" Тогда										
			Элементы.ТекстовыйДокумент.ВыделенныйТекст = ДобавленныйТекст;
		Иначе
			Элементы.ТекстовыйДокумент.ВыделенныйТекст = Элементы.ТекстовыйДокумент.ВыделенныйТекст + ДобавленныйТекст;
		КонецЕсли;
КонецПроцедуры
//Чуров--
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КонструкторФормата(Команда)

	КонструкторыКлиент.КонструкторФорматаОткрытие(ЭтаФорма, "ТекстовыйДокумент");

КонецПроцедуры

//Чуров++
&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("ВидыСкорингаФормаЗапросаЗавершение", ТекстовыйДокумент);
КонецПроцедуры
//Чуров--
