Функция ПолучитьЗначениеКомплекта(Комплект) Экспорт

	Возврат Комплект.Значение;

КонецФункции // ()

Функция ПолучитьНастройкуШаблоновКомплекта(Комплект) Экспорт

	Возврат Комплект.Значение;

КонецФункции // ()

Функция ИнициализироватьСтруктуруНастройкиШаблонов() Экспорт

	НастройкиШаблона = Новый Структура;
	НастройкиШаблона.Вставить("ШаблонПечатнойФормы", Неопределено);
	НастройкиШаблона.Вставить("ФункцияСвойств", Неопределено);
	НастройкиШаблона.Вставить("ФункцияКоличество", Неопределено);
	НастройкиШаблона.Вставить("ИсходящийНомер", Неопределено);
	НастройкиШаблона.Вставить("Прикреплять", Неопределено);
	
	Возврат НастройкиШаблона;

КонецФункции // ()

Функция КоличествоВерсийОснования(Комплект) Экспорт

	Возврат Комплект.Ключ.Количество;

КонецФункции // ()

Функция ИнициализироватьСтруктуруОписанияОснования() Экспорт

	ОснованиеСКоличеством = Новый Структура;
	ОснованиеСКоличеством.Вставить("Основание", Неопределено);
	ОснованиеСКоличеством.Вставить("Количество", 0);
	
	Возврат ОснованиеСКоличеством;

КонецФункции // ()
