
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр СобытияПоОбъектам 
	Движения.СобытияПоОбъектам.Записывать = Истина;
	Для Каждого ТекСтрокаДатыИСуммы Из ДатыИСуммы Цикл
		Движение = Движения.СобытияПоОбъектам.Добавить();
		Движение.Период = Дата;
		Движение.Объект = Объект;
		Движение.ВидСобытия = Перечисления.ВидыСобытий.ОбещаниеОплатить;
		Движение.ИсточникСобытия = Ссылка;
		Движение.Автор = Автор;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
КонецПроцедуры
