
&НаКлиенте
Процедура ПриЗакрытии()
	////Если Не Объект.Ссылка.Пустая() И Вопрос("Создать мероприятие проверки платежа?", 
	////		РежимДиалогаВопрос.ДаНет,,,"Создать мероприятие?") = КодВозвратаДиалога.Да Тогда
	////	//Создание нового мероприятия через форму или через ссылку	
	////	//Форма = Получить   
	////КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбъектыСервер.ОграничитьТипОбъекта(Элементы.ОбъектОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(Объект.Автор) Тогда 
	//	Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатыИСуммыСуммаВВалютеПриИзменении(Элемент)
	Если Элементы.ДатыИСуммы.ТекущиеДанные <> Неопределено И 
			Не Элементы.ДатыИСуммы.ТекущиеДанные.Валюта.Пустая() И 
			ЗначениеЗаполнено(Элементы.ДатыИСуммы.ТекущиеДанные.Дата) Тогда
		////Элементы.ДатыИСуммы.ТекущиеДанные.СуммаРегл = ПересчитатьСуммуВВалютуРегл(
		////		Элементы.ДатыИСуммы.ТекущиеДанные.Дата, Элементы.ДатыИСуммы.ТекущиеДанные.СуммаВВалюте,
		////		Элементы.ДатыИСуммы.ТекущиеДанные.Валюта);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатыИСуммыВалютаПриИзменении(Элемент)
	Если Элементы.ДатыИСуммы.ТекущиеДанные <> Неопределено И 
			Не Элементы.ДатыИСуммы.ТекущиеДанные.Валюта.Пустая() И
			ЗначениеЗаполнено(Элементы.ДатыИСуммы.ТекущиеДанные.Дата) Тогда
		////Элементы.ДатыИСуммы.ТекущиеДанные.СуммаРегл = ПересчитатьСуммуВВалютуРегл(
		////		Элементы.ДатыИСуммы.ТекущиеДанные.Дата, Элементы.ДатыИСуммы.ТекущиеДанные.СуммаВВалюте,
		////		Элементы.ДатыИСуммы.ТекущиеДанные.Валюта);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатыИСуммыДатаПриИзменении(Элемент)
	Если Элементы.ДатыИСуммы.ТекущиеДанные <> Неопределено И 
			Не Элементы.ДатыИСуммы.ТекущиеДанные.Валюта.Пустая() И
			ЗначениеЗаполнено(Элементы.ДатыИСуммы.ТекущиеДанные.Дата) Тогда
		////Элементы.ДатыИСуммы.ТекущиеДанные.СуммаРегл = ПересчитатьСуммуВВалютуРегл(
		////		Элементы.ДатыИСуммы.ТекущиеДанные.Дата, Элементы.ДатыИСуммы.ТекущиеДанные.СуммаВВалюте,
		////		Элементы.ДатыИСуммы.ТекущиеДанные.Валюта);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПересчитатьСуммуВВалютуРегл(ДатаПлатежа, СуммаПлатежа, ВалютаПлатежа)
	ТаблицаВВалюте = РегистрыСведений.КурсыВалют.СрезПоследних(ДатаПлатежа, Новый Структура("Валюта", 
			ВалютаПлатежа));	
	Если ТаблицаВВалюте.Количество() > 0 Тогда
		Возврат СуммаПлатежа * ТаблицаВВалюте[0].Курс * ТаблицаВВалюте[0].Кратность;
	Иначе
		Возврат Неопределено;
	КонецЕсли;				
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//ТипЗначенияВладельца = ТипЗнч(ЭтаФорма.ВладелецФормы);
	//Если ТипЗначенияВладельца = Тип("УправляемаяФорма") тогда
	//	Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Задача.Мероприятие.Форма.ФормаМероприятия" Тогда
	//		ЭтаФорма.ВладелецФормы.Объект.СвязанныйДокумент = Объект.Ссылка;
	//	КонецЕсли;
	//КонецЕсли;
	ПараметрыСохранения = Новый Структура;
	ПараметрыСохранения.Вставить("ДокументСсылка", Объект.Ссылка);
	ПараметрыСохранения.Вставить("Владелец", ВладелецФормы);
	Оповестить("СохранениеДокумент", ПараметрыСохранения);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьОбъектПоМероприятию" Тогда
	
		Объект.Объект = Параметр["ВходящийОбъект"];
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Проверить дату на запрещенную
	Если Элементы.ДатыИСуммы.ТекущиеДанные.Дата > (НачалоДня(ТекущаяДата()) + 432000) Тогда
		Предупреждение("Запрещенная дата платежа!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
