
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запись.ОтгрузкаРазрешена = Истина;
	Запись.Ответственный     = ПользователиИнформационнойБазы.ТекущийПользователь();
	Запись.ДатаЗаписи        = ТекущаяДатаСеанса();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не (ЗначениеЗаполнено(Запись.ИНН)
				И ЗначениеЗаполнено(Запись.Период)) Тогда
				
		Отказ = Истина;
		ПоказатьОповещениеПользователя("Не заполнены обязательные поля");
		
	КонецЕсли;
	
КонецПроцедуры
