Функция Старт(ДанныеДляПроверки, НачалоДанных) Экспорт

	ОписаниеТипаКолонки = ДанныеДляПроверки["ОписаниеТипа"];
	
	Значения = ДанныеДляПроверки["ЗначенияЯчеек"];
	
	НаборДанных = Новый Массив;
	
	Для НомерСтроки = 0 По Значения.Количество() - 1 Цикл
	
		Текст = СокрЛП(Значения[НомерСтроки]);
		Если НулевоеЗначение_Дата(Текст) Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		ДанныеОбработки = Новый Структура;
		ДанныеОбработки.Вставить("ЗначениеЯчейки", Текст);
		ДанныеОбработки.Вставить("НомерСтроки", НачалоДанных + НомерСтроки);
		ДанныеОбработки.Вставить("ДанныеСтрок", НачалоДанных + НомерСтроки);
		ДанныеОбработки.Вставить("Значение", "");
		
		ЧастиДатыТекста = СтрРазделить(Текст, ". ", Истина);
		СборкаДаты = Новый Массив;
		Если СтрДлина(ЧастиДатыТекста[0]) > 2
			ИЛИ СтрДлина(ЧастиДатыТекста[1]) > 2
			ИЛИ СтрДлина(ЧастиДатыТекста[2]) <> 4 Тогда
		
			НаборДанных.Добавить(ДанныеОбработки);
			Продолжить;
		
		КонецЕсли;
		СборкаДаты.Добавить(Формат(ЧастиДатыТекста[0], "ЧЦ=2; ЧВН=; ЧГ="));
		СборкаДаты.Добавить(Формат(ЧастиДатыТекста[1], "ЧЦ=2; ЧВН=; ЧГ="));
		СборкаДаты.Добавить(Формат(ЧастиДатыТекста[2], "ЧЦ=4; ЧВН=; ЧГ="));
		ТекстПриведения = СтрСоединить(СборкаДаты, ".") + " 00:00:00";
		
		Значение = ОписаниеТипаКолонки.ПривестиЗначение(ТекстПриведения);
		
		Если Формат(День(Значение), "ЧЦ=2; ЧВН=; ЧГ=") <> Формат(ЧастиДатыТекста[0], "ЧЦ=2; ЧВН=; ЧГ=")
			ИЛИ Формат(Месяц(Значение), "ЧЦ=2; ЧВН=; ЧГ=") <> Формат(ЧастиДатыТекста[1], "ЧЦ=2; ЧВН=; ЧГ=")
			ИЛИ Формат(Год(Значение), "ЧЦ=4; ЧВН=; ЧГ=") <> ЧастиДатыТекста[2]
			ИЛИ Значение = Дата(1, 1, 1) Тогда
		
			ДанныеОбработки.Вставить("Значение", Строка(Значение));
			НаборДанных.Добавить(ДанныеОбработки);
		
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат НаборДанных;

КонецФункции // ()

Функция НулевоеЗначение_Дата(Знач Текст)

	Возврат Не ЗначениеЗаполнено(Текст);

КонецФункции