
//|DRIVER=" + Объект.ODBCDriver + ";
//|SERVER=" + Объект.Сервер + ";
//|DATABASE=" + Объект.НазваниеБазыДанных + "; 
//|UID=" + Пользователь + ";
//|PWD=" + ТекущийПароль + "";
Функция СтрокаСоединения(Настройка) Экспорт

	Автообзвон = ОбработкаБезопасноеХранилище.ПолучитьВсеЗначения(Настройка);
	Пользователь = Автообзвон.Пользователь;
	Пароль = Автообзвон.Пароль;
	
	Соединение = "
	|Driver={&Драйвер};
	|SERVER=&Сервер;
	|DATABASE=&База;
	|USER=&Пользователь;
	|PASSWORD=&Пароль;";
	
	Соединение = СтрЗаменить(Соединение, "&Драйвер", Настройка.ODBCDriver);
	Соединение = СтрЗаменить(Соединение, "&Сервер", Настройка.Сервер);
	Соединение = СтрЗаменить(Соединение, "&База", Настройка.НазваниеБазыДанных);
	Соединение = СтрЗаменить(Соединение, "&Пользователь", Пользователь);
	Соединение = СтрЗаменить(Соединение, "&Пароль", Пароль);
	
	Возврат Соединение;

КонецФункции // ()
