

// Переехало из формы списка документа ЗДД, называлась ОбработкаЗаданийТолстыйКлиент
Процедура ЗагрузкаДанныхДолжника() Экспорт
	//Определение списка выполянемых сейчас фоновых заданий
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ОчередьФоновыхЗаданий.КлючФоновойЗадачи,
	               |	ОчередьФоновыхЗаданий.ДатаЗапуска,
	               |	ОчередьФоновыхЗаданий.СсылкаНаДокумент,
	               |	ОчередьФоновыхЗаданий.ДатаОтправкиНаВыполнение
	               |ИЗ
	               |	РегистрСведений.ОчередьФоновыхЗаданий КАК ОчередьФоновыхЗаданий
	               |ГДЕ
	               |	ОчередьФоновыхЗаданий.СтатусЗадания = &СтатусЗадания";
	Запрос.УстановитьПараметр("СтатусЗадания", Перечисления.СтатусыФоновыхЗаданий.Выполняется);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Значение = Результат.Выгрузить()[0];
		КлючФоновойЗадачи = Значение.КлючФоновойЗадачи;
			
		//Проверяем что фоновое задание действительно выполняется
		Если ФоновыеЗадания.НайтиПоУникальномуИдентификатору(КлючФоновойЗадачи) = Неопределено Тогда
			СброситьСтатусЗадачи = Ложь;
			Если Значение.ДатаЗапуска <> Дата("00010101000000") Тогда
				//Фоновая задача была запущена, но была неудачно прервана (например сервер вырубился)
				//Проверяем актуальность данных еще раз 
				Запрос = Новый Запрос();
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
					   |	ОчередьФоновыхЗаданий.СсылкаНаДокумент,
					   |	ОчередьФоновыхЗаданий.СтатусЗадания
					   |ИЗ
					   |	РегистрСведений.ОчередьФоновыхЗаданий КАК ОчередьФоновыхЗаданий
					   |ГДЕ
					   |	ОчередьФоновыхЗаданий.КлючФоновойЗадачи = &КлючФоновойЗадачи";
				Запрос.УстановитьПараметр("КлючФоновойЗадачи", КлючФоновойЗадачи);
				
				Значение = Запрос.Выполнить().Выгрузить()[0];
				Если Значение.СтатусЗадания = Перечисления.СтатусыФоновыхЗаданий.Выполняется Тогда
					//Сбрасываем статус этой задачи
					СброситьСтатусЗадачи = Истина;
				КонецЕсли;
			ИначеЕсли ТекущаяДата() - Значение.ДатаОтправкиНаВыполнение > 300 Тогда
				//Фоновая задача была отправлена на выполнение, но так и не была запущена в течении 5 минут
				//Сбрасываем статус этой задачи		
				СброситьСтатусЗадачи = Истина;
			КонецЕсли;
			
			Если СброситьСтатусЗадачи Тогда 
                   Запись = РегистрыСведений.ОчередьФоновыхЗаданий.СоздатьМенеджерЗаписи();
				Запись.СсылкаНаДокумент = Значение.СсылкаНаДокумент;
				Запись.Прочитать();	
				Запись.ПроцентЗавершенности = 0;
				Запись.ДатаЗапуска = Неопределено;
				Запись.ДатаОтправкиНаВыполнение = Неопределено;
				Запись.КлючФоновойЗадачи = Неопределено;
				Запись.СтатусЗадания = Перечисления.СтатусыФоновыхЗаданий.ВОчереди;	
				Запись.Записать();
			КонецЕсли;
		КонецЕсли;
	Иначе
		//Поставить на выполнение следующее фоновое задание
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ОчередьФоновыхЗаданий.СсылкаНаДокумент,
		               |	ОчередьФоновыхЗаданий.ДатаДобавленияВРегистр КАК ДатаДобавленияВРегистр
		               |ИЗ
		               |	РегистрСведений.ОчередьФоновыхЗаданий КАК ОчередьФоновыхЗаданий
		               |ГДЕ
		               |	ОчередьФоновыхЗаданий.СтатусЗадания = &СтатусЗадания
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ДатаДобавленияВРегистр";
		Запрос.УстановитьПараметр("СтатусЗадания", Перечисления.СтатусыФоновыхЗаданий.ВОчереди);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда		
			ОбъектДокумент = Результат.Выгрузить()[0].СсылкаНаДокумент;
							
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Новый УникальныйИдентификатор());
			МассивПараметров.Добавить(ОбъектДокумент);	
						
			Запись = РегистрыСведений.ОчередьФоновыхЗаданий.СоздатьМенеджерЗаписи();
			Запись.СсылкаНаДокумент = ОбъектДокумент;
			Запись.Прочитать();					
			Запись.КлючФоновойЗадачи = МассивПараметров[1];
			Запись.ДатаОтправкиНаВыполнение = ТекущаяДата();
			Запись.ДатаЗапуска = Неопределено;
			Запись.СтатусЗадания = Перечисления.СтатусыФоновыхЗаданий.Выполняется;	
			Запись.Записать();
					
			ЗаписатьДолжниковИДолговыеОбязательства(МассивПараметров[0], МассивПараметров[1]);
		КонецЕсли;
	КонецЕсли;	
	
	//
	Данные = Константы.ОбработкаСинхронизации.Получить().Получить();
	Если Данные <> Неопределено Тогда
		Стр = ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор());
		Имя = "О" + Формат(ТекущаяДата(), "ДФ=ddMMyyyyЧЧМммсс");
		ВнешниеОбработки.Подключить(Стр, Имя);
		
	КонецЕсли;
КонецПроцедуры


Процедура ЗаписатьДолжниковИДолговыеОбязательства(Ключ, СсылкаНаДокумент) Экспорт
	НачатьТранзакцию();
	
	Запись = РегистрыСведений.ОчередьФоновыхЗаданий.СоздатьМенеджерЗаписи(); 
	Запись.СсылкаНаДокумент = СсылкаНаДокумент;
	Запись.Прочитать();
	Запись.ДатаЗапуска = ТекущаяДата();
	Запись.ПроцентЗавершенности = 0;
	Запись.Записать();
		
	ТипКА = СсылкаНаДокумент.ЮрФизЛица;
	ТипДО = СсылкаНаДокумент.ТипДолговыхОбязательств;
	ТЗ = СсылкаНаДокумент.ТаблицаЗначений.Получить();
	//ДопСведенияИРеквизиты = СсылкаНаДокумент.ДополнительныеСведенияИРеквизиты.Выгрузить();
	ОбновлятьРанееЗаписанные = СсылкаНаДокумент.ОбновлятьРанееЗаписанные;
	
	Массив = Новый Массив;
	Массив.Добавить("НомерСтроки");	
	Массив.Добавить("Наименование");
	Массив.Добавить("Идентификатор");
	Массив.Добавить("ИдентификаторКА");
	Массив.Добавить("ИдентификаторКР");
	Если Константы.УчетПоУслугам.Получить() Тогда
		Массив.Добавить("ИдентификаторУ");
	КонецЕсли;
	Если Константы.УчетПоИД.Получить() Тогда
		Массив.Добавить("ИдентификаторИД");
	КонецЕсли;
	Если Константы.УчетПоДоговорам.Получить() Тогда
		Массив.Добавить("ИдентификаторД");
	КонецЕсли;

	Массив.Добавить("ВалютаДоговора");
	Массив.Добавить("НомерДО");
	Массив.Добавить("СсылкаДО");
	Массив.Добавить("ТипДОЛ");
	Массив.Добавить("ТипКА");
	Массив.Добавить("ТипКР");
	Массив.Добавить("ТипДО");
	
	МассивСообщений = Новый Массив;
	
	Для Индекс = 0 По ТЗ.Количество() - 1 Цикл
		Должник = ЗаписатьДолжника(Массив, ТЗ[Индекс], ТЗ, ТипКА,  
				ОбновлятьРанееЗаписанные, МассивСообщений, СсылкаНаДокумент);
		ТЗ[Индекс].СсылкаДО = ЗаписатьДолговоеОбязательство(Массив, Должник, ТЗ[Индекс], ТЗ, ТипДО, 
				ОбновлятьРанееЗаписанные, МассивСообщений, СсылкаНаДокумент);	
		
		Процент = Индекс/ТЗ.Количество()*100;
		Если Индекс % 15 = 0 Тогда
			Запись = РегистрыСведений.ОчередьФоновыхЗаданий.СоздатьМенеджерЗаписи();
			Запись.СсылкаНаДокумент = СсылкаНаДокумент;
			Запись.Прочитать();
			Запись.ПроцентЗавершенности = Процент;	
			Запись.Записать();
		КонецЕсли;
	КонецЦикла;
	                
	Если МассивСообщений.Количество() = 0 Тогда
		МассивСообщений.Добавить(Новый Структура("Текст, Объект, Поле, Путь", 
				"Данные записаны!", СсылкаНаДокумент, Неопределено, Неопределено));
		УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные записаны!", СсылкаНаДокумент,,,);
	КонецЕсли;
	
	ОбъектДокумент = СсылкаНаДокумент.ПолучитьОбъект();
	ОбъектДокумент.СправочникиЗаписаны = Истина;
	ОбъектДокумент.ТаблицаЗначений = Новый ХранилищеЗначения(ТЗ, Новый СжатиеДанных(5));
	ОбъектДокумент.Записать();
	
	Запись = РегистрыСведений.СообщенияПоЗагрузкеДанных.СоздатьМенеджерЗаписи();
	Запись.Документ = СсылкаНаДокумент;	
	Запись.МассивСообщений = Новый ХранилищеЗначения(МассивСообщений, Новый СжатиеДанных(5));
	Запись.Записать();
	
	Запись = РегистрыСведений.ОчередьФоновыхЗаданий.СоздатьМенеджерЗаписи(); 
	Запись.СсылкаНаДокумент = СсылкаНаДокумент;
	Запись.Прочитать();
	Запись.ПроцентЗавершенности = 100;
	Запись.ДатаОкончания = ТекущаяДата();
	Запись.СтатусЗадания = Перечисления.СтатусыФоновыхЗаданий.Завершено;
	Запись.Записать();	
	
	//
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗагрузкаДанных") И 
			Не СоздатьНаборДокументов(ТЗ, СсылкаНаДокумент) Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

Функция СоздатьНаборДокументов(ТЗ, СсылкаНаДокумент) Экспорт
	Список = Новый СписокЗначений();
	Для Каждого Элемент Из ТЗ.Колонки Цикл
		Если Лев(Элемент.Имя, 2) = "ТС" Тогда			
			Стр = Сред(Элемент.Имя, 3);
			Стр = СтрЗаменить(Стр, "_", " ");
			ТССсылка = ПланыВидовХарактеристик.ТипыСотрудников.НайтиПоКоду(Стр);
			Если ЗначениеЗаполнено(ТССсылка) Тогда
				Список.Добавить(ТССсылка, Элемент.Имя);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТЗ.ЗадолженностьВалютаЗагрузки КАК ВалютаЗагрузки,
	                      |	ТЗ.ЗадолженностьОсновнойДолг КАК ОсновнойДолг,
	                      |	ТЗ.ЗадолженностьПроценты КАК Проценты,
	                      |	ТЗ.ЗадолженностьШтрафы КАК Штрафы,
	                      |	ТЗ.СсылкаДО КАК Объект
	                      |ПОМЕСТИТЬ Табл
	                      |ИЗ
	                      |	&ТЗ КАК ТЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Табл.Объект,
	                      |	МАКСИМУМ(Табл.ВалютаЗагрузки) КАК ВалютаЗагрузки,
	                      |	МАКСИМУМ(Табл.ОсновнойДолг) КАК ОсновнойДолг,
	                      |	МАКСИМУМ(Табл.Проценты) КАК Проценты,
	                      |	МАКСИМУМ(Табл.Штрафы) КАК Штрафы
	                      |ИЗ
	                      |	Табл КАК Табл
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Табл.Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	                      |			,
	                      |			Организация = &Организация
	                      |				И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Табл КАК Табл
	                      |		ПО ОбъектыВРаботеОстатки.Объект = Табл.Объект
	                      |ГДЕ
	                      |	Табл.Объект ЕСТЬ NULL 
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЗ.Объект
	                      |ИЗ
	                      |	Табл КАК ТЗ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
	                      |				,
	                      |				Организация = &Организация
	                      |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	                      |		ПО (ОбъектыВРаботеОстатки.Объект = ТЗ.Объект)
	                      |ГДЕ
	                      |	ОбъектыВРаботеОстатки.Объект ЕСТЬ NULL ");
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Организация", СсылкаНаДокумент.Организация);
	Пакет = Запрос.ВыполнитьПакет();
	
	//
	Док = Документы.АктуализацияЗадолженности.СоздатьДокумент();
	Док.Дата = СсылкаНаДокумент.Дата;
	Док.Организация = СсылкаНаДокумент.Организация;
	Док.Автор = СсылкаНаДокумент.Автор;
	Док.Объекты.Загрузить(Пакет[1].Выгрузить());
	Если Док.Объекты.Количество() > 0 Тогда
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	//
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗагрузкаДанных") И 
			СсылкаНаДокумент.ПриниматьУбиратьИзРаботыОрганизации Тогда
		Док = Документы.ЗавершениеРаботыОрганизации.СоздатьДокумент();
		Док.Дата = СсылкаНаДокумент.Дата;
		Док.Организация = СсылкаНаДокумент.Организация;
		Док.Автор = СсылкаНаДокумент.Автор;
		Док.Объекты.Загрузить(Пакет[2].Выгрузить());
		Если Док.Объекты.Количество() > 0 Тогда
			Попытка
				Док.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	//
	Док = Документы.ПринятиеВРаботуОрганизации.СоздатьДокумент();
	Док.Дата = СсылкаНаДокумент.Дата;
	Док.Организация = СсылкаНаДокумент.Организация;
	Док.Автор = СсылкаНаДокумент.Автор;
	Док.Объекты.Загрузить(Пакет[3].Выгрузить());
	Если Док.Объекты.Количество() > 0 Тогда
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	//ОтвСотр
	ТЗ.Колонки.СсылкаДО.Имя = "Объект";
	Для Каждого Результат Из ТЗ Цикл
		Для Каждого Элемент Из Список Цикл
			Сотр = Вычислить("Результат." + Элемент.Представление);
			Если ЗначениеЗаполнено(Сотр) Тогда
				Набор = РегистрыСведений.ОтветственныеСотрудники.СоздатьМенеджерЗаписи();
				Набор.Объект = Результат.Объект;
				Набор.ТипСотрудника = Элемент.Значение;
				Набор.Прочитать();
				Если Набор.ТипСотрудника.Пустая() Тогда
					//Пишем его
					Набор.Объект = Результат.Объект;
					Набор.ТипСотрудника = Элемент.Значение;
				    Набор.Пользователь = Сотр;
					Попытка
						Набор.Записать();
					Исключение
						Сообщить(ОписаниеОшибки());
						Возврат Ложь;
					КонецПопытки;
					
				ИначеЕсли Набор.Пользователь <> Сотр Тогда
					НаборСП = РегистрыСведений.СотрудникиВПомощь.СоздатьМенеджерЗаписи();
					НаборСП.Объект = Результат.Объект;
					НаборСП.ТипСотрудника = Элемент.Значение;
					НаборСП.Пользователь = Сотр;
					НаборСП.Прочитать();
					Если НаборСП.ТипСотрудника.Пустая() Тогда
						//Пишем его
						НаборСП.Объект = Результат.Объект;
						НаборСП.ТипСотрудника = Элемент.Значение;
						НаборСП.Пользователь = Сотр;
						Попытка
							НаборСП.Записать();
						Исключение
							Сообщить(ОписаниеОшибки());
							Возврат Ложь;
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

// Записывает данные в элемент справочника "Должники".
  // Параметры
  //  РеквизитыСправочника - метаданные, реквизиты справочника "Заемщики" 
  //  Текущая строка - текущая строка табличной части "Данные".
  // Возвращаемое значение
  //  Ссылка на элемент справочника "Заемщики"
  //
Функция ЗаписатьДолжника(Массив, ТекущаяСтрока, тзДанныеЗначение, ТипКА, ОбновлятьРанееЗаписанные, МассивСообщений,
	  	СсылкаНаДокумент) Экспорт
	Справочник = Справочники.Контрагенты;
	НайденнаяСсылка = Справочник.НайтиПоРеквизиту("КодКонтрагента", ТекущаяСтрока.Идентификатор);
	//НайденнаяСсылка = Справочник.НайтиПоКоду(ТекущаяСтрока.Идентификатор);
	Если НайденнаяСсылка = Справочник.ПустаяСсылка() Тогда
		НовыйЭлемент = Справочник.СоздатьЭлемент();
		СсылкаНового = Справочник.ПолучитьСсылку();
		НовыйЭлемент.УстановитьСсылкуНового(СсылкаНового);
		//КоличествоЗаписанныхДО = КоличествоЗаписанныхДО + 1;
	Иначе
		СсылкаНового = НайденнаяСсылка;
		Если ОбновлятьРанееЗаписанные Тогда
			//Сообщить("Заемщик уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ". Данные обновлены.");
			МассивСообщений.Добавить(Новый Структура("Текст, Объект, Поле, Путь",
					"Заемщик уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ". Данные обновлены.",
					НайденнаяСсылка, Неопределено, Неопределено));
			УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заемщик уже существует. КлиентскийНомер = " + 
					ТекущаяСтрока.Идентификатор + ". Данные обновлены.", НайденнаяСсылка,,,);
			НовыйЭлемент = НайденнаяСсылка.ПолучитьОбъект();
			//КоличествоОбновленныхДО = КоличествоОбновленныхДО + 1;
		Иначе
			//Сообщить("Заемщик уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ".");
			МассивСообщений.Добавить(Новый Структура("Текст, Объект, Поле, Путь",
					"Заемщик уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ".",
					НайденнаяСсылка, Неопределено, Неопределено));
			УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заемщик уже существует. КлиентскийНомер = " + 
					ТекущаяСтрока.Идентификатор + ".", НайденнаяСсылка,,,);
			Возврат НайденнаяСсылка;
		КонецЕсли;	  
	КонецЕсли;	
	  
	НовыйЭлемент.Наименование = ТекущаяСтрока.Наименование;
	НовыйЭлемент.КодКонтрагента = ТекущаяСтрока.Идентификатор;
	НовыйЭлемент.Организация = СсылкаНаДокумент.Организация;
	Если ТекущаяСтрока.ТипКА.Пустая() Тогда
		НовыйЭлемент.ЮрФизЛицо = ТипКА;
	Иначе
		НовыйЭлемент.ЮрФизЛицо = ТекущаяСтрока.ТипКА;
	КонецЕсли;
	//НовыйЭлемент.ПроверкаДвойников();
	Если НЕ ТекущаяСтрока.Наименование = "" Тогда
		НовыйЭлемент.ПроверкаДвойников();
	КонецЕсли; 
	
	//Записываем дополнительные сведения
	НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Объект.Установить(СсылкаНового);
	НаборЗаписей.Прочитать();
	 
	Для Каждого Колонка Из тзДанныеЗначение.Колонки Цикл
		//Заполнение Свойств:
		Если Массив.Найти(Колонка.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		КодСвойства = СтрЗаменить(Сред(Колонка.Имя, 2), "_", " ");
		Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду(КодСвойства);
		Если Не (Свойство.Родитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеРеквизиты_Контрагенты ИЛИ 
					Свойство.Родитель.Родитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеСведения_Контрагенты) Тогда
			Продолжить;
		ИначеЕсли Свойство.ЭтоДополнительноеСведение Тогда
			//Записываем дополнительные сведения
			НайденныеСтроки = НаборЗаписей.НайтиСтроки(Новый Структура("Свойство", Свойство));    
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = НаборЗаписей.Добавить();
				НоваяСтрока.Объект = НовыйЭлемент.Ссылка;
				НоваяСтрока.Свойство = Свойство;
			Иначе 
				НоваяСтрока = НайденныеСтроки[0];
			КонецЕсли;	
			НоваяСтрока.Значение = ТекущаяСтрока[Колонка.Имя];
		ИначеЕсли Не Свойство.ЭтоДополнительноеСведение Тогда	
			//Записываем дополнительные реквизиты
			НайденныеСтроки = НовыйЭлемент.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Свойство));    
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = НовыйЭлемент.ДополнительныеРеквизиты.Добавить();
			Иначе 
				НоваяСтрока = НайденныеСтроки[0];
				Если НайденныеСтроки.Количество() > 1 Тогда 
					Для Индекс = 2 По НайденныеСтроки.Количество() Цикл
						ИндексПересчитанный = НайденныеСтроки.Количество() - Индекс + 1;
						НовыйЭлемент.ДополнительныеРеквизиты.Удалить(НайденныеСтроки[ИндексПересчитанный].НомерСтроки - 1);
					КонецЦикла;	
			    	Сообщить("Ошибка! Дублирование доп реквизита у Должника!");
				КонецЕсли;
			КонецЕсли;
			НоваяСтрока.Свойство = Свойство;
			НоваяСтрока.Значение = ТекущаяСтрока[Колонка.Имя];
		КонецЕсли;						
		
	КонецЦикла;		
	НовыйЭлемент.Записать();
	//НаборЗаписей.Загрузить(НаборЗаписейТЗ);
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
	//////////////////////////////////////////////Записываем дополнительные сведения
	////////////////////////////////////////////НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей(); 
	////////////////////////////////////////////НаборЗаписей.Отбор.Объект.Установить(НовыйЭлемент.Ссылка);
	////////////////////////////////////////////НаборЗаписей.Прочитать();
	////////////////////////////////////////////НаборЗаписейТЗ = НаборЗаписей.Выгрузить();	 	
	////////////////////////////////////////////Для Каждого Колонка Из тзДанныеЗначение.Колонки Цикл
	////////////////////////////////////////////	Если Массив.Найти(Колонка.Имя) <> Неопределено Тогда
	////////////////////////////////////////////		Продолжить;
	////////////////////////////////////////////	КонецЕсли;
	////////////////////////////////////////////	//Если НЕ ЗначениеЗаполнено(ТекущаяСтрока[Колонка.Имя]) Тогда
	////////////////////////////////////////////	//	Продолжить;
	////////////////////////////////////////////	//КонецЕсли;
	////////////////////////////////////////////	КодСвойства = СтрЗаменить(Сред(Колонка.Имя, 2), "_", " ");
	////////////////////////////////////////////	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду(КодСвойства);
	////////////////////////////////////////////	Если Не Свойство.ЭтоДополнительноеСведение ИЛИ 
	////////////////////////////////////////////			Не (Свойство.Родитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеРеквизиты_Контрагенты ИЛИ 
	////////////////////////////////////////////				Свойство.Родитель.Родитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеСведения_Контрагенты) Тогда
	////////////////////////////////////////////		Продолжить;	
	////////////////////////////////////////////	КонецЕсли;						
	////////////////////////////////////////////	
	////////////////////////////////////////////	НайденныеСтроки = НаборЗаписейТЗ.НайтиСтроки(Новый Структура("Свойство", Свойство));    
	////////////////////////////////////////////	Если НайденныеСтроки.Количество() = 0 Тогда
	////////////////////////////////////////////		НоваяСтрока = НаборЗаписейТЗ.Добавить();
	////////////////////////////////////////////		НоваяСтрока.Объект = НовыйЭлемент.Ссылка;
	////////////////////////////////////////////		НоваяСтрока.Свойство = Свойство;
	////////////////////////////////////////////	Иначе 
	////////////////////////////////////////////		НоваяСтрока = НайденныеСтроки[0];
	////////////////////////////////////////////	КонецЕсли;	
	////////////////////////////////////////////	НоваяСтрока.Значение = ТекущаяСтрока[Колонка.Имя];
	////////////////////////////////////////////КонецЦикла;
	////////////////////////////////////////////НаборЗаписей.Загрузить(НаборЗаписейТЗ);
	////////////////////////////////////////////НаборЗаписей.Записать();
	
	Возврат НовыйЭлемент.Ссылка;	  
КонецФункции

// Записывает данные в элемент справочника "ДолговыеОбязательства".
Функция ЗаписатьДолговоеОбязательство(Массив, Должник, ТекущаяСтрока, тзДанныеЗначение, ТипДО,
		ОбновлятьРанееЗаписанные, МассивСообщений, СсылкаНаДокумент) Экспорт
	Справочник = Справочники.ДолговыеОбязательства;
	
	//НайденнаяСсылка = Справочник.НайтиПоНаименованию(ТекущаяСтрока.НомерДО,, Должник, Должник);
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ДолговыеОбязательстваКонтрагенты.Ссылка
	                      |ИЗ
	                      |	Справочник.ДолговыеОбязательства.Контрагенты КАК ДолговыеОбязательстваКонтрагенты
	                      |ГДЕ
	                      |	ДолговыеОбязательстваКонтрагенты.Значение = &Должник
	                      |	И ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Должник)
	                      |	И ДолговыеОбязательстваКонтрагенты.Ссылка.Наименование = &Наименование
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДолговыеОбязательстваКонтрагенты.Ссылка.ПометкаУдаления");
	Запрос.УстановитьПараметр("Должник", Должник);
	Запрос.УстановитьПараметр("Наименование", ТекущаяСтрока.НомерДО);
	Результат = Запрос.Выполнить().Выгрузить();
	Попытка
		НайденнаяСсылка = Результат[0].Ссылка;
	Исключение
		НайденнаяСсылка = Справочник.ПустаяСсылка();
	КонецПопытки;
	
	
	Если НайденнаяСсылка = Справочник.ПустаяСсылка() Тогда
		НовыйЭлемент = Справочник.СоздатьЭлемент();
		СсылкаНового = Справочник.ПолучитьСсылку();
		НовыйЭлемент.УстановитьСсылкуНового(СсылкаНового);
	Иначе
		НайденнаяСсылка = СсылкаНового;
		Если ОбновлятьРанееЗаписанные Тогда
		  	//Сообщить("Долговое обязательство " + ТекущаяСтрока.НомерДО + " для должника " + Должник + " уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ". Данные обновлены.");
			МассивСообщений.Добавить(Новый Структура("Текст, Объект, Поле, Путь",
					"Долговое обязательство " + ТекущаяСтрока.НомерДО + " для должника " 
					+ Должник + " уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ". Данные обновлены.",
					НайденнаяСсылка, Неопределено, Неопределено));
			УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Долговое обязательство " + ТекущаяСтрока.НомерДО + " для должника " 
					+ Должник + " уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ". Данные обновлены.",
					НайденнаяСсылка,,,);
			НовыйЭлемент = НайденнаяСсылка.ПолучитьОбъект();
		Иначе
			//Сообщить("Долговое обязательство " + ТекущаяСтрока.НомерДО + " для должника " + Должник + " уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ".");
			МассивСообщений.Добавить(Новый Структура("Текст, Объект, Поле, Путь",
					"Долговое обязательство " + ТекущаяСтрока.НомерДО + " для должника " 
					+ Должник + " уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ".",
					НайденнаяСсылка, Неопределено, Неопределено));
			УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Долговое обязательство " + ТекущаяСтрока.НомерДО + " для должника " 
					+ Должник + " уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ".", 
					НайденнаяСсылка,,,);
			Возврат НайденнаяСсылка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	
	НовыйЭлемент.Наименование = ТекущаяСтрока.НомерДО;
	Если НовыйЭлемент.Контрагенты.НайтиСтроки(Новый Структура("Значение, ВидКонтрагента", 
			Должник, Перечисления.ВидыКонтрагентов.Должник)).Количество() = 0 Тогда
		Нов = НовыйЭлемент.Контрагенты.Добавить();
		Нов.Значение = Должник;
		Нов.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Должник;
	КонецЕсли;	
	НовыйЭлемент.ВалютаДоговора = ТекущаяСтрока.ВалютаДоговора;
	НовыйЭлемент.Организация = СсылкаНаДокумент.Организация;
	Если ТекущаяСтрока.ТипДО.Пустая() Тогда
		НовыйЭлемент.ТипДолговогоОбязательства = ТипДО;
	Иначе
		НовыйЭлемент.ТипДолговогоОбязательства = ТекущаяСтрока.ТипДО;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Объект.Установить(СсылкаНового); 	
	НаборЗаписей.Прочитать();

	
	//Заполнение Свойств:
	//Записываем дополнительные реквизиты
	Для Каждого Колонка Из тзДанныеЗначение.Колонки Цикл  
		Если Массив.Найти(Колонка.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		КодСвойства = СтрЗаменить(Сред(Колонка.Имя, 2), "_", " ");		
		Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду(КодСвойства);
		
		
		Если Не (Свойство.Родитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеРеквизиты_ДолговыеОбязательства ИЛИ 
					Свойство.Родитель.Родитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеСведения_ДолговыеОбязательства) Тогда
			Продолжить;
		ИначеЕсли Свойство.ЭтоДополнительноеСведение Тогда 
			НайденныеСтроки = НаборЗаписей.НайтиСтроки(Новый Структура("Свойство", Свойство));    
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = НаборЗаписей.Добавить();
				НоваяСтрока.Объект = НовыйЭлемент.Ссылка;
				НоваяСтрока.Свойство = Свойство;
			Иначе 
				НоваяСтрока = НайденныеСтроки[0];
			КонецЕсли;	
			НоваяСтрока.Значение = ТекущаяСтрока[Колонка.Имя];	
		ИначеЕсли Не Свойство.ЭтоДополнительноеСведение Тогда 
			НайденныеСтроки = НовыйЭлемент.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Свойство));    
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = НовыйЭлемент.ДополнительныеРеквизиты.Добавить();
			Иначе
				НоваяСтрока = НайденныеСтроки[0];
				Если НайденныеСтроки.Количество() > 1 Тогда	
					Для Индекс = 2 По НайденныеСтроки.Количество() Цикл
						ИндексПересчитанный = НайденныеСтроки.Количество() - Индекс + 1;
			            НовыйЭлемент.ДополнительныеРеквизиты.Удалить(НайденныеСтроки[ИндексПересчитанный].НомерСтроки - 1);
					КонецЦикла;
				    Сообщить("Ошибка! Дублирование доп реквизита у ДО!");
				КонецЕсли;
			КонецЕсли;
			НоваяСтрока.Свойство = Свойство;
			НоваяСтрока.Значение = ТекущаяСтрока[Колонка.Имя];	
			
		КонецЕсли;		
			
	КонецЦикла;
	ВалютаНеЗаполнена = НовыйЭлемент.ВалютаДоговора.Пустая();
	НовыйЭлемент.Записать();
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
	Если ВалютаНеЗаполнена Тогда
		МассивСообщений.Добавить(Новый Структура("Текст, Объект, Поле, Путь",
				"ДО: " + НовыйЭлемент.Ссылка + ": т.к. валюта долгового обязательства не была
				| заполнена, то проставлена валюта регламентированного учета", 
				НовыйЭлемент.Ссылка, Неопределено, Неопределено));
		УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("ДО: " + НовыйЭлемент.Ссылка + ": т.к. валюта долгового обязательства не была
				| заполнена, то проставлена валюта регламентированного учета", НовыйЭлемент.Ссылка,,,);
	КонецЕсли;
	
	////////////////////////////////Записываем дополнительные сведения
	//////////////////////////////НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей(); 
	//////////////////////////////НаборЗаписей.Отбор.Объект.Установить(НовыйЭлемент.Ссылка); 	
	//////////////////////////////НаборЗаписей.Прочитать();
	//////////////////////////////НаборЗаписейТЗ = НаборЗаписей.Выгрузить(); 
	//////////////////////////////Для Каждого Колонка Из тзДанныеЗначение.Колонки Цикл  
	//////////////////////////////	Если Массив.Найти(Колонка.Имя) <> Неопределено Тогда
	//////////////////////////////		Продолжить;
	//////////////////////////////	КонецЕсли;
	//////////////////////////////	КодСвойства = СтрЗаменить(Сред(Колонка.Имя, 2), "_", " ");		
	//////////////////////////////	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду(КодСвойства);
	//////////////////////////////	Если Не Свойство.ЭтоДополнительноеСведение ИЛИ 				
	//////////////////////////////			Не (Свойство.Родитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеРеквизиты_ДолговыеОбязательства ИЛИ 
	//////////////////////////////				Свойство.Родитель.Родитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеСведения_ДолговыеОбязательства) Тогда
	//////////////////////////////		Продолжить;	
	//////////////////////////////	КонецЕсли;		
	//////////////////////////////	
	//////////////////////////////	НайденныеСтроки = НаборЗаписейТЗ.НайтиСтроки(Новый Структура("Свойство", Свойство));    
	//////////////////////////////	Если НайденныеСтроки.Количество() = 0 Тогда
	//////////////////////////////		НоваяСтрока = НаборЗаписейТЗ.Добавить();
	//////////////////////////////		НоваяСтрока.Объект = НовыйЭлемент.Ссылка;
	//////////////////////////////		НоваяСтрока.Свойство = Свойство;
	//////////////////////////////	Иначе 
	//////////////////////////////		НоваяСтрока = НайденныеСтроки[0];
	//////////////////////////////	КонецЕсли;	
	//////////////////////////////	НоваяСтрока.Значение = ТекущаяСтрока[Колонка.Имя];	
	//////////////////////////////КонецЦикла;
	//////////////////////////////НаборЗаписей.Загрузить(НаборЗаписейТЗ);
	//////////////////////////////НаборЗаписей.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
КонецФункции

Функция ЗаписатьДолжникаИДолговоеОбязательство(Массив, ТекущаяСтрока, тзДанныеЗначение, ТипДОЛ, ТипКА, ТипКР, ТипДО, ОбновлятьРанееЗаписанные, МассивСообщений,
	  	СсылкаНаДокумент, МассивДопРеквизитов, ВыводитьСообщения, СоздаватьДО) Экспорт
		
	СправочникК = Справочники.Контрагенты;
	НайденнаяСсылкаК = СправочникК.НайтиПоРеквизиту("КодКонтрагента", ТекущаяСтрока.Идентификатор);
	//НайденнаяСсылка = Справочник.НайтиПоКоду(ТекущаяСтрока.Идентификатор);
	ОбновитьРеквизитыК = Ложь;
	Если НайденнаяСсылкаК = СправочникК.ПустаяСсылка() Тогда
		НовыйЭлементК = СправочникК.СоздатьЭлемент();
		СсылкаНовогоК = СправочникК.ПолучитьСсылку();
		НовыйЭлементК.УстановитьСсылкуНового(СсылкаНовогоК);
		ОбновитьРеквизитыК = Истина;
		//КоличествоЗаписанныхДО = КоличествоЗаписанныхДО + 1;
	Иначе
		СсылкаНовогоК = НайденнаяСсылкаК;
		Если ОбновлятьРанееЗаписанные Тогда
			//МассивСообщений.Добавить(Новый Структура("Текст, Объект, Поле, Путь",
			//		"Заемщик уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ". Данные обновлены.",
			//		НайденнаяСсылкаК, Неопределено, Неопределено));
			Если ВыводитьСообщения Тогда
				УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заемщик уже существует. КлиентскийНомер = " + 
						ТекущаяСтрока.Идентификатор + ". Данные обновлены.", НайденнаяСсылкаК,,,);
			КонецЕсли;		
			НовыйЭлементК = НайденнаяСсылкаК.ПолучитьОбъект();
			
			ОбновитьРеквизитыК = Истина;
		Иначе
			//МассивСообщений.Добавить(Новый Структура("Текст, Объект, Поле, Путь",
			//		"Заемщик уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ".",
			//		НайденнаяСсылкаК, Неопределено, Неопределено));
			Если ВыводитьСообщения Тогда
				УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заемщик уже существует. КлиентскийНомер = " + 
						ТекущаяСтрока.Идентификатор + ".", НайденнаяСсылкаК,,,);
			КонецЕсли;
		КонецЕсли;	  
	КонецЕсли;
	
	Если СоздаватьДО Тогда
		Если ТекущаяСтрока.НомерДО <> "" Тогда
			СправочникДО = Справочники.ДолговыеОбязательства;
			
			//НайденнаяСсылка = Справочник.НайтиПоНаименованию(ТекущаяСтрока.НомерДО,, Должник, Должник);
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДолговыеОбязательстваКонтрагенты.Ссылка
			|ИЗ
			|	Справочник.ДолговыеОбязательства.Контрагенты КАК ДолговыеОбязательстваКонтрагенты
			|ГДЕ
			|	ДолговыеОбязательстваКонтрагенты.Значение = &Должник
			|	И ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Должник)
			|	И ДолговыеОбязательстваКонтрагенты.Ссылка.Наименование = &Наименование
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДолговыеОбязательстваКонтрагенты.Ссылка.ПометкаУдаления");
			Запрос.УстановитьПараметр("Должник", СсылкаНовогоК);
			Запрос.УстановитьПараметр("Наименование", ТекущаяСтрока.НомерДО);
			Результат = Запрос.Выполнить().Выгрузить();
			Попытка
				НайденнаяСсылкаДО = Результат[0].Ссылка;
			Исключение
				НайденнаяСсылкаДО = СправочникДО.ПустаяСсылка();
			КонецПопытки;
			
			ОбновитьРеквизитыДО = Ложь;
			Если НайденнаяСсылкаДО = СправочникДО.ПустаяСсылка() Тогда
				НовыйЭлементДО = СправочникДО.СоздатьЭлемент();
				СсылкаНовогоДО = СправочникДО.ПолучитьСсылку();
				НовыйЭлементДО.УстановитьСсылкуНового(СсылкаНовогоДО);
				ОбновитьРеквизитыДО = Истина;
			Иначе
				СсылкаНовогоДО = НайденнаяСсылкаДО;
				Если ОбновлятьРанееЗаписанные Тогда
					МассивСообщений.Добавить(Новый Структура("Текст, Объект, Поле, Путь",
					"Долговое обязательство " + ТекущаяСтрока.НомерДО + " для должника " 
					+ СсылкаНовогоК + " уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ". Данные обновлены.",
					НайденнаяСсылкаДО, Неопределено, Неопределено));
					Если ВыводитьСообщения Тогда
						УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Долговое обязательство " + ТекущаяСтрока.НомерДО + " для должника " 
						+ СсылкаНовогоК + " уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ". Данные обновлены.",
						НайденнаяСсылкаДО,,,);
					КонецЕсли;
					НовыйЭлементДО = НайденнаяСсылкаДО.ПолучитьОбъект();
					
					ОбновитьРеквизитыДО = Истина;
				Иначе
					МассивСообщений.Добавить(Новый Структура("Текст, Объект, Поле, Путь",
					"Долговое обязательство " + ТекущаяСтрока.НомерДО + " для должника " 
					+ СсылкаНовогоК + " уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ".",
					НайденнаяСсылкаДО, Неопределено, Неопределено));
					Если ВыводитьСообщения Тогда
						УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Долговое обязательство " + ТекущаяСтрока.НомерДО + " для должника " 
						+ СсылкаНовогоК + " уже существует. КлиентскийНомер = " + ТекущаяСтрока.Идентификатор + ".", 
						НайденнаяСсылкаДО,,,);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе ОбновитьРеквизитыДО = Ложь;
			НайденнаяСсылкаДО = Справочники.ДолговыеОбязательства.ПустаяСсылка();
		КонецЕсли;
	Иначе ОбновитьРеквизитыДО = Ложь;
		НайденнаяСсылкаДО = Справочники.ДолговыеОбязательства.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ОбновитьРеквизитыК И Не ОбновитьРеквизитыДО Тогда
		Возврат НайденнаяСсылкаДО;
	КонецЕсли;
	
	Если ОбновитьРеквизитыК Тогда
		
		НовыйЭлементК.Наименование = ТекущаяСтрока.Наименование;
		НовыйЭлементК.КодКонтрагента = ТекущаяСтрока.Идентификатор;
		НовыйЭлементК.Организация = СсылкаНаДокумент.Организация;
		Если ТекущаяСтрока.ТипДОЛ.Пустая() Тогда
			НовыйЭлементК.ЮрФизЛицо = ТипДОЛ;
		Иначе
			НовыйЭлементК.ЮрФизЛицо = ТекущаяСтрока.ТипДОЛ;
		КонецЕсли;
		//НовыйЭлемент.ПроверкаДвойников();
		Если НЕ ТекущаяСтрока.Наименование = "" Тогда
			НовыйЭлементК.ПроверкаДвойников();
		КонецЕсли; 
		//Записываем дополнительные сведения
		НаборЗаписейК = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей(); 
		НаборЗаписейК.Отбор.Объект.Установить(СсылкаНовогоК);
		НаборЗаписейК.Прочитать();
		НаборЗаписейКТЗ = НаборЗаписейК.Выгрузить();
	 
	КонецЕсли;

	
	Если ОбновитьРеквизитыДО Тогда
		НовыйЭлементДО.Наименование = ТекущаяСтрока.НомерДО;
		Если НовыйЭлементДО.Контрагенты.НайтиСтроки(Новый Структура("Значение, ВидКонтрагента", 
				СсылкаНовогоК, Перечисления.ВидыКонтрагентов.Должник)).Количество() = 0 Тогда
			Нов = НовыйЭлементДО.Контрагенты.Добавить();
			Нов.Значение = СсылкаНовогоК;
			Нов.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Должник;
		КонецЕсли;	

		НовыйЭлементДО.ВалютаДоговора = ТекущаяСтрока.ВалютаДоговора;
		НовыйЭлементДО.Организация = СсылкаНаДокумент.Организация;
		Если ТекущаяСтрока.ТипДО.Пустая() Тогда
			НовыйЭлементДО.ТипДолговогоОбязательства = ТипДО;
		Иначе
			НовыйЭлементДО.ТипДолговогоОбязательства = ТекущаяСтрока.ТипДО;
		КонецЕсли;
		
		НаборЗаписейДО = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
		НаборЗаписейДО.Отбор.Объект.Установить(СсылкаНовогоДО); 	
		НаборЗаписейДО.Прочитать();
		НаборЗаписейДОТЗ = НаборЗаписейДО.Выгрузить();
	КонецЕсли;
	
	Для Каждого Колонка Из тзДанныеЗначение.Колонки Цикл
		//Заполнение Свойств:
		Если Массив.Найти(Колонка.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		КодСвойства = СтрЗаменить(Сред(Колонка.Имя, 2), "_", " ");
		Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду(КодСвойства);
		
		ЭтоСвойствоКонтрагента = (Свойство.Родитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеРеквизиты_Контрагенты ИЛИ 
					Свойство.Родитель.Родитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеСведения_Контрагенты);
					
		ЭтоСвойствоДолговогоОбязательства = (Свойство.Родитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеРеквизиты_ДолговыеОбязательства ИЛИ 
					Свойство.Родитель.Родитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеСведения_ДолговыеОбязательства);
					
		Если Свойство.ЭтоДополнительноеСведение И ЭтоСвойствоКонтрагента И ОбновитьРеквизитыК Тогда
			//Записываем дополнительные сведения
			НайденныеСтрокиК = НаборЗаписейКТЗ.НайтиСтроки(Новый Структура("Свойство", Свойство));    
			Если НайденныеСтрокиК.Количество() = 0 Тогда
				НоваяСтрокаК = НаборЗаписейКТЗ.Добавить();
				НоваяСтрокаК.Объект = СсылкаНовогоК;
				НоваяСтрокаК.Свойство = Свойство;
			Иначе 
				НоваяСтрокаК = НайденныеСтрокиК[0];
			КонецЕсли;	
			НоваяСтрокаК.Значение = ТекущаяСтрока[Колонка.Имя];
		ИначеЕсли Не Свойство.ЭтоДополнительноеСведение И ЭтоСвойствоКонтрагента И ОбновитьРеквизитыК Тогда	
			//Записываем дополнительные реквизиты
			НайденныеСтрокиК = НовыйЭлементК.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Свойство));    
			Если НайденныеСтрокиК.Количество() = 0 Тогда
				НоваяСтрокаК = НовыйЭлементК.ДополнительныеРеквизиты.Добавить();
			Иначе 
				НоваяСтрокаК = НайденныеСтрокиК[0];
				Если НайденныеСтрокиК.Количество() > 1 Тогда 
					Для Индекс = 2 По НайденныеСтрокиК.Количество() Цикл
						ИндексПересчитанный = НайденныеСтрокиК.Количество() - Индекс + 1;
						НовыйЭлементК.ДополнительныеРеквизиты.Удалить(НайденныеСтрокиК[ИндексПересчитанный].НомерСтроки - 1);
					КонецЦикла;	
					Если ВыводитьСообщения Тогда
			    	Сообщить("Ошибка! Дублирование доп реквизита у Должника!");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрокаК.Свойство = Свойство;
			НоваяСтрокаК.Значение = ТекущаяСтрока[Колонка.Имя];
		
		ИначеЕсли Свойство.ЭтоДополнительноеСведение И ЭтоСвойствоДолговогоОбязательства И ОбновитьРеквизитыДО Тогда 
			НайденныеСтрокиДО = НаборЗаписейДОТЗ.НайтиСтроки(Новый Структура("Свойство", Свойство));    
			Если НайденныеСтрокиДО.Количество() = 0 Тогда
				НоваяСтрокаДО = НаборЗаписейДОТЗ.Добавить();
				НоваяСтрокаДО.Объект = СсылкаНовогоДО;
				НоваяСтрокаДО.Свойство = Свойство;
			Иначе 
				НоваяСтрокаДО = НайденныеСтрокиДО[0];
			КонецЕсли;	
			НоваяСтрокаДО.Значение = ТекущаяСтрока[Колонка.Имя];	
		ИначеЕсли Не Свойство.ЭтоДополнительноеСведение И ЭтоСвойствоДолговогоОбязательства И ОбновитьРеквизитыДО Тогда 
			НайденныеСтрокиДО = НовыйЭлементДО.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Свойство));    
			Если НайденныеСтрокиДО.Количество() = 0 Тогда
				НоваяСтрокаДО = НовыйЭлементДО.ДополнительныеРеквизиты.Добавить();
			Иначе
				НоваяСтрокаДО = НайденныеСтрокиДО[0];
				Если НайденныеСтрокиДО.Количество() > 1 Тогда	
					Для Индекс = 2 По НайденныеСтрокиДО.Количество() Цикл
						ИндексПересчитанный = НайденныеСтрокиДО.Количество() - Индекс + 1;
			            НовыйЭлементДО.ДополнительныеРеквизиты.Удалить(НайденныеСтрокиДО[ИндексПересчитанный].НомерСтроки - 1);
					КонецЦикла;
					Если ВыводитьСообщения Тогда
				    Сообщить("Ошибка! Дублирование доп реквизита у ДО!");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрокаДО.Свойство = Свойство;
			НоваяСтрокаДО.Значение = ТекущаяСтрока[Колонка.Имя];	
			
		КонецЕсли;						
		   
	КонецЦикла;		
	Если ОбновитьРеквизитыК Тогда
		НовыйЭлементК.ОбменДанными.Загрузка = Истина;
		НовыйЭлементК.Записать();
		НаборЗаписейК.Загрузить(НаборЗаписейКТЗ);
		Если НаборЗаписейК.Количество() > 0 Тогда
			НаборЗаписейК.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущаяСтрока.ИдентификаторКА <> "" Тогда
		СправочникКА = Справочники.Контрагенты;
		НайденнаяСсылкаКА = СправочникКА.НайтиПоРеквизиту("КодКонтрагента", ТекущаяСтрока.ИдентификаторКА);
		ОбновитьРеквизитыКА = Ложь;
		Если НайденнаяСсылкаКА = СправочникКА.ПустаяСсылка() Тогда
			НовыйЭлементКА = СправочникКА.СоздатьЭлемент();
			СсылкаНовогоКА = СправочникКА.ПолучитьСсылку();
			НовыйЭлементКА.УстановитьСсылкуНового(СсылкаНовогоКА);
			ОбновитьРеквизитыКА = Истина;
		Иначе
			СсылкаНовогоКА = НайденнаяСсылкаКА;
			Если ОбновлятьРанееЗаписанные Тогда
				Если ВыводитьСообщения Тогда
					УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Контрагент уже существует. КлиентскийНомер = " + 
					ТекущаяСтрока.ИдентификаторКА + ". Данные обновлены.", НайденнаяСсылкаКА,,,);
				КонецЕсли;		
				НовыйЭлементКА = НайденнаяСсылкаКА.ПолучитьОбъект();		
				ОбновитьРеквизитыКА = Истина;
			Иначе
				Если ВыводитьСообщения Тогда
					УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Контрагент уже существует. КлиентскийНомер = " + 
					ТекущаяСтрока.ИдентификаторКА + ".", НайденнаяСсылкаКА,,,);
				КонецЕсли;
			КонецЕсли;	  
		КонецЕсли;	
	КонецЕсли;
	
	Если ТекущаяСтрока.ИдентификаторКР <> "" Тогда
		СправочникКР = Справочники.Контрагенты;
		НайденнаяСсылкаКР = СправочникКР.НайтиПоРеквизиту("КодКонтрагента", ТекущаяСтрока.ИдентификаторКР);
		ОбновитьРеквизитыКР = Ложь;
		Если НайденнаяСсылкаКР = СправочникКР.ПустаяСсылка() Тогда
			НовыйЭлементКР = СправочникКР.СоздатьЭлемент();
			СсылкаНовогоКР = СправочникКР.ПолучитьСсылку();
			НовыйЭлементКР.УстановитьСсылкуНового(СсылкаНовогоКР);
			ОбновитьРеквизитыКР = Истина;
		Иначе
			СсылкаНовогоКР = НайденнаяСсылкаКР;
			Если ОбновлятьРанееЗаписанные Тогда
				Если ВыводитьСообщения Тогда
					УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Кредитор уже существует. КлиентскийНомер = " + 
					ТекущаяСтрока.ИдентификаторКР + ". Данные обновлены.", НайденнаяСсылкаКР,,,);
				КонецЕсли;		
				НовыйЭлементКР = НайденнаяСсылкаКР.ПолучитьОбъект();		
				ОбновитьРеквизитыКР = Истина;
			Иначе
				Если ВыводитьСообщения Тогда
					УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Кредитор уже существует. КлиентскийНомер = " + 
					ТекущаяСтрока.ИдентификаторКР + ".", НайденнаяСсылкаКР,,,);
				КонецЕсли;
			КонецЕсли;	  
		КонецЕсли;
	КонецЕсли;	
	
	Если Константы.УчетПоДоговорам.Получить() Тогда
		Если ТекущаяСтрока.ИдентификаторД <> "" Тогда			
			СправочникД = Справочники.ДоговорыКонтрагентов;
			НайденнаяСсылкаД = СправочникД.НайтиПоРеквизиту("КодДоговора", ТекущаяСтрока.ИдентификаторД);
			ОбновитьРеквизитыД = Ложь;
			Если НайденнаяСсылкаД = СправочникД.ПустаяСсылка() Тогда
				НовыйЭлементД = СправочникД.СоздатьЭлемент();
				СсылкаНовогоД = СправочникД.ПолучитьСсылку();
				НовыйЭлементД.УстановитьСсылкуНового(СсылкаНовогоД);
				ОбновитьРеквизитыД = Истина;
			Иначе
				СсылкаНовогоД = НайденнаяСсылкаД;
				Если ОбновлятьРанееЗаписанные Тогда
					Если ВыводитьСообщения Тогда
						УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Договор уже существует. КлиентскийНомер = " + 
						ТекущаяСтрока.ИдентификаторД + ". Данные обновлены.", НайденнаяСсылкаД,,,);
					КонецЕсли;		
					НовыйЭлементД = НайденнаяСсылкаД.ПолучитьОбъект();		
					ОбновитьРеквизитыД = Истина;
				Иначе
					Если ВыводитьСообщения Тогда
						УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Договор уже существует. КлиентскийНомер = " + 
						ТекущаяСтрока.ИдентификаторД + ".", НайденнаяСсылкаД,,,);
					КонецЕсли;
				КонецЕсли;	  
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Константы.УчетПоУслугам.Получить() Тогда
		Если ТекущаяСтрока.ИдентификаторУ <> "" Тогда
			
			СправочникУ = Справочники.УслугиПоДоговору;
			НайденнаяСсылкаУ = СправочникУ.НайтиПоРеквизиту("КодУслуги", ТекущаяСтрока.ИдентификаторУ);
			ОбновитьРеквизитыУ = Ложь;
			Если НайденнаяСсылкаУ = СправочникУ.ПустаяСсылка() Тогда
				НовыйЭлементУ = СправочникУ.СоздатьЭлемент();
				СсылкаНовогоУ = СправочникУ.ПолучитьСсылку();
				НовыйЭлементУ.УстановитьСсылкуНового(СсылкаНовогоУ);
				ОбновитьРеквизитыУ = Истина;
			Иначе
				СсылкаНовогоУ = НайденнаяСсылкаУ;
				Если ОбновлятьРанееЗаписанные Тогда
					Если ВыводитьСообщения Тогда
						УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Услуга уже существует. КлиентскийНомер = " + 
						ТекущаяСтрока.ИдентификаторУ + ". Данные обновлены.", НайденнаяСсылкаУ,,,);
					КонецЕсли;		
					НовыйЭлементУ = НайденнаяСсылкаУ.ПолучитьОбъект();		
					ОбновитьРеквизитыУ = Истина;
				Иначе
					Если ВыводитьСообщения Тогда
						УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Услуга уже существует. КлиентскийНомер = " + 
						ТекущаяСтрока.ИдентификаторУ + ".", НайденнаяСсылкаУ,,,);
					КонецЕсли;
				КонецЕсли;	  
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Константы.УчетПоИД.Получить() Тогда
		
		Если ТекущаяСтрока.ИдентификаторИД <> "" Тогда
			СправочникИД = Справочники.ИсполнительныеДокументы;
			НайденнаяСсылкаИД = СправочникИД.НайтиПоРеквизиту("КодИД", ТекущаяСтрока.ИдентификаторИД);
			ОбновитьРеквизитыИД = Ложь;
			Если НайденнаяСсылкаИД = СправочникИД.ПустаяСсылка() Тогда
				НовыйЭлементИД = СправочникИД.СоздатьЭлемент();
				СсылкаНовогоИД = СправочникИД.ПолучитьСсылку();
				НовыйЭлементИД.УстановитьСсылкуНового(СсылкаНовогоИД);
				ОбновитьРеквизитыИД = Истина;
			Иначе
				СсылкаНовогоИД = НайденнаяСсылкаИД;
				Если ОбновлятьРанееЗаписанные Тогда
					Если ВыводитьСообщения Тогда
						УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Исполнительный документ уже существует. КлиентскийНомер = " + 
						ТекущаяСтрока.ИдентификаторИД + ". Данные обновлены.", НайденнаяСсылкаИД,,,);
					КонецЕсли;		
					НовыйЭлементИД = НайденнаяСсылкаИД.ПолучитьОбъект();		
					ОбновитьРеквизитыИД = Истина;
				Иначе
					Если ВыводитьСообщения Тогда
						УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("Договор уже существует. КлиентскийНомер = " + 
						ТекущаяСтрока.ИдентификаторИД + ".", НайденнаяСсылкаИД,,,);
					КонецЕсли;
				КонецЕсли;	  
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Если ОбновитьРеквизитыДО Тогда
		Если ТекущаяСтрока.ИдентификаторКА <> "" Тогда 
			Если НовыйЭлементДО.Контрагенты.НайтиСтроки(Новый Структура("Значение, ВидКонтрагента", 
				СсылкаНовогоКА, Перечисления.ВидыКонтрагентов.Контрагент)).Количество() = 0 Тогда
				Нов = НовыйЭлементДО.Контрагенты.Добавить();
				Нов.Значение = СсылкаНовогоКА;
				Нов.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Контрагент;
			КонецЕсли;
		КонецЕсли;
		Если ТекущаяСтрока.ИдентификаторКР <> "" Тогда
			Если НовыйЭлементДО.Контрагенты.НайтиСтроки(Новый Структура("Значение, ВидКонтрагента", 
				СсылкаНовогоК, Перечисления.ВидыКонтрагентов.Кредитор)).Количество() = 0 Тогда
				Нов = НовыйЭлементДО.Контрагенты.Добавить();
				Нов.Значение = СсылкаНовогоКР;
				Нов.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Кредитор;
			КонецЕсли;
		КонецЕсли;
		Если НовыйЭлементДО.Услуги.НайтиСтроки(Новый Структура("Значение", 
			СсылкаНовогоУ)).Количество() = 0 Тогда
			Нов = НовыйЭлементДО.Услуги.Добавить();
			Нов.Значение = СсылкаНовогоУ; 
		КонецЕсли;
		НовыйЭлементДО.Услуга = СсылкаНовогоУ;		
	КонецЕсли;
	
	Если ТекущаяСтрока.ИдентификаторКА <> "" Тогда	
		Если ОбновитьРеквизитыКА Тогда
			НовыйЭлементКА.Наименование = ТекущаяСтрока.НаименованиеКА;
			НовыйЭлементКА.КодКонтрагента = ТекущаяСтрока.ИдентификаторКА;
			НовыйЭлементКА.Организация = СсылкаНаДокумент.Организация;
			Если ТекущаяСтрока.ТипКА.Пустая() Тогда
				НовыйЭлементКА.ЮрФизЛицо = ТипКА;
			Иначе
				НовыйЭлементКА.ЮрФизЛицо = ТекущаяСтрока.ТипКА;
			КонецЕсли;
			//НовыйЭлемент.ПроверкаДвойников();
			Если НЕ ТекущаяСтрока.НаименованиеКА = "" Тогда
				НовыйЭлементКА.ПроверкаДвойников();
			КонецЕсли; 	
			НовыйЭлементКА.ОбменДанными.Загрузка = Истина;
			НовыйЭлементКА.Записать();		
		КонецЕсли;
	КонецЕсли;
	
	Если Константы.УчетПоДоговорам.Получить() Тогда
		Если ТекущаяСтрока.ИдентификаторД <> "" Тогда
			Если ОбновитьРеквизитыД Тогда
				НовыйЭлементД.Организация = СсылкаНаДокумент.Организация;
				НовыйЭлементД.КодДоговора = ТекущаяСтрока.ИдентификаторД;
				НовыйЭлементД.Наименование = ТекущаяСтрока.НаименованиеД;
				Если НовыйЭлементД.Контрагенты.НайтиСтроки(Новый Структура("Контрагент", 
					СсылкаНовогоКА)).Количество() = 0 Тогда
					Нов = НовыйЭлементД.Контрагенты.Добавить();
					Нов.Контрагент = СсылкаНовогоКА;
				КонецЕсли;			
				НовыйЭлементД.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Константы.УчетПоУслугам.Получить() Тогда
		Если ТекущаяСтрока.ИдентификаторУ <> "" Тогда	
			Если ОбновитьРеквизитыУ Тогда
				НовыйЭлементУ.Организация = СсылкаНаДокумент.Организация;
				НовыйЭлементУ.КодУслуги = ТекущаяСтрока.ИдентификаторУ;
				НовыйЭлементУ.Наименование = ТекущаяСтрока.НаименованиеУ;	
				НовыйЭлементУ.Владелец = СсылкаНовогоД;
				НовыйЭлементУ.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Если Константы.УчетПоИД.Получить() Тогда
		Если ТекущаяСтрока.ИдентификаторИД <> "" Тогда		
			Если ОбновитьРеквизитыИД Тогда
				НовыйЭлементИД.Организация = СсылкаНаДокумент.Организация;
				НовыйЭлементИД.КодИД = ТекущаяСтрока.ИдентификаторИД;
				НовыйЭлементИД.НомерДела = ТекущаяСтрока.НаименованиеИД;	
				НовыйЭлементИД.Должник = СсылкаНовогоК;
				НовыйЭлементИД.Владелец = СсылкаНовогоДО;
				НовыйЭлементИД.Взыскатель = СсылкаНовогоКР;
				НовыйЭлементИД.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Если ТекущаяСтрока.ИдентификаторКР <> "" Тогда
		Если ОбновитьРеквизитыКР Тогда
			НовыйЭлементКР.Наименование = ТекущаяСтрока.НаименованиеКР;
			НовыйЭлементКР.КодКонтрагента = ТекущаяСтрока.ИдентификаторКР;
			НовыйЭлементКР.Организация = СсылкаНаДокумент.Организация;
			Если ТекущаяСтрока.ТипКР.Пустая() Тогда
				НовыйЭлементКР.ЮрФизЛицо = ТипКР;
			Иначе
				НовыйЭлементКР.ЮрФизЛицо = ТекущаяСтрока.ТипКР;
			КонецЕсли;
			//НовыйЭлемент.ПроверкаДвойников();
			Если НЕ ТекущаяСтрока.НаименованиеКР = "" Тогда
				НовыйЭлементКР.ПроверкаДвойников();
			КонецЕсли; 	
			НовыйЭлементКР.ОбменДанными.Загрузка = Истина;
			НовыйЭлементКР.Записать();			
		КонецЕсли;
	КонецЕсли;
		
	Если ОбновитьРеквизитыДО Тогда
		НовыйЭлементДО.Записать();
		НаборЗаписейДО.Загрузить(НаборЗаписейДОТЗ);
		Если НаборЗаписейДО.Количество() > 0 Тогда
			НаборЗаписейДО.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Если Не СоздаватьДО ИЛИ ТекущаяСтрока.НомерДО = "" Тогда
		Возврат Справочники.ДолговыеОбязательства.ПустаяСсылка();
	Иначе
    	Возврат НовыйЭлементДО.Ссылка;
	КонецЕсли;
КонецФункции

Процедура СоздатьДокументРезультатАвтоинформирования() Экспорт
	СсылкаСправочникаFTP = Константы.FTPСоединение.Получить();
	Каталог = Константы.КаталогРезультатовАвтоинформирования.Получить();
	Если СсылкаСправочникаFTP.Пустая() Тогда	
		Массив = НайтиФайлы(Каталог, "[" + Константы.ИмяИсточникаАИ.Получить() + "] *.ats", Ложь);	
	Иначе		
		Попытка
			FTPПапка = Новый FTPСоединение(СсылкаСправочникаFTP.Сервер,, СсылкаСправочникаFTP.Пользователь,
					СсылкаСправочникаFTP.Пароль);
		Исключение	
			//Сообщить("Не удалось создать FTP соединение");		
			Возврат;
		КонецПопытки;
		Массив = FTPПапка.НайтиФайлы(Каталог, "[" + Константы.ИмяИсточникаАИ.Получить() + "] *.ats", Ложь);		
	КонецЕсли;
		    
	Если Массив.Количество() > 0 Тогда
		Документ = Документы.РезультатыАвтоинформирования.СоздатьДокумент();
		Документ.Дата = ТекущаяДата();
		Файл = Новый ТекстовыйДокумент();
		Для Каждого Элемент Из Массив Цикл
			Если СсылкаСправочникаFTP.Пустая() Тогда
				Файл.Прочитать(Элемент.ПолноеИмя);
			Иначе	
				ИмяФайла = КаталогВременныхФайлов() + Элемент.Имя;
				FTPПапка.Получить(Элемент.ПолноеИмя, ИмяФайла);
				Файл.Прочитать(ИмяФайла);
				УдалитьФайлы(ИмяФайла);						
			КонецЕсли;

			//Файл с одной строкой вида: УИД~Результат~Дата
			СписокСтрок = СтрЗаменить(Файл.ПолучитьТекст(), "~", Символы.ПС);		
			НоваяСтрока = Документ.Результаты.Добавить();
			НоваяСтрока.УИД = Новый УникальныйИдентификатор(СтрПолучитьСтроку(СписокСтрок, 1)); 
			СтрокаРезультат = СтрПолучитьСтроку(СписокСтрок, 2);
			НоваяСтрока.Дата = Дата(СтрПолучитьСтроку(СписокСтрок, 3));
			
			Если Лев(СтрокаРезультат, СтрДлина("ИНФОРМИРОВАНИЕ_ЗАВЕРШЕНО")) = "ИНФОРМИРОВАНИЕ_ЗАВЕРШЕНО" Тогда
				НоваяСтрока.Результат = Перечисления.РезультатыАвтоинформирования.ИНФОРМИРОВАНИЕ_ЗАВЕРШЕНО;
			Иначе
				Попытка
			    	НоваяСтрока.Результат = Перечисления.РезультатыАвтоинформирования[СтрокаРезультат];
				Исключение
					НоваяСтрока.Результат = Перечисления.РезультатыАвтоинформирования.ОшибкаФорматаСтрокиРезультата;
				КонецПопытки;
			КонецЕсли;		
			//СтрокаДата = СтрЗаменить(СтрокаДата, ":", ""); //"13.10.2010 16:34:31"
			//НоваяСтрока.Дата = Дата( Сред(СтрокаДата,7,4) + Сред(СтрокаДата,4,2) + Лев(СтрокаДата, 2) + 
			//		Сред(СтрокаДата,12,6) );	
		КонецЦикла;
		Документ.Записать(РежимЗаписиДокумента.Запись);	
		
		Для Каждого Элемент Из Массив Цикл
			Если СсылкаСправочникаFTP.Пустая() Тогда
				УдалитьФайлы(Элемент.ПолноеИмя);                     
			Иначе
				FTPПапка.Удалить(Элемент.ПолноеИмя);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;			
КонецПроцедуры


Процедура РегламентныеДействияПоКатегориямСкорингаРегл() Экспорт
	Если РегистрыСведений.РегламентныеДействияПоКатегориям.ПроверитьВыполнениеСкоринга(12) Тогда
		РегламентныеДействияПоКатегориямСкоринга();
	КонецЕсли;
КонецПроцедуры

Процедура РегламентныеДействияПоКатегориямСкоринга(РегламентноеДействиеСсылка = Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РегламентныеДействияПоКатегориям.Ссылка,
	                      |	РегламентныеДействияПоКатегориям.Расписание,
	                      |	ЕСТЬNULL(РегистрРегламентныеДействияПоКатегориям.ДатаНачалаПоследнегоЗапуска, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаНачалаПоследнегоЗапуска,
	                      |	ЕСТЬNULL(РегистрРегламентныеДействияПоКатегориям.ДатаЗавершенияПоследнегоЗапуска, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаЗавершенияПоследнегоЗапуска
	                      |ИЗ
	                      |	Справочник.РегламентныеДействияПоКатегориям КАК РегламентныеДействияПоКатегориям
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентныеДействияПоКатегориям КАК РегистрРегламентныеДействияПоКатегориям
	                      |		ПО (РегистрРегламентныеДействияПоКатегориям.РегламентноеДействие = РегламентныеДействияПоКатегориям.Ссылка)
	                      |ГДЕ
	                      |	(&РегламентноеДействиеСсылка = НЕОПРЕДЕЛЕНО
	                      |			ИЛИ РегламентныеДействияПоКатегориям.Используется = ИСТИНА
	                      |				И РегламентныеДействияПоКатегориям.Ссылка = &РегламентноеДействиеСсылка)");				  
	Запрос.УстановитьПараметр("РегламентноеДействиеСсылка", РегламентноеДействиеСсылка);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Расписание = Результат.Расписание.Получить();
		Если Расписание <> Неопределено Тогда
			Если Расписание.ТребуетсяВыполнение(, Результат.ДатаНачалаПоследнегоЗапуска, 
					Результат.ДатаЗавершенияПоследнегоЗапуска) ИЛИ (РегламентноеДействиеСсылка <> Неопределено) Тогда
				Набор = РегистрыСведений.РегламентныеДействияПоКатегориям.СоздатьМенеджерЗаписи();
				Набор.РегламентноеДействие = Результат.Ссылка;
				Набор.ДатаНачалаПоследнегоЗапуска = ТекущаяДата();
										
				//Этап 1 - Все кроме запуска БП
				ЗапросДО = Новый Запрос("ВЫБРАТЬ
				                        |	РегламентныеДействияПоКатегориямТаблицаДействий.НомерСтроки КАК НомерСтроки,
				                        |	РегламентныеДействияПоКатегориямТаблицаДействий.Действие,
				                        |	РегламентныеДействияПоКатегориямТаблицаДействий.Шаблон,
				                        |	РегламентныеДействияПоКатегориямТаблицаДействий.ВидКИ,
				                        |	СостоянияПоКатегориямОстатки.Объект
				                        |ИЗ
				                        |	Справочник.РегламентныеДействияПоКатегориям.ТаблицаДействий КАК РегламентныеДействияПоКатегориямТаблицаДействий
				                        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СостоянияПоКатегориям.Остатки КАК СостоянияПоКатегориямОстатки
				                        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
				                        |					,
				                        |					Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
				                        |						И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
				                        |						И (&ОрганизацияПустая
				                        |							ИЛИ Организация = &Организация)) КАК ОбъектыВРаботеОстатки
				                        |			ПО СостоянияПоКатегориямОстатки.Объект = ОбъектыВРаботеОстатки.Объект
				                        |		ПО РегламентныеДействияПоКатегориямТаблицаДействий.Скоринг = СостоянияПоКатегориямОстатки.Скоринг
				                        |			И РегламентныеДействияПоКатегориямТаблицаДействий.Категория = СостоянияПоКатегориямОстатки.Категория
				                        |ГДЕ
				                        |	РегламентныеДействияПоКатегориямТаблицаДействий.Ссылка = &Ссылка
				                        |	И НЕ ОбъектыВРаботеОстатки.Организация ЕСТЬ NULL 
				                        |	И РегламентныеДействияПоКатегориямТаблицаДействий.Действие <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийДляСкоринга.ЗапускБП)
				                        |	И РегламентныеДействияПоКатегориямТаблицаДействий.Действие <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийДляСкоринга.ПроизвольноеДействие)
										|	И РегламентныеДействияПоКатегориямТаблицаДействий.Действие <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийДляСкоринга.ЗавершениеБП)
				                        |	И РегламентныеДействияПоКатегориямТаблицаДействий.Используется = ИСТИНА
				                        |
				                        |УПОРЯДОЧИТЬ ПО
				                        |	НомерСтроки");
				ЗапросДО.УстановитьПараметр("Ссылка", Результат.Ссылка);
				ЗапросДО.УстановитьПараметр("Организация", Результат.Ссылка.Организация);
				ЗапросДО.УстановитьПараметр("ОрганизацияПустая", Результат.Ссылка.Организация.Пустая());
				
				РезультатДО = ЗапросДО.Выполнить().Выбрать(); 
				НомСтр = -1;
				Пока РезультатДО.Следующий() Цикл
					Если НомСтр = -1 Тогда
						НомСтр = РезультатДО.НомерСтроки;
						ДокументОбъект = Документы.УдалитьРассылка.СоздатьДокумент();
						ДокументОбъект.Дата = ТекущаяДата();
						ДокументОбъект.Автор = Результат.Ссылка;
						ДокументОбъект.Комментарий = "Регламентное действие";
						ДокументОбъект.Организация = Результат.Ссылка.Организация;
						ДокументОбъект.ВидКИ = РезультатДО.ВидКИ;
						ДокументОбъект.Действие = РезультатДО.Действие;
						ДокументОбъект.Шаблон = РезультатДО.Шаблон;
						Если РезультатДО.Действие = Перечисления.ВариантыДействийДляСкоринга.SMSОповещение Тогда
							ДокументОбъект.УчетнаяЗаписьОтправителя = Константы.УчеткаSMSРассылок.Получить();
						ИначеЕсли РезультатДО.Действие = Перечисления.ВариантыДействийДляСкоринга.EMailРассылка Тогда
							ДокументОбъект.УчетнаяЗаписьОтправителя = Константы.УчеткаEMailРассылок.Получить();
						КонецЕсли;						
					КонецЕсли;
					Если РезультатДО.НомерСтроки <> НомСтр Тогда
						
						Попытка 
							Если ДокументОбъект.ПроверитьЗаполнение() Тогда
								ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
								Сообщить("Создан документ ЗаданияДляАвтоинформирования.");
							Иначе
								Сообщить("Недостаточно данных для заполнения документа");
							КонецЕсли;
						Исключение
							Сообщить("Отказ в создании документа ЗаданияДляАвтоинформирования.");
						КонецПопытки;						
						НомСтр = РезультатДО.НомерСтроки;
						ДокументОбъект = Документы.УдалитьРассылка.СоздатьДокумент();
						ДокументОбъект.Дата = ТекущаяДата();
						ДокументОбъект.Автор = Результат.Ссылка;
						ДокументОбъект.Комментарий = "Регламентное действие";
						ДокументОбъект.Организация = Результат.Ссылка.Организация;
						ДокументОбъект.ВидКИ = РезультатДО.ВидКИ;
						ДокументОбъект.Действие = РезультатДО.Действие;
						ДокументОбъект.Шаблон = РезультатДО.Шаблон;
						Если РезультатДО.Действие = Перечисления.ВариантыДействийДляСкоринга.SMSОповещение Тогда
							ДокументОбъект.УчетнаяЗаписьОтправителя = Константы.УчеткаSMSРассылок.Получить();
						ИначеЕсли РезультатДО.Действие = Перечисления.ВариантыДействийДляСкоринга.EMailРассылка Тогда
							ДокументОбъект.УчетнаяЗаписьОтправителя = Константы.УчеткаEMailРассылок.Получить();
						КонецЕсли;
					Иначе					
						
					КонецЕсли;  
					Строка = ДокументОбъект.Объекты.Добавить();
					Строка.Объект = РезультатДО.Объект;
					Строка.Контакт = Автоинформирование.ПолучитьКонтакт(РезультатДО.Объект, РезультатДО.ВидКИ);
					Строка.Текст = Автоинформирование.ПолучитьПодсказку(РезультатДО.Объект, РезультатДО.Шаблон);
				КонецЦикла;
				
				
				//Этап 2 - Запуски БП
				ЗапросДО.Текст = "ВЫБРАТЬ
				                 |	РегламентныеДействияПоКатегориямТаблицаДействий.Действие,
				                 |	РегламентныеДействияПоКатегориямТаблицаДействий.Шаблон,
				                 |	СостоянияПоКатегориямОстатки.Объект
				                 |ИЗ
				                 |	Справочник.РегламентныеДействияПоКатегориям.ТаблицаДействий КАК РегламентныеДействияПоКатегориямТаблицаДействий
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СостоянияПоКатегориям.Остатки КАК СостоянияПоКатегориямОстатки
				                 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
				                 |					,
				                 |					Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
				                 |						И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
				                 |						И (&ОрганизацияПустая
				                 |							ИЛИ Организация = &Организация)) КАК ОбъектыВРаботеОстатки
				                 |			ПО СостоянияПоКатегориямОстатки.Объект = ОбъектыВРаботеОстатки.Объект
				                 |		ПО РегламентныеДействияПоКатегориямТаблицаДействий.Скоринг = СостоянияПоКатегориямОстатки.Скоринг
				                 |			И РегламентныеДействияПоКатегориямТаблицаДействий.Категория = СостоянияПоКатегориямОстатки.Категория
				                 |ГДЕ
				                 |	РегламентныеДействияПоКатегориямТаблицаДействий.Ссылка = &Ссылка
				                 |	И (НЕ ОбъектыВРаботеОстатки.Организация ЕСТЬ NULL )
				                 |	И РегламентныеДействияПоКатегориямТаблицаДействий.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийДляСкоринга.ЗапускБП)
				                 |	И РегламентныеДействияПоКатегориямТаблицаДействий.Используется = ИСТИНА
				                 |
				                 |УПОРЯДОЧИТЬ ПО
				                 |	РегламентныеДействияПоКатегориямТаблицаДействий.Шаблон";				
				ДокументОбъект = Неопределено;
				РезультатДО = ЗапросДО.Выполнить().Выбрать();		
				Пока РезультатДО.Следующий() Цикл
					Если Результат.Ссылка.ТолькоДляНовых Тогда
						//Проверка на наличие заданий
						ЗапросЗаданий = Новый Запрос("ВЫБРАТЬ
						                             |	ЗапускБП.Ссылка
						                             |ИЗ
						                             |	Документ.ЗапускБП КАК ЗапускБП
						                             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапускБП.Объекты КАК ЗапускБПОбъекты
						                             |		ПО (ЗапускБПОбъекты.Ссылка = ЗапускБП.Ссылка)
						                             |ГДЕ
						                             |	ЗапускБП.Организация = &Организация
						                             |	И ЗапускБП.Проведен = ИСТИНА
						                             |	И ЗапускБП.Операция = &Операция
						                             |	И ЗапускБП.Автор = &РегламентноеДействие
						                             |	И ЗапускБПОбъекты.Объект = &Объект");
						ЗапросЗаданий.УстановитьПараметр("Организация", Результат.Ссылка.Организация);
						ЗапросЗаданий.УстановитьПараметр("Операция", РезультатДО.Шаблон);
						ЗапросЗаданий.УстановитьПараметр("РегламентноеДействие", Результат.Ссылка);
                        ЗапросЗаданий.УстановитьПараметр("Объект", РезультатДО.Объект);
						Если Не ЗапросЗаданий.Выполнить().Пустой() Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					
					Если Результат.Ссылка.ТолькоДляСвободных Тогда
						//Проверка на наличие активных бизнес-процессов						
						ЗапросЗаданий = Новый Запрос("ВЫБРАТЬ
						                             |	БизнесПроцессы.Ссылка КАК Ссылка
						                             |ИЗ
						                             |	БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
						                             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапускБП.Объекты КАК ЗапускБПОбъекты
						                             |		ПО БизнесПроцессы.Автор = ЗапускБПОбъекты.Ссылка
						                             |			И БизнесПроцессы.Объект = ЗапускБПОбъекты.Объект
						                             |ГДЕ
						                             |	БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
						                             |	И БизнесПроцессы.Завершен = ЛОЖЬ
						                             |	И БизнесПроцессы.Стартован = ИСТИНА
						                             |	И БизнесПроцессы.Автор.Операция = &Операция
						                             |	И БизнесПроцессы.Автор.Автор = &РегламентноеДействие
						                             |	И ЗапускБПОбъекты.Объект = &Объект
						                             |	И БизнесПроцессы.Автор.Организация = &Организация");
						
						ЗапросЗаданий.УстановитьПараметр("Организация", Результат.Ссылка.Организация);
						ЗапросЗаданий.УстановитьПараметр("Операция", РезультатДО.Шаблон);
						ЗапросЗаданий.УстановитьПараметр("РегламентноеДействие", Результат.Ссылка);
                        ЗапросЗаданий.УстановитьПараметр("Объект", РезультатДО.Объект);
						Если Не ЗапросЗаданий.Выполнить().Пустой() Тогда
							Продолжить;
						КонецЕсли;
					 КонецЕсли;
					
					Если ДокументОбъект <> Неопределено И ДокументОбъект.Операция <> РезультатДО.Шаблон Тогда 
					    Попытка
							ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
							Сообщить("Создан документ ЗапускБП.");
						Исключение
							Сообщить("Отказ в создании документа ЗапускБП.");
						КонецПопытки;
						ДокументОбъект = Неопределено;
					КонецЕсли;
					
					Если ДокументОбъект = Неопределено Тогда
						ДокументОбъект = Документы.ЗапускБП.СоздатьДокумент();
						ДокументОбъект.Дата = ТекущаяДата();
						ДокументОбъект.Автор = Результат.Ссылка;
						ДокументОбъект.Комментарий = "Регламентное действие";
						ДокументОбъект.Организация = Результат.Ссылка.Организация;
						ДокументОбъект.Подразделение = Неопределено;
						ДокументОбъект.Операция = РезультатДО.Шаблон;
						Если Не РегистрыСведений.НастройкиБП.ЗаполнитьДанныеДляЗапускаСВыбраннойСтадии(ДокументОбъект, РезультатДО.Шаблон) Тогда
							ДокументОбъект.Схема = РегистрыСведений.НастройкиБП.ПолучитьСхемуПоОперации(
								ДокументОбъект.Организация, ДокументОбъект.Подразделение, ДокументОбъект.Операция);
						КонецЕсли;
					КонецЕсли;					
					ДокументОбъект.Объекты.Добавить().Объект = РезультатДО.Объект;
				КонецЦикла;
					
				Если ДокументОбъект <> Неопределено Тогда 
				    Попытка
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
						Сообщить("Создан документ ЗапускБП.");
					Исключение
						Сообщить("Отказ в создании документа ЗапускБП.");
					КонецПопытки;
				КонецЕсли;
								
				
				
				//Этап 3 - Выполнение произвольных действий
				ЗапросДО.Текст = "ВЫБРАТЬ
				                 |	РегламентныеДействияПоКатегориямТаблицаДействий.Действие,
				                 |	РегламентныеДействияПоКатегориямТаблицаДействий.Шаблон,
				                 |	СостоянияПоКатегориямОстатки.Объект
				                 |ИЗ
				                 |	Справочник.РегламентныеДействияПоКатегориям.ТаблицаДействий КАК РегламентныеДействияПоКатегориямТаблицаДействий
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СостоянияПоКатегориям.Остатки КАК СостоянияПоКатегориямОстатки
				                 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
				                 |					,
				                 |					Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
				                 |						И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
				                 |						И (&ОрганизацияПустая
				                 |							ИЛИ Организация = &Организация)) КАК ОбъектыВРаботеОстатки
				                 |			ПО СостоянияПоКатегориямОстатки.Объект = ОбъектыВРаботеОстатки.Объект
				                 |		ПО РегламентныеДействияПоКатегориямТаблицаДействий.Скоринг = СостоянияПоКатегориямОстатки.Скоринг
				                 |			И РегламентныеДействияПоКатегориямТаблицаДействий.Категория = СостоянияПоКатегориямОстатки.Категория
				                 |ГДЕ
				                 |	РегламентныеДействияПоКатегориямТаблицаДействий.Ссылка = &Ссылка
				                 |	И (НЕ ОбъектыВРаботеОстатки.Организация ЕСТЬ NULL )
				                 |	И РегламентныеДействияПоКатегориямТаблицаДействий.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийДляСкоринга.ПроизвольноеДействие)
				                 |	И РегламентныеДействияПоКатегориямТаблицаДействий.Используется = ИСТИНА
				                 |
				                 |УПОРЯДОЧИТЬ ПО
				                 |	РегламентныеДействияПоКатегориямТаблицаДействий.Шаблон";				
				ДокументОбъект = Неопределено;
				РезультатДО = ЗапросДО.Выполнить().Выбрать();		
				Пока РезультатДО.Следующий() Цикл
					Если Результат.Ссылка.ТолькоДляНовых Тогда
						//Проверка на наличие заданий
						ЗапросЗаданий = Новый Запрос("ВЫБРАТЬ
						                             |	ЗапускБП.Ссылка
						                             |ИЗ
						                             |	Документ.ДействияПоОбъектам КАК ЗапускБП
						                             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДействияПоОбъектам.Объекты КАК ЗапускБПОбъекты
						                             |		ПО (ЗапускБПОбъекты.Ссылка = ЗапускБП.Ссылка)
						                             |ГДЕ
						                             |	ЗапускБП.Организация = &Организация
						                             |	И ЗапускБП.Проведен = ИСТИНА
						                             |	И ЗапускБП.Действие = &Операция
						                             |	И ЗапускБП.Автор = &РегламентноеДействие
						                             |	И ЗапускБПОбъекты.Объект = &Объект");
						ЗапросЗаданий.УстановитьПараметр("Организация", Результат.Ссылка.Организация);
						ЗапросЗаданий.УстановитьПараметр("Операция", РезультатДО.Шаблон);
						ЗапросЗаданий.УстановитьПараметр("РегламентноеДействие", Результат.Ссылка);
                        ЗапросЗаданий.УстановитьПараметр("Объект", РезультатДО.Объект);
						Если Не ЗапросЗаданий.Выполнить().Пустой() Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
									
					Если ДокументОбъект <> Неопределено И ДокументОбъект.Действие <> РезультатДО.Шаблон Тогда 
						Попытка
						//	ДокументОбъект = Документы.ДействияПоОбъектам.СоздатьДокумент();
							ДокументОбъект.ВыполнитьДействия();
							ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
							Сообщить("Создан документ ДействияПоОбъектам.");
						Исключение
							Сообщить("Отказ в создании документа ДействияПоОбъектам.");
						КонецПопытки;
						ДокументОбъект = Неопределено;
					КонецЕсли;
					
					Если ДокументОбъект = Неопределено Тогда
						ДокументОбъект = Документы.ДействияПоОбъектам.СоздатьДокумент();
						ДокументОбъект.Дата = ТекущаяДата();
						ДокументОбъект.Автор = Результат.Ссылка;
						ДокументОбъект.Комментарий = "Регламентное действие";
						ДокументОбъект.Организация = Результат.Ссылка.Организация;
//						ДокументОбъект.Подразделение = Неопределено;
						ДокументОбъект.Действие = РезультатДО.Шаблон;
					КонецЕсли;					
					ДокументОбъект.Объекты.Добавить().Объект = РезультатДО.Объект;
				КонецЦикла;
					
				Если ДокументОбъект <> Неопределено Тогда 
					Попытка
						ДокументОбъект.ВыполнитьДействия();

						ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
						Сообщить("Создан документ ЗапускБП.");
					Исключение
						Сообщить("Отказ в создании документа ЗапускБП.");
					КонецПопытки;
				КонецЕсли;
				

				
				//Этап 4 - Завершение БП
				ЗапросДО.Текст = "ВЫБРАТЬ
				                 |	РегламентныеДействияПоКатегориямТаблицаДействий.Действие,
				                 |	РегламентныеДействияПоКатегориямТаблицаДействий.Шаблон,
				                 |	СостоянияПоКатегориямОстатки.Объект
				                 |ИЗ
				                 |	Справочник.РегламентныеДействияПоКатегориям.ТаблицаДействий КАК РегламентныеДействияПоКатегориямТаблицаДействий
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СостоянияПоКатегориям.Остатки КАК СостоянияПоКатегориямОстатки
				                 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
				                 |					,
				                 |					Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
				                 |						И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
				                 |						И (&ОрганизацияПустая
				                 |							ИЛИ Организация = &Организация)) КАК ОбъектыВРаботеОстатки
				                 |			ПО СостоянияПоКатегориямОстатки.Объект = ОбъектыВРаботеОстатки.Объект
				                 |		ПО РегламентныеДействияПоКатегориямТаблицаДействий.Скоринг = СостоянияПоКатегориямОстатки.Скоринг
				                 |			И РегламентныеДействияПоКатегориямТаблицаДействий.Категория = СостоянияПоКатегориямОстатки.Категория
				                 |ГДЕ
				                 |	РегламентныеДействияПоКатегориямТаблицаДействий.Ссылка = &Ссылка
				                 |	И (НЕ ОбъектыВРаботеОстатки.Организация ЕСТЬ NULL )
				                 |	И РегламентныеДействияПоКатегориямТаблицаДействий.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийДляСкоринга.ЗавершениеБП)
				                 |	И РегламентныеДействияПоКатегориямТаблицаДействий.Используется = ИСТИНА
				                 |
				                 |УПОРЯДОЧИТЬ ПО
				                 |	РегламентныеДействияПоКатегориямТаблицаДействий.Шаблон";				
								 
				РезультатДО = ЗапросДО.Выполнить().Выбрать();		
				Пока РезультатДО.Следующий() Цикл
					Схема = РегистрыСведений.НастройкиБП.ПолучитьСхемуПоОперации(РезультатДО.Объект.Организация, Неопределено, РезультатДО.Шаблон);	
					ЗапросБП = Новый Запрос("ВЫБРАТЬ
					                        |	БизнесПроцессы.Ссылка
					                        |ИЗ
					                        |	БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
					                        |ГДЕ
					                        |	БизнесПроцессы.Завершен = ЛОЖЬ
					                        |	И БизнесПроцессы.Стартован = ИСТИНА
					                        |	И БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
					                        |	И БизнесПроцессы.Схема = &Схема
					                        |	И БизнесПроцессы.Объект = &Объект");
					ЗапросБП.УстановитьПараметр("Схема", Схема);
					ЗапросБП.УстановитьПараметр("Объект", РезультатДО.Объект);
					РезультатБП = ЗапросБП.Выполнить().Выбрать();
					Пока РезультатБП.Следующий() Цикл
						Попытка							
							БПОбъект = РезультатБП.Ссылка.ПолучитьОбъект();
							БПОбъект.Завершен = Истина;
							БПОбъект.Записать();
							Сообщить("Завершен " + Строка(БПОбъект));
						Исключение
							Сообщить("Отказ в завершении " + Строка(БПОбъект));
						КонецПопытки;
					КонецЦикла;
				КонецЦикла;
				
				
				
				Набор.ДатаЗавершенияПоследнегоЗапуска = ТекущаяДата();
				Попытка
					Набор.Записать();
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;		
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Процедура СозданиеДокументовСкоринга() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыСкоринга.Ссылка,
	                      |	ВидыСкоринга.Расписание,
	                      |	ЕСТЬNULL(РегистрРегламентныеДействияПоКатегориям.ДатаНачалаПоследнегоЗапуска, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаНачалаПоследнегоЗапуска,
	                      |	ЕСТЬNULL(РегистрРегламентныеДействияПоКатегориям.ДатаЗавершенияПоследнегоЗапуска, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаЗавершенияПоследнегоЗапуска
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ВидыСкоринга КАК ВидыСкоринга
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентныеДействияПоКатегориям КАК РегистрРегламентныеДействияПоКатегориям
	                      |		ПО ВидыСкоринга.Ссылка = РегистрРегламентныеДействияПоКатегориям.РегламентноеДействие
	                      |ГДЕ
	                      |	ВидыСкоринга.Используется = ИСТИНА");
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Расписание = Результат.Расписание.Получить();
		Если Расписание <> Неопределено Тогда
			Если Расписание.ТребуетсяВыполнение(, Результат.ДатаНачалаПоследнегоЗапуска, 
					Результат.ДатаЗавершенияПоследнегоЗапуска) Тогда
				Набор = РегистрыСведений.РегламентныеДействияПоКатегориям.СоздатьМенеджерЗаписи();
				Набор.РегламентноеДействие = Результат.Ссылка;
				Набор.ДатаНачалаПоследнегоЗапуска = ТекущаяДата();
				
				ЗапросДО = Новый Запрос("ВЫБРАТЬ
				                        |	ОбъектыВРаботеОстатки.Объект
				                        |ИЗ
				                        |	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки");
				ДокументОбъект = Документы.СкорингДолговыхОбязательств.СоздатьДокумент();
				ДокументОбъект.Дата = ТекущаяДата();
				ДокументОбъект.Скоринг = Результат.Ссылка;
				ДокументОбъект.Организация = ДокументОбъект.Скоринг.Организация;
				ДокументОбъект.Комментарий = "Регламентный скоринг";
				ДокументОбъект.Объекты.Загрузить(ЗапросДО.Выполнить().Выгрузить());
				ДокументОбъект.РаспределитьСервер();
				//Попытка 
				Если ДокументОбъект.Объекты.Количество() > 0 Тогда
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
				//Исключение
				//КонецПопытки;			
				Набор.ДатаЗавершенияПоследнегоЗапуска = ТекущаяДата();
				Набор.Записать();
			КонецЕсли;		
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры


Процедура АвтораспределениеПоСотрудникам() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РаспределениеПоСотрудникам.Ссылка,
	                      |	РаспределениеПоСотрудникам.ПодборОбъектов
	                      |ИЗ
	                      |	Справочник.РаспределениеПоСотрудникам КАК РаспределениеПоСотрудникам
	                      |ГДЕ
	                      |	РаспределениеПоСотрудникам.Используется
	                      |	И РаспределениеПоСотрудникам.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	РаспределениеПоСотрудникам.Приоритет");
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
	
		Если Результат.Ссылка.СпособРаспределения = Перечисления.СпособыРаспределения.ПередатьВсемВРаботу Тогда
			Об = Документы.РаспределитьДела.СоздатьДокумент();
			Об.Организация = Результат.Ссылка.Организация;
			Об.Дата = ТекущаяДата();
			Об.СотрудникПередающий = Результат.Ссылка.Пользователь;
			Об.ТипСотрудника = Результат.Ссылка.ТипСотрудника;
			Об.Автор = Результат.Ссылка.Пользователь;
			
			Об.Сотрудники.Загрузить(Результат.Ссылка.Сотрудники.Выгрузить());
			
			Попытка
				Настройки = Результат.ПодборОбъектов.Настройка.Получить()[0];
				Схема = Результат.ПодборОбъектов.Настройка.Получить()[1];
				
				КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
				МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
				
				ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
				ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
				
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
				
				ТаблицаРезультат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
				об.Объекты.Загрузить(ТаблицаРезультат);
				
			Исключение
				ЗапросПодбора = Новый Запрос(Результат.ПодборОбъектов.ТекстЗапроса);
				Для Каждого Параметр ИЗ Результат.ПодборОбъектов.ПараметрыЗапроса Цикл
					ЗапросПодбора.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
				КонецЦикла;
				
				об.Объекты.Загрузить(ЗапросПодбора.Выполнить().Выгрузить());
				
			КонецПопытки;
			Об.РаспределитьСервер();
			
			Если Об.Объекты.Количество() > 0 Тогда
				Попытка
					Об.Записать(РежимЗаписиДокумента.Проведение);
				Исключение                       
				КонецПопытки;
			КонецЕсли;
			
		ИначеЕсли Результат.Ссылка.СпособРаспределения = Перечисления.СпособыРаспределения.АктПередачи Тогда
			Об = Документы.АктПередачи.СоздатьДокумент();
			Об.Организация = Результат.Ссылка.Организация;
			Об.Дата = ТекущаяДата();
			Об.ПодразделениеПередающее = Результат.Ссылка.ПодразделениеПередающее;
			Об.СотрудникПередающий = Результат.Ссылка.ПользовательПередающий;
			Об.ТипСотрудникаПередающего = Результат.Ссылка.ТипСотрудникаПередающего;
			
			Об.ПодразделениеПринимающее = Результат.Ссылка.ПодразделениеПринимающее;
			Об.СотрудникПринимающий = Результат.Ссылка.ПользовательПринимающий;
			Об.ТипСотрудникаПринимающего = Результат.Ссылка.ТипСотрудникаПринимающего;
			
			Об.Автор = Результат.Ссылка.Пользователь;
			
			Попытка
				Настройки = Результат.ПодборОбъектов.Настройка.Получить()[0];
				Схема = Результат.ПодборОбъектов.Настройка.Получить()[1];
				
				КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
				МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
				
				ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
				ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
				
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
				
				ТаблицаРезультат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
				об.Объекты.Загрузить(ТаблицаРезультат);
				
			Исключение
				ЗапросПодбора = Новый Запрос(Результат.ПодборОбъектов.ТекстЗапроса);
				Для Каждого Параметр ИЗ Результат.ПодборОбъектов.ПараметрыЗапроса Цикл
					ЗапросПодбора.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
				КонецЦикла;
				
				об.Объекты.Загрузить(ЗапросПодбора.Выполнить().Выгрузить());
				
			КонецПопытки;

			
			Если Об.Объекты.Количество() > 0 Тогда
				Попытка
					Об.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;	
			
			
		Иначе
			Об = Документы.РаспределениеПоНагрузке.СоздатьДокумент();
			Об.Организация = Результат.Ссылка.Организация;
			Об.Дата = ТекущаяДата();
			Об.Ответственный = Результат.Ссылка.Пользователь;
			Об.ТипСотрудника = Результат.Ссылка.ТипСотрудника;
			Об.РаспределятьПоДолям = Результат.Ссылка.РаспределятьПоДолям;
			Об.Автор = Результат.Ссылка.Пользователь;
			Если ЗначениеЗаполнено(Результат.Ссылка.Сотрудники) Тогда
				Об.Сотрудники.Загрузить(Результат.Ссылка.Сотрудники.Выгрузить());
			КонецЕсли;
			
						
			Попытка
				Настройки = Результат.ПодборОбъектов.Настройка.Получить()[0];
				Схема = Результат.ПодборОбъектов.Настройка.Получить()[1];
				
				КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
				МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
				
				ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
				ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
				
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
				
				ТаблицаРезультат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
				об.Объекты.Загрузить(ТаблицаРезультат);
				
			Исключение
				ЗапросПодбора = Новый Запрос(Результат.ПодборОбъектов.ТекстЗапроса);
				Для Каждого Параметр ИЗ Результат.ПодборОбъектов.ПараметрыЗапроса Цикл
					ЗапросПодбора.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
				КонецЦикла;
				
				об.Объекты.Загрузить(ЗапросПодбора.Выполнить().Выгрузить());
				
			КонецПопытки;

			Об.ВыполнитьРаспределение();
			
			Если Об.Объекты.Количество() > 0 Тогда
				Попытка
					Об.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбновитьИсториюДанных() Экспорт
	ИсторияДанных.ОбновитьИсторию();	
КонецПроцедуры

Процедура СинхронизацияСЦКТ() Экспорт
	Попытка
		Соединитель = Новый COMОбъект("V82.COMConnector");
		ОбъектЦКТ = Соединитель.Connect(РаботаСЦКТСервер.СтрокаПодключенияКЦКТ());	
	Исключение
		Возврат;
	КонецПопытки;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КампанииОбзвона.Ссылка,
	                      |	КампанииОбзвона.КодВЦКТ
	                      |ИЗ
	                      |	БизнесПроцесс.КампанииОбзвона КАК КампанииОбзвона
	                      |ГДЕ
	                      |	КампанииОбзвона.Стартован = ИСТИНА
	                      |	И КампанииОбзвона.Завершен = ЛОЖЬ");
	Результат = Запрос.Выполнить().Выбрать();	
	Пока Результат.Следующий() Цикл
		ВсеВыполнены = Истина;
		ОбъектБП = Результат.Ссылка.ПолучитьОбъект();
		Для Каждого Элемент Из ОбъектБП.ДолговыеОбязательства Цикл
			Если Элемент.Результат = "" Тогда
				Элемент.Результат = ОбъектЦКТ.КонтактЦентрВС.ПолучитьРезультатЗадачи(Элемент.УИД);
				Если Элемент.Результат = "" Тогда
					ВсеВыполнены = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		
		Если ВсеВыполнены Тогда
			ОбъектБП.Стартован = Ложь;
			ОбъектБП.Завершен = Истина;
		КонецЕсли;
		ОбъектБП.Записать();
	КонецЦикла;	
КонецПроцедуры

Процедура СинхронизацияСУЗРегл() Экспорт
	СинхронизацияСУЗ();
КонецПроцедуры

Процедура СинхронизацияСУЗ(РегламентноеДействиеСсылка = Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ХранилищеВнешнихОбработок.Ссылка,
	                      |	ХранилищеВнешнихОбработок.Расписание,
	                      |	ЕСТЬNULL(РегистрРегламентныеДействияПоКатегориям.ДатаНачалаПоследнегоЗапуска, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаНачалаПоследнегоЗапуска,
	                      |	ЕСТЬNULL(РегистрРегламентныеДействияПоКатегориям.ДатаЗавершенияПоследнегоЗапуска, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаЗавершенияПоследнегоЗапуска,
	                      |	ХранилищеВнешнихОбработок.Хранилище,
	                      |	ХранилищеВнешнихОбработок.ИмяОбработки,
	                      |	ХранилищеВнешнихОбработок.Внутренний
	                      |ИЗ
	                      |	Справочник.ХранилищеВнешнихОбработок КАК ХранилищеВнешнихОбработок
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентныеДействияПоКатегориям КАК РегистрРегламентныеДействияПоКатегориям
	                      |		ПО (РегистрРегламентныеДействияПоКатегориям.РегламентноеДействие = ХранилищеВнешнихОбработок.Ссылка)
	                      |ГДЕ
	                      |	(&РегламентноеДействиеСсылка = НЕОПРЕДЕЛЕНО
	                      |				И ХранилищеВнешнихОбработок.Используется
	                      |			ИЛИ ХранилищеВнешнихОбработок.Ссылка = &РегламентноеДействиеСсылка)");						  
	Запрос.УстановитьПараметр("РегламентноеДействиеСсылка", РегламентноеДействиеСсылка);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Расписание = Результат.Расписание.Получить();
		Если Расписание <> Неопределено И (РегламентноеДействиеСсылка <> Неопределено ИЛИ
				Расписание.ТребуетсяВыполнение(, Результат.ДатаНачалаПоследнегоЗапуска, 
						Результат.ДатаЗавершенияПоследнегоЗапуска)) Тогда
			Набор = РегистрыСведений.РегламентныеДействияПоКатегориям.СоздатьМенеджерЗаписи();
			Набор.РегламентноеДействие = Результат.Ссылка;
			Набор.ДатаНачалаПоследнегоЗапуска = ТекущаяДата();
				
			//
			НаборСообщ = РегистрыСведений.СообщенияРегламентныхЗаданий.СоздатьМенеджерЗаписи();
			НаборСообщ.Период = Набор.ДатаНачалаПоследнегоЗапуска;
			НаборСообщ.Регламент = Результат.Ссылка;
			
			Если Результат.Внутренний Тогда
				Попытка
					Об = Вычислить("Обработки." + Результат.ИмяОбработки + ".Создать()");
				Исключение
					НаборСообщ.Сообщение = ОписаниеОшибки();
				КонецПопытки;
			Иначе
				АдресХранилища = ПоместитьВоВременноеХранилище(Результат.Хранилище.Получить(), Новый УникальныйИдентификатор());
				Попытка
					ВнешниеОбработки.Подключить(АдресХранилища,, Ложь);
				Исключение
					НаборСообщ.Сообщение = ОписаниеОшибки();
				КонецПопытки;	
				
				Если НаборСообщ.Сообщение = "" Тогда
					Попытка
						Об = ВнешниеОбработки.Создать(Результат.ИмяОбработки);
					Исключение
						НаборСообщ.Сообщение = ОписаниеОшибки();
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			
			//
			Если НаборСообщ.Сообщение = "" Тогда
				Попытка
					Об.РегламентноеЗадание(НаборСообщ);
				Исключение
					НаборСообщ.Сообщение = НаборСообщ.Сообщение + Символы.ПС + Символы.ПС + ОписаниеОшибки();
				КонецПопытки;
			КонецЕсли;
			
			Если НаборСообщ.Сообщение = "" Тогда
				НаборСообщ.Сообщение = "Выполнено.";
			КонецЕсли;
			
			Попытка
				НаборСообщ.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
				Прервать;
			КонецПопытки;
			
			//
			Набор.ДатаЗавершенияПоследнегоЗапуска = НаборСообщ.Период;
			Попытка
				Набор.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;		
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Процедура КонтрольБП() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БизнесПроцессыВыполненныеСтрелки.Ссылка
	                      |ПОМЕСТИТЬ БП
	                      |ИЗ
	                      |	БизнесПроцесс.БизнесПроцессы.ВыполненныеСтрелки КАК БизнесПроцессыВыполненныеСтрелки
	                      |ГДЕ
	                      |	БизнесПроцессыВыполненныеСтрелки.ДатаВыполнения <= &ТекДата
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	БП.Ссылка,
	                      |	БизнесПроцессы.Объект
	                      |ПОМЕСТИТЬ БП_2
	                      |ИЗ
	                      |	БП КАК БП
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	                      |		ПО БП.Ссылка = БизнесПроцессы.Ссылка
	                      |			И (БизнесПроцессы.Стартован)
	                      |			И (НЕ БизнесПроцессы.Завершен)
	                      |			И (НЕ БизнесПроцессы.ПометкаУдаления)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ БП
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	БП_2.Ссылка,
	                      |	ВЫБОР
	                      |		КОГДА ТИПЗНАЧЕНИЯ(БП_2.Объект) = ТИП(Справочник.ИсполнительныеДокументы)
	                      |			ТОГДА ИсполнительныеДокументы.Владелец
	                      |		ИНАЧЕ БП_2.Объект
	                      |	КОНЕЦ КАК Объект
	                      |ПОМЕСТИТЬ БП_3
	                      |ИЗ
	                      |	БП_2 КАК БП_2
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
	                      |		ПО (ТИПЗНАЧЕНИЯ(БП_2.Объект) = ТИП(Справочник.ИсполнительныеДокументы))
	                      |			И БП_2.Объект = ИсполнительныеДокументы.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ БП_2
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	БП_3.Ссылка
	                      |ИЗ
	                      |	БП_3 КАК БП_3
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(&ТекДата, Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	                      |		ПО БП_3.Объект = ОбъектыВРаботеОстатки.Объект");
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Об = Результат.Ссылка.ПолучитьОбъект();
		Отказ = Ложь;
		Об.ПродолжитьВыполнениеБП(Отказ);
	КонецЦикла;
	
	//Автовыполнение
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипыМероприятий.Ссылка,
	               |	ТипыМероприятий.АвтоВыполнение
	               |ПОМЕСТИТЬ ТипыМ
	               |ИЗ
	               |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	               |ГДЕ
	               |	ТипыМероприятий.АвтоВыполнение <> ЗНАЧЕНИЕ(Справочник.РезультатыМероприятий.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Мероприятие.Ссылка,
	               |	ТипыМ.АвтоВыполнение
	               |ИЗ
	               |	ТипыМ КАК ТипыМ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	               |		ПО ТипыМ.Ссылка = Мероприятие.ТипМероприятия
	               |			И (Мероприятие.ПланируемаяДата < &ТекДата)
	               |			И (НЕ Мероприятие.ПометкаУдаления)
	               |			И (НЕ Мероприятие.Выполнена)
	               |			И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	               |				ИЛИ НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления)";						  
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Об = Результат.Ссылка.ПолучитьОбъект();
		Об.Результат = Результат.АвтоВыполнение;
		Отказ = Ложь;
		Об.ВыполнитьМероприятие(Отказ);
	КонецЦикла;	
КонецПроцедуры

Процедура ЗагрузкаРеестров() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиАвтозагрузки.Ссылка,
	                      |	НастройкиАвтозагрузки.Организация,
	                      |	НастройкиАвтозагрузки.Автор,
	                      |	НастройкиАвтозагрузки.НастройкаСоответствий,
	                      |	НастройкиАвтозагрузки.КаталогФайловДляОбработки,
	                      |	НастройкиАвтозагрузки.КаталогПеремещенныхФайлов,
	                      |	НастройкиАвтозагрузки.КаталогОшибочныхФайлов,
	                      |	НастройкиАвтозагрузки.ОбновлятьРанееЗаписанные
	                      |ИЗ
	                      |	Справочник.НастройкиАвтозагрузки КАК НастройкиАвтозагрузки
	                      |ГДЕ
	                      |	НастройкиАвтозагрузки.ПометкаУдаления = ЛОЖЬ
	                      |	И НастройкиАвтозагрузки.Используется = ИСТИНА
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НастройкиАвтозагрузки.Приоритет");
	Результат = Запрос.Выполнить().Выбрать();
						  
						  
	МассивСообщений = Новый Массив();
	МаскаРеестров = Новый Массив(3);
	МаскаРеестров[0] = "*.xls";
	МаскаРеестров[1] =  "*.xlsx"; 
	МаскаРеестров[2] = "*.ods";
	

	Пока Результат.Следующий() Цикл   
		ТД = Новый ТекстовыйДокумент;
				
		Для Каждого ЭлементМаски из МаскаРеестров цикл
			ВыполнитьЗагрузкуРеестров(Результат.Организация, Результат.Автор, Результат.НастройкаСоответствий, Результат.КаталогФайловДляОбработки, Результат.КаталогПеремещенныхФайлов, Результат.КаталогОшибочныхФайлов, Результат.ОбновлятьРанееЗаписанные, ЭлементМаски, ТД);
			ИмяФайла = Результат.КаталогОшибочныхФайлов + "\Ошибки регламентной загрузки данных от " + СтрЗаменить(Строка(ТекущаяДата()), ":", "_") + ".txt";
			Если ТД.КоличествоСтрок() > 0 Тогда
				ТД.Записать(ИмяФайла);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	
КонецПроцедуры

Процедура ВыполнитьЗагрузкуРеестров(Организация, Автор, НастройкаСоответствий, КаталогФайловДляОбработки, КаталогПеремещенныхФайлов, КаталогОшибочныхФайлов, ОбновлятьРанееЗаписанные, Маска, ТД) Экспорт
	Сообщение = "";
	//ТД = Новый ТекстовыйДокумент;
	НайденныеФайлы = НайтиФайлы(КаталогФайловДляОбработки, Маска, Истина);
	Для Каждого Файл из НайденныеФайлы Цикл		
		ПолеИсходнойТаблицы = Новый ТабличныйДокумент;
		Попытка
			Попытка
				ПолеИсходнойТаблицы.Прочитать(Файл.ПолноеИмя);
				Прочитано = Истина;
			Исключение
				//Прочитано = РаботаСДокументами.мПрочитатьТабличныйДокументИзExcel(ПолеИсходнойТаблицы, Файл.ПолноеИмя, 1);
				ДД = Новый ДвоичныеДанные(Файл.ПолноеИмя);
				Прочитано  = РаботаСДокументами.ПрочитатьТабличныйДокументExcelизДвоичныхДанных(ПолеИсходнойТаблицы, ДД, 1);
				Если Не Прочитано Тогда
					Сообщение = Сообщение + "Не удалось прочитать файл: " + Файл.ПолноеИмя + Символы.ПС;
					ТД.ДобавитьСтроку("Не удалось прочитать файл: " + Файл.ПолноеИмя);
				КонецЕсли;
			КонецПопытки;			
		Исключение
			Прочитано = Ложь;
			Сообщение = Сообщение + "Не удалось прочитать файл: " + Файл.ПолноеИмя + Символы.ПС;
			ТД.ДобавитьСтроку("Не удалось прочитать файл: " + Файл.ПолноеИмя);
		КонецПопытки;
		
		Если Прочитано Тогда
			Если ТипЗнч(НастройкаСоответствий) = Тип("СправочникСсылка.НастройкиСоответствий") Тогда
				Попытка
					Обработка = Обработки.ЗагрузкаРеестров.Создать();
					Обработка.Организация = Организация;
					Обработка.Автор = Автор;
					Обработка.Комментарий = Файл.ПолноеИмя;
					Обработка.ОбновлятьРанееЗаписанные = ОбновлятьРанееЗаписанные;
					Обработка.ЗагрузитьНастройкиСоответствий(НастройкаСоответствий);
					Обработка.ЗагрузитьДанные(Обработка.СформироватьТаблицуДанных(ПолеИсходнойТаблицы), ПолеИсходнойТаблицы);
					Загружено = Истина;
				Исключение
					Загружено = Ложь;
					Сообщение = Сообщение + "Не удалось загрузить файл: " + Файл.ПолноеИмя + Символы.ПС;
					Сообщение = Сообщение +  + Символы.ПС;
					ТД.ДобавитьСтроку("Не удалось загрузить файл: " + Файл.ПолноеИмя);
					ТД.ДобавитьСтроку(ОписаниеОшибки());
				КонецПопытки;
			ИначеЕсли ТипЗнч(НастройкаСоответствий) = Тип("СправочникСсылка.ФорматыЗагрузки") И НастройкаСоответствий.Назначение = "Документ ссылка: Поступление платежей" Тогда
				Попытка
					Документ = Документы.ПоступлениеПлатежей.СоздатьДокумент();
					Документ.Организация = Организация;
					Документ.Автор = Автор;
					Документ.Комментарий = Файл.ПолноеИмя;
					Документ.Дата = ТекущаяДата();
					Документ.ЗаполнитьДанные(ПолеИсходнойТаблицы, НастройкаСоответствий);
					Документ.ВыборСоответствий.Загрузить(НастройкаСоответствий.ВыборСоответствий.Выгрузить());
					Если Документ.Объекты.Количество() > 0 Тогда
						Документ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
						УправлениеЗагрузкамиДанных.ПоместитьТабличнуюЧастьВХранилище(ПолеИсходнойТаблицы, Документ.Ссылка);
					КонецЕсли;
					Загружено = Истина;
				Исключение
					Загружено = Ложь;
					Сообщение = Сообщение + "Не удалось загрузить файл: " + Файл.ПолноеИмя + Символы.ПС;
					Сообщение = Сообщение +  + Символы.ПС;
					ТД.ДобавитьСтроку("Не удалось загрузить файл: " + Файл.ПолноеИмя);
					ТД.ДобавитьСтроку(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		Иначе
			Загружено = Ложь;
		КонецЕсли;
		Если Прочитано И Загружено Тогда
			Попытка
				ПереместитьФайл(Файл.ПолноеИмя, КаталогПеремещенныхФайлов + "/" + Файл.Имя);
			Исключение
				Сообщение = Сообщение + "Не удалось переместить файл: " + Файл.ПолноеИмя + Символы.ПС;
				ТД.ДобавитьСтроку("Не удалось переместить файл: " + Файл.ПолноеИмя);
			КонецПопытки;
		Иначе
			Попытка
				ПереместитьФайл(Файл.ПолноеИмя, КаталогОшибочныхФайлов + "/" + Файл.Имя);
			Исключение
				Сообщение = Сообщение + "Не удалось переместить файл: " + Файл.ПолноеИмя + Символы.ПС;
				ТД.ДобавитьСтроку("Не удалось переместить файл: " + Файл.ПолноеИмя);
			КонецПопытки;			
		КонецЕсли;		
	КонецЦикла;
	Сообщить(Сообщение);
КонецПроцедуры

Процедура ВыгрузитьДанныеВНБКИ() Экспорт
	РучнаяВыгрузка = Ложь;
	ОбъектОбработки = Обработки.ВыгрузкаВНБКИ.Создать();
	ОбъектОбработки.ВыгрузитьДанныеВФайл(РучнаяВыгрузка); 
КонецПроцедуры

Процедура Mandarin_Автосписание() Экспорт
	Бит_Мандарин.АвтосписаниеПоГрафику();
КонецПроцедуры

Процедура УдалениеСписковАвтообзвона() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокДляАвтообзвона.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СписокДляАвтообзвона КАК СписокДляАвтообзвона
		|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		// Получить ID целым числом
		НомерСписка = СтрЗаменить(Объект.IDSQL, Символы.НПП, "");
		СтрокаСоединения   =  ПолучитьСоединение();	
		Соединение = Новый COMОбъект("ADODB.Connection");
		Соединение.ConnectionString = (СтрокаСоединения);
		Попытка
			Соединение.Open();
		Исключение
			Сообщить("Удаление списка из АТС не может быть осуществлено!");
		КонецПопытки;
		Попытка
			ЗаписиSQL = Новый ComObject("ADODB.RecordSet"); 
			ЗаписиSQL.ActiveConnection = Соединение; 
			ЗапросНомерСписка  = "SELECT id from autodialer_phonelists WHERE `id`  ="+""""+НомерСписка+ """"+"";
			ЗаписиSQL = Соединение.Execute(ЗапросНомерСписка);
			// Получить ID целым числом
			НомерСпискаSQL = СтрЗаменить(ЗаписиSQL.Fields(0).Value, Символы.НПП, "");
			Если НомерСпискаSQL = НомерСписка Тогда 
				СтрPhoneList = "DELETE from `autodialer_phonelists` WHERE `id`  ="+""""+НомерСписка+ """"+"";
				Соединение.Execute(СтрPhoneList);
				//Сообщить(СтрPhoneList);
				Для к = 0 по Объект.СписокДляАО.Количество()-1 цикл
					СтрNumbers = "DELETE from`autodialer_phones` WHERE `phonelist_id`  ="+""""+НомерСписка+ """"+""; 
					Соединение.Execute(СтрNumbers);
					//Сообщить(СтрNumbers);
				КонецЦикла;
				//Сообщить("Список удален из АТС");
			КонецЕсли;	
			Соединение.Close();
		Исключение
			//Сообщить("Списка с таким номером уже не существует!");
		КонецПопытки;
		Объект.Удалить();
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоединение();
	Настройки = Константы.ПрофильПодключенияКАТС.Получить();
	Если Не ЗначениеЗаполнено(Настройки) Тогда
		Возврат "";
	Иначе
		ОДБС = Настройки.ODBCDriver;
		Сервер = Настройки.Сервер;
		БД = Настройки.НазваниеБазыДанных;
		Пользователь = Настройки.Пользователь;
		Пароль = Настройки.Пароль;
		СтрОДБС  = "{" + ОДБС + "}";
		
		Стр = "
		|DRIVER="+СтрОДБС+";
		|SERVER="+Сервер+";
		|DATABASE="+БД+"; 
		|UID="+Пользователь+";
		|PWD="+Пароль+"";
		
		Возврат Стр; 
	КонецЕсли;
КонецФункции

Процедура ФормированиеСписковАвтообзвона() Экспорт
	// Основной список (дальние регионы)
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "Основной список (дальние регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФормированиеСписковАвтообзвонаПараметры(Запрос);
    //
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2500
	|	ДолговыеОбязательства.Ссылка КАК Ссылка,
	|	МАКСИМУМ(Мероприятие.Дата) КАК Дата,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.РезультативныйКонтакт) КАК РезультативныйКонтакт
	|ИЗ
	|	Задача.Мероприятие КАК Мероприятие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ПО Мероприятие.Объект = ДолговыеОбязательства.Ссылка
	|ГДЕ
	|	(ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/McMurdo""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ1 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ НЕ NULL
	|				И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Casey""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ2 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ НЕ NULL
	|				И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА 
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""AET""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ3 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ НЕ NULL
	|				И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА 
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Asia/Chita""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ4 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ НЕ NULL
	|				И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА 
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Asia/Brunei""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ5 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ НЕ NULL
	|				И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА 
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Davis""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ6 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ НЕ NULL
	|				И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА 
	|			ИЛИ (ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|					И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/McMurdo""
	|					И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|					И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|					И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|					И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Casey""
	|					И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|					И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|					И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|					И ДолговыеОбязательства.Должник.ЧасовойПояс = ""AET""
	|					И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|					И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|					И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|					И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Asia/Chita""
	|					И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|					И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|					И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|					И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Asia/Brunei""
	|					И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|					И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|					И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|					И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Davis""
	|					И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|					И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|					И Мероприятие.Ссылка ЕСТЬ НЕ NULL ))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера
	|
	|УПОРЯДОЧИТЬ ПО
	|	РезультативныйКонтакт УБЫВ,
	|	Дата";
	
	ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
    
	// Основной список (основные регионы)
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "Основной список (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФормированиеСписковАвтообзвонаПараметры(Запрос);
    //
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2500
	|	ДолговыеОбязательства.Ссылка КАК Ссылка,
	|	МАКСИМУМ(Мероприятие.Дата) КАК Дата,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.РезультативныйКонтакт) КАК РезультативныйКонтакт
	|ИЗ
	|	Задача.Мероприятие КАК Мероприятие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ПО Мероприятие.Объект = ДолговыеОбязательства.Ссылка
	|ГДЕ
	|	(ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Vostok""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ1 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Mawson""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ2 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Asia/Baku""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ3 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Syowa""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ4 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""EET""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ5 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА
	|			ИЛИ (ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|					И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Vostok""
	|					И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|					И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|					И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|					И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Mawson""
	|					И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|					И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|					И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|					И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Asia/Baku""
	|					И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|					И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|					И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|					И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Syowa""
	|					И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|					И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|					И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|					И ДолговыеОбязательства.Должник.ЧасовойПояс = ""EET""
	|					И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|					И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|					И Мероприятие.Ссылка ЕСТЬ НЕ NULL ))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера
	|
	|УПОРЯДОЧИТЬ ПО
	|	РезультативныйКонтакт УБЫВ,
	|	Дата";
	
	ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	// Список по неконтактным (дальние регионы)
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "Неконтактные (дальние регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2500
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.Мероприятие КАК Мероприятие
	|		ПРАВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ПО Мероприятие.Объект = ДолговыеОбязательства.Ссылка
	|ГДЕ
	|	(ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/McMurdo""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ1 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Casey""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ2 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""AET""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ3 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Asia/Chita""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ4 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Asia/Brunei""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ5 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Davis""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ6 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL)";
	
	ВыгрузкаВСписокАвтообзвонаБезКонтроляСобытий(Запрос, СписокАвтообзвона);
    
	// Список по неконтактным (основные регионы)
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "Неконтактные (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФормированиеСписковАвтообзвонаПараметры(Запрос);
    //
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2500
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.Мероприятие КАК Мероприятие
	|		ПРАВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ПО Мероприятие.Объект = ДолговыеОбязательства.Ссылка
	|ГДЕ
	|	(ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Vostok""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ1 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Mawson""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ2 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Asia/Baku""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ3 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Syowa""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ4 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""EET""
	|				И ДолговыеОбязательства.Наименование ПОДОБНО ""%"" + &ГСЧ5 + ""%""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL)";
	
	ВыгрузкаВСписокАвтообзвонаБезКонтроляСобытий(Запрос, СписокАвтообзвона);
    
	// Список по новым реестрам (дальние регионы)
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "Новые реестры (дальние регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2500
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.Мероприятие КАК Мероприятие
	|		ПРАВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ПО Мероприятие.Объект = ДолговыеОбязательства.Ссылка
	|ГДЕ
	|	(ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/McMurdo""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Casey""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""AET""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Asia/Chita""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Asia/Brunei""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Davis""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL)";
	
	ВыгрузкаВСписокАвтообзвонаБезКонтроляСобытий(Запрос, СписокАвтообзвона);
    
	// Список по новым реестрам (основные регионы)
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "Новые реестры (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2500
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.Мероприятие КАК Мероприятие
	|		ПРАВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ПО Мероприятие.Объект = ДолговыеОбязательства.Ссылка
	|ГДЕ
	|	(ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Vostok""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Mawson""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Asia/Baku""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""Antarctica/Syowa""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|				И ДолговыеОбязательства.Должник.ЧасовойПояс = ""EET""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ NULL)";
	
	ВыгрузкаВСписокАвтообзвонаБезКонтроляСобытий(Запрос, СписокАвтообзвона);
    
КонецПроцедуры

Процедура ВыгрузкаВСписокАвтообзвона(Знач Запрос, Знач СписокАвтообзвона)
	
	Перем Выборка, Договор, Должник, РезультатЗапроса, стр, стрТел;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Договор = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ КонтрольСобытий.РезультативныеЗвонки(Договор.Должник) Тогда
			// Заблокировать ДО для автообзвона
			Договор.ЗапретАвтообзвона = Истина;
			Договор.Записать();
			//
			стр = СписокАвтообзвона.Объекты.Добавить();
			стр.Объект = Договор.Ссылка;
			Должник = Договор.Должник.ПолучитьОбъект();
			Для каждого стр из Должник.Телефоны Цикл
				Если строка(стр.ВидТелефона) = "Мобильный" Тогда 
					стрТел = СписокАвтообзвона.СписокДляАО.Добавить();
					стрТел.Должник = Договор.Должник;
					// Фикс для БИТ.АТС
					стрТел.НомерТелефона = бит_ТелефонияКлиентСервер.ОчиститьНомерТолькоЦифры(стр.Номер);
					//
					стрТел.СтрокаАвтообзвона = Договор;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	//СписокАвтообзвона.Записать();
	ЗагрузитьНаСервере(СписокАвтообзвона);
	СписокАвтообзвона.Записать();

КонецПроцедуры

Процедура ВыгрузкаВСписокАвтообзвонаБезКонтроляСобытий(Знач Запрос, Знач СписокАвтообзвона)
	
	Перем Выборка, Договор, Должник, РезультатЗапроса, стр, стрТел;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Договор = Выборка.Ссылка.ПолучитьОбъект();
		// Заблокировать ДО для автообзвона
		Договор.ЗапретАвтообзвона = Истина;
		Договор.Записать();
		//
		стр = СписокАвтообзвона.Объекты.Добавить();
		стр.Объект = Договор.Ссылка;
		Должник = Договор.Должник.ПолучитьОбъект();
		Для каждого стр из Должник.Телефоны Цикл
			Если строка(стр.ВидТелефона) = "Мобильный" Тогда 
				стрТел = СписокАвтообзвона.СписокДляАО.Добавить();
				стрТел.Должник = Договор.Должник;
				// Фикс для БИТ.АТС
				стрТел.НомерТелефона = бит_ТелефонияКлиентСервер.ОчиститьНомерТолькоЦифры(стр.Номер);
				//
				стрТел.СтрокаАвтообзвона = Договор;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//СписокАвтообзвона.Записать();
	ЗагрузитьНаСервере(СписокАвтообзвона);
	СписокАвтообзвона.Записать();

КонецПроцедуры

Процедура ФормированиеСписковАвтообзвонаПараметры(Знач Запрос)
	
	Перем ГСЧ, СлучайноеЧисло, Дата;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	СлучайноеЧисло = Строка(ГСЧ.СлучайноеЧисло(1, 10));
	Запрос.УстановитьПараметр("ГСЧ1", СлучайноеЧисло);
	
	СлучайноеЧисло = Строка(ГСЧ.СлучайноеЧисло(1, 10));
	Запрос.УстановитьПараметр("ГСЧ2", СлучайноеЧисло);
	
	СлучайноеЧисло = Строка(ГСЧ.СлучайноеЧисло(1, 10));
	Запрос.УстановитьПараметр("ГСЧ3", СлучайноеЧисло);
	
	СлучайноеЧисло = Строка(ГСЧ.СлучайноеЧисло(1, 10));
	Запрос.УстановитьПараметр("ГСЧ4", СлучайноеЧисло);
	
	СлучайноеЧисло = Строка(ГСЧ.СлучайноеЧисло(1, 10));
	Запрос.УстановитьПараметр("ГСЧ5", СлучайноеЧисло);
	
	СлучайноеЧисло = Строка(ГСЧ.СлучайноеЧисло(1, 10));
	Запрос.УстановитьПараметр("ГСЧ6", СлучайноеЧисло);
	
	Дата = НачалоДня(ТекущаяДата()) - 86400;
	Запрос.УстановитьПараметр("Вчера", Дата);
	
КонецПроцедуры	

//&НаСервере
//Процедура ПроверитьID()
//	Если Объект.IDSQL = 0 Тогда
//		Элементы.Удалить.Доступность = Ложь;
//		Элементы.Обновить.Доступность = Ложь;
//		Элементы.Загрузить.Доступность = Истина;
//	Иначе
//		Элементы.Удалить.Доступность = Истина;
//		Элементы.Обновить.Доступность = Истина;
//		Элементы.Загрузить.Доступность = Ложь;
//	КонецЕсли;
//КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(Объект)
	
	//Если ПроверитьЗаполнение() тогда
		СтрокаСоединения   =  ПолучитьСоединение();	
		Соединение = Новый COMОбъект("ADODB.Connection");
		Соединение.ConnectionString = (СтрокаСоединения);
		Попытка
			Соединение.Open();
			Сообщить("Производится добавление списка в АТС...");
		Исключение
			Сообщить("Добавление списка в АТС не может быть осуществлено!");
		КонецПопытки;
		Попытка	
			СтрPhoneList = "REPLACE INTO `autodialer_phonelists` SET `name`  ="+""""+Объект.Наименование+""""+"";
			Соединение.Execute(СтрPhoneList);
			//Сообщить(СтрPhoneList);
			ЗаписиSQL = Новый ComObject("ADODB.RecordSet"); 
			ЗаписиSQL.ActiveConnection = Соединение; 
			ЗапросНомерСписка  = "SELECT max(id) from autodialer_phonelists";
			ЗаписиSQL = Соединение.Execute(ЗапросНомерСписка);
			// Получить ID целым числом
			НомерСписка = СтрЗаменить(ЗаписиSQL.Fields(0).Value, Символы.НПП, "");
			Для к = 0 по Объект.СписокДляАО.Количество()-1 цикл
				СтрNumbers = "REPLACE INTO `autodialer_phones` SET `phonelist_id`="+""""+НомерСписка+""""+",`client`="+""""+Объект.СписокДляАО[к].СтрокаАвтообзвона+""""+",`number`  ="+""""+Объект.СписокДляАО[к].НомерТелефона+""""+" "; 
				Соединение.Execute(СтрNumbers);
				//Сообщить(СтрNumbers);
			КонецЦикла;
			Объект.IDSQL = НомерСписка;
    		Сообщить("Список добавлен на АТС");
			Соединение.Close();
			//ЭтотОбъект.Записать();
		Исключение
			Сообщить("Произошла ошибка добавления списка на АТС");
		КонецПопытки;
	//Иначе
		//Сообщить("Заполните обязательные поля!");
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновлениеДнейПросрочки() Экспорт  
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|  ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|  Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|  ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование <> ""Архив""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл    
		ДО = Выборка.Ссылка;
		ДатаВозврата = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, "0162");
		Если ЗначениеЗаполнено(ДатаВозврата) = Истина Тогда
			ДнейПросрочки = (НачалоДня(ТекущаяДата()) - НачалоДня(ДатаВозврата)) / 86400;
			ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, "0141", ДнейПросрочки);
			ДатаПередачи = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, "0138");
			ДнейВАгентстве = (НачалоДня(ТекущаяДата()) - НачалоДня(ДатаПередачи)) / 86400;
			ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, "0140", ДнейВАгентстве);
			ДнейНаДатуПередачи = (ДнейПросрочки - ДнейВАгентстве);
			ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, "0139", ДнейНаДатуПередачи);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалениеПомеченныхОбъектов() Экспорт
	// Выгрузить все акты передачи, помеченные на удаление
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктПередачи.Ссылка КАК Ссылка,
	|	АктПередачи.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.АктПередачи КАК АктПередачи
	|ГДЕ
	|	АктПередачи.ПометкаУдаления = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл    
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.Удалить();
	КонецЦикла;
	
	// Выгрузить все обещания, помеченные на удаление
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбещанныеПлатежи.Ссылка КАК Ссылка,
	|	ОбещанныеПлатежи.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.ОбещанныеПлатежи КАК ОбещанныеПлатежи
	|ГДЕ
	|	ОбещанныеПлатежи.ПометкаУдаления = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл    
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.Удалить();
	КонецЦикла;
	
	// Выгрузить все мероприятия, помеченные на удаление
	
	Запрос = Новый Запрос;	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Мероприятие.Ссылка КАК Ссылка,
	|	Мероприятие.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Задача.Мероприятие КАК Мероприятие
	|ГДЕ
	|	Мероприятие.ПометкаУдаления = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл    
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.Удалить();
	КонецЦикла;
	
	// Выгрузить все платежи, помеченные на удаление
	
	Запрос = Новый Запрос;	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеПлатежа.Ссылка КАК Ссылка,
	|	ПоступлениеПлатежа.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.ПоступлениеПлатежа КАК ПоступлениеПлатежа
	|ГДЕ
	|	ПоступлениеПлатежа.ПометкаУдаления = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл    
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.Удалить();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновлениеОстатков() Экспорт
	// Выгрузить остатки по внесудебке
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.ОсновнойДолгРеглОстаток, 0) КАК ОсновнойДолг,
	|	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПроцентыРеглОстаток, 0) КАК Проценты,
	|	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.ШтрафыРеглОстаток, 0) КАК Штрафы,
	|	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПениРеглОстаток, 0) КАК Пени,
	|	-ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая8РеглОстаток, 0) КАК Переплата,
	|	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.СуммаДООстаток, 0) КАК Итого
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектамВнесудебная.Остатки КАК ЗадолженностьПоОбъектамВнесудебнаяОстатки
	|		ПО ЗадолженностьПоОбъектамВнесудебнаяОстатки.Объект = ДолговыеОбязательства.Ссылка
	|ГДЕ
	|	(ДолговыеОбязательства.Кредитор.Код = ""F00114343""
	|			ИЛИ ДолговыеОбязательства.Кредитор.Код = ""F00000160""
	|			ИЛИ ДолговыеОбязательства.Кредитор.Код = ""F00000236""
	|			ИЛИ ДолговыеОбязательства.Кредитор.Код = ""F00000091""
	|			ИЛИ ДолговыеОбязательства.Кредитор.Код = ""F00114342"")";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Получить остатки по внесудебке
		СуммаОДВнесудебка = Выборка.ОсновнойДолг;
		СуммаПроцентыВнесудебка	= Выборка.Проценты;
		СуммаПениВнесудебка = Выборка.Пени;
		
		// Получить основной долг
		Если СуммаОДВнесудебка <> 0 Тогда
			Попытка
				НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
				НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Основной долг"));
				НаборЗаписей.Добавить(); 
				Для каждого ЗаписьНабора из НаборЗаписей Цикл
					ЗаписьНабора.Объект = Выборка.Ссылка;
					ЗаписьНабора.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Основной долг");
					ЗаписьНабора.СуммаДО = 0;
					ЗаписьНабора.СуммаРегл = 0;
				КонецЦикла; 
				НаборЗаписей.Записать();
			Исключение
			КонецПопытки;
			НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
			НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Основной долг"));
			НаборЗаписей.Прочитать(); 
			Для каждого ЗаписьНабора из НаборЗаписей Цикл
				СуммаОДРегистр = ЗаписьНабора.СуммаДО;
				Если СуммаОДРегистр <> СуммаОДВнесудебка Тогда
					ЗаписьНабора.СуммаДО = СуммаОДВнесудебка;
					ЗаписьНабора.СуммаРегл = СуммаОДВнесудебка;
				КонецЕсли;
				НаборЗаписей.Записать();
			КонецЦикла;
		КонецЕсли;
		
		// Получить проценты
		Если СуммаПроцентыВнесудебка <> 0 Тогда
			Попытка
				НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
				НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Проценты"));
				НаборЗаписей.Добавить(); 
				Для каждого ЗаписьНабора из НаборЗаписей Цикл
					ЗаписьНабора.Объект = Выборка.Ссылка;
					ЗаписьНабора.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Проценты");
					ЗаписьНабора.СуммаДО = 0;
					ЗаписьНабора.СуммаРегл = 0;
				КонецЦикла; 
				НаборЗаписей.Записать();
			Исключение
			КонецПопытки;
			НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
			НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Проценты"));
			НаборЗаписей.Прочитать();
			Для каждого ЗаписьНабора из НаборЗаписей Цикл
				СуммаПроцентыРегистр = ЗаписьНабора.СуммаДО;
				Если СуммаПроцентыРегистр <> СуммаПроцентыВнесудебка Тогда
					ЗаписьНабора.СуммаДО = СуммаПроцентыВнесудебка;
					ЗаписьНабора.СуммаРегл = СуммаПроцентыВнесудебка;
				КонецЕсли;
				НаборЗаписей.Записать();
			КонецЦикла;
		Иначе
			// Исключение для Квик Мани, где сумма по процентам загружена в реквизит 0169
			СуммаПроцентыВнесудебка = ОбъектыСервер.ПолучитьЗначениеСвойства(Выборка.Ссылка, "0169");
			Если СуммаПроцентыВнесудебка <> 0 Тогда
				НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
				НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Проценты"));
				НаборЗаписей.Прочитать();
				Для каждого ЗаписьНабора из НаборЗаписей Цикл
					СуммаПроцентыРегистр = ЗаписьНабора.СуммаДО;
					Если СуммаПроцентыРегистр <> СуммаПроцентыВнесудебка Тогда
						ЗаписьНабора.СуммаДО = СуммаПроцентыВнесудебка;
						ЗаписьНабора.СуммаРегл = СуммаПроцентыВнесудебка;
					КонецЕсли;
					НаборЗаписей.Записать();
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		// Получить пени и штрафы
		Если СуммаПениВнесудебка <> 0 Тогда
			Попытка
				НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
				НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Пени"));
				НаборЗаписей.Добавить(); 
				Для каждого ЗаписьНабора из НаборЗаписей Цикл
					ЗаписьНабора.Объект = Выборка.Ссылка;
					ЗаписьНабора.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Пени");
					ЗаписьНабора.СуммаДО = 0;
					ЗаписьНабора.СуммаРегл = 0;
				КонецЦикла; 
				НаборЗаписей.Записать();
			Исключение
			КонецПопытки;
			НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
			НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Пени"));
			НаборЗаписей.Прочитать(); 
			Для каждого ЗаписьНабора из НаборЗаписей Цикл
				СуммаПениРегистр = ЗаписьНабора.СуммаДО;
				Если СуммаПениРегистр <> СуммаПениВнесудебка Тогда
					ЗаписьНабора.СуммаДО = СуммаПениВнесудебка;
					ЗаписьНабора.СуммаРегл = СуммаПениВнесудебка;
				КонецЕсли;
				НаборЗаписей.Записать();
			КонецЦикла;
		КонецЕсли;
		
		// Обновить остатки в регистре сведений
		Если ЗначениеЗаполнено(СуммаОДВнесудебка) = Ложь
			Тогда
			СуммаОДВнесудебка = 0;
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаПроцентыВнесудебка) = Ложь
			Тогда
			СуммаПроцентыВнесудебка = 0;
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаПениВнесудебка) = Ложь
			Тогда
			СуммаПениВнесудебка = 0;
		КонецЕсли;
		СуммаДОРегистрНовая = (СуммаОДВнесудебка + СуммаПроцентыВнесудебка + СуммаПениВнесудебка);
		Попытка
			НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
			НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Сумма"));
			НаборЗаписей.Добавить(); 
			Для каждого ЗаписьНабора из НаборЗаписей Цикл
				ЗаписьНабора.Объект = Выборка.Ссылка;
				ЗаписьНабора.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Сумма");
				ЗаписьНабора.СуммаДО = 0;
				ЗаписьНабора.СуммаРегл = 0;
			КонецЦикла; 
			НаборЗаписей.Записать();
		Исключение
		КонецПопытки;
		НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
		НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Сумма"));
		НаборЗаписей.Прочитать();
		Для каждого ЗаписьНабора из НаборЗаписей Цикл
			ЗаписьНабора.СуммаДО = СуммаДОРегистрНовая;
			ЗаписьНабора.СуммаРегл = СуммаДОРегистрНовая;
			НачатьТранзакцию();
			НаборЗаписей.Записать();
			ЗафиксироватьТранзакцию();
		КонецЦикла;
	КонецЦикла;
	
	// Выгрузить суммы удержаний по судебным решениям
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(СУММА(ЗадолженностьПоСудебнымРешениям.Сумма), 0) КАК СуммаУдержаний
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоСудебнымРешениям КАК ЗадолженностьПоСудебнымРешениям
	|		ПО ЗадолженностьПоСудебнымРешениям.Займ = ДолговыеОбязательства.Ссылка
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Передано в ЮД""
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Получить суммы удежраний по судебным решениям
		СуммаУдержанийПоСудебнымРешениям = Выборка.СуммаУдержаний;
		
		// Получить основной долг
		НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
		НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Основной долг"));
		НаборЗаписей.Прочитать(); 
		Для каждого ЗаписьНабора из НаборЗаписей Цикл
			Если ЗаписьНабора.СуммаДО <> 0 Тогда
				СуммаОДВнесудебка = ЗаписьНабора.СуммаДО;
			КонецЕсли;
			НаборЗаписей.Записать();
		КонецЦикла;
		
		// Получить проценты		
		НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
		НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Проценты"));
		НаборЗаписей.Прочитать(); 
		Для каждого ЗаписьНабора из НаборЗаписей Цикл
			Если ЗаписьНабора.СуммаДО <> 0 Тогда
				СуммаПроцентыВнесудебка = ЗаписьНабора.СуммаДО;
			КонецЕсли;
			НаборЗаписей.Записать();
		КонецЦикла;
		
		// Получить пени и штрафы
		НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
		НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Пени"));
		НаборЗаписей.Прочитать(); 
		Для каждого ЗаписьНабора из НаборЗаписей Цикл
			Если ЗаписьНабора.СуммаДО <> 0 Тогда
				СуммаПениВнесудебка = ЗаписьНабора.СуммаДО;
			КонецЕсли;
			НаборЗаписей.Записать();
		КонецЦикла;
		
		// Списать суммы удержаний по судебным решениям
		Если ЗначениеЗаполнено(СуммаОДВнесудебка) = Ложь
			Тогда
			СуммаОДВнесудебка = 0;
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаПроцентыВнесудебка) = Ложь
			Тогда
			СуммаПроцентыВнесудебка = 0;
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаПениВнесудебка) = Ложь
			Тогда
			СуммаПениВнесудебка = 0;
		КонецЕсли;
		СуммаДОРегистрНовая = (СуммаОДВнесудебка + СуммаПроцентыВнесудебка + СуммаПениВнесудебка) - СуммаУдержанийПоСудебнымРешениям;
		НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
		НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Сумма"));
		НаборЗаписей.Прочитать();
		Для каждого ЗаписьНабора из НаборЗаписей Цикл
			ЗаписьНабора.СуммаДО = СуммаДОРегистрНовая;
			ЗаписьНабора.СуммаРегл = ЗаписьНабора.СуммаДО;
			НачатьТранзакцию();
			НаборЗаписей.Записать();
			ЗафиксироватьТранзакцию();
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура БлокировкаДелДляАвтообзвона() Экспорт
	// Выгрузить незаблокированные ДО, где больше 10 нерезультативных контактов за последние 3 месяца
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	БлокировкаДелДляАвтообзвонаПараметры(Запрос);
    //
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка,
	|	МИНИМУМ(Мероприятие.Дата) КАК Дата1,
	|	МАКСИМУМ(Мероприятие.Дата) КАК Дата2,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.РезультативныйКонтакт) КАК РезультативныйКонтакт
	|ИЗ
	|	Задача.Мероприятие КАК Мероприятие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ПО Мероприятие.Объект = ДолговыеОбязательства.Ссылка
	|ГДЕ
	|	(ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""В работе""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				И Мероприятие.Результат.РезультативныйКонтакт = ЛОЖЬ
	|			ИЛИ ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Новые""
	|				И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|				И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ
	|				И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|				И Мероприятие.Результат.РезультативныйКонтакт = ЛОЖЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(Мероприятие.Дата) >= &ТриМесяцаНазад И
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера И
	|	КОЛИЧЕСТВО(Мероприятие.Результат.РезультативныйКонтакт) >= 10";
	
	ОбработкаНеконтактныхДелДляАвтообзвона(Запрос);
	
КонецПроцедуры

Процедура БлокировкаДелДляАвтообзвонаПараметры(Знач Запрос)
	
	Перем Дата;
	
	Дата = НачалоДня(ТекущаяДата() - 7776000);
	Запрос.УстановитьПараметр("ТриМесяцаНазад", Дата);
	
	Дата = НачалоДня(ТекущаяДата());
	Запрос.УстановитьПараметр("Вчера", Дата);
	
КонецПроцедуры

Процедура ОбработкаНеконтактныхДелДляАвтообзвона(Знач Запрос)
	
	Перем Выборка, Договор, РезультатЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Договор = Выборка.Ссылка.ПолучитьОбъект();
		// Заблокировать ДО для автообзвона по причине неконтактности
		Договор.ЗапретАвтообзвона = Истина;
		Договор.НеконтактныеНомера = Истина;
		Договор.Записать();
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура РазблокировкаДелДляАвтообзвона() Экспорт
	// Выгрузить ДО, заблокированные по причине добавления в автообзвон
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ЗапретАвтообзвона = ИСТИНА
	|	И ДолговыеОбязательства.НеконтактныеНомера = ЛОЖЬ";
	
	ОбработкаДелДляАвтообзвона(Запрос);
	
КонецПроцедуры

Процедура ОбработкаДелДляАвтообзвона(Знач Запрос)
	
	Перем Выборка, Договор, РезультатЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Договор = Выборка.Ссылка.ПолучитьОбъект();
		// Разблокировать ДО для автообзвона
		Договор.ЗапретАвтообзвона = Ложь;
		Договор.Записать();
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПересчетИтоговРегистров() Экспорт
    // Из УПП
    НаДату = НачалоМесяца(ТекущаяДата())-1;    
    ПересчетРегистров(РегистрыНакопления, НаДату, Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки);
    ПересчетРегистров(РегистрыБухгалтерии, НаДату);
КонецПроцедуры

Процедура ПересчетРегистров(МенеджерРегистров, НаДату, ОграничениеПоВидуРегистра = Неопределено)
    
    Для Каждого МенеджерРегистра ИЗ МенеджерРегистров Цикл
        МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗнч(МенеджерРегистра));
        
        Если ОграничениеПоВидуРегистра <> Неопределено И МетаданныеРегистра.ВидРегистра <> ОграничениеПоВидуРегистра Тогда
            Продолжить;
        КонецЕсли;
        ПересчитатьРегистрПоДате(МенеджерРегистра, НаДату);
        
    КонецЦикла;
    
КонецПроцедуры

Процедура ПересчитатьРегистрПоДате(МенеджерРегистра, НаДату)
    
    Если МенеджерРегистра.ПолучитьПериодРассчитанныхИтогов()<НаДату Тогда
        МенеджерРегистра.УстановитьПериодРассчитанныхИтогов(НаДату);
    Иначе
        МенеджерРегистра.ПересчитатьИтоги();
    КонецЕсли;
    
КонецПроцедуры