
Функция ПолучитьКодРегиона(Адрес) Экспорт
	// Получить код региона
	// Запрос к API
	SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Новый СертификатыУдостоверяющихЦентровОС());  
	Соединение = Новый HTTPСоединение("suggestions.dadata.ru", 443,,,,, SSL);
	
	Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Authorization", "Token " + "0209132e40a4178b46e5449713418860f53d7553");
	Заголовки.Вставить("Authorization", "Token " + "4c4ac34735a17fe1d156b907b39fcfb7ac22b705"); // Резервный токен
	//Заголовки.Вставить("Authorization", "Token " + "e41d061e2840f553cbf229111610ce768f0e0ac6"); // Резервный токен
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Accept", "application/json");
	
	АдресныеСведения = Новый Структура();
	АдресныеСведения.Вставить("query", УдалитьЗапрещенныеПрефиксы(Адрес));
	
	ЗаписьJSON = Новый ЗаписьJSON;            
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, АдресныеСведения);            
	ТелоЗапроса = ЗаписьJSON.Закрыть(); 
	
	Запрос = Новый HTTPЗапрос("/suggestions/api/4_1/rs/suggest/address", Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	
	//Сообщить(Ответ.ПолучитьТелоКакСтроку());
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	АдресныеСведения = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();
	
	// Получить регион по коду ИФНС
	Возврат Лев(АдресныеСведения.suggestions[0].data.tax_office, 2);
КонецФункции

Функция ПолучитьОКАТО(Адрес) Экспорт
	// Получить код региона
	// Запрос к API
	SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Новый СертификатыУдостоверяющихЦентровОС());  
	Соединение = Новый HTTPСоединение("suggestions.dadata.ru", 443,,,,, SSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", "Token " + "0209132e40a4178b46e5449713418860f53d7553");
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Accept", "application/json");
	
	АдресныеСведения = Новый Структура();
	АдресныеСведения.Вставить("query", УдалитьЗапрещенныеПрефиксы(Адрес));
	
	ЗаписьJSON = Новый ЗаписьJSON;            
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, АдресныеСведения);            
	ТелоЗапроса = ЗаписьJSON.Закрыть(); 
	
	Запрос = Новый HTTPЗапрос("/suggestions/api/4_1/rs/suggest/address", Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	
	//Сообщить(Ответ.ПолучитьТелоКакСтроку());
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	АдресныеСведения = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();
	
	// Получить ОКАТО
	Возврат АдресныеСведения.suggestions[0].data.okato;
КонецФункции

Функция УдалитьЗапрещенныеПрефиксы(Адрес)
	Адрес = СтрЗаменить(Адрес, "RU, ", "");
	Адрес = СтрЗаменить(Адрес, "Регион", "");
	Возврат Адрес;
КонецФункции