
&НаКлиенте
Функция ПолучитьIpАдрес() Экспорт
	Если РаботаСЦКТСервер.ИспользоватьЦКТ() Тогда
		ИмяФайла = ПолучитьИмяВременногоФайла(".txt");
		КомандаСистемы("ipconfig > """ + ИмяФайла + """");
		ТекстовыйДокумент = Новый ТекстовыйДокумент();
		ТекстовыйДокумент.Прочитать(ИмяФайла);
		УдалитьФайлы(ИмяФайла);
		ТекстФайла = ТекстовыйДокумент.ПолучитьТекст();	
		ТекстФайла = СтрЗаменить(ТекстФайла, " : ", Символы.ПС);
		Возврат СтрПолучитьСтроку(ТекстФайла, 10);
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция СоздатьОбъектЦКТ() Экспорт
	Если Не РаботаСЦКТСервер.ИспользоватьЦКТ() Тогда
        Возврат ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
	КонецЕсли;	
	
	Попытка	
		Соединитель = Новый COMОбъект("V82.COMConnector");
		ОбъектЦКТ = Соединитель.Connect(РаботаСЦКТСервер.СтрокаПодключенияКЦКТ());
	Исключение
		ОбъектЦКТ = Неопределено;
		Сообщить("Нет доступа к базе ЦКТ!");
	КонецПопытки;

	Возврат ПоместитьВоВременноеХранилище(ОбъектЦКТ, Новый УникальныйИдентификатор());
КонецФункции

&НаКлиенте
Функция ЗагрузитьОбъектКомпоненты() Экспорт
	ДрайверКомпоненты = Неопределено;
	Подключена = ПодключитьВнешнююКомпоненту("Справочник.СправочникFTP.Макет.AddInCTSnExt", "AddInCTSnExt", 
			ТипВнешнейКомпоненты.Native);			
	Если Подключена Тогда                           
		Попытка
			ДрайверКомпоненты = Новый("AddIn.AddInCTSnExt.AddInCTSnExtension");
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	Возврат ДрайверКомпоненты;	
КонецФункции

&НаКлиенте
Процедура СкопироватьКомпоненты(Принудительно = Ложь) Экспорт
	СкопироватьКомпоненту("СправочникFTP",               "AddInCTSnExt",   Принудительно);	
	СкопироватьКомпоненту("СправочникFTP",               "AlderSDK",       Принудительно);
	СкопироватьКомпоненту("тсШаблоныПечатныхДокументов", "AddInEDCNative", Принудительно);
	СкопироватьКомпоненту("тсШаблоныПечатныхДокументов", "AddInEDC64",     Принудительно);
	СкопироватьКомпоненту("тсШаблоныПечатныхДокументов", "NameDecl",       Принудительно);
	СкопироватьКомпоненту("тсШаблоныПечатныхДокументов", "WordCtr",        Принудительно);
	СкопироватьКомпоненту("тсШаблоныПечатныхДокументов", "WinCtrl",        Принудительно);	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьКомпоненту(ИмяСправочника, ИмяМакета, Принудительно)
	РаботаСЦКТСервер.СкопироватьКомпонентуСервер(ИмяСправочника, ИмяМакета, Принудительно);
	
	//
	Если Не Принудительно Тогда
		Файл = Новый Файл(КаталогПрограммы() + ИмяМакета + ".dll");
		Если Файл.Существует() Тогда
			Возврат ;
		КонецЕсли;
	КонецЕсли;
	
	ДД = РаботаСЦКТСервер.ПолучитьМакетСправочника(ИмяСправочника, ИмяМакета);
	Если ДД <> Неопределено Тогда
		Попытка
			ДД.Записать(КаталогПрограммы() + ИмяМакета + ".dll");
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	Иначе
		Сообщить("Ошибка обновления компоненты " + ИмяМакета + ".dll!");
	КонецЕсли;
КонецПроцедуры
