
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ
//
// Источники: форма, панели, команды, элементы панелей, элементы формы,
//            поля, элементы полей

// Обработчик события ПриСозданииНаСервере формы выполняет заполнение
// реквизитов формы из информационной базы, используя параметр формы
// Идентификатор (фонового задания).
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СвойстваФоновогоЗадания = УдалитьРегламентныеЗаданияСервер.ПолучитьСвойстваФоновогоЗадания(Параметры.Идентификатор);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СвойстваФоновогоЗадания, "Ключ, Наименование, Начало, Конец, Расположение, Состояние, ИмяМетода");
	СообщенияПользователюИОписаниеИнформацииОбОшибке = УдалитьРегламентныеЗаданияСервер.СообщенияИОписанияОшибокФоновогоЗадания(Параметры.Идентификатор);
	Если ЗначениеЗаполнено(СвойстваФоновогоЗадания.ИдентификаторРегламентногоЗадания) Тогда
		ИдентификаторРегламентногоЗадания = СвойстваФоновогоЗадания.ИдентификаторРегламентногоЗадания;
		НаименованиеРегламентногоЗадания  = УдалитьРегламентныеЗаданияСервер.ПредставлениеРегламентногоЗадания(СвойстваФоновогоЗадания.ИдентификаторРегламентногоЗадания);
	Иначе
		НаименованиеРегламентногоЗадания  = УдалитьРегламентныеЗаданияСервер.ТекстНеОпределено();
		ИдентификаторРегламентногоЗадания = УдалитьРегламентныеЗаданияСервер.ТекстНеОпределено();
	КонецЕсли;

КонецПроцедуры // ПриСозданииНаСервере()

