
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;	
	Shell = Новый COMОбъект("WScript.Shell");
	USERPROFILE = Shell.ExpandEnvironmentStrings("%USERPROFILE%");
	ПоказатьОповещениеПользователя("Документы",,"Файл сохранен в папку Документы",БиблиотекаКартинок.NC_ПодсистемаДокументооборот);
	ТабДок.Записать(USERPROFILE + "\Documents\Справка об отсутствии задолженности.pdf", ТипФайлаТабличногоДокумента.PDF);
	//}}
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	Документы.СправкаОбОтсутствииЗадолженности.Печать(ТабДок, ПараметрКоманды);
КонецПроцедуры
