#Область ПрограммныйИнтерфейс

Функция НовыйНомерСессии(Клиент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧатСессииСКлиентомСрезПоследних.Сессия КАК Сессия,
		|	ЧатСессииСКлиентомСрезПоследних.Закрытие КАК Закрытие,
		|	ЧатСессииСКлиентомСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЧатСессииСКлиентом.СрезПоследних(, Клиент = &Клиент) КАК ЧатСессииСКлиентомСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Номер = 1;
	Пока Выборка.Следующий() Цикл
		
		Номер = Выборка.Сессия;
		Если Выборка.Закрытие
			Или НачалоДня(Выборка.Период) < НачалоДня(ТекущаяДатаСеанса()) Тогда
		
			Номер = Номер + 1;
		
		КонецЕсли;
		
	КонецЦикла;

	Возврат Номер;

КонецФункции // ()

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти