
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектыСервер.ОграничитьТипОбъекта(Элементы.ОбъектыОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
		
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элементы.ОбъектыОбъект.ВыбиратьТип = (Элементы.Объекты.ТекущиеДанные.Объект = Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПолеПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтрокуОбъект(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьСервер();
КонецПроцедуры

&НаСервере
Процедура ОчиститьСервер()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Т.Объект
	                      |ПОМЕСТИТЬ Т
	                      |ИЗ
	                      |	&Т КАК Т
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Т.Объект
	                      |ИЗ
	                      |	Т КАК Т
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Т.Объект");
	Запрос.УстановитьПараметр("Т", Объект.Объекты.Выгрузить());	
	Объект.Объекты.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	РаспределитьСервер();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура РаспределитьСервер()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РаспределитьСервер();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьСервер();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСервер()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьСервер();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПередающийПриИзменении(Элемент)
	Попытка
		Объект.ТипСотрудника = ОбъектыСервер.РазыменоватьСсылку(Объект.СотрудникПередающий, "ТипСотрудника");
	Исключение
		Объект.ТипСотрудника = Неопределено;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	Если Элементы.Сотрудники.ТекущиеДанные <> Неопределено Тогда
		Попытка
			Элементы.Сотрудники.ТекущиеДанные.ТипСотрудника = ОбъектыСервер.РазыменоватьСсылку(Элементы.Сотрудники.ТекущиеДанные.Сотрудник, "ТипСотрудника");
		Исключение
			Элементы.Сотрудники.ТекущиеДанные.ТипСотрудника = Неопределено;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры
