
&НаСервере
Процедура ЗагрузитьНаСервере()
	НачатьТранзакцию();
	Попытка
		ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
		ЗначениеОбъект.ЗагрузитьДанные(ПолеИсходнойТаблицы, Ложь);
		ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
		Сообщить("Загрузка успешно выполнена!");
		ЗафиксироватьТранзакцию();
	Исключение
		Сообщить("При загрузке данных произошла ошибка!");
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФайлИмпортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл регионов...";
	Диалог.МножественныйВыбор = Ложь;                       
	Диалог.Фильтр = "Табличный документ(*.xls, *.xlsx, *.ods)|*.xls?;*.ods|";
	//МассивПутейДокументов = Новый Массив;
	Если Диалог.Выбрать() Тогда
		ФайлИмпорта = Диалог.ПолноеИмяФайла;
		ДД = Новый ДвоичныеДанные(ФайлИмпорта);
		ЗагрузитьТабличныйДокумент(ПолеИсходнойТаблицы,ДД);
		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТабличныйДокумент(ПолеИсходнойТаблицы,ДД)
	Попытка
		ПолеИсходнойТаблицы.Прочитать(ФайлИмпорта);
	Исключение
		//Сообщить(ОписаниеОшибки());
		//Загружено = бит_ФССП_ИнтеграцияФССП.мПрочитатьТабличныйДокументИзExcel(ПолеИсходнойТаблицы, ФайлИмпорта, 1);
		Загружено = РаботаСДокументами.ПрочитатьТабличныйДокументExcelизДвоичныхДанных(ПолеИсходнойТаблицы,ДД,1);
	КонецПопытки	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
		ЗначениеОбъект.ЗаполнитьНомераСтолбцов();
		ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
КонецПроцедуры

