
&НаКлиенте
Процедура ПодборКонтрагентов(Команда)
	формаПодбор = ПолучитьФорму("Обработка.бит_Битфон.Форма.ПодборКонтрагентов", , Элементы.Список); 
	формаПодбор.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		строка = Объект.Список.Добавить();
		строка.Контрагент = ВыбранноеЗначение;
		массивНомераТелефонов = бит_ТелефонияСерверПереопределяемый.НайтиНомераКонтрагента(строка.Контрагент);
		Если массивНомераТелефонов.Количество() > 0 Тогда
			строка.НомерТелефона = массивНомераТелефонов[0];
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	описаниеТипа = Новый ОписаниеТипов("СправочникСсылка." + бит_ТелефонияСерверПереопределяемый.ПолучитьИмяСправочникаКонтрагентов());
	Элемент.ОграничениеТипа = описаниеТипа;
	Элемент.ВыбиратьТип = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьФлагОбработки(Команда)
	Для Каждого строкаСписка Из Объект.Список Цикл
		Если строкаСписка.Обработан Тогда
			строкаСписка.Обработан = Ложь;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	описаниеТипа = Новый ОписаниеТипов("СправочникСсылка." + бит_ТелефонияСерверПереопределяемый.ПолучитьИмяСправочникаКонтактныхЛиц());
	Элемент.ОграничениеТипа = описаниеТипа;
	Элемент.ВыбиратьТип = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтрагентПриИзменении(Элемент)
	массивНомераТелефонов = бит_ТелефонияСерверПереопределяемый.НайтиНомераКонтрагента(Элементы.Список.ТекущиеДанные.Контрагент);
	Если массивНомераТелефонов.Количество() > 0 Тогда
		Элементы.Список.ТекущиеДанные.НомерТелефона = массивНомераТелефонов[0];
	КонецЕсли;
	Элементы.Список.ТекущиеДанные.Обработан = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтактноеЛицоПриИзменении(Элемент)
	массивНомераТелефонов = бит_ТелефонияСерверПереопределяемый.НайтиНомераКонтактногоЛица(Элементы.Список.ТекущиеДанные.КонтактноеЛицо);
	Если массивНомераТелефонов.Количество() > 0 Тогда
		Элементы.Список.ТекущиеДанные.НомерТелефона = массивНомераТелефонов[0];
	КонецЕсли;
	Элементы.Список.ТекущиеДанные.Обработан = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокНомерТелефонаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.КонтактноеЛицо) Тогда
		массивНомераТелефонов = бит_ТелефонияСерверПереопределяемый.НайтиНомераКонтактногоЛица(Элементы.Список.ТекущиеДанные.КонтактноеЛицо);
		Элемент.СписокВыбора.ЗагрузитьЗначения(массивНомераТелефонов);
	ИначеЕсли ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Контрагент) Тогда
		массивНомераТелефонов = бит_ТелефонияСерверПереопределяемый.НайтиНомераКонтрагента(Элементы.Список.ТекущиеДанные.Контрагент);
		Элемент.СписокВыбора.ЗагрузитьЗначения(массивНомераТелефонов);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры


//Лебедева 02.10.2018

&НаКлиенте
Процедура ВидыТелефоновПриИзменении(Элемент)
	Если ВидыТелефонов = 1 Тогда
		Элементы.Тип.Доступность = Ложь;
		Элементы.ПервыйНомер.Доступность = Ложь;
	ИначеЕсли ВидыТелефонов = 2 Тогда
		Элементы.Тип.Доступность = Истина;
		Элементы.ПервыйНомер.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьСписокНаСервере()
	Объект.Список.Очистить();
	ТЗ_ДО = Объект.Объекты.Выгрузить();
	Долговые = ТЗ_ДО.ВыгрузитьКолонку("Объект");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДолговыеОбязательства.Должник КАК Должник,
	|	КонтрагентыТелефоны.ВидТелефона КАК ВидТелефона,
	|	КонтрагентыТелефоны.Номер КАК НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты.Телефоны КАК КонтрагентыТелефоны
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ПО КонтрагентыТелефоны.Ссылка = ДолговыеОбязательства.Должник
	|ГДЕ
	|	ДолговыеОбязательства.Ссылка = &СписокДО";
	Если ВидыТелефонов = 1 Тогда
		Для счетчикДО = 0 по Долговые.Количество()-1 Цикл
			//Сообщить(Долговые[счетчикДО].Ссылка);
			Запрос.УстановитьПараметр("СписокДО",Долговые[счетчикДО].Ссылка);
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			Для счетчикРез = 0 по РезультатЗапроса.Количество()-1 Цикл
				НовСтр = Объект.Список.Добавить();
				НовСтр.Контрагент = РезультатЗапроса[счетчикРез].Должник;
				НовСтр.ВидТелефона = РезультатЗапроса[счетчикРез].ВидТелефона;
				НовСтр.НомерТелефона = РезультатЗапроса[счетчикРез].НомерТелефона;
			КонецЦикла;
		КонецЦикла;
	ИначеЕсли ВидыТелефонов = 2 Тогда
		Для счетчикДО = 0 по Долговые.Количество()-1 Цикл
			//Сообщить(Долговые[счетчикДО].Ссылка);
			Запрос.УстановитьПараметр("СписокДО",Долговые[счетчикДО].Ссылка);
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			Для счетчикРез = 0 по РезультатЗапроса.Количество()-1 Цикл
				Если РезультатЗапроса[счетчикРез].ВидТелефона = Тип и ПервыйНомер = Ложь Тогда
					НовСтр = Объект.Список.Добавить();
					НовСтр.Контрагент = РезультатЗапроса[счетчикРез].Должник;
					НовСтр.ВидТелефона = РезультатЗапроса[счетчикРез].ВидТелефона;
					НовСтр.НомерТелефона = РезультатЗапроса[счетчикРез].НомерТелефона;
				ИначеЕсли РезультатЗапроса[счетчикРез].ВидТелефона = Тип и ПервыйНомер = Истина Тогда
					НовСтр = Объект.Список.Добавить();
					НовСтр.Контрагент = РезультатЗапроса[счетчикРез].Должник;
					НовСтр.ВидТелефона = РезультатЗапроса[счетчикРез].ВидТелефона;
					НовСтр.НомерТелефона = РезультатЗапроса[счетчикРез].НомерТелефона;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	УдалитьДубли = Объект.Список.Выгрузить();
	УдалитьДубли.Свернуть("Контрагент, ВидТелефона,НомерТелефона,Обработан");
	Объект.Список.Очистить();
	Объект.Список.Загрузить(УдалитьДубли);
КонецПроцедуры

&НаСервере
Функция СписокДолговыхКонтрагента(Контрагент)
	стр = "";
	Для Каждого стрОбъект из Объект.Объекты Цикл
		Если стрОбъект.Объект.Должник = Контрагент Тогда
			стр = стр + стрОбъект.Объект.Наименование + ";";
		КонецЕсли;
	КонецЦикла;
	Возврат стр;
КонецФункции

&НаКлиенте
Процедура СоздатьСписок(Команда)
	СоздатьСписокНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПодборПоНастройкам(Команда)
	ОбъектыКлиент.ПодборПоНастройкам(ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ОбъектыПодборПоНастройкам.Видимость = Константы.ИспользоватьНастройкиПодбораОбъектовУчета.Получить();
КонецПроцедуры

