
&НаКлиенте
Процедура СменаДокументаПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура СменаИмениПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура Наименование999ПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью() 
	Элементы.ГруппаНовыйДУЛ.Видимость = СменаДокумента;
	Элементы.ГруппаНовоеФИО.Видимость = СменаИмени;
	Элементы.Наименование999.Видимость = (КодНБКИНовогоДУЛ = "999");
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьНаСервере(Должник)
	ПараметрыКИ = Новый Структура();
	
	ПараметрыКИ.Вставить("ДатаВыдачиДокумента", ЭтотОбъект.ДатаВыдачиНовогоДУЛ);
	ПараметрыКИ.Вставить("ДатаОкончанияДействияДокумента", ЭтотОбъект.ДатаОкончанияНовогоДУЛ);
	ПараметрыКИ.Вставить("КемВыданДокумент", ЭтотОбъект.КемВыданНовыйДУЛ);
	ПараметрыКИ.Вставить("КодНБКИДокумента", ЭтотОбъект.КодНБКИНовогоДУЛ);
	ПараметрыКИ.Вставить("КодПодразделенияРФ", ЭтотОбъект.КодПодразделенияВыдачиНовогоДУЛ);
	ПараметрыКИ.Вставить("НаименованиеИногоДокумента", ЭтотОбъект.Наименование999);
	ПараметрыКИ.Вставить("НомерДокумента", ЭтотОбъект.НомерНовогоДУЛ);
	ПараметрыКИ.Вставить("СерияДокумента", ЭтотОбъект.СерияНовогоДУЛ);
	ПараметрыКИ.Вставить("КодСтраныДокумента", ЭтотОбъект.СтранаПоНовомуДУЛ);
	
	КредитныеИстории.ЗаписатьСобытиеСменаКИ(Должник, "КредитныеИсторииДанныеФизЛица", НачалоДня(ТекущаяДатаСеанса()), ПараметрыКИ);  
	
	Если ЭтотОбъект.СменаИмени Тогда
		ДолжникОбъект = Должник.ПолучитьОбъект();
		стрФИО = ДолжникОбъект.ФИО.Добавить();
		СтрФИО.Фамилия = ЭтотОбъект.НоваяФамилия;
		СтрФИО.Имя = ЭтотОбъект.НовоеИмя;
		СтрФИО.Отчество = ЭтотОбъект.НовоеОтчество;
		ФИО = ЭтотОбъект.НоваяФамилия + " " + ЭтотОбъект.НовоеИмя + " " + ЭтотОбъект.НовоеОтчество;
		Если ЗначениеЗаполнено(ФИО) Тогда
			СтрФИО.ФИО = ФИО;
			ДолжникОбъект.ФИО_Действующее = ФИО;	
			
			к = ДолжникОбъект.ФИО.Количество() - 1;
			
			Фамилия = ДолжникОбъект.ФИО[к].Фамилия;
			Для н = 1 по к Цикл
				Фамилия = Фамилия + " (" + ДолжникОбъект.ФИО[к-н].Фамилия + ")"; 
			КонецЦикла;
			ДолжникОбъект.ФИО_ПФ = Фамилия + " " + ДолжникОбъект.ФИО[к].Имя + " " + ДолжникОбъект.ФИО[к].Отчество; 
			ДолжникОбъект.ФИО_Действующее = ДолжникОбъект.ФИО[к].ФИО;
			
			ДолжникОбъект.Наименование = ДолжникОбъект.ФИО_ПФ;
			ДолжникОбъект.Записать();
		КонецЕсли;
		
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Попытка
		Должник = ЭтаФорма.ВладелецФормы.Список.Отбор.Элементы[0].ПравоеЗначение;
		ЗаписатьНаСервере(Должник);
		Сообщить("Новые сведения записаны!");
	Исключение   
		Сообщить("Произошла ошибка записи!");
	КонецПопытки;
КонецПроцедуры
