
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Запустить установщик
    ПодключитьОбработчикОжидания("ЗапуститьУстановщик", 1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьУстановщик()
	Shell = Новый COMОбъект("WScript.Shell");
	TEMP = Shell.ExpandEnvironmentStrings("%TEMP%");
	BAT = "script.bat";
	Файл = МакетВФайл(); 
	Файл.Записать(TEMP + "\" + BAT);
	ЗапуститьПриложение(TEMP + "\" + BAT,,Истина);
	ПоказатьОповещениеПользователя("Интеграция с WhatsApp",,"Запуск приложения...",БиблиотекаКартинок.NC_ПодсистемаИнтеграцияСWhatsApp);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция МакетВФайл()
	Макет = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("СкриптУстановкиWA"));
	Файл = ПолучитьИзВременногоХранилища(Макет);
	Возврат Файл; 
КонецФункции
