 
&НаСервере
Функция ШаблонПечатнойФормыУЭДСервер(ВидПечатногоДокумента, ОбъектВх = Неопределено, МассивКоличествоКопий = Неопределено, МассивПрикреплятьДокумент = Неопределено, МассивРегистрироватьИсходящий = Неопределено, ТипСсылки = Неопределено,НеПечататьПовторно = ложь) Экспорт	
	СписокШаблонов = Новый Массив;
	Если ТипСсылки = Неопределено Тогда
		Возврат СписокШаблонов;
	КонецЕсли;
	Если ТипСсылки = "Справочник.тсШаблоныПечатныхДокументов" Тогда
		ПроверятьТипыФайлов = Истина;
		ДопСтрока = " И тсВидыПечатныхДокументовШаблоныПечатныхФорм.ШаблонПечатнойФормы ССЫЛКА Справочник.тсШаблоныПечатныхДокументов ";
	ИначеЕсли ТипСсылки = "Справочник.КомплектыФайловДляПечати" Тогда
		ПроверятьТипыФайлов = Ложь;
		ДопСтрока = " И тсВидыПечатныхДокументовШаблоныПечатныхФорм.ШаблонПечатнойФормы ССЫЛКА Справочник.КомплектыФайловДляПечати ";
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	тсВидыПечатныхДокументовШаблоныПечатныхФорм.ШаблонПечатнойФормы КАК ШаблонСправочник,
	                      |	тсВидыПечатныхДокументовШаблоныПечатныхФорм.ФункцияСвойств,
						  |	тсВидыПечатныхДокументовШаблоныПечатныхФорм.Прикреплять,
						  |	тсВидыПечатныхДокументовШаблоныПечатныхФорм.ИсходящийНомер,
	                      |	тсВидыПечатныхДокументовШаблоныПечатныхФорм.ФункцияКоличество
	                      |ИЗ
	                      |	Справочник.тсВидыПечатныхДокументов.ШаблоныПечатныхФорм КАК тсВидыПечатныхДокументовШаблоныПечатныхФорм
	                      |ГДЕ
	                      |	тсВидыПечатныхДокументовШаблоныПечатныхФорм.Ссылка = &Ссылка
	                      |	И НЕ тсВидыПечатныхДокументовШаблоныПечатныхФорм.ШаблонПечатнойФормы.ПометкаУдаления " 
						  + ДопСтрока + 
 						  "
	                      |УПОРЯДОЧИТЬ ПО
	                      |	тсВидыПечатныхДокументовШаблоныПечатныхФорм.НомерСтроки");
						  
	                      //|	И тсВидыПечатныхДокументовШаблоныПечатныхФорм.ШаблонПечатнойФормы ССЫЛКА Справочник.тсШаблоныПечатныхДокументов
	Запрос.УстановитьПараметр("Ссылка", ВидПечатногоДокумента);		
	
	Если ОбъектВх = Неопределено Тогда
		Результат = Запрос.Выполнить().Выгрузить();
		Возврат Результат.ВыгрузитьКолонку("ШаблонСправочник");		
	Иначе
		
		Результат = Запрос.Выполнить().Выбрать();	
		Пока Результат.Следующий() Цикл
			Если НеПечататьПовторно Тогда
				//Лебедева, 20.02.2019 проверка типов прикрепляемых файлов
				Если ПроверятьТипыФайлов Тогда
					Если ОбъектыСервер.ПроверитьТипФайлаОбъекта(ОбъектВх,Результат.ШаблонСправочник.ТипПрикрепляемогоФайла.Код) Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//  Лебедева, 20.02.2019 конец проверки типов прикрепляемых файлов

			//строгая проверка! повышает отказоустойчивость!!!
			Если УправлениеСвойствами.ВычислитьФункциюВидимости(Результат.ФункцияСвойств.Функция, ОбъектВх) <> Ложь Тогда 
				стр = Новый Структура("Шаблон", Результат.ШаблонСправочник);
				стр.Вставить("Исходящий", Результат.ИсходящийНомер);
				стр.Вставить("Прикреплять", Результат.Прикреплять);
				стр.Вставить("РегНомер", 0);
				СписокШаблонов.Добавить(стр);
				МассивПрикреплятьДокумент.Добавить(Результат.Прикреплять);
				МассивРегистрироватьИсходящий.Добавить(Результат.ИсходящийНомер);
				Если МассивКоличествоКопий <> Неопределено Тогда
					Если Не ЗначениеЗаполнено(Результат.ФункцияКоличество) Тогда
						Количество = 1;
					Иначе
						Количество = УправлениеСвойствами.ВычислитьФункциюВидимости(Результат.ФункцияКоличество.Функция, ОбъектВх);
					КонецЕсли;
					МассивКоличествоКопий.Добавить(Количество);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Возврат СписокШаблонов;	
	КонецЕсли;
КонецФункции
