
&НаКлиенте
Процедура НомерПереводаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	формаВыбораТелефона = ПолучитьФорму("Обработка.бит_Битфон.Форма.ФормаВыбораНомера", , ЭтаФорма);
	бит_ТелефонияКлиентПереопределяемый.ОткрытьФормуСБлокировкойВладельца(формаВыбораТелефона);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		НомерПеревода = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОК(Команда)
	Закрыть(НомерПеревода);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОтмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры
