
&НаСервере
Процедура ЗагрузитьНаСервере()
	Попытка
		Для НомерСтроки = 2 По ПолеИсходнойТаблицы.ВысотаТаблицы Цикл
			КодКонтрагента = УправлениеЗагрузкойСервер.ТекстЯчейки(ПолеИсходнойТаблицы, НомерСтроки, Объект.КодКонтрагента);
			НомерДО = УправлениеЗагрузкойСервер.ТекстЯчейки(ПолеИсходнойТаблицы, НомерСтроки, Объект.НомерДО);
			Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодКонтрагента", КодКонтрагента);
			ДО = Справочники.ДолговыеОбязательства.НайтиПоРеквизиту("КодДО", НомерДО);
			Если Не Контрагент.Пустая() И Не ДО.Пустая() Тогда
				МенеджерЗаписи = РегистрыСведений.Поручительства.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.ДолговоеОбязательство = ДО;
				МенеджерЗаписи.Поручитель = Контрагент;
				МенеджерЗаписи.Записать(Истина);
			Иначе 
				Сообщить("По строке № " + Строка(НомерСтроки) + " данные не найдены!");
			КонецЕсли;
		КонецЦикла;
		Сообщить("Загрузка поручителей завершена");
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

#Область СчитатьФайл

&НаКлиенте
Асинх Процедура ФайлИмпортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Чтец = УправлениеЧтениеФайловКлиент;
	Попытка
	
		ОписаниеФайла = Ждать Чтец.ВыбратьИПоместитьНаСерверТабличныйДокумент(ЭтаФорма.УникальныйИдентификатор);
	
	Исключение
		СообщениеПользователю("Операция не удалась: " + ОписаниеОшибки());
		ОчиститьДанныеФайла();
		Возврат;
	КонецПопытки;
	
	Если ОписаниеФайла = Неопределено Тогда
	
		Возврат;
	
	КонецЕсли;
	
	АдресФайлИмпорта = ОписаниеФайла["Адрес"];
	ФайлИмпорта = ОписаниеФайла["СсылкаНаФайл"]["Имя"];
	
	Результат = УправлениеЗагрузкойСервер.ЗаполнитьТабличныйДокументИзАрхива(ФайлИмпорта, АдресФайлИмпорта);
	Если Результат["Ошибка"] = Неопределено Тогда
	
		ПолеИсходнойТаблицы = Результат["ТабличныйДокумент"];
	
	КонецЕсли;
	
	УдалитьВременныйФайл(Результат["ИмяФайла"]);
	СообщениеПользователю(Результат["Сообщение"]);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВременныйФайл(ИмяФайла)

	ФайловаяСистема.УдалитьВременныйФайл(ИмяФайла);

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеФайла()

	ФайлИмпорта = Неопределено;
	АдресФайлИмпорта = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура СообщениеПользователю(ТекстСообщения)

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти