
Функция ПроверитьНаличиеПросроченныхЗадач() Экспорт
	Набор = РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();
	Набор.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Набор.Прочитать();
	
	Если Набор.ДатаСледующегоНапоминания > ТекущаяДатаСеанса() Тогда
		Возврат Ложь;
	КонецЕсли;
	
    Запрос = Новый Запрос("ВЫБРАТЬ Первые 1
                          |	ЗадачаМероприятие.Ссылка КАК Ссылка,
                          |	ДОБАВИТЬКДАТЕ(ЗадачаМероприятие.ПланируемаяДата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ЗадачаМероприятие.ПланируемоеВремя, СЕКУНДА)) КАК ПланируемаяДата
                          |ИЗ
                          |	Задача.Мероприятие КАК ЗадачаМероприятие
                          |ГДЕ
                          |	НЕ ЗадачаМероприятие.Выполнена
                          |	И ЗадачаМероприятие.Ответственный = &Ответственный
                          |	И НЕ ЗадачаМероприятие.ПометкаУдаления
                          |	И (ЗадачаМероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
                          |			ИЛИ НЕ ЗадачаМероприятие.БизнесПроцесс.ПометкаУдаления)
                          |	И ДОБАВИТЬКДАТЕ(ЗадачаМероприятие.ПланируемаяДата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ЗадачаМероприятие.ПланируемоеВремя, СЕКУНДА)) <= &ТекущаяДата
                          |
                          |ОБЪЕДИНИТЬ
                          |
                          |ВЫБРАТЬ Первые 1
                          |	ЗадачаМероприятие.Ссылка,
                          |	ДОБАВИТЬКДАТЕ(ЗадачаМероприятие.ПланируемаяДата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ЗадачаМероприятие.ПланируемоеВремя, СЕКУНДА))
                          |ИЗ
                          |	Задача.Мероприятие КАК ЗадачаМероприятие
                          |ГДЕ
                          |	НЕ ЗадачаМероприятие.Выполнена
                          |	И ЗадачаМероприятие.Ответственный = &Должность
                          |	И НЕ ЗадачаМероприятие.ПометкаУдаления
                          |	И (ЗадачаМероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
                          |			ИЛИ НЕ ЗадачаМероприятие.БизнесПроцесс.ПометкаУдаления)
                          |	И ДОБАВИТЬКДАТЕ(ЗадачаМероприятие.ПланируемаяДата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ЗадачаМероприятие.ПланируемоеВремя, СЕКУНДА)) <= &ТекущаяДата
                          |	И ЗадачаМероприятие.Объект В(&Объекты)");
	Запрос.УстановитьПараметр("Ответственный", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Должность", ПараметрыСеанса.ТекущийПользователь.ТипСотрудника);
	МассивОбъектов = ЗаполнитьОбъекты();
	Запрос.УстановитьПараметр("Объекты",МассивОбъектов);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

Функция НапоминатьМероприятия() Экспорт
	Возврат Константы.НапоминатьМероприятия.Получить();	
КонецФункции

Функция НапоминатьСообщения() Экспорт
	Возврат Константы.НапоминатьСообщения.Получить()
КонецФункции

Функция ПроверитьНаличиеНеПрочитанныхСообщений() Экспорт	
	НаборЗаписей = РегистрыСведений.СообщенияКПросмотру.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ответственный.Установить(ПараметрыСеанса.ТекущийПользователь); 
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции     


Функция ЗаполнитьОбъекты() Экспорт    
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыВРаботеОстатки.Объект КАК Объект
		|ИЗ
		|	РегистрНакопления.ОбъектыВРаботе.Остатки(&ТекущаяДата, Сотрудник = &Ответственный) КАК ОбъектыВРаботеОстатки";
	
	Запрос.УстановитьПараметр("Ответственный", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Объект");
	
	Возврат РезультатЗапроса; 
КонецФункции

