
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ГарантийноеПисьмо.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГарантийноеПисьмо.Ссылка КАК Ссылка,
	|	ГарантийноеПисьмо.ВерсияДанных КАК ВерсияДанных,
	|	ГарантийноеПисьмо.ПометкаУдаления КАК ПометкаУдаления,
	|	ГарантийноеПисьмо.Номер КАК Номер,
	|	ГарантийноеПисьмо.Дата КАК Дата,
	|	ГарантийноеПисьмо.Проведен КАК Проведен,
	|	ГарантийноеПисьмо.Договор КАК Договор,
	|	ГарантийноеПисьмо.Должник КАК Должник,
	|	ГарантийноеПисьмо.Цедент КАК Цедент,
	|	ГарантийноеПисьмо.ДатаЦессии КАК ДатаЦессии,
	|	ГарантийноеПисьмо.ДоговорЦессии КАК ДоговорЦессии,
	|	ГарантийноеПисьмо.ДатаВыдачи КАК ДатаВыдачи,
	|	ГарантийноеПисьмо.ТекущаяДата КАК ТекущаяДата,
	|	ГарантийноеПисьмо.ДолгПоТелу КАК ДолгПоТелу,
	|	ГарантийноеПисьмо.ДолгПоПроцентам КАК ДолгПоПроцентам,
	|	ГарантийноеПисьмо.ПениШтрафы КАК ПениШтрафы,
	|	ГарантийноеПисьмо.Сумма КАК Сумма,
	|	ГарантийноеПисьмо.ДатаРождения КАК ДатаРождения,
	|	ГарантийноеПисьмо.ДнейПросрочки КАК ДнейПросрочки,
	|	ГарантийноеПисьмо.ДнейПросрочкиОбщее КАК ДнейПросрочкиОбщее
	|ИЗ
	|	Документ.ГарантийноеПисьмо КАК ГарантийноеПисьмо
	|ГДЕ
	|	ГарантийноеПисьмо.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ФорматДаты = "ДФ=dd.MM.yyyy";
		Шапка.Параметры.Дата = Формат(Выборка.Дата, ФорматДаты);
		Шапка.Параметры.ДатаЦессии = Формат(Выборка.ДатаЦессии, ФорматДаты);
		Шапка.Параметры.ДатаВыдачи = Формат(Выборка.ДатаВыдачи, ФорматДаты);
		Шапка.Параметры.ДатаРождения = Формат(Выборка.ДатаРождения, ФорматДаты);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры