
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектыСервер.ОграничитьТипОбъекта(Элементы.Объект);
	
	//	
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
		
		//
		Объект.ДатаПлатежей = ?(Объект.ДатаПлатежей = 0, 1, Объект.ДатаПлатежей);
		Объект.КоличествоМесяцев = ?(Объект.КоличествоМесяцев = 0, 1, Объект.КоличествоМесяцев);
	КонецЕсли;
	
	//
	ЗаполнитьДолг();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	ЗаполнитьТаблицуСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСервер()
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ВЫБОР
	                      |		КОГДА ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток > 0
	                      |			ТОГДА ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ + ВЫБОР
	                      |		КОГДА ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток > 0
	                      |			ТОГДА ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ КАК Сумма
	                      |ИЗ
	                      |	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&ТекДата, Объект = &Объект) КАК ЗадолженностьПоОбъектамОстатки");
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Объект", Объект.Объект);

	Результат = Запрос.Выполнить().Выбрать();
	Сумма = 0;
	Если Результат.Следующий() Тогда
	    Сумма = Результат.Сумма;
	КонецЕсли;

	//
	ТекДата = ТекущаяДатаСеанса();
	НачГода = НачалоГода(ТекДата) + (Объект.ДатаПлатежей - 1) * 3600 * 24;
	ТекМесяц = Месяц(ТекДата) - 1;
	Если День(ТекДата) >= Объект.ДатаПлатежей Тогда
		ТекМесяц = ТекМесяц + 1;
	КонецЕсли;
	
	СуммаПлатежа = Цел(Сумма * 100 / Объект.КоличествоМесяцев) / 100;
	ОстатокОтДеления = Сумма - СуммаПлатежа * Объект.КоличествоМесяцев;
	
	//
	Объект.Платежи.Очистить();
	Пока Сумма > 0 Цикл
		Нов = Объект.Платежи.Добавить();
		Нов.Составляющая1 = СуммаПлатежа + ОстатокОтДеления;
		ОстатокОтДеления = 0;	
		Сумма = Сумма - Нов.Составляющая1;
		Нов.Дата = ДобавитьМесяц(НачГода, ТекМесяц);
		ТекМесяц = ТекМесяц + 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	ЗаполнитьДолг();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДолг()
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ВЫБОР
	                      |		КОГДА ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток > 0
	                      |			ТОГДА ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ + ВЫБОР
	                      |		КОГДА ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток > 0
	                      |			ТОГДА ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ КАК Сумма
	                      |ИЗ
	                      |	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&ТекДата, Объект = &Объект) КАК ЗадолженностьПоОбъектамОстатки");
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Объект", Объект.Объект);

	Результат = Запрос.Выполнить().Выбрать();
	Долг = 0;
	Если Результат.Следующий() Тогда
		Долг = Результат.Сумма;
	КонецЕсли;
КонецПроцедуры
