
&НаКлиенте
Процедура ЗагрузитьСправочник(Команда)
	Если Не ЗначениеЗаполнено(ФайлСправочника) Или не ЗначениеЗаполнено(ФайлРегионов) Тогда
		Сообщить("Сначала нужно выбрать файлы для загрузки!");
		Возврат;
	КонецЕсли;
	ЗагрузитьСправочникНаСервере(ФайлСправочника, ПолеИсходнойТаблицы);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСправочникНаСервере(ФайлСправочника,ПолеИсходнойТаблицы)
	НачатьТранзакцию();
	Попытка
		ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
		ЗначениеОбъект.ЗагрузитьСправочникИндексов(ФайлСправочника,ПолеИсходнойТаблицы);
		ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
		Сообщить("Загрузка успешно выполнена!");
		ЗафиксироватьТранзакцию();
	Исключение
		Сообщить("При загрузке данных произошла ошибка!");
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;

КонецПроцедуры	

&НаКлиенте
Процедура ПутьФайлаСправочникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл Эталонного справочника индексов...";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Файл базы данных(*.dbf)|*.dbf|";
	Если Диалог.Выбрать() Тогда
		ФайлСправочника = Диалог.ПолноеИмяФайла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПутьФайлаРегионовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл Регионов...";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Табличный документ(*.xls, *.xlsx, *.ods)|*.xls?;*.ods|";
	Если Диалог.Выбрать() Тогда
		ФайлРегионов = Диалог.ПолноеИмяФайла;
		ДД = Новый ДвоичныеДанные(ФайлРегионов);
		ЗагрузитьТабличныйДокумент(ПолеИсходнойТаблицы,ДД);	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТабличныйДокумент(ПолеИсходнойТаблицы,ДД)
	Попытка
		ПолеИсходнойТаблицы.Прочитать(ФайлРегионов);
	Исключение
		//Загружено = РаботаСДокументами.мПрочитатьТабличныйДокументИзExcel(ПолеИсходнойТаблицы, ФайлИмпорта, 1);
		Загружено = РаботаСДокументами.ПрочитатьТабличныйДокументExcelизДвоичныхДанных(ПолеИсходнойТаблицы,ДД,1);
	КонецПопытки	
КонецПроцедуры

