
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Должник") И Не Параметры.Должник.Пустая() Тогда
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = ПолучитьМассивДел(Параметры.Должник, Перечисления.ВидыКонтрагентов.Должник);
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = Истина;
	КонецЕсли;
КонецПроцедуры

 &НаСервере
Процедура ПриОткрытииНаСервере()
	// Получим непредопредленное значение с сервера
	ЭтаФорма.РольРКЦ = РольДоступна("РКЦ")
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДел(Контрагент, ВидКонтрагента)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДолговыеОбязательстваКонтрагенты.Ссылка
	                      |ИЗ
	                      |	Справочник.ДолговыеОбязательства.Контрагенты КАК ДолговыеОбязательстваКонтрагенты
	                      |ГДЕ
	                      |	ДолговыеОбязательстваКонтрагенты.Значение = &Значение
	                      |	И ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = &ВидКонтрагента");
	Запрос.УстановитьПараметр("Значение", Контрагент);
	Запрос.УстановитьПараметр("ВидКонтрагента", ВидКонтрагента);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
КонецФункции

&НаКлиенте
Процедура ПозвонитьДолжнику(Команда)
	// Получить объект мероприятия
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		К = Элементы.Список.ТекущиеДанные.Ссылка;
		НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
		НоваяЗадача.Объект.Объект = К;
		НоваяЗадача.Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокИсходящий");
		// НоваяЗадача.Объект.Контакт = РезультатНомер;
		//НоваяЗадача.КонтрагентКЛ = К;
		НоваяЗадача.Открыть();
	Иначе
		Предупреждение("Не выбран объект мероприятия!",,"Исходящий звонок");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьСМСНаСервере()
	// Получим непредопределенное значение с сервера
	ЭтаФорма.РезультатОтправлено = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Отправлено");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	ОтправитьСМСНаСервере();
	// Выполняем обычную клиентскую процедуру
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		К = Элементы.Список.ТекущиеДанные.Ссылка;
		НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
		НоваяЗадача.Объект.Объект = К;
		НоваяЗадача.Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ОтправкаСМС");
		НоваяЗадача.Объект.Результат = РезультатОтправлено;
		// НоваяЗадача.Объект.Контакт = РезультатНомер;
		//НоваяЗадача.КонтрагентКЛ = К;
		НоваяЗадача.Открыть();
	Иначе
		Предупреждение("Не выбран объект мероприятия!",,"Отправка СМС");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НаписатьВВЦНаСервере()
	// Получим непредопределенное значение с сервера
 	ЭтаФорма.ТипВЦ = Справочники.ТипыМероприятий.НайтиПоНаименованию("WhatsApp");
	ЭтаФорма.РезультатОтправлено = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Отправлено");
КонецПроцедуры

&НаКлиенте
Процедура НаписатьВВЦ(Команда)
	НаписатьВВЦНаСервере();
	// Выполняем обычную клиентскую процедуру
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		К = Элементы.Список.ТекущиеДанные.Ссылка;
		НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
		НоваяЗадача.Объект.Объект = К;
		НоваяЗадача.Объект.ТипМероприятия = ТипВЦ;
		НоваяЗадача.Объект.Результат = РезультатОтправлено; 
		// НоваяЗадача.Объект.Контакт = РезультатНомер;
		//НоваяЗадача.КонтрагентКЛ = К;
		НоваяЗадача.Открыть();
	Иначе
		Предупреждение("Не выбран объект мероприятия!",,"Интеграция с WhatsApp");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗакрепитьДолжникаНаСервере()
	// Получим непредопределенное значение с сервера
 	ЭтаФорма.ТипЗаявка = Справочники.ТипыМероприятий.НайтиПоНаименованию("Заявка на закрепление");
КонецПроцедуры

&НаКлиенте
Процедура ЗакрепитьДолжника(Команда)
	ЗакрепитьДолжникаНаСервере();
	// Выполняем обычную клиентскую процедуру
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		К = Элементы.Список.ТекущиеДанные.Ссылка;
		НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
		НоваяЗадача.Объект.Объект = К;
		НоваяЗадача.Объект.ТипМероприятия = ТипЗаявка;
		// НоваяЗадача.Объект.Контакт = РезультатНомер;
		//НоваяЗадача.КонтрагентКЛ = К;
		НоваяЗадача.Открыть();
	Иначе
		Предупреждение("Не выбран объект мероприятия!",,"Открепление должника");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДолжникМероприятия(Команда)
	// Передать с ключом
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		К = Элементы.Список.ТекущиеДанные.Ссылка;
		ФормаМероприятия = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаСписка",,,Новый УникальныйИдентификатор());
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаМероприятия.Список, "Объект", К, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
		ФормаМероприятия.КоманднаяПанель.Видимость = Ложь;
		ФормаМероприятия.ОткрытьМодально();
	Иначе
		Предупреждение("Не найден объект отбора!",,"Все мероприятия");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоискНомераВБазе(Команда)
	ФормаПоиска = ПолучитьФорму("ОбщаяФорма.ПоискНомераВБазе",,,Новый УникальныйИдентификатор());
	ФормаПоиска.Открыть();
КонецПроцедуры

&НаСервере
Процедура ЗапросКредиторуНаСервере()
	// Получим непредопределенное значение с сервера
 	ЭтаФорма.ТипЗапросКредитору = Справочники.ТипыМероприятий.НайтиПоНаименованию("Запрос кредитору");
КонецПроцедуры

&НаКлиенте
Процедура ЗапросКредитору(Команда)
	Если ЭтаФорма.РольРКЦ = Истина Тогда
		ЗапросКредиторуНаСервере();
		// Выполняем обычную клиентскую процедуру
		Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
			К = Элементы.Список.ТекущиеДанные.Ссылка;
			НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
			НоваяЗадача.Объект.Объект = К;
			НоваяЗадача.Объект.ТипМероприятия = ТипЗапросКредитору; 
			// НоваяЗадача.Объект.Контакт = РезультатНомер;
			//НоваяЗадача.КонтрагентКЛ = К;
			НоваяЗадача.Открыть();
		Иначе
			Предупреждение("Не выбран объект мероприятия!",,"Запрос кредитору");
		КонецЕсли;
	Иначе
		Предупреждение("Нарушение прав доступа!",,"Предупреждение");
	КонецЕсли;
КонецПроцедуры
