Функция ФорматНомераДокумента() Экспорт

	Возврат "ЧЦ=9; ЧДЦ=0; ЧН=000000000; ЧВН=; ЧГ=0";

КонецФункции // ()

Функция ПолучитьРеквизитыПлательщика() Экспорт

	Правила = Новый Структура;
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Банк", "РасчетныйСчет");
	Правила.Вставить("Счет", Реквизиты);
	Реквизиты = Новый Структура;
	РеквизитыОрганизации = Новый Массив;
	РеквизитыОрганизации.Добавить("ИНН");
	РеквизитыОрганизации.Добавить("Наименование");
	Реквизиты.Вставить("Организация", РеквизитыОрганизации);
	Правила.Вставить("Пусто", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Организация", "ИНН");
	Правила.Вставить("ИНН", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Организация", "Наименование");
	Правила.Вставить("СоставнойНомер_1", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Банк", "РасчетныйСчет");
	Правила.Вставить("РасчСчет", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Банк", "Наименование");
	Правила.Вставить("Банк1", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Банк", "Город");
	Правила.Вставить("Банк2", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Банк", "Код");
	Правила.Вставить("БИК", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Банк", "КоррСчет");
	Правила.Вставить("Корсчет", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Организация", "КПП");
	Правила.Вставить("КПП", Реквизиты);
	
	Возврат Правила;

КонецФункции // ()

Функция ПолучитьРеквизитыОплаты() Экспорт

	Правила = Новый Структура;
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Организация", "РасчетныйСчет");
	Правила.Вставить("Счет", Реквизиты);
	Реквизиты = Новый Структура;
	РеквизитыОрганизации = Новый Массив;
	РеквизитыОрганизации.Добавить("ИНН");
	РеквизитыОрганизации.Добавить("Наименование");
	Реквизиты.Вставить("Организация", РеквизитыОрганизации);
	Правила.Вставить("Пусто", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Организация", "ИНН");
	Правила.Вставить("ИНН", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Организация", "Наименование");
	Правила.Вставить("СоставнойНомер_1", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Организация", "РасчетныйСчет");
	Правила.Вставить("РасчСчет", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Банк", "Наименование");
	Правила.Вставить("Банк1", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Банк", "Город");
	Правила.Вставить("Банк2", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Банк", "Код");
	Правила.Вставить("БИК", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Банк", "КоррСчет");
	Правила.Вставить("КоррСчет", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Организация", "КПП");
	Правила.Вставить("КПП", Реквизиты);
	Возврат Правила;
	
КонецФункции // ()

Функция ПолучитьНазначение() Экспорт

	ШаблонНазначения = Новый Массив;
	ШаблонНазначения.Добавить("Госпошлина за подачу заявления о вынесении судебного приказа");
	ШаблонНазначения.Добавить("о взыскании долга по договору займа от <Организация>");
	ШаблонНазначения.Добавить("за <ФИО> Cумма <Сумма>, без налога (НДС).");

	Возврат ШаблонНазначения;
	
КонецФункции // ()

Функция ПолучитьРеквизитыВБюджет() Экспорт

	Правила = Новый Структура;
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ЭтаФорма", "СтатусСоставителя");
	Правила.Вставить("СтатусСоставителя", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Суд", "КБК");
	Правила.Вставить("ПоказательКБК", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Суд", "ОКАТО");
	Правила.Вставить("ОКАТО", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ЭтаФорма", "ПоказательОснования");
	Правила.Вставить("ПоказательОснования", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ЭтаФорма", "ПоказательПериода");
	Правила.Вставить("ПоказательПериода", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ЭтаФорма", "ПоказательНомера");
	Правила.Вставить("ПоказательНомера", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ЭтаФорма", "ПоказательДаты");
	Правила.Вставить("ПоказательДаты", Реквизиты);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ЭтаФорма", "ПоказательТипа");
	Правила.Вставить("ПоказательТипа", Реквизиты);
	
	Возврат Правила;

КонецФункции // ()
