#Область ПрограммныйИнтерфейс

Функция КаталогПоУмолчанию() Экспорт

	Возврат Константы.КаталогХраненияПрикрепляемыхФайловНаСервере.Получить();

КонецФункции // ()

Функция ИмяКаталогаИсторииЧатов() Экспорт

	Возврат "ИсторияЧатов";

КонецФункции // ()

#Область ИспользуемыеМодули

Функция МодульПрикрепленияФайлов() Экспорт

	Возврат Документы.ПрикрепитьФайлы;

КонецФункции // ()

Функция МодульХраненияИсторииЧатовПоУмолчанию() Экспорт

	Возврат Документы.ХранилищеИсторииЧатов;

КонецФункции // ()

#КонецОбласти

#Область ВзаимодействиеТелеграмм

Функция КлючиОтветаСервисаТелеграмм() Экспорт

	Описание = Новый Структура;
	Описание.Вставить("Результат", "result");
	Описание.Вставить("Успешно", "ok");
	
	Возврат Описание;

КонецФункции // ()

Функция УспешныйОтветТелеграмм() Экспорт

	Возврат Истина;

КонецФункции // ()

Функция АдресОжиданияСообщений() Экспорт

	Сервис = Метаданные.HTTPСервисы.Bots;
	
	Адрес = КорневоеИмяСервера() + "/hs/"
		+ Сервис.КорневойURL
		+ Сервис.ШаблоныURL.ПолучениеСообщений.Шаблон;
	
	Возврат Адрес;

КонецФункции // ()

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КорневоеИмяСервера()

	Возврат "uz";

КонецФункции // ()


#КонецОбласти