
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АвтоЗначения = Неопределено;
	Если Не Параметры.Свойство("Авто", АвтоЗначения) Тогда
	
		Элементы.ИмяКолонки.ТолькоПросмотр = Ложь;
		Элементы.НомерКолонки.ТолькоПросмотр = Ложь;
		Возврат;
	
	КонецЕсли;
	
	Параметры.Свойство("Имя", ИмяКолонки);
	Параметры.Свойство("Номер", НомерКолонки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПустаяСтрока(НаборыТипов) Тогда
	
		НаборыТипов = "Все типы";
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	ЗначенияЯчейки = Новый Структура;
	ЗначенияЯчейки.Вставить("Результат", Ложь);
	
	Если Не ЗначениеЗаполнено(ТипКолонки) Тогда
	
		Закрыть(ЗначенияЯчейки);
	
	КонецЕсли;
	
	ЗначенияЯчейки.Вставить("Результат", Истина);
	ЗначенияЯчейки.Вставить("Номер", НомерКолонки);
	ЗначенияЯчейки.Вставить("Имя", ИмяКолонки);
	ЗначенияЯчейки.Вставить("Тип", ТипКолонки);
	
	Закрыть(ЗначенияЯчейки);
	
КонецПроцедуры
