
#Область ПрограммныйИнтерфейс

// Обработка текущего модуля
// Работает с файловой системой Клиента/Сервера
//   В зависимости от места вызова
//
// Параметры:
//  Параметры  - Структура - См. ПодготовитьПараметры
//
// Возвращаемое значение:
//   Структура   - Результат обработки
//     Результат - Булево - Успешное завершение
//     Ошибка - Массив - Набор ошибок, если Результат = Ложь
//                     Если Результат = Истина, Может не быть
//     Ответ - - Возвращаемое значение, при Результат = Истина
//                     Если Результат = Ложь, Может не быть
//
Функция Обработать(Параметры) Экспорт

	КаталогоУправлятель = ПарсингДокументовОбщийКлиентСервер;
	
	ОписаниеКаталогов = Параметры["Каталоги"];
	Попытка
	
		Каталоги = КаталогоУправлятель.СоздатьКаталоги(ОписаниеКаталогов);
	
	Исключение
		ВызватьИсключение "При проверке каталогов произошла ошибка: "
			+ Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	Попытка
	
		ФайлыДляОбработки = КаталогоУправлятель.ПолучитьФайлыИсточника(Каталоги);
	
	Исключение
		ВызватьИсключение "При получении файлов произошла ошибка: "
			+ Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	
	

КонецФункции // ()

// Параметры для обработки в текущем модуле
//
// Параметры:
//  Каталоги  - Структура - Общее описание структуры каталогов
//                 См. ПарсингДокументовОбщийКлиентСервер.КаталогиДляПарсинга
//  НастройкиПарсинга  - Структура - Для Клиент Серверной работы
//                 Данные реквизитов СправочникСсылка.НастройкиПарсингаДокументов
//
// Возвращаемое значение:
//   Структура   - Параметры для Обработки
//
Функция ПодготовитьПараметры(Каталоги, НастройкиПарсинга) Экспорт

	Настройщик = НастройкиПарсингаКлиентСервер;
	
	Описание = Новый Структура;

	КаталогиПарсинг = ПарсингДокументовОбщийКлиентСервер
		.КаталогиДляПервичнойПодготовки(Каталоги);
	
	Описание.Вставить("Каталоги", КаталогиПарсинг);
	
	ВложенныеКаталоги = Настройщик.ПолучитьВложенныеКаталоги(НастройкиПарсинга);
	Описание.Вставить("ВложенныеКаталоги", ВложенныеКаталоги);
	
	Возврат Описание;

КонецФункции // ()

#КонецОбласти