
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Состояние) = Ложь Тогда
		Предупреждение("Не задано состояние документа!");
		Отказ = Истина;
		ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Объект.ЕжемесячныйПлатеж) = Ложь Тогда
		Предупреждение("Не задана сумма ежемесячного платежа!");
		Отказ = Истина;
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Объект.ПланируемаяДатаПлатежа) = Ложь Тогда
		Предупреждение("Не задана планируемая дата платежа!");
		Отказ = Истина;
	ИначеЕсли ЭтаФорма.Объект.Проведен = Ложь Тогда
		Предупреждение("Документ не проведен!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры