
Процедура ПередЗаписью(Отказ, Замещение)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	//КазанцевЯА , в документе Корректировка регистров он там отсутствует реквизит на который идет проверка
	//Документ Корректировка регистров является также регистратором данного регистра, но не должен подстраиваться под логику,а вносить коррективы из ТЧ 
	МетаданныеОбъекта = ЭтотОбъект.Отбор.Регистратор.Значение.Метаданные();
	Если МетаданныеОбъекта.Реквизиты.Найти("Объект") <> Неопределено Тогда
		ДО = ЭтотОбъект.Отбор.Регистратор.Значение.Объект;
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	МАКСИМУМ(ПрикрепляемыеФайлыСрезПоследних.Период) КАК Период,
		|	ПрикрепляемыеФайлыСрезПоследних.Объект КАК Объект,
		|	ПрикрепляемыеФайлыСрезПоследних.ТипФайла КАК ТипФайла
		|ИЗ
		|	РегистрСведений.ПрикрепляемыеФайлы.СрезПоследних КАК ПрикрепляемыеФайлыСрезПоследних
		|ГДЕ
		|	ПрикрепляемыеФайлыСрезПоследних.Объект = &Объект
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрикрепляемыеФайлыСрезПоследних.Объект,
		|	ПрикрепляемыеФайлыСрезПоследних.ТипФайла");
		Запрос.УстановитьПараметр("Объект", ДО);
		Результат = Запрос.Выполнить().Выбрать();
		НаборЗаписей = РегистрыСведений.ПрикрепляемыеФайлыСрезПоследних.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(ДО);
		Пока Результат.Следующий() Цикл
			Запись = НаборЗаписей.Добавить();
			Запись.Объект = ДО;
			Запись.ТипФайла = Результат.ТипФайла;
			Запись.Дата = Результат.Период;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЕсли;	

	
КонецПроцедуры
