#Область ПользовательскиеФункции

Функция ЗначениеСвойства() Экспорт

	МодульКонвертации = Справочники.ФункцииКонвертацииСвойств;
	
	Настройка = МодульКонвертации.ПолучитьДанныеНастройки(ЭтотОбъект, ЭтотОбъект, ЭтотОбъект.ОбъектВх);
	
	Возврат МодульКонвертации.ЗначениеСвойства(Настройка);

КонецФункции // ()

Функция ЗначениеСвойстваВЧисло() Экспорт

	МодульКонвертации = Справочники.ФункцииКонвертацииСвойств;
	
	Настройка = МодульКонвертации.ПолучитьДанныеНастройки(ЭтотОбъект, ЭтотОбъект, ЭтотОбъект.ОбъектВх);
	
	Возврат МодульКонвертации.ЗначениеСвойстваВЧисло(Настройка);

КонецФункции

Функция ЗначениеСвойстваВДату() Экспорт

	МодульКонвертации = Справочники.ФункцииКонвертацииСвойств;
	
	Настройка = МодульКонвертации.ПолучитьДанныеНастройки(ЭтотОбъект, ЭтотОбъект, ЭтотОбъект.ОбъектВх);
	
	Возврат МодульКонвертации.ЗначениеСвойстваВДату(Настройка);

КонецФункции

Функция ТекущееЗначение() Экспорт

	МодульКонвертации = Справочники.ФункцииКонвертацииСвойств;
	
	Настройка = МодульКонвертации.ПолучитьДанныеНастройки(ЭтотОбъект, ЭтотОбъект, ЭтотОбъект.ОбъектВх);
	
	Возврат МодульКонвертации.ТекущееЗначение(Настройка);

КонецФункции

#КонецОбласти

