
&НаСервере
Процедура ДолжникПриИзмененииНаСервере()
	бит_ФССП_Переопределяемый.ЗаполнитьЗапрос(Объект.Должник,Объект.Фамилия,Объект.Имя,Объект.Отчество,Объект.ДатаРождения,Объект.КодРегиона);
КонецПроцедуры


&НаКлиенте
Процедура ДолжникПриИзменении(Элемент)
	ДолжникПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПолучитьНомерЗаданияНаСервере()
	Если ЗначениеЗаполнено(Объект.Должник) Тогда
		Если Объект.КодРегиона = 0 Или Объект.ДатаРождения = Дата(1,1,1) Тогда
			Сообщить ("Не удалось определить данные должника! Проверьте настройки констант ФССП!");
			Возврат;
		Иначе
			Объект.task=бит_ФССП_ИнтеграцияФССП.СоздатьЕдиничныйЗапрос(Объект.Должник,Объект.Фамилия,Объект.Имя,Объект.Отчество,Объект.ДатаРождения,Объект.КодРегиона);
		КонецЕсли;
	Иначе 
		Сообщить("Сначала выберете должника для запроса!");
		Возврат;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьНомерЗадания(Команда)
	ПолучитьНомерЗаданияНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОбработатьЗаданиеНаСервере(МассивИП,ТекПользователь,Готово)
	ДолжникИП = бит_ФССП_ИнтеграцияФССП.ОбработатьЕдиничноеЗадание(Объект.task);
	Если ДолжникИП = Неопределено Тогда
		Готово = Ложь;
		Возврат;
	КонецЕсли;
	Долж = Объект.Должник;
	Для Каждого ИП из ДолжникИП Цикл
		МассивИП = бит_ФССП_ИнтеграцияФССП.ЗаполнитьДанныеДокумента(ИП,Долж,Ложь);
	КонецЦикла;
	Готово = Истина;
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗадание(Команда)
	ДлительнаяОперация = ВыполнитьФоновоеЗаданиеНаСервере();
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    
    // указываем необходимость вывода прогресса состояния
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
    
    // указываем интервал обновления состояния в секундах, если не указать, 
    // то интервал будет увеличиваться при каждой итерации в 1.4 раза.
    ПараметрыОжидания.Интервал = 2;
    
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,Новый ОписаниеОповещения("ВыполнитьПроцедуруФоновоВыполнено", ЭтотОбъект),ПараметрыОжидания);
КонецПроцедуры

&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Задание",объект.task);
	СтруктураПараметров.Вставить("ОбработкаЗакончена",Ложь);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'ОбработатьПрогрессЕдиничного'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("Бит_ФССП_ИнтеграцияФССП.ОбработатьПрогрессЕдиничного",СтруктураПараметров,ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
КонецФункции

&НаКлиенте
Процедура ВыполнитьПроцедуруФоновоВыполнено(Результат, ДополнительныеПараметры) Экспорт
	МассивИП="";
	ТекПользователь = "";
	Готово = Ложь; 
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		МассивИП = "";
		ТекПользователь = "";
		Обработано = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если Обработано Тогда
			ОбработатьЗаданиеНаСервере(МассивИП,ТекПользователь,Готово);
			Если Готово Тогда
				СоздатьДокументЗагрузкаИП(Объект.task, Объект.Должник, МассивИП,ТекПользователь);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры



&НаКлиенте
Процедура СоздатьДокументЗагрузкаИП(Задание, Должник, МассивИП,ТекПользователь);
	//МассивИП = ФССП_ОбщийМодуль_ИнтеграцияФССП.ЗаполнитьДанныеДокумента(МассивИППервичный,Должник,Ложь);
	
	
	//ДокументОбъект = Документы.ФССП_ЗагрузкаИсполнительногоПроизводства.СоздатьДокумент();
	ФормаДокумент = ПолучитьФорму("Документ.ФССП_ЗагрузкаИсполнительногоПроизводства.Форма.ФормаДокумента", , ЭтаФорма);
	ФормаДокумент.Объект.Должник = Должник;
	ФормаДокумент.Объект.task = Задание;
	ФормаДокумент.Объект.Дата = ОбщегоНазначенияКлиент.ДатаСеанса();
	ФормаДокумент.Объект.Автор = ТекПользователь;
	
	Для Каждого ип из МассивИП Цикл
		стр = ФормаДокумент.Объект.тчИсполнительныеПроизводства.Добавить();
		ЗаполнитьЗначенияСвойств(стр,ИП);
	КонецЦикла;
	Для Каждого стр из ФормаДокумент.Объект.тчИсполнительныеПроизводства Цикл 
		стр.bailiff = стрЗаменить(стр.bailiff, "<br>", " ");
		стр.bailiff= стрЗаменить(стр.bailiff, "<br/>", " ");
	КонецЦикла;	
	ФормаДокумент.Открыть();
	
КонецПроцедуры


