
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтаФорма.Объект.КодКредитора = "000037809" Тогда
			ЭтаФорма.Объект.ТелефонКредитора = "8 (499) 550-34-22"
		ИначеЕсли ЭтаФорма.Объект.КодКредитора = "F00000160" Тогда
			ЭтаФорма.Объект.ТелефонКредитора = "8 (800) 350-37-23"
		ИначеЕсли ЭтаФорма.Объект.КодКредитора = "F00000236" Тогда
			ЭтаФорма.Объект.ТелефонКредитора = "8 (800) 350-37-23"
		ИначеЕсли ЭтаФорма.Объект.КодКредитора = "F00000091" Тогда
			ЭтаФорма.Объект.ТелефонКредитора = "8 (865) 260-76-07"
		ИначеЕсли ЭтаФорма.Объект.КодКредитора = "F00062598" Тогда
			ЭтаФорма.Объект.ТелефонКредитора = "8 (800) 200-20-39"
		ИначеЕсли ЭтаФорма.Объект.КодКредитора = "F00001401" Тогда
			ЭтаФорма.Объект.ТелефонКредитора = "8 (800) 200-01-45"
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЭтаФорма.Объект.Проведен = Ложь Тогда
		Предупреждение("Документ не проведен!",,"Ошибка сохранения документа");
		Отказ = Истина;	
	КонецЕсли
КонецПроцедуры
