
// Для тонкого клиента
&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитаНаСервере(ИмяОбъекта, ИмяРеквизита)
Возврат ИмяОбъекта[ИмяРеквизита];
КонецФункции
//

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Получить код кредитора
	ЭтаФорма.СкрытоеПолеКодКредитора = ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Объект.Кредитор, "Код");
	//
	Если ЭтаФорма.СкрытоеПолеКодКредитора = "F00114343" Тогда
		ЭтаФорма.Объект.ТелефонКредитора = "8 (499) 550-34-22"
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00000160" Тогда
		ЭтаФорма.Объект.ТелефонКредитора = "8 (800) 350-37-23"
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00000236" Тогда
		ЭтаФорма.Объект.ТелефонКредитора = "8 (800) 350-37-23"
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00062598" Тогда
		ЭтаФорма.Объект.ТелефонКредитора = "8 (800) 200-20-39"
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00001401" Тогда
		ЭтаФорма.Объект.ТелефонКредитора = "8 (800) 200-01-45"
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00000091" Тогда
		ЭтаФорма.Объект.ТелефонКредитора = "8 (865) 260-76-07"
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00114342" Тогда
		ЭтаФорма.Объект.ТелефонКредитора = "8 (865) 260-76-07"
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЭтаФорма.Объект.Проведен = Ложь Тогда
		Предупреждение("Документ не проведен!",,"Ошибка записи документа");
		Отказ = Истина;	
	КонецЕсли
КонецПроцедуры
