
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТаблицуИмпорта();
	ВывестиТаблицуДанных();
КонецПроцедуры

&НаСервере
Процедура ВывестиТаблицуДанных()
	ТаблицаДанных = ПолучитьТаблицуДанных();
		
	Реквизит = Новый РеквизитФормы("тзДанные", Новый ОписаниеТипов("ТаблицаЗначений"), "", "тзДанные");
	КолонкиТаблицыЦенДоб = Новый Массив;
	КолонкиТаблицыЦенДоб.Добавить(Реквизит);
	ЭтаФорма.ИзменитьРеквизиты(КолонкиТаблицыЦенДоб);

	ПолеТаблицы = Элементы.Добавить("тзДанные", Тип("ТаблицаФормы"), Элементы.ГруппаТаблицаДанных);
	ПолеТаблицы.ПутьКДанным = "тзДанные";
	ПолеТаблицы.ИзменятьПорядокСтрок = Ложь;
	ПолеТаблицы.ИзменятьСоставСтрок = Ложь;

	Если ТаблицаДанных <> Неопределено Тогда
		
		Для Каждого Элемент Из ТаблицаДанных.Колонки Цикл
			Имя = Элемент.Имя;
			Синоним = Элемент.Заголовок;
			ТипЗначения = Элемент.ТипЗначения;
			
			
			//2 Добавляем колонку в таблицу тзДанные
			Реквизит = Новый РеквизитФормы(Имя, ТипЗначения, "тзДанные", Синоним);
			//РеквизитНомерСтроки = Новый РеквизитФормы("НомерСтроки", Новый Описаниетипов("Число"), "тзДанные", "N");
			КолонкиТаблицыЦенДоб = Новый Массив;
			КолонкиТаблицыЦенДоб.Добавить(Реквизит);
			
			ПолеФормы = Элементы.Добавить("тзДанные" + Имя, Тип("ПолеФормы"), Элементы["тзДанные"]);
			ПолеФормы.Заголовок = Синоним;
			ЭтаФорма.ИзменитьРеквизиты(КолонкиТаблицыЦенДоб);
			
			Попытка		
				ПолеФормы.ПутьКДанным = "тзДанные." + Имя;			
			Исключение
				Сообщить(ОписаниеОшибки());		
			КонецПопытки;
			ПолеФормы.Вид = ВидПоляФормы.ПолеВвода; 
			
			
		КонецЦикла;
		тзДанные = РеквизитФормыВЗначение("тзДанные");
		Для Каждого Элемент Из ТаблицаДанных Цикл
			тзДанные.Добавить();
		КонецЦикла;
		Для Каждого Колонка Из тзДанные.Колонки Цикл
			тзДанные.ЗагрузитьКолонку(ТаблицаДанных.ВыгрузитьКолонку(Колонка.Имя), Колонка.Имя);
		КонецЦикла;
		ЗначениеВРеквизитФормы(тзДанные, "тзДанные");
	КонецЕсли;
	//тзДанные.Загрузить(ТаблицаДанных);	
КонецПроцедуры	


&НаСервере
Процедура ЗаполнитьТаблицуИмпорта()
	ПолеИсходнойТаблицы.Очистить();
	УправлениеЗагрузкамиДанных.ИзвлечьТабличнуюЧастьВЭлементИзХранилища(ПолеИсходнойТаблицы, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуДанных()
	Документ = РеквизитФормыВЗначение("Объект");
	тзДанныеХранилища = Документ.ВернутьСодержимоеХранилищаТЗДанных();
	ЗначениеВРеквизитФормы(Документ,"Объект");
	Возврат тзДанныеХранилища;	
КонецФункции
