 //Чуров
&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	Попытка
		ВладелецФормыВыбора = ЭтаФорма.ВладелецФормы.УникальныйИдентификатор;
	Исключение
		ВладелецФормы = ЭтаФорма.ВладелецФормы;
	КонецПопытки;	
	
	Оповестить("МероприятиеРезультатНачалоВыбора", Значение, ВладелецФормыВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборДляМероприятияВеб" Тогда
	
		Отбор = Список.Отбор.Элементы;
		
		НовыйЭлемент = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент.ПравоеЗначение = Параметр["Владелец"];
		НовыйЭлемент.Использование = Истина;
			
		НовыйЭлемент = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФункцияВидимости");
		НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;	
		НовыйЭлемент.ПравоеЗначение = Параметр["ФункцияВидимости"];
		НовыйЭлемент.Использование = Истина;
	
	КонецЕсли;
	
КонецПроцедуры
