
Функция АвторизацияУЗ(КраткоеИмя,IDМобильногоУстройства)
	ПользовательБД = УправлениеПользователями.НайтиПользователяБД(КраткоеИмя);
	Свойства = Новый Структура;
	Если ПользовательБД = Неопределено Тогда
		Свойства.Вставить("НеНайдено","Пользователь не найден в БИТ.Управление задолженностью");
		Возврат Свойства;
	Иначе	
		ПользовательПрочитан = Пользователи.ПрочитатьПользователяИБ(ПользовательБД.УникальныйИдентификатор,Свойства,,,);
		Если не ПользовательПрочитан Тогда
			Свойства.Вставить("НеПрочитано","Пользователь не прочитан в БИТ.Управление задолженностью");
		Иначе
			//Записываем айди мобильного устройства для лицензирования			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Мобильные.Ссылка КАК Ссылка
			|ИЗ
			|	ПланОбмена.Мобильные КАК Мобильные
			|ГДЕ
			|	Мобильные.ОтветственныйВыезднойСотрудник = &ОтветственныйВыезднойСотрудник";
			
			ОтветственныйВыезднойСотрудник  = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",ПользовательБД.УникальныйИдентификатор);
			
			Запрос.УстановитьПараметр("ОтветственныйВыезднойСотрудник", ОтветственныйВыезднойСотрудник);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				Выборка= РезультатЗапроса.Выбрать();
				Если Выборка.Следующий() Тогда
					УзелОбъект = Выборка.Ссылка.ПолучитьОбъект();
					ХранилищеМУ = Новый ХранилищеЗначения(IDМобильногоУстройства, Новый СжатиеДанных(9));
					УзелОбъект.IDМобильногоУстройства = ХранилищеМУ;
					Попытка
						УзелОбъект.Записать();
					Исключение
						Свойства = Новый Структура;
						Свойства.Вставить("НеПройдено","У пользователя уже есть зарегистрированное мобильное устройство! Обратитесь к Администратору для смены текущего устройства.");
					КонецПопытки;	
				КонецЕсли;	
				
			КонецЕсли;
			
			Если Свойства.Количество()> 1 Тогда
				
				//Проверяем, первый ли это пользователь МП, чтобы не синхронить предопределенные медиа из МП
				ЭтоПервый = Истина;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Мобильные.Ссылка) КАК КоличествоМобильных
				|ИЗ
				|	ПланОбмена.Мобильные КАК Мобильные";
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					ЭтоПервый = ?(ВыборкаДетальныеЗаписи.КоличествоМобильных > 2, Ложь, Истина);
				Иначе
					ЭтоПервый = Истина;
				КонецЕсли;
				
				
				Свойства.Вставить("ЭтоПервыйУЗ",ЭтоПервый);
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
	СвойстваXDTO = СериализаторXDTO.ЗаписатьXDTO(Свойства);
	
	Возврат СвойстваXDTO;
КонецФункции
