
&НаКлиенте
Процедура ВыгрузкаНомеров(Команда)
	// Выгрузить номера для рассылки
	КомандаВыгрузкаНомеров = "C:\whatsappsender_dgfinance\numbers.txt";
	ЗапуститьПриложение(КомандаВыгрузкаНомеров);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаШаблона(Команда)
	// Выгрузить шаблон сообщения
	КомандаВыгрузкаШаблона = "C:\whatsappsender_dgfinance\message.txt";
	ЗапуститьПриложение(КомандаВыгрузкаШаблона);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьБезДокумента(Команда)
	// Автоматизатор без вложений
	КомандаОтправитьБезДокумента = "C:\whatsappsender_dgfinance\automator_nodoc.bat";
	ЗапуститьПриложение(КомандаОтправитьБезДокумента)
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСДокументом(Команда)
	// Автоматизатор с вложениями
	КомандаОтправитьСДокументом = "C:\whatsappsender_dgfinance\automator.bat";
	ЗапуститьПриложение(КомандаОтправитьСДокументом);
КонецПроцедуры


