
Функция ПолучитьВСекундах(Значение) Экспорт
	Если Значение = Перечисления.НапоминанияИнтервалыПереноса.ПустаяСсылка() Тогда
		Возврат 0;
	ИначеЕсли Значение = Перечисления.НапоминанияИнтервалыПереноса.Минут5 Тогда
		Возврат 5 * 60;
	ИначеЕсли Значение = Перечисления.НапоминанияИнтервалыПереноса.Минут15 Тогда
		Возврат 15 * 60;
	ИначеЕсли Значение = Перечисления.НапоминанияИнтервалыПереноса.Минут30 Тогда
		Возврат 30 * 60;
	ИначеЕсли Значение = Перечисления.НапоминанияИнтервалыПереноса.Час1 Тогда
		Возврат 60 * 60; 
	ИначеЕсли Значение = Перечисления.НапоминанияИнтервалыПереноса.Час4 Тогда
		Возврат 4 * 60 * 60;
	ИначеЕсли Значение = Перечисления.НапоминанияИнтервалыПереноса.Завтра Тогда
		Возврат КонецДня(ТекущаяДатаСеанса()) - ТекущаяДатаСеанса() + 1;
	КонецЕсли;
КонецФункции
