Функция НеОплаченная() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГоспошлинаДляКлиентБанкаСрезПоследних.Основание КАК Основание,
		|	ГоспошлинаДляКлиентБанкаСрезПоследних.Госпошлина КАК Госпошлина
		|ИЗ
		|	РегистрСведений.ГоспошлинаДляКлиентБанка.СрезПоследних КАК ГоспошлинаДляКлиентБанкаСрезПоследних
		|ГДЕ
		|	ГоспошлинаДляКлиентБанкаСрезПоследних.Оплачена = ЛОЖЬ";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ()

Процедура ОтметитьКакОплачена(СудебныеДела) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГоспошлинаДляКлиентБанкаСрезПоследних.Основание КАК Основание,
		|	ГоспошлинаДляКлиентБанкаСрезПоследних.Госпошлина КАК Госпошлина
		|ИЗ
		|	РегистрСведений.ГоспошлинаДляКлиентБанка.СрезПоследних(, Основание В (&Основания)) КАК ГоспошлинаДляКлиентБанкаСрезПоследних
		|ГДЕ
		|	ГоспошлинаДляКлиентБанкаСрезПоследних.Оплачена = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Основания", СудебныеДела);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДатаЗаписи = ТекущаяДатаСеанса();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Запись = СоздатьМенеджерЗаписи();
		Запись.Период = ДатаЗаписи;
		Запись.Основание = ВыборкаДетальныеЗаписи.Основание;
		Запись.Госпошлина = ВыборкаДетальныеЗаписи.Госпошлина;
		Запись.Оплачена = Истина;
		
		Запись.Записать();
		
	КонецЦикла;

КонецПроцедуры
