
Процедура ЗаписатьХранилищеЗначений(НомерСтроки, МассивДанных) Экспорт
	//////Записать();
	//////ЭтотОбъект.Настройка[НомерСтроки - 1].Хранилище = Хранилище;
	//////
	////////Для Каждого Стр Из ЭтотОбъект.Настройка Цикл
	////////	Если Стр.НомерСтроки = НомерСтроки Тогда
	////////		Стр.Хранилище = Хранилище;
	////////		Прервать;
	////////	КонецЕсли;
	////////КонецЦикла;
	//////Записать();
	
	//---
	Записать();
	Для Каждого Стр Из ЭтотОбъект.Настройка Цикл
		Если Стр.НомерСтроки = НомерСтроки Тогда
			Стр.СтрокаХранилище = "";
			Для Каждого СтрМ Из МассивДанных Цикл
				Стр.СтрокаХранилище = Стр.СтрокаХранилище + "[" + СтрМ + "]";
			КонецЦикла;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Записать();

	
КонецПроцедуры

Процедура Записать_СтрокаХранилище(НомерСтроки, МассивДанных) Экспорт
	Записать();
	Для Каждого Стр Из ЭтотОбъект.Настройка Цикл
		Если Стр.НомерСтроки = НомерСтроки Тогда
			Стр.СтрокаХранилище = "";
			Для Каждого СтрМ Из МассивДанных Цикл
				Стр.СтрокаХранилище = Стр.СтрокаХранилище + "[" + СтрМ + "]";
			КонецЦикла;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Записать();
КонецПроцедуры

