
&НаКлиенте
Процедура КомандаОК(Команда)
	Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Результат = Неопределено;
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Для Каждого Элемент Из Схема.Выходы Цикл
		Элементы.Наименование.СписокВыбора.Добавить(Элемент.Наименование);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеПриИзмененииНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура НаименованиеПриИзмененииНаСервере()
	Результат = Схема.Выходы.Найти(Наименование, "Наименование").Результат;
КонецПроцедуры 

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть(Ложь);
КонецПроцедуры

//Чуров++
&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("БизнесПроцессыФормаЗавершенияБПЗавершение", ЭтаФорма);
КонецПроцедуры
