
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектыУчета = Справочники.НастройкиЗагрузкиМероприятий
		.ДоступныеОбъектыУчета();
	
	Для каждого ВидУчета Из ОбъектыУчета Цикл
	
		Элементы.ОбъектУчета.СписокВыбора.Добавить(
			ВидУчета
		);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипМероприятияПриИзменении(Элемент)
	ТипМероприятияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТипМероприятияПриИзмененииНаСервере()
	Объект.РезультатПоУмолчанию = Справочники.РезультатыМероприятий.ПустаяСсылка();
	Объект.ДополнительныеРеквизиты.Очистить();
	//Элементы.РезультатПоУмолчанию.СписокВыбора.Очистить();
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	РезультатыМероприятий.Ссылка
	//                      |ИЗ
	//                      |	Справочник.РезультатыМероприятий КАК РезультатыМероприятий
	//                      |ГДЕ
	//                      |	РезультатыМероприятий.Владелец = &Владелец
	//                      |	И РезультатыМероприятий.ПометкаУдаления = ЛОЖЬ");
	//Запрос.УстановитьПараметр("Владелец", Объект.ТипМероприятия);
	//Результат = Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() Цикл
	//	Элементы.РезультатПоУмолчанию.СписокВыбора.Добавить(Результат.Ссылка);	
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПоУмолчаниюПриИзменении(Элемент)
	РезультатПоУмолчаниюПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РезультатПоУмолчаниюПриИзмененииНаСервере()
	Объект.ДополнительныеРеквизиты.Очистить();
	Объект.ДополнительныеРеквизиты.Загрузить(Объект.РезультатПоУмолчанию.ДополнительныеРеквизиты.Выгрузить());
КонецПроцедуры

