
Функция ОписаниеОшибкиПотыРФ(КлючОшибки) Экспорт

	ОписаниеОшибки = ПереченьОшибокПочтыРФ();
	Возврат ОписаниеОшибки.Получить(КлючОшибки);
	
КонецФункции 

Функция ПереченьОшибокПочтыРФ() 

	Описание = Новый Соответствие();
	Описание.Вставить("ALL_SHIPMENTS_SENT", "Все отправления уже отправлены");
	Описание.Вставить("BARCODE_ERROR", "Ошибка при получении ШПИ");	
	Описание.Вставить("EMPTY_ADDRESS_TYPE_TO", "Тип адреса не указан");
	Описание.Вставить("EMPTY_INDEX_TO", "Почтовый индекс не указан");
	Описание.Вставить("EMPTY_INSR_VALUE", "Объявленная сумма не указана");
	Описание.Вставить("EMPTY_MAIL_CATEGORY", "Категория почтового отправления не указана");
	Описание.Вставить("EMPTY_MAIL_DIRECT", "Почтовое направление не указано");
	Описание.Вставить("EMPTY_MAIL_TYPE", "Тип почтового отправления не указан");
	Описание.Вставить("EMPTY_MASS", "Масса не указана");
	
	Описание.Вставить("EMPTY_NUM_ADDRESS_TYPE", "Не задан номер для соответствующего типа адреса");
	Описание.Вставить("EMPTY_PAYMENT", "Наложенный платеж не указан");
	Описание.Вставить("EMPTY_PLACE_TO", "Населенный пункт не указан");
	Описание.Вставить("EMPTY_REGION_TO", "Регион не заполнен");
	Описание.Вставить("EMPTY_TRANSPORT_TYPE", "Способ пересылки не указан");
	Описание.Вставить("EMPTY_POSTOFFICE_CODE", "Индекс приемного почтового отделения не задан");
	Описание.Вставить("ILLEGAL_ADDRESS_TYPE_TO", "Тип адреса некорректен");
	Описание.Вставить("ILLEGAL_INDEX_TO", "Почтовый индекс некорректен");
	Описание.Вставить("ILLEGAL_INITIALS", "ФИО некорректно");
	Описание.Вставить("ILLEGAL_INSR_VALUE", "Объявленная сумма некорректна");
	Описание.Вставить("ILLEGAL_MAIL_CATEGORY", "Категория почтового отправления некорректна");
	Описание.Вставить("ILLEGAL_MAIL_DIRECT", "Почтовое направление некорректно");
	
	Описание.Вставить("ILLEGAL_MAIL_TYPE", "Тип почтового отправления некорректен");
	Описание.Вставить("ILLEGAL_MASS", "Масса некорректна");
	Описание.Вставить("ILLEGAL_MASS_EXCESS", "Вес отправления не должен превышать N кг");
	Описание.Вставить("ILLEGAL_PAYMENT", "Наложенный платеж некорректен");
	Описание.Вставить("ILLEGAL_POSTCODE", "Индекс приемного почтового отделения в настройках и в партии отличаются");
	Описание.Вставить("ILLEGAL_POSTOFFICE_CODE", "Индекс приемного почтового отделения некорректен");
	Описание.Вставить("ILLEGAL_TRANSPORT_TYPE", "Некорректный способ пересылки");
	Описание.Вставить("IMP13N_ERROR", "Ошибка имперсонализации");
	Описание.Вставить("INSR_VALUE_EXCEEDS_MAX", "Превышено максимальное значение N руб");
	Описание.Вставить("NO_AVAILABLE_POSTOFFICES", "Нет доступных точек сдачи");
	Описание.Вставить("NOT_FOUND", "Отправление не найдено");
	Описание.Вставить("PAST_DUE_DATE", "Дата отправки просрочена");
	Описание.Вставить("READONLY_STATE", "Изменения в партии недопустимы");
	Описание.Вставить("RESTRICTED_MAIL_CATEGORY", "Для создания отправлений с наложенным платежом необходимо указать номер ЕСПП в настройках сервиса. Обратитесь к вашему персональному менеджеру в Почте или напишите письмо на почтовый ящик support.otpravka@russianpost.ru");
	Описание.Вставить("SENDING_MAIL_FAILED", "Ошибка при отправке почты");
	
	Описание.Вставить("TARIFF_ERROR", "Ошибка при расчете тарифа");
	Описание.Вставить("DIFFERENT_TRANSPORT_TYPE", "Способы пересылки отправления и партии отличаются");
	Описание.Вставить("DIFFERENT_MAIL_TYPE", "Типы почтовых отправлений не совпадают");
	Описание.Вставить("DIFFERENT_MAIL_CATEGORY", "Категории почтовых отправления не совпадают");
	Описание.Вставить("DIFFERENT_MAIL_RANK", "Разряд отправления и партии отличаются");
	Описание.Вставить("ABSENT_OVERSIZE_POSTMARK", "Отправление не может быть добавлено в партию с отметкой ""Негабаритная""");
	Описание.Вставить("UNEXPECTED_OVERSIZE_POSTMARK", "Отправление не может быть добавлено в партию с отметкой ""Негабаритная""");
	Описание.Вставить("ABSENT_FRAGILE_POSTMARK", "Отправление без отметки ""Осторожно/Хрупкое"" не может быть добавлено в партию с отметкой ""Осторожно/Хрупкое""");
	Описание.Вставить("UNEXPECTED_FRAGILE_POSTMARK", "Отправление с отметкой ""Осторожно/Хрупкое"" не может быть добавлено в партию без отметки ""Осторожно/Хрупкое""");
	Описание.Вставить("ABSENT_COURIER_DELIVERY_POSTMARK", "Отправление без отметки ""Курьер"" не может быть добавлено в партию с отметкой ""Курьер""");
	Описание.Вставить("UNEXPECTED_COURIER_DELIVERY_POSTMARK", "Отправление с отметкой ""Курьер"" не может быть добавлено в партию без отметки ""Курьер""");
	Описание.Вставить("ABSENT_ORDER_OF_NOTICE_POSTMARK", "Отправление без отметки ""С заказным уведомлением"" не может быть добавлено в партию с отметкой ""С заказным уведомлением""");
	Описание.Вставить("UNEXPECTED_ORDER_OF_NOTICE_POSTMARK", "Отправление с отметкой ""С заказным уведомлением"" не может быть добавлено в партию без отметки ""С заказным уведомлением""");
	Описание.Вставить("ABSENT_SIMPLE_NOTICE_POSTMARK", "Отправление без отметки ""С простым уведомлением"" не может быть добавлено в партию с отметкой ""С простым уведомлением""");
	Описание.Вставить("UNEXPECTED_SIMPLE_NOTICE_POSTMARK", "Отправление с отметкой ""С простым уведомлением"" не может быть добавлено в партию без отметки ""С простым уведомлением""");
	Описание.Вставить("UNDEFINED", "Неопределенная ошибка");
	
	Описание.Вставить("ACCESS_VIOLATION", "Нарушение доступа");
	Описание.Вставить("DELIVERY_IN_PROGRESS", "Отправление уже отправлено");
	Описание.Вставить("READONLY_STATE", "Изменения в партии недопустимы");
	
	Описание.Вставить("EMPTY_TELADDRESS", "Телефон получателя является обязательным для данного вида отправления");
	Описание.Вставить("NOT_INSURED_PAYMENT", "Наложенный платеж превышает объявленную ценность");
	Описание.Вставить("DIFFERENT_POSTCODE", "Способы пересылки отправления и партии отличаются");
	Описание.Вставить("ILLEGAL_FRAGILE", "Отметка ""Осторожно/Хрупкое"" неприменима для указанного типа отправлений");
	Описание.Вставить("EMPTY_MAIL_RANK", "Код разряда почтового отправления не задан в настройках пользователя");
	Описание.Вставить("EMPTY_ENVELOPE_TYPE", "Не задан тип конверта");
	Описание.Вставить("ILLEGAL_ENVELOPE_TYPE", "Недопустимое значение ""Тип конверта"" для выбранного вида отправления");
	Описание.Вставить("ILLEGAL_ADDRESS_LETTER", "Недопустимое значение ""Литера""");
	Описание.Вставить("ILLEGAL_ADDRESS_SLASH", "Недопустимое значение ""Дробь""");
	Описание.Вставить("ILLEGAL_ADDRESS_CORPUS", "Недопустимое значение ""Корпус""");
	Описание.Вставить("ILLEGAL_ADDRESS_BUILDING", "Недопустимое значение ""Строение""");
	Описание.Вставить("ILLEGAL_ADDRESS_ROOM", "Недопустимое значение ""Комната""");
	Описание.Вставить("EMPTY_PAYMENT_METHOD", "Способ оплаты не задан");
	Описание.Вставить("ILLEGAL_PAYMENT_METHOD", "Некорректный способ оплаты");
	Описание.Вставить("CODE_1372", "Доставка по указанному маршруту не осуществляется");
	
	Возврат Описание;
	
КонецФункции 




