
&НаСервере
Процедура ЗаписатьНаСервере()
	// Создать мероприятие отправки
	НовоеМероприятие = Задачи.Мероприятие.СоздатьЗадачу();	
	НовоеМероприятие.Автор = ПараметрыСеанса.ТекущийПользователь;
	НовоеМероприятие.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	НовоеМероприятие.Дата = ТекущаяДата();
	НовоеМероприятие.ВремяСоздания = ТекущаяДата();
	НовоеМероприятие.ПланируемаяДата = ТекущаяДата();
	НовоеМероприятие.ДатаВыполнения = ТекущаяДата();
	НовоеМероприятие.ФактическаяДата = ТекущаяДата();
	НовоеМероприятие.ДлительностьРазговора = "0:00:00";
	НовоеМероприятие.Объект = ЭтаФорма.ДО;
	НовоеМероприятие.Контакт = ЭтаФорма.Контакт;
	НовоеМероприятие.ТипМероприятия = Справочники.ТипыМероприятий.НайтиПоНаименованию(ЭтаФорма.СредствоОтправки);
	НовоеМероприятие.Результат = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Отправлено");
	НовоеМероприятие.Комментарий = Строка(ЭтаФорма.ТипДокумента);
	НовоеМероприятие.Выполнена = Истина;
	НовоеМероприятие.Записать();
	ЭтаФорма.ЗаписьПроизведена = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Если ЗначениеЗаполнено(ЭтаФорма.ТипДокумента) Тогда
		ПоказатьОповещениеПользователя("Документооборот",,"Мероприятие отправки записано",БиблиотекаКартинок.NC_СоздатьМероприятие);
		ЗаписатьНаСервере();
		ЭтаФорма.Закрыть();
	Иначе
		Предупреждение("Не выбран тип документа!",,"Ошибка записи");
	КонецЕсли;
КонецПроцедуры
