
Перем ТекстИзменений;

Процедура ПередЗаписью(Отказ)
	//Наименование = ?(ПустаяСтрока(СерияНомерИД), НомерДела, НомерДела + " (" + СерияНомерИД + ")");
	//
	//Если Не ЭтотОбъект.ЭтоГруппа И Не ЗначениеЗаполнено(ЭтотОбъект.ДатаСоздания) Тогда
	//	ЭтотОбъект.ДатаСоздания = ТекущаяДата();
	//КонецЕсли;
	
	//
	ТекстИзменений = ОбъектыСервер.ПроверитьИзмененияВОбъекте(ЭтотОбъект);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Справочники.Пользователи.ОтслеживаниеИзменений(Отказ, Ссылка, ТекстИзменений);
КонецПроцедуры
