
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыВозврата = Новый Структура;
	ПараметрыВозврата.Вставить("Назначение", Назначение);
	ПараметрыВозврата.Вставить("Результат", ВыбраннаяСтрока);
	Оповестить("ДобавитьРеквизит", ПараметрыВозврата, ВладелецФормы);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Назначение = Параметры["Назначение"];
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыделенные(Команда)
	
	ПараметрыВозврата = Новый Структура;
	ПараметрыВозврата.Вставить("Назначение", Назначение);
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	ВыбранныеРеквизиты = Новый Массив;
	Для каждого ВыделеннаяСторка Из ВыделенныеСтроки Цикл
	
		ВыбранныеРеквизиты.Добавить(ВыделеннаяСторка);
	
	КонецЦикла;
	ПараметрыВозврата.Вставить("Результат", ВыбранныеРеквизиты);
	Оповестить("ДобавитьРеквизиты", ПараметрыВозврата, ВладелецФормы);
	
КонецПроцедуры
