&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	ВидимостьЭлементов();   
КонецПроцедуры

&НаКлиенте
Процедура ПолноеПрощениеПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ВидимостьЭлементов()
	Элементы.ДокументКорректировка.Видимость = Объект.СписыватьЗадолженностьВПрограмме И Не Объект.ПолноеПрощение;  
	Элементы.ВидЛьготногоПериода.Видимость = (Объект.ВидИзменияДоговора = 1);
	Элементы.ПричиныУрегулированияПроблемнойЗадолженности.Видимость = (Объект.ВидИзменияДоговора = 2);
	Элементы.ВидыПрочихИзмененийДоговора.Видимость = (Объект.ВидИзменияДоговора = 3);
	Элементы.ОписаниеИныхИзменений.Видимость = (Объект.ПричиныУрегулированияПроблемнойЗадолженности = 99 или Объект.ВидыПрочихИзмененийДоговора = 99);
	Элементы.Наследник.Видимость = (Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.НаследованиеДоговора);
КонецПроцедуры

&НаКлиенте
Процедура ВидИзменияДоговораПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПричиныУрегулированияПроблемнойЗадолженностиПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ВидыПрочихИзмененийДоговораПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ТипИзмененияПриИзменении(Элемент)
	ЗаполнитьПараметрыНаследованияДоговора();
	ВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНаследованияДоговора()
	Если Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.НаследованиеДоговора Тогда
		Объект.ВидИзменияДоговора = 3;
		Объект.ВидыПрочихИзмененийДоговора = 99;
		Объект.ОписаниеИныхИзменений = "Вступление в наследство.";
	Иначе
		Объект.ВидИзменияДоговора = "";
		Объект.ВидыПрочихИзмененийДоговора = "";
		Объект.ОписаниеИныхИзменений = "";
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьЭлементов();
КонецПроцедуры


&НаСервере
Процедура ОснованиеПрекращенияОбязательстваПриИзмененииНаСервере()
	Если ТипЗнч(Объект.ОснованиеПрекращенияОбязательства) = Тип("ДокументСсылка.СудебноеДело") Тогда
		Если Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.МировоеСоглашение Тогда
			Объект.ПричиныПрекращенияОбязательства = 3;
		Иначе
			Объект.ПричиныПрекращенияОбязательства = 2;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Объект.ОснованиеПрекращенияОбязательства) = Тип("СправочникСсылка.ДелоОНедееспособностиСубъекта") Тогда
		Объект.ПричиныПрекращенияОбязательства = 5;
	ИначеЕсли ТипЗнч(Объект.ОснованиеПрекращенияОбязательства) = Тип("СправочникСсылка.ДелоОБанкротстве") Тогда
		Объект.ПричиныПрекращенияОбязательства = 13; 
	Иначе 
		Объект.ПричиныПрекращенияОбязательства = 99;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ОснованиеПрекращенияОбязательстваПриИзменении(Элемент)
	ОснованиеПрекращенияОбязательстваПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СписыватьЗадолженностьВПрограммеПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

