&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Если Не ЗначениеЗаполнено(Объект.ТипИзменения) Тогда
		Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.Изменения;   
	КонецЕсли;
	ВидимостьЭлементов();   
КонецПроцедуры

&НаКлиенте
Процедура ПолноеПрощениеПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ВидимостьЭлементов()
	Элементы.ДокументКорректировка.Видимость = Объект.СписыватьЗадолженностьВПрограмме И Не Объект.ПолноеПрощение;  
	Элементы.ВидЛьготногоПериода.Видимость = (Объект.ВидИзменияДоговора = 1);
	Элементы.ПричиныУрегулированияПроблемнойЗадолженности.Видимость = (Объект.ВидИзменияДоговора = 2);
	Элементы.ВидыПрочихИзмененийДоговора.Видимость = (Объект.ВидИзменияДоговора = 3);
	Элементы.ОписаниеИныхИзменений.Видимость = (Объект.ПричиныУрегулированияПроблемнойЗадолженности = 99 или Объект.ВидыПрочихИзмененийДоговора = 99);
	Элементы.Наследник.Видимость = (Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.НаследованиеДоговора);
КонецПроцедуры

&НаКлиенте
Процедура ВидИзменияДоговораПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПричиныУрегулированияПроблемнойЗадолженностиПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ВидыПрочихИзмененийДоговораПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ТипИзмененияПриИзменении(Элемент)
	//ЗаполнитьПараметрыНаследованияДоговора();
	ОбработатьТипыИзменения();
	ВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНаследованияДоговора()
	Если Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.НаследованиеДоговора Тогда
		Объект.ВидИзменияДоговора = 3;
		Объект.ВидыПрочихИзмененийДоговора = 99;
		Объект.ОписаниеИныхИзменений = "Вступление в наследство.";	
	Иначе
		Объект.ВидИзменияДоговора = "";
		Объект.ВидыПрочихИзмененийДоговора = "";
		Объект.ОписаниеИныхИзменений = "";
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьТипыИзменения()
	Если Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.НаследованиеДоговора Тогда
		Объект.ВидИзменияДоговора = 3;
		Объект.ВидыПрочихИзмененийДоговора = 99;  
		Объект.ПричиныУрегулированияПроблемнойЗадолженности = "";
		Объект.ОписаниеИныхИзменений = "Вступление в наследство.";	
	ИначеЕсли Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.ЗаконодательныеИНормативноПравовыеАкты Тогда
		Объект.ВидИзменияДоговора = 2;
		Объект.ВидыПрочихИзмененийДоговора = "";
		Объект.ПричиныУрегулированияПроблемнойЗадолженности = 99;  
		Объект.ОписаниеИныхИзменений = "Укажите в этом поле причины изменения договора для события 2.1 или измените значение показателя Видов изменений. На основании акта органа государственной власти или органа местного самоуправления.";
		Объект.СписыватьЗадолженностьВПрограмме = Истина;
		Объект.ПолноеПрощение = Истина;
		Объект.ПричиныПрекращенияОбязательства = 13;
	ИначеЕсли Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.ПредусмотреныИсходнымиУсловиями Тогда
		Объект.ВидИзменияДоговора = 3;
		Объект.ВидыПрочихИзмененийДоговора = "";
		Объект.ПричиныУрегулированияПроблемнойЗадолженности = "";  
		Объект.ОписаниеИныхИзменений = "Заполните данные, которые необходимы дя блоков ФЛ 23(1)/ ЮЛ 15(1)";
		Объект.СписыватьЗадолженностьВПрограмме = Ложь;
		Объект.ПолноеПрощение = Ложь;
		Объект.ПричиныПрекращенияОбязательства = "";
	
	Иначе
		Объект.ВидИзменияДоговора = "";     
		Объект.ВидыПрочихИзмененийДоговора = "";
		Объект.ПричиныУрегулированияПроблемнойЗадолженности = "";
		Объект.ОписаниеИныхИзменений = ""; 
		Объект.СписыватьЗадолженностьВПрограмме = Ложь;
		Объект.ПолноеПрощение = Ложь; 
		Объект.ПричиныПрекращенияОбязательства = "";
	КонецЕсли;	
КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьЭлементов();
КонецПроцедуры


&НаСервере
Процедура ОснованиеПрекращенияОбязательстваПриИзмененииНаСервере()
	Если ТипЗнч(Объект.ОснованиеПрекращенияОбязательства) = Тип("ДокументСсылка.СудебноеДело") Тогда
		Если Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.МировоеСоглашение Тогда
			Объект.ПричиныПрекращенияОбязательства = 3;   
		ИначеЕсли Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.СоглашениеОПрощении Тогда 
			Объект.ПричиныПрекращенияОбязательства = 11; 
		Иначе
			Объект.ПричиныПрекращенияОбязательства = 2;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Объект.ОснованиеПрекращенияОбязательства) = Тип("СправочникСсылка.ДелоОНедееспособностиСубъекта") Тогда
		Объект.ПричиныПрекращенияОбязательства = 13;
	ИначеЕсли ТипЗнч(Объект.ОснованиеПрекращенияОбязательства) = Тип("СправочникСсылка.ДелоОБанкротстве") Тогда
		Объект.ПричиныПрекращенияОбязательства = 16; 
	Иначе 
		Объект.ПричиныПрекращенияОбязательства = 99;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ОснованиеПрекращенияОбязательстваПриИзменении(Элемент)
	ОснованиеПрекращенияОбязательстваПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СписыватьЗадолженностьВПрограммеПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

