
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьСуммыЗадолженности");
КонецПроцедуры

&НаСервере
Процедура СуммаПлатежаПриИзмененииНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ПересчитатьНеразнесеннуюСумму();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПлатежаПриИзменении(Элемент)
	СуммаПлатежаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РазнесениеПоСудебнымРешениямПриИзменении(Элемент)
	СуммаПлатежаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РазнестиПоСудебнымРешениямНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РаспределитьПоСудебнымРешениям();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура РазнестиПоСудебнымРешениям(Команда)
	РазнестиПоСудебнымРешениямНаСервере();
КонецПроцедуры

&НаСервере
Процедура РазнестиПоВнесудебкеНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РаспределитьПоВнесудебке();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура РазнестиПоВнесудебке(Команда)
	РазнестиПоВнесудебкеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РазнесениеПоЗагруженнымОстаткамПриИзменении(Элемент)
	СуммаПлатежаПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
КонецПроцедуры

