#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Процедура заполняет значения ставки рефинансирования.
// Центрального Банка Российской Федерации 
//
Процедура ЗаполнитьЗначенияСтавкиРефинансированияЦБ() Экспорт
	
	КлассификаторXML = РегистрыСведений.АЭ_ЗначенияВидовПроцентныхСтавок.ПолучитьМакет("СтавкаРефинансированияЦБ").ПолучитьТекст();
	
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	НаборЗаписей = РегистрыСведений.АЭ_ЗначенияВидовПроцентныхСтавок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидСтавки.Установить(Справочники.АЭ_ВидыСтавок.КлючеваяСтавкаЦБ);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	
	Для Каждого СтрокаКлассификатора Из КлассификаторТаблица Цикл
		СтрокаНабора = НаборЗаписей.Добавить();
		СтрокаНабора.Период 	= Дата(СтрокаКлассификатора.Date);
		СтрокаНабора.ВидСтавки 	= Справочники.АЭ_ВидыСтавок.КлючеваяСтавкаЦБ;
		СтрокаНабора.Процент	= Число(СтрокаКлассификатора.Rate);
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли