
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Макет = Отчеты.ОтчетПоВзысканию.ПолучитьМакет("Макет");
	ТабДок.Очистить();
	
    ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(ОбластьЗаголовок);		
	ОбластьШапка = ?(Отчет.КолонкаКредитор, Макет.ПолучитьОбласть("Шапка1"), Макет.ПолучитьОбласть("Шапка"));
	ОбластьШапка.Параметры.ПериодОтчетаС = Строка(Формат(НачалоПериода, "ДЛФ=Д"));
	ОбластьШапка.Параметры.ПериодОтчетаПо = Строка(Формат(КонецПериода, "ДЛФ=Д"));
	//ОбластьШапка.Параметры.НомерДоговора = Контрагент.НомерДоговора;
	ТабДок.Вывести(ОбластьШапка);
	
	ТабДок.ФиксацияСверху = 5;
	ОбластьДанных = ?(Отчет.КолонкаКредитор, Макет.ПолучитьОбласть("ДанныеОтчета1"), Макет.ПолучитьОбласть("ДанныеОтчета"));
	
	//Подготовка таблицы с ДО подходящими по стадии
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект КАК ДолговоеОбязательство
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	                      |			,
	                      |			Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	                      |				И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки");
	ТаблицаДО = Запрос.Выполнить().Выгрузить();
	ОтобратьПоСтадии(ТаблицаДО);
	
	Если Должник.Пустая() И Контрагент.Пустая() И Кредитор.Пустая() Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаДО.ДолговоеОбязательство,
		               |	ТаблицаДО.СтадияФлаг
		               |ПОМЕСТИТЬ ТаблицаДО
		               |ИЗ
		               |	&ТаблицаДО КАК ТаблицаДО";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаДО.ДолговоеОбязательство,
		               |	ТаблицаДО.СтадияФлаг
		               |ПОМЕСТИТЬ ТаблицаДОВрем
		               |ИЗ
		               |	&ТаблицаДО КАК ТаблицаДО
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаДОВрем.ДолговоеОбязательство,
		               |	ТаблицаДОВрем.СтадияФлаг
		               |ПОМЕСТИТЬ ТаблицаДО
		               |ИЗ
		               |	ТаблицаДОВрем КАК ТаблицаДОВрем
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.Контрагенты КАК ДолговыеОбязательстваКонтрагенты
		               |		ПО ТаблицаДОВрем.ДолговоеОбязательство = ДолговыеОбязательстваКонтрагенты.Ссылка
		               |			И (ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Должник)
		               |					И ДолговыеОбязательстваКонтрагенты.Значение = &Должник
		               |				ИЛИ ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Контрагент)
		               |					И ДолговыеОбязательстваКонтрагенты.Значение = &Контрагент
		               |				ИЛИ ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Кредитор)
		               |					И ДолговыеОбязательстваКонтрагенты.Значение = &Кредитор)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаДОВрем.ДолговоеОбязательство,
		               |	ТаблицаДОВрем.СтадияФлаг
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(*) >= &КолВо";	
		Запрос.УстановитьПараметр("Должник", Должник);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Кредитор", Кредитор);
		Запрос.УстановитьПараметр("КолВо", Число(Не Должник.Пустая()) + Число(Не Контрагент.Пустая()) + 
				Число(Не Кредитор.Пустая()));
	КонецЕсли;
	Запрос.УстановитьПараметр("ТаблицаДО", ТаблицаДО);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.ВыполнитьПакет();
	//
		
	///////////////////////////////////////
	// Выбор должника и номера закладной //
	///////////////////////////////////////
	Если Сотрудник.Пустая() Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОбъектыВРаботеОстатки.Объект.ВладелецДолжник КАК Должник,
					   |	ОбъектыВРаботеОстатки.Объект.ВладелецКредитор КАК Кредитор,
		               |	ЕСТЬNULL(ЕСТЬNULL(ДополнительныеСведения.Значение, ДолговыеОбязательстваДополнительныеРеквизиты.Значение), ОбъектыВРаботеОстатки.Объект) КАК НомерПоБазе,
		               |	ОбъектыВРаботеОстатки.Объект КАК ДолговоеОбязательство,
		               |	ОтветственныеСотрудники.Пользователь КАК Ответственный,
					   |	ОбъектыВРаботеОстатки.Объект.Должник КАК ДолжникНаименование,
					   |	ОбъектыВРаботеОстатки.Объект.Кредитор КАК КредиторНаименование,
		               |	ТаблицаДО.СтадияФлаг
		               |ИЗ
		               |	РегистрНакопления.ОбъектыВРаботе.Остатки(
		               |			&ДатаОтчета,
		               |			Подразделение = &Подразделение
		               |				И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяССылка)
		               |				И (Объект = &ДолговоеОбязательство
		               |					ИЛИ &ПустоеДО)) КАК ОбъектыВРаботеОстатки
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДО КАК ТаблицаДО
		               |		ПО ОбъектыВРаботеОстатки.Объект = ТаблицаДО.ДолговоеОбязательство
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		               |		ПО ОбъектыВРаботеОстатки.Объект = ДополнительныеСведения.Объект
		               |			И (ДополнительныеСведения.Свойство.Код = ""     0078"")
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
		               |		ПО ОбъектыВРаботеОстатки.Объект = ОтветственныеСотрудники.Объект
		               |			И (ОтветственныеСотрудники.ТипСотрудника.Код = ""     0002"")
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДолговыеОбязательстваДополнительныеРеквизиты
		               |		ПО ОбъектыВРаботеОстатки.Объект = ДолговыеОбязательстваДополнительныеРеквизиты.Ссылка
		               |			И (ДолговыеОбязательстваДополнительныеРеквизиты.Свойство.Код = ""     0078"")
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДопРеквизитыРегион
		               |		ПО ОбъектыВРаботеОстатки.Объект = ДопРеквизитыРегион.Ссылка
		               |			И (ДопРеквизитыРегион.Свойство.Код = ""     0125"")
		               |			И (ДопРеквизитыРегион.Значение = &Регион
		               |				ИЛИ &НеЗаполненРегион)
		               |ГДЕ
		               |	НЕ ОбъектыВРаботеОстатки.Объект.ПометкаУдаления
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Должник";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОбъектыВРаботеОстатки.Объект.ВладелецДолжник КАК Должник,
					   |	ОбъектыВРаботеОстатки.Объект.ВладелецКредитор КАК Кредитор,
		               |	ЕСТЬNULL(ЕСТЬNULL(ДополнительныеСведения.Значение, ДолговыеОбязательстваДополнительныеРеквизиты.Значение), ОбъектыВРаботеОстатки.Объект) КАК НомерПоБазе,
		               |	ОбъектыВРаботеОстатки.Объект КАК ДолговоеОбязательство,
		               |	&Пользователь КАК Ответственный,
		               |	ОбъектыВРаботеОстатки.Объект.Должник КАК ДолжникНаименование,
					   |	ОбъектыВРаботеОстатки.Объект.Кредитор КАК КредиторНаименование,
		               |	ТаблицаДО.СтадияФлаг
		               |ИЗ
		               |	РегистрНакопления.ОбъектыВРаботе.Остатки(
		               |			&ДатаОтчета,
		               |			Подразделение = &Подразделение
		               |				И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяССылка)
		               |				И (Объект = &ДолговоеОбязательство
		               |					ИЛИ &ПустоеДО)) КАК ОбъектыВРаботеОстатки
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДО КАК ТаблицаДО
		               |		ПО ОбъектыВРаботеОстатки.Объект = ТаблицаДО.ДолговоеОбязательство
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		               |		ПО ОбъектыВРаботеОстатки.Объект = ДополнительныеСведения.Объект
		               |			И (ДополнительныеСведения.Свойство.Код = ""     0078"")
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДолговыеОбязательстваДополнительныеРеквизиты
		               |		ПО ОбъектыВРаботеОстатки.Объект = ДолговыеОбязательстваДополнительныеРеквизиты.Ссылка
		               |			И (ДолговыеОбязательстваДополнительныеРеквизиты.Свойство.Код = ""     0078"")
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
		               |		ПО ОбъектыВРаботеОстатки.Объект = ОтветственныеСотрудники.Объект
		               |			И (ОтветственныеСотрудники.Пользователь = &Пользователь)
		               |			И (ОтветственныеСотрудники.ТипСотрудника.Код = ""     0002"")
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДопРеквизитыРегион
		               |		ПО ОбъектыВРаботеОстатки.Объект = ДопРеквизитыРегион.Ссылка
		               |			И (ДопРеквизитыРегион.Свойство.Код = ""     0125"")
		               |			И (ДопРеквизитыРегион.Значение = &Регион
		               |				ИЛИ &НеЗаполненРегион)
		               |ГДЕ
		               |	НЕ ОбъектыВРаботеОстатки.Объект.ПометкаУдаления
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Должник";
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ДатаОтчета", КонецДня(ДатаОтчета));
	Запрос.УстановитьПараметр("Пользователь", Сотрудник);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Должник", Должник);
	Запрос.УстановитьПараметр("ДолговоеОбязательство", ДолговоеОбязательство);
	Запрос.УстановитьПараметр("ПустоеДО", ДолговоеОбязательство.Пустая());
	Запрос.УстановитьПараметр("Регион", Регион);
	Запрос.УстановитьПараметр("НеЗаполненРегион", Регион.Пустая());
	
	МассивРезультатовМС = Новый Массив();	
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0220"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0315"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0221"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0183"));	
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0222"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0184"));
	Запрос.УстановитьПараметр("РезультатМС", МассивРезультатовМС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	НомерЗаписи = 0;
	Пока Выборка.Следующий() Цикл
		НомерЗаписи = НомерЗаписи + 1;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Мероприятие.ТипМероприятия,
		               |	Мероприятие.ФактическаяДата КАК ФактическаяДата,
		               |	Мероприятие.Комментарий,
		               |	Мероприятие.Ссылка
		               |ИЗ
		               |	Задача.Мероприятие КАК Мероприятие
		               |ГДЕ
		               |	Мероприятие.ФактическаяДата МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И Мероприятие.Выполнена
		               |	И (Мероприятие.Объект = &ДО
	                   |			ИЛИ Мероприятие.Объект.Владелец = &ДО)
		               |	И (НЕ Мероприятие.ПометкаУдаления)
		               |	И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
		               |			ИЛИ (НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления)) 
	                   |	И НЕ Мероприятие.ВыполненоКакНеАктуальное
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ФактическаяДата";
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
		Запрос.УстановитьПараметр("ТекДата", КонецДня(ДатаОтчета));
		Запрос.УстановитьПараметр("ДО", Выборка.ДолговоеОбязательство);
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		Выборка2 = Запрос.Выполнить().Выбрать();
		
		
		СтрокаДействий = "";
		Если Сред(Выборка.СтадияФлаг, 1, 1) = "1" Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	Мероприятие.Результат.Код КАК Код
			               |ИЗ
			               |	Задача.Мероприятие КАК Мероприятие
			               |ГДЕ
			               |	Мероприятие.Выполнена
			               |	И Мероприятие.Результат В(&РезультатМС)
			               |	И (Мероприятие.Объект = &ДО
	                       |			ИЛИ Мероприятие.Объект.Владелец = &ДО)
			               |	И Мероприятие.ДатаВыполнения < &ТекДата
			               |	И (НЕ Мероприятие.ПометкаУдаления)
			               |	И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
			               |			ИЛИ (НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления))
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Мероприятие.ФактическаяДата";
			Результат3 = Запрос.Выполнить().Выбрать();
			ТекМС = Ложь;
			Пока Результат3.Следующий() Цикл
				Если Результат3.Код = "     0220" ИЛИ Результат3.Код = "     0315" Тогда
					ТекМС = Истина;
					СтрокаДействий = СтрокаДействий + "УТВЕРЖДЕНО МИРОВОЕ СОГЛАШЕНИЕ" + Символы.ПС;
				ИначеЕсли (Результат3.Код = "     0221" ИЛИ Результат3.Код = "     0183") И ТекМС Тогда
					ТекМС = Ложь;
					СтрокаДействий = СокрЛП(СтрокаДействий) + ", ИСПОЛНЕНО" + Символы.ПС;
				ИначеЕсли (Результат3.Код = "     0222" ИЛИ Результат3.Код = "     0184") И ТекМС Тогда
					ТекМС = Ложь;
					СтрокаДействий = СокрЛП(СтрокаДействий) + ", НЕ ИСПОЛНЕНО" + Символы.ПС;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Сред(Выборка.СтадияФлаг, 2, 1) = "1" Тогда
			СтрокаДействий = СтрокаДействий + "ОТКАЗ ОТ ИСКА" + Символы.ПС;
		КонецЕсли;
		Если Сред(Выборка.СтадияФлаг, 3, 1) = "1" Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	МероприятиеДополнительныеРеквизиты.Ссылка,
			               |	МероприятиеДополнительныеРеквизиты.Значение
			               |ИЗ
			               |	Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
			               |ГДЕ
			               |	(МероприятиеДополнительныеРеквизиты.Ссылка.Объект = &ДО
			               |			ИЛИ МероприятиеДополнительныеРеквизиты.Ссылка.Объект.Владелец = &ДО)
			               |	И МероприятиеДополнительныеРеквизиты.Ссылка.Выполнена
			               |	И МероприятиеДополнительныеРеквизиты.Свойство = &Свойство
			               |	И МероприятиеДополнительныеРеквизиты.Значение >= &ТекДата
			               |	И МероприятиеДополнительныеРеквизиты.Ссылка.ДатаВыполнения < &ТекДата
			               |	И НЕ МероприятиеДополнительныеРеквизиты.Ссылка.ПометкаУдаления
			               |	И (МероприятиеДополнительныеРеквизиты.Ссылка.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
			               |			ИЛИ НЕ МероприятиеДополнительныеРеквизиты.Ссылка.БизнесПроцесс.ПометкаУдаления)
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	МероприятиеДополнительныеРеквизиты.Значение";
			Запрос.УстановитьПараметр("Свойство", 
					ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду("     2051")); //ДопРеквизитыМероприятий
			Результат3 = Запрос.Выполнить().Выбрать();
			Пока Результат3.Следующий() Цикл
				СтрокаДействий = СтрокаДействий + "ПРЕДОСТАВЛЕНА ОТСРОЧКА ДО " + Формат(Результат3.Значение, "ДЛФ=D") + Символы.ПС;
			КонецЦикла;	
		КонецЕсли;
		Если Сред(Выборка.СтадияФлаг, 4, 1) = "1" Тогда
			СтрокаДействий = СтрокаДействий + "ПОЛУЧЕНО СВИДЕТЕЛЬСТВО О РЕГИСТРАЦИИ ПРАВА СОБСТВЕННОСТИ" + Символы.ПС;
		КонецЕсли;
		Если Сред(Выборка.СтадияФлаг, 5, 1) = "1" Тогда
			СтрокаДействий = СтрокаДействий + "ПЕРЕЧИСЛЕНЫ ДЕНЕЖНЫЕ СРЕДСТВА" + Символы.ПС;
		КонецЕсли;
		
		
		//СтрСокр_0 - текущий комментарий
		//СтрСокр_1 - результат функции комментария
		//Стр_0 - предыдущий комментарий
		//Стр_1 - предыдущий результат функции комментария
		Номер = 1;
		Стр_0 = "";	
		Стр_1 = "";
		Стр_ = "";
		Пока Выборка2.Следующий() Цикл
			СтрСокр_0 = СокрЛП(Выборка2.Комментарий);
			СтрСокр_1 = ?(Выборка2.Ссылка.Результат.ШаблонКомментария.Пустая(), "", 
					Справочники.ФункцииКомментариев.ВычислитьФункцию(
						Выборка2.Ссылка.Результат.ШаблонКомментария.Функция, Выборка2.Ссылка, ""));
			
			Если СтрСокр_0 <> "" И Стр_0 <> СтрСокр_0 И (Стр_1 <> СтрСокр_1 ИЛИ СтрСокр_1 = "") И Стр_ <> СтрСокр_0 Тогда
				Стр = Формат(Номер, "ЧГ=") + ") " + СтрСокр_0;
				СтрокаДействий = СтрокаДействий + Стр + Символы.ПС;
				Номер = Номер + 1;
				Стр_0 = СтрСокр_0;
				Стр_1 = СтрСокр_1;
				Стр_ = СтрСокр_0;
				
			ИначеЕсли СтрСокр_0 = "" И СтрСокр_1 <> "" И Стр_1 <> СтрСокр_1 И Стр_ <> СтрСокр_1 Тогда
				Стр = Формат(Номер, "ЧГ=") + ") " + СтрСокр_1;
				СтрокаДействий = СтрокаДействий + Стр + Символы.ПС;
				Номер = Номер + 1;
				Стр_0 = СтрСокр_1;
				Стр_1 = СтрСокр_1;
				Стр_ = СтрСокр_1;
				
			Иначе
				Стр_1 = СтрСокр_1;			
			КонецЕсли;		
		КонецЦикла;
		
		////////////////////////////////////
		// Выбор суммы исковых требований //
		////////////////////////////////////
		ЗапросСуммаИска = Новый Запрос("ВЫБРАТЬ
		                               |	ЕСТЬNULL(ЕСТЬNULL(ДополнительныеСведения.Значение, ДолговыеОбязательстваДополнительныеРеквизиты.Значение), """") КАК СуммаИска
		                               |ИЗ
		                               |	РегистрНакопления.ОбъектыВРаботе.Остатки(&ДатаОтчета, Объект = &ДО) КАК ОбъектыВРаботеОстатки
		                               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		                               |		ПО ОбъектыВРаботеОстатки.Объект = ДополнительныеСведения.Объект
		                               |			И (ДополнительныеСведения.Свойство.Код = ""     0079"")
		                               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДолговыеОбязательстваДополнительныеРеквизиты
		                               |		ПО ОбъектыВРаботеОстатки.Объект = ДолговыеОбязательстваДополнительныеРеквизиты.Ссылка
		                               |			И (ДолговыеОбязательстваДополнительныеРеквизиты.Свойство.Код = ""     0079"")");
		ЗапросСуммаИска.УстановитьПараметр("ДатаОтчета", КонецДня(ДатаОтчета));
		ЗапросСуммаИска.УстановитьПараметр("ДО", Выборка.ДолговоеОбязательство);
		ВыборкаСуммаИска = ЗапросСуммаИска.Выполнить().Выбрать();
		ВыборкаСуммаИска.Следующий();
		
		ОбластьДанных.Параметры.Номер = НомерЗаписи; 
		ОбластьДанных.Параметры.Должник = Выборка.Должник;
		ОбластьДанных.Параметры.ДолжникРас = Выборка.ДолжникНаименование;
		Если Отчет.КолонкаКредитор Тогда
			ОбластьДанных.Параметры.Кредитор = Выборка.Кредитор;		
			ОбластьДанных.Параметры.КредиторРас = Выборка.КредиторНаименование;
		КонецЕсли;
		ОбластьДанных.Параметры.НомерЗакладной = Выборка.НомерПоБазе;
		ОбластьДанных.Параметры.ДолговоеОбязательство = Выборка.ДолговоеОбязательство;
		ОбластьДанных.Параметры.Действия = СокрЛП(СтрокаДействий);
		
		СтрЧ = СтрЗаменить(ВыборкаСуммаИска.СуммаИска, ",", ".");
		СтрЧ = СтрЗаменить(СтрЧ, " ", "");
		Попытка
			ЗначЧ = Число(СтрЧ);
			ОбластьДанных.Параметры.СуммаИска = Формат(ЗначЧ, "ЧДЦ=2; ЧРД=,; ЧН=");
		Исключение
			ОбластьДанных.Параметры.СуммаИска = ВыборкаСуммаИска.СуммаИска;
		КонецПопытки;	
		
		ЗапросМ = Новый Запрос("ВЫБРАТЬ
		                       |	ТабКод.КодТипаМероприятия,
		                       |	ТабКод.КодДопРеквизитаМероприятия,
		                       |	ТабКод.НомерКолонки,
		                       |	ТабКод.КодРезультата
		                       |ПОМЕСТИТЬ ТабКод
		                       |ИЗ
		                       |	&ТабКод КАК ТабКод
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ
		                       |	Мероприятие.БизнесПроцесс КАК БизнесПроцесс,
		                       |	Мероприятие.Схема КАК Схема,
		                       |	Мероприятие.ОбъектРодитель КАК ОбъектРодитель,
		                       |	Мероприятие.ФактическаяДата,
		                       |	Мероприятие.ТипМероприятия.Код КАК ТипМероприятияКод,
		                       |	Мероприятие.Результат.Код КАК РезультатКод,
		                       |	МероприятиеДополнительныеРеквизиты.Свойство.Код КАК СвойствоКод,
		                       |	МероприятиеДополнительныеРеквизиты.Значение КАК Значение,
							   |	Мероприятие.Объект
		                       |ПОМЕСТИТЬ ТаблицаМ
		                       |ИЗ
		                       |	Задача.Мероприятие КАК Мероприятие
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
		                       |		ПО (МероприятиеДополнительныеРеквизиты.Ссылка = Мероприятие.Ссылка)
		                       |ГДЕ
		                       |	(Мероприятие.Объект = &ДО
		                       |			ИЛИ Мероприятие.Объект.Владелец = &ДО)
		                       |	И Мероприятие.ФактическаяДата <= &ДатаОтчета
		                       |	И (НЕ Мероприятие.ПометкаУдаления)
		                       |	И Мероприятие.Выполнена
		                       |	И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
		                       |			ИЛИ (НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления))
		                       |	И (НЕ Мероприятие.ВыполненоКакНеАктуальное)");				
		ЗапросМ.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	    ЗапросМ.УстановитьПараметр("ТабКод", ТабКод.Выгрузить());
		ЗапросМ.УстановитьПараметр("ДО", Выборка.ДолговоеОбязательство);
		ЗапросМ.УстановитьПараметр("ДатаОтчета", КонецДня(ДатаОтчета));
	    ЗапросМ.ВыполнитьПакет();
		
		ОбластьДанных.Параметры.ДатаПодачиИскЗаявления  = ЗаписатьКолонку(ЗапросМ, 0, Выборка.ДолговоеОбязательство, Истина);
		ОбластьДанных.Параметры.ДатаСудебногоЗаседания  = ЗаписатьКолонку(ЗапросМ, 1, Выборка.ДолговоеОбязательство,, Истина);
		ОбластьДанных.Параметры.ДатаРешенияСуда         = ЗаписатьКолонку(ЗапросМ, 2, Выборка.ДолговоеОбязательство);
		ОбластьДанных.Параметры.ДатаНаправленияИспЛиста = ЗаписатьКолонку(ЗапросМ, 3, Выборка.ДолговоеОбязательство);
		ОбластьДанных.Параметры.ДатаВозбужденияИспПрава = ЗаписатьКолонку(ЗапросМ, 4, Выборка.ДолговоеОбязательство);
		ОбластьДанных.Параметры.ДатаТоргов 				= ЗаписатьКолонку(ЗапросМ, 5, Выборка.ДолговоеОбязательство);
		ОбластьДанных.Параметры.ДатаПеречисления 		= ЗаписатьКолонкуПоследнююДатуПоКаждомуИД(ЗапросМ, 6, Выборка.ДолговоеОбязательство);
		
		ТабДок.Вывести(ОбластьДанных);		
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаОтчета = ТекущаяДата();
	НачалоПериода = НачалоМесяца(ТекущаяДата());
	КонецПериода = ТекущаяДата();
	
	ЗаполнитьТаблицуКодов();
	
	ЗаполнитьСписокСтадий();
КонецПроцедуры

&НаСервере
Функция ЗаписатьКолонку(Запрос, НомерКолонки, ДО, ТолькоПервуюДату = Ложь, БезПовторовВПределахОбъектаРодителя = Ложь)
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ТабКод.КодДопРеквизитаМероприятия = """"
	               |			ТОГДА Мероприятие.ФактическаяДата
	               |		ИНАЧЕ Мероприятие.Значение
	               |	КОНЕЦ КАК ДатаМероприятия,
	               |	Мероприятие.БизнесПроцесс КАК БизнесПроцесс,
	               |	Мероприятие.Схема КАК Схема,
	               |	Мероприятие.ОбъектРодитель КАК ОбъектРодитель
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабКод КАК ТабКод
	               |		ПО Мероприятие.ТипМероприятияКод = ТабКод.КодТипаМероприятия
	               |			И (ТабКод.КодДопРеквизитаМероприятия = """"
	               |				ИЛИ Мероприятие.СвойствоКод = ТабКод.КодДопРеквизитаМероприятия)
	               |			И (ТабКод.НомерКолонки = &НомерКолонки)
	               |			И (Мероприятие.РезультатКод = ТабКод.КодРезультата
	               |				ИЛИ ТабКод.КодРезультата = """")
	               |ГДЕ
	               |	(Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	               |			ИЛИ НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаМероприятия,
	               |	БизнесПроцесс,
	               |	Схема,
	               |	ОбъектРодитель";	
	Запрос.УстановитьПараметр("НомерКолонки", НомерКолонки);	
	Результат = Запрос.Выполнить().Выбрать();
	СтрокаТМП = "";
	
	ТекОбъектРодитель = Неопределено;
	ТекДатаМероприятия = Неопределено;
	ТекСхема = Неопределено;
	ТекБП = Неопределено;
	Пока Результат.Следующий() Цикл
		Если БезПовторовВПределахОбъектаРодителя И ТекОбъектРодитель = Результат.ОбъектРодитель И 
				ТекДатаМероприятия = НачалоДня(Результат.ДатаМероприятия) И ТекСхема = Результат.Схема И 
				ТекБП = Результат.БизнесПроцесс И Не Результат.БизнесПроцесс.Пустая() Тогда
			Продолжить;
		КонецЕсли;
				
		СтрДата = Формат(Результат.ДатаМероприятия, "ДЛФ=Д");
		СтрокаТМП = СтрокаТМП + СтрДата + Символы.ПС;
		Если ТолькоПервуюДату Тогда
			Прервать;
		КонецЕсли;
		
		ТекОбъектРодитель = Результат.ОбъектРодитель;
		ТекДатаМероприятия = НачалоДня(Результат.ДатаМероприятия);
		ТекСхема = Результат.Схема;
		ТекБП = Результат.БизнесПроцесс;
	КонецЦикла;
    Возврат СокрЛП(СтрокаТМП);	
КонецФункции

&НаСервере
Функция ЗаписатьКолонкуПоследнююДатуПоКаждомуИД(Запрос, НомерКолонки, ДО)
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ТабКод.КодДопРеквизитаМероприятия = """"
	               |				ТОГДА Мероприятие.ФактическаяДата
	               |			ИНАЧЕ Мероприятие.Значение
	               |		КОНЕЦ) КАК ДатаМероприятия,
	               |	Мероприятие.Объект
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабКод КАК ТабКод
	               |		ПО Мероприятие.ТипМероприятияКод = ТабКод.КодТипаМероприятия
	               |			И (ТабКод.КодДопРеквизитаМероприятия = """"
	               |				ИЛИ Мероприятие.СвойствоКод = ТабКод.КодДопРеквизитаМероприятия)
	               |			И (ТабКод.НомерКолонки = &НомерКолонки)
	               |			И (Мероприятие.РезультатКод = ТабКод.КодРезультата
	               |				ИЛИ ТабКод.КодРезультата = """")
	               |ГДЕ
	               |	(Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	               |			ИЛИ НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаМероприятия";	
	Запрос.УстановитьПараметр("НомерКолонки", НомерКолонки);	
	Результат = Запрос.Выполнить().Выбрать();
	СтрокаТМП = "";
	
	Пока Результат.Следующий() Цикл			
		СтрДата = Формат(Результат.ДатаМероприятия, "ДЛФ=Д");
		СтрокаТМП = СтрокаТМП + СтрДата + Символы.ПС;
	КонецЦикла;
    Возврат СокрЛП(СтрокаТМП);	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуКодов()
	ТабКод.Очистить();
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0018";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2033"; //"";
	НоваяСтрока.НомерКолонки = 0;
	НоваяСтрока.КодРезультата = "";
	
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0019";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";	
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0023";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "     0055";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0034";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "     0126";
		
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0048";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "     0072";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0020";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "     0048";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0095";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0096";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "     0148";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0100";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0120";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0127";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0086";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "     0179";
	
		
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0034";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "     0088";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "     0050";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "     0141";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "     0142";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "     0143";	
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0034";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2037"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "     0182";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2037"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "     0180";
	
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0069";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2031"; //"";
	НоваяСтрока.НомерКолонки = 3;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0070";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2017";
	НоваяСтрока.НомерКолонки = 4;
	НоваяСтрока.КодРезультата = "     0100";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0083";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2018";
	НоваяСтрока.НомерКолонки = 6;
	НоваяСтрока.КодРезультата = ""; //"     0114";
		
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0074";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2007";
	НоваяСтрока.НомерКолонки = 5;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0073";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2007";
	НоваяСтрока.НомерКолонки = 5;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0078";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2009";
	НоваяСтрока.НомерКолонки = 5;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0079";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2009";
	НоваяСтрока.НомерКолонки = 5;
	НоваяСтрока.КодРезультата = "";
КонецПроцедуры

&НаКлиенте
Процедура РегионНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	 Параметр  = Новый ПараметрВыбора("Отбор.Владелец", НайтиПВХПоКоду("     0125")) ;
	 НовыйМассив = Новый Массив();
	 НовыйМассив.Добавить(Параметр);
	 НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	 Элементы.Регион.ПараметрыВыбора = НовыеПараметры;
КонецПроцедуры

&НаСервере
Функция НайтиПВХПоКоду(Код)
 	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду(Код); 
КонецФункции // НайтиПВХПоКоду()

&НаКлиенте
Процедура СтадияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Форма = ПолучитьФорму("Отчет.ОтчетПоВзысканию.Форма.ФормаПеречисления");
	Форма.Список = Стадия;
	Форма.ОткрытьМодально();
	СтадияТекст = Форма.Результат;    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСтадий()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КартыМаршрутов.Ссылка,
	                      |	КартыМаршрутов.Наименование КАК Наименование
	                      |ИЗ
	                      |	Справочник.КартыМаршрутов КАК КартыМаршрутов
	                      |ГДЕ
	                      |	(НЕ КартыМаршрутов.ПометкаУдаления)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Наименование");
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл 
		Стадия.Добавить(Результат.Ссылка, Результат.Наименование);	
	КонецЦикла;
	Стадия.Добавить(Перечисления.СостоянияДел.МировоеСоглашение, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.МировоеСоглашение.Синоним);
	Стадия.Добавить(Перечисления.СостоянияДел.ОтказОтИска, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.ОтказОтИска.Синоним);
	Стадия.Добавить(Перечисления.СостоянияДел.ПолученоСвидетельство, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.ПолученоСвидетельство.Синоним);
	Стадия.Добавить(Перечисления.СостоянияДел.ПредоставленаОтсрочка, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.ПредоставленаОтсрочка.Синоним);
	Стадия.Добавить(Перечисления.СостоянияДел.ПеречисленыДенежныеСредства, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.ПеречисленыДенежныеСредства.Синоним);
КонецПроцедуры	

&НаСервере
Процедура ОтобратьПоСтадии(Таблица)
	МассивСтадий = Новый Массив();	
	ФлагПоискаМС = Ложь;
	ФлагПоискаОИ = Ложь;
	ФлагПоискаПО = Ложь;
	ФлагПоискаПС = Ложь;
	ФлагПоискаПД = Ложь;
	Для Каждого Элемент Из Стадия Цикл
		Если Элемент.Пометка Тогда
			Если ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.КартыМаршрутов") Тогда
				МассивСтадий.Добавить(Элемент.Значение);			
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.МировоеСоглашение Тогда
				ФлагПоискаМС = Истина;
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.ОтказОтИска Тогда
				ФлагПоискаОИ = Истина;
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.ПредоставленаОтсрочка Тогда
				ФлагПоискаПО = Истина;
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.ПолученоСвидетельство Тогда
				ФлагПоискаПС = Истина;
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.ПеречисленыДенежныеСредства Тогда
				ФлагПоискаПД = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
							  
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Таблица.ДолговоеОбязательство
	                      |ПОМЕСТИТЬ Таблица
	                      |ИЗ
	                      |	&Таблица КАК Таблица
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Мероприятие.Ссылка,
	                      |	ЕСТЬNULL(Мероприятие.Объект.Владелец, Мероприятие.Объект) КАК Объект,
	                      |	Мероприятие.Схема,
	                      |	Мероприятие.БизнесПроцесс,
	                      |	Мероприятие.Результат,
	                      |	Мероприятие.Дата,
	                      |	Мероприятие.ДатаВыполнения,
	                      |	Мероприятие.Выполнена,
	                      |	Мероприятие.ТипМероприятия
	                      |ПОМЕСТИТЬ ТаблицаМ
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |ГДЕ
	                      |	НЕ Мероприятие.ПометкаУдаления
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Таблица.ДолговоеОбязательство,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеМС.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) + МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеОИ.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) + МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеПО.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) + МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеПС.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) + МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеПД.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) КАК СтадияФлаг
	                      |ИЗ
	                      |	Таблица КАК Таблица
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеСтадии
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеСтадии.Объект
	                      |			И (МероприятиеСтадии.Схема В (&МассивСтадий))
	                      |			И (МероприятиеСтадии.ДатаВыполнения > &ТекДата
	                      |				ИЛИ НЕ МероприятиеСтадии.Выполнена)
	                      |			И (МероприятиеСтадии.Дата < &ТекДата)
	                      |			И (НЕ МероприятиеСтадии.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеМС
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеМС.Объект
	                      |			И (МероприятиеМС.Выполнена)
	                      |			И (МероприятиеМС.Результат В (&МассивРезультатовМС))
	                      |			И (МероприятиеМС.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеМС.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеМС.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеОИ
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеОИ.Объект
	                      |			И (МероприятиеОИ.Выполнена)
	                      |			И (МероприятиеОИ.Результат В (&МассивРезультатовОИ))
	                      |			И (МероприятиеОИ.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеОИ.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеОИ.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеПО
	                      |		ПО (Таблица.ДолговоеОбязательство = ЕСТЬNULL(МероприятиеПО.Ссылка.Объект.Владелец, МероприятиеПО.Ссылка.Объект))
	                      |			И (МероприятиеПО.Ссылка.Выполнена)
	                      |			И (МероприятиеПО.Свойство В (&МассивРезультатовПО))
	                      |			И (МероприятиеПО.Значение >= &ТекДата)
	                      |			И (МероприятиеПО.Ссылка.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеПО.Ссылка.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеПО.Ссылка.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеПС
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеПС.Объект
	                      |			И (МероприятиеПС.Выполнена)
	                      |			И (МероприятиеПС.Результат В (&МассивРезультатовПС))
	                      |			И (МероприятиеПС.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеПС.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеПС.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеПД
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеПД.Объект
	                      |			И (МероприятиеПД.Выполнена)
	                      |			И (МероприятиеПД.ТипМероприятия В (&МассивТиповМероприятийПД))
	                      |			И (МероприятиеПД.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеПД.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеПД.БизнесПроцесс.ПометкаУдаления)
	                      |ГДЕ
	                      |	(&ФлагБезУсловий
	                      |			ИЛИ НЕ МероприятиеСтадии.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеМС.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеОИ.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеПО.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеПС.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеПД.Ссылка ЕСТЬ NULL )
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Таблица.ДолговоеОбязательство
	                      |
	                      |ИМЕЮЩИЕ
	                      |	(&ФлагБезУсловий
	                      |		ИЛИ &ФлагПоискаСтадии
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеСтадии.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаМС
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеМС.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаОИ
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеОИ.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаПО
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеПО.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаПС
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеПС.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаПД
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеПД.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1)");					  						  
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("МассивСтадий", МассивСтадий);
	Запрос.УстановитьПараметр("ФлагБезУсловий", МассивСтадий.Количество() = 0 И Не ФлагПоискаМС И Не ФлагПоискаОИ И 
			Не ФлагПоискаПО И Не ФлагПоискаПС И Не ФлагПоискаПД);
	Запрос.УстановитьПараметр("ТекДата", КонецДня(ДатаОтчета));	
	
	Запрос.УстановитьПараметр("ФлагПоискаСтадии", МассивСтадий.Количество() > 0);
	Запрос.УстановитьПараметр("ФлагПоискаМС", ФлагПоискаМС);
	Запрос.УстановитьПараметр("ФлагПоискаОИ", ФлагПоискаОИ);
	Запрос.УстановитьПараметр("ФлагПоискаПО", ФлагПоискаПО);
	Запрос.УстановитьПараметр("ФлагПоискаПС", ФлагПоискаПС);
	Запрос.УстановитьПараметр("ФлагПоискаПД", ФлагПоискаПД);
			
	МассивРезультатовМС = Новый Массив();	
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0220"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0315"));
	
	МассивРезультатовОИ = Новый Массив();
	МассивРезультатовОИ.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0321"));
	МассивРезультатовОИ.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0322"));
	
	Запрос.УстановитьПараметр("МассивРезультатовМС", МассивРезультатовМС);
	Запрос.УстановитьПараметр("МассивРезультатовОИ", МассивРезультатовОИ);
	Запрос.УстановитьПараметр("МассивРезультатовПО", 
			ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду("     2051")); //ДопРеквизитыМероприятий
			//Справочники.РезультатыМероприятий.НайтиПоКоду("     0320"));
	Запрос.УстановитьПараметр("МассивРезультатовПС", Справочники.РезультатыМероприятий.НайтиПоКоду("     0216"));
	Запрос.УстановитьПараметр("МассивТиповМероприятийПД", Справочники.ТипыМероприятий.НайтиПоКоду("     0083"));
	
	Таблица = Запрос.Выполнить().Выгрузить();
КонецПроцедуры
