
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Макет = Отчеты.ОтчетПоВзысканию.ПолучитьМакет("Макет");
	ТабДок.Очистить();
	
    ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(ОбластьЗаголовок);		
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ПериодОтчетаС = Строка(Формат(НачалоПериода, "ДЛФ=Д"));
	//ОбластьШапка.Параметры.ПериодОтчетаПо = Строка(Формат(КонецПериода, "ДЛФ=Д"));
	ТабДок.Вывести(ОбластьШапка);
	
	ТабДок.ФиксацияСверху = 5;
	
	
	//Подготовка таблицы с ДО подходящими по стадии
	Запрос = Новый Запрос();
	
	ТекстЗапроса =  "ВЫБРАТЬ
	                |	МАКСИМУМ(ПоступлениеПлатежа.ДатаПлатежа) КАК ДатаПлатежа,
	                |	ПоступлениеПлатежа.Займ КАК Займ
	                |ПОМЕСТИТЬ ПоследнееДСОтПристава
	                |ИЗ
	                |	Документ.ПоступлениеПлатежа КАК ПоступлениеПлатежа
	                |ГДЕ
	                |	НЕ ПоступлениеПлатежа.ПометкаУдаления
	                |	И ПоступлениеПлатежа.Проведен
	                |	И ПоступлениеПлатежа.ВидПлательщика = ЗНАЧЕНИЕ(Перечисление.ВидыПлательщика.СудебныйПристав)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПоступлениеПлатежа.Займ
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	Займ
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	СудебноеДело.Займ.Должник КАК Должник,
	                |	СудебноеДело.Займ.Кредитор КАК Кредитор,
	                |	СудебноеДело.Займ КАК НомерДО,
	                |	СудебноеДело.ДатаИска КАК ДатаИска,
	                |	СудебноеДело.ЦенаИска КАК СуммаИска,
	                |	СудебноеДело.ДатаРешения КАК ДатаРешения,
	                |	СудебноеДелоИД.ИсполнительныйДокумент КАК НомерИД,
	                |	ПоследнееДСОтПристава.ДатаПлатежа КАК ДатаПлатежаССП,
	                |	ВЫБОР
	                |		КОГДА СудебноеДело.Отменено
	                |			ТОГДА ""Отменено: "" + СТРОКА(НАЧАЛОПЕРИОДА(СудебноеДело.ДатаОтмены, ДЕНЬ))
	                |		ИНАЧЕ ""Поворот: "" + СТРОКА(СудебноеДело.ПоворотИсполненияРешенияСуда)
	                |	КОНЕЦ КАК Действия,
	                |	СудебноеДело.ВидТребований КАК ВидТребований,
	                |	СудебноеДело.НомерДела КАК НомерДела
	                |ПОМЕСТИТЬ ДелаИД
	                |ИЗ
	                |	Документ.СудебноеДело КАК СудебноеДело
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СудебноеДело.ИД КАК СудебноеДелоИД
	                |		ПО СудебноеДело.Ссылка = СудебноеДелоИД.Ссылка
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ПоследнееДСОтПристава КАК ПоследнееДСОтПристава
	                |		ПО СудебноеДело.Займ = ПоследнееДСОтПристава.Займ
	                |			И (НЕ СудебноеДелоИД.ИсполнительныйДокумент.ПометкаУдаления)
	                |			И (НЕ СудебноеДело.ПометкаУдаления)
	                |			И (СудебноеДело.Проведен)
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	НомерИД
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ДелаИД.Должник КАК Должник,
	                |	ДелаИД.Кредитор КАК Кредитор,
	                |	ДелаИД.НомерДО КАК НомерДО,
	                |	ДелаИД.ДатаИска КАК ДатаИска,
	                |	ДелаИД.СуммаИска КАК СуммаИска,
	                |	ДелаИД.ВидТребований КАК ВидИска,
	                |	ДелаИД.ДатаРешения КАК ДатаРешения,
	                |	ДелаИД.НомерИД КАК НомерИД,
	                |	ДелаИД.ДатаПлатежаССП КАК ДатаПлатежаССП,
	                |	ДелаИД.Действия КАК Действия,
	                |	ФССП_ИсполнительноеПроизводство.Ссылка КАК НомерИП,
	                |	ФССП_ИсполнительноеПроизводство.ДатаВозбуждения КАК ДатаИП,
	                |	ДелаИД.НомерДела КАК Номер
	                |ИЗ
	                |	ДелаИД КАК ДелаИД
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФССП_ИсполнительноеПроизводство КАК ФССП_ИсполнительноеПроизводство
	                |		ПО ДелаИД.НомерИД = ФССП_ИсполнительноеПроизводство.НомерИД
	                |			И (НЕ ФССП_ИсполнительноеПроизводство.ПометкаУдаления)
	                |ГДЕ
	                |	ДелаИД.ДатаРешения <= &ДатаРешения"; 
	
	УстановитьПараметрыЗапроса(Запрос, ТекстЗапроса);
	
	Запрос.Текст = ТекстЗапроса;
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ОбластьДанных = Макет.ПолучитьОбласть("ДанныеОтчета");
		ЗаполнитьЗначенияСвойств(ОбластьДанных.Параметры, Выборка);
		ТабДок.Вывести(ОбластьДанных);
	КонецЦикла;	
	
			
			
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 НачалоПериода = ТекущаяДатаСеанса();
	
КонецПроцедуры


&НаКлиенте
Процедура РегионНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)   
	
КонецПроцедуры


&НаСервере
Процедура УстановитьПараметрыЗапроса(Запрос, ТекстЗапроса) 
	Запрос.УстановитьПараметр("ДатаРешения", ?(ЗначениеЗаполнено(НачалоПериода),НачалоПериода, Дата(1,1,1))); 
	//Если ЗначениеЗаполнено(Должник) Тогда
	//	ТекстЗапроса
	//	Запрос.УстановитьПараметр("Должник", Должник);
	//Запрос.УстановитьПараметр("ДолговоеОбязательство", ДолговоеОбязательство);
	//Запрос.УстановитьПараметр("ПустоеДО", ДолговоеОбязательство.Пустая());
	//Запрос.УстановитьПараметр("Регион", Регион);
	//Запрос.УстановитьПараметр("НеЗаполненРегион", Регион.Пустая()); 		
КонецПроцедуры


