
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтборыПользователя = ЭтотОбъект.ВладелецФормы.ПолучитьОтборы();
	
	Индекс = 0;
	
	Пока Индекс < ОтборыПользователя.Количество() Цикл
	
		Элемент = ОтборыПользователя[Индекс];
		
		Запись = Отборы.Добавить();
		Запись.КодКатегории = Элемент.Значение;
		Запись.Отбор = Элемент.Отбор;
		Запись.Индекс = Индекс;
		
		Индекс = Индекс + 1;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Данные = Новый Массив;
	Для каждого Отбор Из Отборы Цикл
	
		Если Не Отбор.Оставить Тогда
		
			Данные.Добавить(Отбор.Индекс);
		
		КонецЕсли;
	
	КонецЦикла;
	
	Закрыть(Данные);
	
КонецПроцедуры




