Процедура ОтправитьУведомление(Уведомление) Экспорт
	Выборка = ПланыОбмена.Мобильные.Выбрать();	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИдентификаторПодписчикаДоставляемыхУведомлений <> Неопределено Тогда	
			//Если Пользователь = Неопределено ИЛИ Пользователь = Выборка.Курьер Тогда	
			Идентификатор = Выборка.ИдентификаторПодписчикаДоставляемыхУведомлений.Получить();
			Если Идентификатор <> Неопределено Тогда
				Уведомление.Получатели.Добавить(Идентификатор);
			КонецЕсли;
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	
	Если Уведомление.Получатели.Количество() > 0 Тогда
		ДанныеАутентификации = "";
		//ДанныеАутентификации = Новый Соответствие;
		Сертификат = Неопределено;
		КлючДоступаОтправителя = СокрЛП(Константы.КлючДоступаОтправителя.Получить());
		УдаленныеТокены = Новый Массив;
		//ДанныеАутентификации.Вставить(ТипПодписчикаДоставляемыхУведомлений.FCM,КлючДоступаОтправителя);
		ДанныеАутентификации = КлючДоступаОтправителя;
		ИнфоОбОшибках = Новый массив;
		ОтправкаДоставляемыхУведомлений.Отправить(Уведомление, ДанныеАутентификации, УдаленныеТокены, Истина,ИнфоОбОшибках);
		НеИспользоватьИдентификаторы(УдаленныеТокены);
	КонецЕсли;
	
	
		
КонецПроцедуры

Процедура НеИспользоватьИдентификаторы(Токены)
	Если Токены.Количество() > 0 Тогда	
		Выборка = ПланыОбмена.Мобильные.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИдентификаторПодписчикаДоставляемыхУведомлений <> Неопределено Тогда
				Идентификатор = Выборка.ИдентификаторПодписчикаДоставляемыхУведомлений.Получить();
				Если Идентификатор <> Неопределено И Токены.Найти(Идентификатор.ИдентификаторУстройства) Тогда
					Узел = Выборка.ПолучитьОбъект();
					Узел.ИдентификаторПодписчикаДоставляемыхУведомлений = Неопределено;
					Узел.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры