
&НаСервере
Процедура ПриОткрытииНаСервере()
	// Получим непредопределенное значение с сервера
	ЭтаФорма.Авторизованный = ПользователиКлиентСервер.АвторизованныйПользователь();
	ЭтаФорма.РКЦ = Справочники.Пользователи.НайтиПоНаименованию("Дорохина Алена Юрьевна");
	ЭтаФорма.ЗРКЦ = Справочники.Пользователи.НайтиПоНаименованию("Арабова Римма Эйнуллавна");
	ЭтаФорма.АБД = Справочники.Пользователи.НайтиПоНаименованию("Попов Николай Алексеевич");
	ЭтаФорма.ГарантийноеПисьмо = Перечисления.ТипыДокументовПоДоговору.ГарантийноеПисьмо;
	ЭтаФорма.СправкаОбОтсутствииЗадолженности = Перечисления.ТипыДокументовПоДоговору.СправкаОбОтсутствииЗадолженности;
	// Получим остатки из регистра сведений
	НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ЭтаФорма.Объект.Договор);
	НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Основной долг"));
	НаборЗаписей.Прочитать(); 
	Для каждого ЗаписьНабора из НаборЗаписей Цикл
		ЭтаФорма.ДолгПоТелу = ЗаписьНабора.СуммаДО;
	КонецЦикла;
	НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ЭтаФорма.Объект.Договор);
	НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Проценты"));
	НаборЗаписей.Прочитать(); 
	Для каждого ЗаписьНабора из НаборЗаписей Цикл
		ЭтаФорма.ДолгПоПроцентам = ЗаписьНабора.СуммаДО;
	КонецЦикла;
	НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ЭтаФорма.Объект.Договор);
	НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Пени"));
	НаборЗаписей.Прочитать(); 
	Для каждого ЗаписьНабора из НаборЗаписей Цикл
		ЭтаФорма.ПениШтрафы = ЗаписьНабора.СуммаДО;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Получим непредопредленное значение с сервера
	ПриОткрытииНаСервере();
	Если ЭтаФорма.Авторизованный = ЭтаФорма.РКЦ
		ИЛИ ЭтаФорма.Авторизованный = ЭтаФорма.ЗРКЦ
		ИЛИ	ЭтаФорма.Авторизованный = ЭтаФорма.АБД Тогда
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьДокумент.Видимость = Истина;
	Иначе
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьДокумент.Видимость = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Автор) = Ложь Тогда
		ЭтаФорма.Объект.Автор = ЭтаФорма.Авторизованный;
	КонецЕсли;
КонецПроцедуры

// Для тонкого клиента
&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитаНаСервере(ИмяОбъекта, ИмяРеквизита)
Возврат ИмяОбъекта[ИмяРеквизита];
КонецФункции
//

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	// Заполнить документ
	Если ЭтаФорма.Объект.ТипДокумента = ЭтаФорма.ГарантийноеПисьмо Тогда
		ФормаДок = ПолучитьФорму("Документ.ГарантийноеПисьмо.Форма.ФормаДокумента");
		ФормаДок.Объект.Договор = ЭтаФорма.Объект.Договор;
		ФормаДок.Объект.Должник = ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Объект.Договор, "Должник");
		ФормаДок.Объект.Цедент = ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Объект.Договор, "Кредитор");
		ФормаДок.Объект.ДатаЦессии = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0158");
		ФормаДок.Объект.ДоговорЦессии = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0157");
		ФормаДок.Объект.ДатаВыдачи = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0161");
		ФормаДок.Объект.ДолгПоТелу = ЭтаФорма.ДолгПоТелу;
		ФормаДок.Объект.ДолгПоПроцентам = ЭтаФорма.ДолгПоПроцентам;
		ФормаДок.Объект.ПениШтрафы = ЭтаФорма.ПениШтрафы;
		ФормаДок.Объект.Сумма = ФормаДок.Объект.ДолгПоТелу + ФормаДок.Объект.ДолгПоПроцентам + ФормаДок.Объект.ПениШтрафы;
		ФормаДок.Объект.ДатаРождения = ОбъектыСервер.ПолучитьЗначениеСвойства(ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Объект.Договор, "Должник"), "0043");
		ФормаДок.Объект.ДнейПросрочки = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0139");
		ФормаДок.Объект.ДнейПросрочкиОбщее = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0141");
		ЭтаФорма.Закрыть();
		ФормаДок.Открыть();
	ИначеЕсли ЭтаФорма.Объект.ТипДокумента = ЭтаФорма.СправкаОбОтсутствииЗадолженности Тогда
		ФормаДок = ПолучитьФорму("Документ.СправкаОбОтсутствииЗадолженности.Форма.ФормаДокумента");
		ФормаДок.Объект.Договор = ЭтаФорма.Объект.Договор;
		ФормаДок.Объект.Должник = ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Объект.Договор, "Должник");
		ФормаДок.Объект.Цедент = ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Объект.Договор, "Кредитор");
		ДО = ЭтаФорма.Объект.Договор;
		ФормаДок.Объект.ДатаЦессии = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0158");
		ФормаДок.Объект.ДоговорЦессии = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0157");
		ФормаДок.Объект.ДатаВыдачи = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0161");
		ЭтаФорма.Закрыть();
		ФормаДок.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.ТипДокумента) = Ложь Тогда
		Предупреждение("Не задано состояние документа!",,"Ошибка проведения документа");
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Объект.Получатель) = Ложь Тогда
		Предупреждение("Не задан получатель!",,"Ошибка проведения документа");
		Отказ = Истина;
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Объект.Состояние) = Ложь Тогда
		Предупреждение("Не задано состояние!",,"Ошибка проведения документа");
		Отказ = Истина;
	ИначеЕсли ЭтаФорма.Объект.Проведен = Ложь Тогда
		Предупреждение("Документ не проведен!",,"Ошибка сохранения документа");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
