
Процедура _ЗаписатьХранилищеЗначений(НомерСтроки, Хранилище) Экспорт
	Записать();
	Для Каждого Стр Из ЭтотОбъект.РеквизитыИСвойства Цикл
		Если Стр.НомерСтроки = НомерСтроки Тогда
			Стр.Хранилище = Хранилище;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Записать();
КонецПроцедуры

Процедура Записать_СтрокаХранилище(НомерСтроки, МассивДанных) Экспорт
	Записать();
	Для Каждого Стр Из ЭтотОбъект.РеквизитыИСвойства Цикл
		Если Стр.НомерСтроки = НомерСтроки Тогда
			Стр.СтрокаХранилище = "";
			Для Каждого СтрМ Из МассивДанных Цикл
				Стр.СтрокаХранилище = Стр.СтрокаХранилище + "[" + СтрМ + "]";
			КонецЦикла;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Записать();
КонецПроцедуры


Процедура _ЗаписатьХранилищеЗначенийТаблицаТаблиц(ИндексСтроки, Хранилище, UID) Экспорт
	Записать();
	Структура = Новый Структура;
	Структура.Вставить("UID", UID);
	Стр = ЭтотОбъект.ТаблицаТаблиц.НайтиСтроки(Структура);
	Стр[ИндексСтроки].Хранилище = Хранилище;
	Записать();
КонецПроцедуры

Процедура _ЗаполнитьХранилищеТаблицаВыбораТаблиц(НомерСтроки, Хранилище) Экспорт
	Записать();
	Для Каждого Стр Из ЭтотОбъект.ТаблицаВыбораТаблиц Цикл
		Если Стр.НомерСтроки = НомерСтроки Тогда
			Стр.Хранилище = Хранилище;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Записать();
КонецПроцедуры


Процедура ЗагрузитьМакет(АдресВХ) Экспорт

	БинДанные = ПолучитьИзВременногоХранилища(АдресВХ);
	ЭтотОбъект.ХранилищеШаблона = Новый ХранилищеЗначения(БинДанные);
	ЭтотОбъект.Записать();

КонецПроцедуры

Функция МакетШаблона() Экспорт

	Возврат ЭтотОбъект.ХранилищеШаблона.Получить();
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
	
		ЭтотОбъект.ТипДокумента = Константы.ТипШаблонаДляПечати.Получить();
	
	КонецЕсли;
	
КонецПроцедуры
