
Функция ШаблонСоответствуетТЗ(Шаблон) Экспорт

	Если Не ЗначениеЗаполнено(Шаблон) Тогда
	
		Возврат Ложь;
	
	КонецЕсли;
	
	ТекстШаблона = Шаблон.ШаблонТекста;
	
	ПроверяемыеТеги = ПроверяемыеТеги();
	
	Для каждого Тег Из ПроверяемыеТеги Цикл
	
		Если СтрНайти(ТекстШаблона, Тег) = 0 Тогда
		
			Возврат Ложь;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

Функция ПроверяемыеТеги() Экспорт

	Теги = Новый Массив;
	Теги.Добавить("<Сумма долга>");
	Теги.Добавить("<Контактный телефон>");
	Теги.Добавить("<Кредитор>");
	
	Возврат Теги;

КонецФункции // ()
