
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка
		Объект.Ответственный = Параметры.Ответственный;	
	Исключение
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецПопытки;
	Объект.Подразделение = Объект.Ответственный.Подразделение;
	
	ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
	ЗначениеОбъект.ЗаполнитьНастройкиРаспределения();
	ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
	
	Попытка
		Объект.Объекты.Загрузить(Параметры.СписокДолжников.Выгрузить());
	Исключение
	КонецПопытки;	
		
	Если Объект.Объекты.Количество() > 0 Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Таблица.Объект КАК Объект
		                      |ПОМЕСТИТЬ Таблица
		                      |ИЗ
		                      |	&Таблица КАК Таблица
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Таблица.Объект КАК Объект,
		                      |	ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток КАК СуммаЗадолженности
		                      |ИЗ
		                      |	Таблица КАК Таблица
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(, ) КАК ЗадолженностьПоОбъектамОстатки
		                      |		ПО Таблица.Объект = ЗадолженностьПоОбъектамОстатки.Объект");
		Запрос.УстановитьПараметр("Таблица", Объект.Объекты.Выгрузить());
		Объект.Объекты.Загрузить(Запрос.Выполнить().Выгрузить());	
	Иначе
		ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
		ЗначениеОбъект.ЗаполнитьТаблицуСДолговымиОбязательствами();
		ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоСотрудникам(Команда)
	РаспределитьПоСотрудникамНаСервере();	
КонецПроцедуры

&НаСервере
Процедура РаспределитьПоСотрудникамНаСервере()
	ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
	ЗначениеОбъект.ВыполнитьРаспределение();
	ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередатьСотрудникам(Команда)
	Если Элементы.Объекты.ТекущиеДанные <> Неопределено Тогда
		ПередатьСотрудникамНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередатьСотрудникамНаСервере()
	ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
	ЗначениеОбъект.ПередатьСотрудникам();
	ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиАвтораспределения(Команда)
	Форма = ПолучитьФорму("РегистрСведений.НастройкиАвтораспределения.Форма.ФормаНастройки",, ЭтаФорма);
	Форма.ОткрытьМодально();
КонецПроцедуры
