Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не УказанОдинТип() Тогда
	
		Отказ = Истина;
		ТекстОшибки = УправленияСообщениями.ПредупреждениеОбПользовательскойОшибке(
			"Требуется указать только один тип. Текущее количество: " + ТипЗначения.Типы().Количество()
		);
		УправленияСообщениями.ТекстовоеСообщить(ТекстОшибки);
	
	КонецЕсли;
	
КонецПроцедуры

Функция УказанОдинТип()

	Возврат ТипЗначения.Типы().Количество() = 1

КонецФункции // ()

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не УказанОдинТип() Тогда
	
		Отказ = Истина;
		ВызватьИсключение УправленияСообщениями.ПредупреждениеОбПользовательскойОшибке(
			"Требуется указать только один тип. Текущее количество: " + ТипЗначения.Типы().Количество()
		);
	
	КонецЕсли;
	
КонецПроцедуры
