
&НаКлиенте
Процедура Сформировать(Команда)
	Если ЗначениеЗаполнено(Отчет.ДатаНа1) И ЗначениеЗаполнено(Отчет.ДатаНа2) Тогда
		СформироватьНовуюВерсию();
	Иначе
		Вопрос("Не заполнены обязательные реквизиты!", РежимДиалогаВопрос.ОК);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьНовуюВерсию()
	ТабДок.Очистить();
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	
	//
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Дата1 = Формат(Отчет.ДатаНа1, "ДФ=dd.MM.yyyy");
	Область.Параметры.Дата2 = Формат(Отчет.ДатаНа2, "ДФ=dd.MM.yyyy");	
	ТабДок.Вывести(Область);
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(Мероприятие.Объект) = ТИП(Справочник.ДолговыеОбязательства)
	               |			ТОГДА Мероприятие.Объект.Должник
	               |		ИНАЧЕ Мероприятие.Объект
	               |	КОНЕЦ КАК Должник,
	               |	Мероприятие.Объект КАК Объект
	               |ПОМЕСТИТЬ НевыполненныеМероприятияПоОбъектам
	               |ИЗ
	               |	Задача.Мероприятие КАК Мероприятие
	               |ГДЕ
	               |	НЕ Мероприятие.Выполнена
	               |	И НЕ Мероприятие.ТипМероприятия.ПометкаУдаления
	               |	И НЕ Мероприятие.ПометкаУдаления
	               |	И Мероприятие.ПланируемаяДата >= &ДатаНа
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НевыполненныеМероприятияПоОбъектам.ТипМероприятия КАК ТипМероприятия,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НевыполненныеМероприятияПоОбъектам.Должник) КАК КолВо,
	               |	СУММА(ЗадолженностьПоОбъектамОстатки.СуммаДО) КАК Сумма
	               |ИЗ
	               |	НевыполненныеМероприятияПоОбъектам КАК НевыполненныеМероприятияПоОбъектам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадолженностьПоОбъектамОстатки КАК ЗадолженностьПоОбъектамОстатки
	               |		ПО НевыполненныеМероприятияПоОбъектам.Объект = ЗадолженностьПоОбъектамОстатки.Объект
	               |ГДЕ
	               |	ЗадолженностьПоОбъектамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыЗадолженности.Сумма)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НевыполненныеМероприятияПоОбъектам.ТипМероприятия
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТипМероприятия УБЫВ";    
	
	Запрос.УстановитьПараметр("ДатаНа", Отчет.ДатаНа1);
	Результат1 = Запрос.Выполнить().Выбрать();
	Запрос.УстановитьПараметр("ДатаНа", Отчет.ДатаНа2);
	Результат2 = Запрос.Выполнить().Выбрать();    	
	
	
	
	Пока Результат1.Следующий() Цикл
		
		Область = Макет.ПолучитьОбласть("Строка");
		
		Область.Параметры.ТипМероприятия = Результат1.ТипМероприятия;
		Область.Параметры.КолВо1 = Результат1.КолВо;
		Область.Параметры.Сумма1 = Результат1.Сумма;  
		
		ПараметрыВывода = Новый Структура; 
		ПараметрыВывода.Вставить("ТипМероприятия", Результат1.ТипМероприятия); 
		
		Если Результат2.НайтиСледующий(ПараметрыВывода) Тогда				
			Область.Параметры.ТипМероприятия2 = Результат2.ТипМероприятия;
			Область.Параметры.КолВо2 = Результат2.КолВо;
			Область.Параметры.Сумма2 = Результат2.Сумма;
			
		КонецЕсли;   
		ТабДок.Вывести(Область);
	КонецЦикла;   
	
	Пока Результат2.Следующий() Цикл	
		Область = Макет.ПолучитьОбласть("Строка");		
		Область.Параметры.ТипМероприятия2 = Результат2.ТипМероприятия;
		Область.Параметры.КолВо2 = Результат2.КолВо;
		Область.Параметры.Сумма2 = Результат2.Сумма;
		
		ТабДок.Вывести(Область);
	КонецЦикла;
	
	
	
КонецПроцедуры 


&НаСервере
Процедура СформироватьНаСервере()
	ТабДок.Очистить();
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	
	//
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Дата1 = Формат(Отчет.ДатаНа1, "ДФ=dd.MM.yyyy");
	Область.Параметры.Дата2 = Формат(Отчет.ДатаНа2, "ДФ=dd.MM.yyyy");	
	ТабДок.Вывести(Область);
	
	//
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТипыМероприятий.Ссылка,
	                      |	ТипыМероприятий.Наименование
	                      |ПОМЕСТИТЬ ТипыМ
	                      |ИЗ
	                      |	Справочник.ТипыМероприятий КАК ТипыМероприятий
	                      |ГДЕ
	                      |	ТипыМероприятий.Родитель.Код = ""0012     ""
						  |	И НЕ ТипыМероприятий.Наименование ПОДОБНО ""6* %""
						  |	И ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	                      |	И ТипыМероприятий.ЭтоГруппа = ЛОЖЬ
	                      |	И ТипыМероприятий.ПометкаУдаления = ЛОЖЬ");
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("ДатаНа0", Отчет.ДатаНа1);
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	Если Отчет.Организация.Пустая() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Истина");
	КонецЕсли;
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбъектыУ.Должник КАК ОбъектКА,
	               |	ЕСТЬNULL(СУММА(ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток), 0) КАК Сумма
	               |ПОМЕСТИТЬ СуммаПоКА
	               |ИЗ
	               |	Справочник.ДолговыеОбязательства КАК ОбъектыУ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
	               |				&ДатаНа,
	               |				Организация = &Организация
	               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |					И ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ВРаботеУслуги
	               |		ПО ОбъектыУ.Ссылка = ВРаботеУслуги.Объект
	               |			И (ОбъектыУ.ПометкаУдаления = ЛОЖЬ)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&ДатаНа, ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ЗадолженностьПоОбъектамОстатки
	               |		ПО ОбъектыУ.Ссылка = ЗадолженностьПоОбъектамОстатки.Объект
	               |			И (ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток > 0)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОбъектыУ.Должник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбъектыКА.Объект КАК ОбъектКА,
	               |	МАКСИМУМ(Мероприятия.ТипМероприятия) КАК ТипМ
	               |ПОМЕСТИТЬ ТипыМПоКА
	               |ИЗ
	               |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	               |			&ДатаНа,
	               |			Организация = &Организация
	               |				И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |				И ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.Контрагенты)) КАК ОбъектыКА
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятия
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыМ КАК ТипыМ
	               |			ПО (ТипыМ.Ссылка = Мероприятия.ТипМероприятия)
	               |				И (Мероприятия.ДатаВыполнения = ДАТАВРЕМЯ(1, 1, 1)
	               |					ИЛИ Мероприятия.ДатаВыполнения >= &ДатаНа)
	               |				И (Мероприятия.Дата < &ДатаНа)
	               |				И (Мероприятия.ПометкаУдаления = ЛОЖЬ)
	               |				И (Мероприятия.БизнесПроцесс.ПометкаУдаления = ЛОЖЬ)
	               |		ПО ОбъектыКА.Объект = Мероприятия.Объект
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОбъектыКА.Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ТипыМПоКА.ТипМ ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КолВо,
	               |	ЕСТЬNULL(СУММА(ЕСТЬNULL(СуммаПоКА.Сумма, 0)), 0) КАК Сумма,
	               |	ТипыМ.Ссылка КАК ТипМероприятия
	               |ИЗ
	               |	ТипыМ КАК ТипыМ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТипыМПоКА КАК ТипыМПоКА
	               |			ЛЕВОЕ СОЕДИНЕНИЕ СуммаПоКА КАК СуммаПоКА
	               |			ПО ТипыМПоКА.ОбъектКА = СуммаПоКА.ОбъектКА
	               |		ПО ТипыМ.Ссылка = ТипыМПоКА.ТипМ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТипыМ.Ссылка,
	               |	ТипыМ.Наименование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТипыМ.Наименование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ СуммаПоКА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ТипыМПоКА";
	Запрос.УстановитьПараметр("ДатаНа", Отчет.ДатаНа1);
	Результат1 = Запрос.ВыполнитьПакет()[2].Выбрать();
	Запрос.УстановитьПараметр("ДатаНа", Отчет.ДатаНа2);
	Результат2 = Запрос.ВыполнитьПакет()[2].Выбрать();
	
	//
	Пока Результат1.Следующий() Цикл
		Результат2.Следующий();	
		Область = Макет.ПолучитьОбласть("Строка");
		
		Область.Параметры.ТипМероприятия = Результат1.ТипМероприятия;
		Область.Параметры.КолВо1 = Результат1.КолВо;
		Область.Параметры.Сумма1 = Результат1.Сумма;
			
		Область.Параметры.ТипМероприятия2 = Результат2.ТипМероприятия;
		Область.Параметры.КолВо2 = Результат2.КолВо;
		Область.Параметры.Сумма2 = Результат2.Сумма;
		
		ТабДок.Вывести(Область);
	КонецЦикла;
	
	//Пустая строка
	Область = Макет.ПолучитьОбласть("Строка");
	ТабДок.Вывести(Область);
	
	//Подвал
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Услуги.Ссылка.Должник) КАК КолВо2
	               |ИЗ
	               |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	               |			&ДатаНа0,
	               |			Организация = &Организация
	               |				И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |				И ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ВРаботеУслуги0
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&ДатаНа0, ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ЗадолженностьПоОбъектамОстатки0
	               |		ПО ВРаботеУслуги0.Объект = ЗадолженностьПоОбъектамОстатки0.Объект
	               |			И (ЗадолженностьПоОбъектамОстатки0.СуммаРеглОстаток > 0)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
	               |				&ДатаНа,
	               |				Организация = &Организация
	               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |					И ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ВРаботеУслуги
	               |		ПО ВРаботеУслуги0.Объект = ВРаботеУслуги.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&ДатаНа, ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ЗадолженностьПоОбъектамОстатки
	               |		ПО ВРаботеУслуги0.Объект = ЗадолженностьПоОбъектамОстатки.Объект
	               |			И (ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток > 0)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК Услуги
	               |		ПО ВРаботеУслуги0.Объект = Услуги.Ссылка
	               |			И (Услуги.Значение = ЛОЖЬ)
	               |			И (Услуги.Свойство = &Свойство)
	               |ГДЕ
	               |	(ВРаботеУслуги.Объект ЕСТЬ NULL 
	               |			ИЛИ ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток, 0) <= 0)";
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду("!!!"));
	Область = Макет.ПолучитьОбласть("Строка");
	Область.Параметры.ТипМероприятия2 = "Процесс завершен оплатой";
	Область.Параметры.КолВо2 = Запрос.Выполнить().Выгрузить()[0].КолВо2;
	ТабДок.Вывести(Область);
	
	//
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Услуги.Ссылка.Должник) КАК КолВо2
	               |ИЗ
	               |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	               |			&ДатаНа0,
	               |			Организация = &Организация
	               |				И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |				И ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ВРаботеУслуги0
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&ДатаНа0, ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ЗадолженностьПоОбъектамОстатки0
	               |		ПО ВРаботеУслуги0.Объект = ЗадолженностьПоОбъектамОстатки0.Объект
	               |			И (ЗадолженностьПоОбъектамОстатки0.СуммаРеглОстаток > 0)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
	               |				&ДатаНа,
	               |				Организация = &Организация
	               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |					И ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ВРаботеУслуги
	               |		ПО ВРаботеУслуги0.Объект = ВРаботеУслуги.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&ДатаНа, ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)) КАК ЗадолженностьПоОбъектамОстатки
	               |		ПО ВРаботеУслуги0.Объект = ЗадолженностьПоОбъектамОстатки.Объект
	               |			И (ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток > 0)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК Услуги
	               |		ПО ВРаботеУслуги0.Объект = Услуги.Ссылка
	               |			И (Услуги.Значение = ИСТИНА)
	               |			И (Услуги.Свойство = &Свойство)
	               |ГДЕ
	               |	(ВРаботеУслуги.Объект ЕСТЬ NULL 
	               |			ИЛИ ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток, 0) <= 0)";
	
	Область = Макет.ПолучитьОбласть("Строка");
	Область.Параметры.ТипМероприятия2 = "Процесс завершен корректировкой";
	Область.Параметры.КолВо2 = Запрос.Выполнить().Выгрузить()[0].КолВо2;
	ТабДок.Вывести(Область);
КонецПроцедуры

