
 &НаСервере
Процедура ПриОткрытииНаСервере()
	ЭтаФорма.РольЮД = РольДоступна("ЮД");
КонецПроцедуры

 &НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПозвонитьДолжнику(Команда)
	// Получить объект мероприятия
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		К = Элементы.Список.ТекущиеДанные.Ссылка;
		НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
		НоваяЗадача.Объект.Объект = К;
		НоваяЗадача.Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокИсходящий");
		// НоваяЗадача.Объект.Контакт = РезультатНомер;
		//НоваяЗадача.КонтрагентКЛ = К;
		НоваяЗадача.Открыть();
	Иначе
		Предупреждение("Не выбран объект мероприятия!",,"Исходящий звонок");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьСМСНаСервере()
	// Получить значения с сервера
	ЭтаФорма.РезультатОтправлено = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Отправлено");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	Если ЭтаФорма.РольЮД = Истина Тогда
		ОтправитьСМСНаСервере();
		// Выполнить обычную клиентскую процедуру
		Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
			К = Элементы.Список.ТекущиеДанные.Ссылка;
			НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
			НоваяЗадача.Объект.Объект = К;
			НоваяЗадача.Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ОтправкаСМС");
			НоваяЗадача.Объект.Результат = РезультатОтправлено;
			// НоваяЗадача.Объект.Контакт = РезультатНомер;
			//НоваяЗадача.КонтрагентКЛ = К;
			НоваяЗадача.Открыть();
		Иначе
			Предупреждение("Не выбран объект мероприятия!",,"Отправка СМС");
		КонецЕсли;
	Иначе
		Предупреждение("Нарушение прав доступа!",,"Предупреждение");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НаписатьВВЦНаСервере()
	// Получить значения с сервера
 	ЭтаФорма.ТипВЦ = Справочники.ТипыМероприятий.НайтиПоНаименованию("WhatsApp");
	ЭтаФорма.РезультатОтправлено = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Отправлено");
КонецПроцедуры

&НаКлиенте
Процедура НаписатьВВЦ(Команда)
	Если ЭтаФорма.РольЮД = Истина Тогда
		НаписатьВВЦНаСервере();
		// Выполнить обычную клиентскую процедуру
		Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
			К = Элементы.Список.ТекущиеДанные.Ссылка;
			НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
			НоваяЗадача.Объект.Объект = К;
			НоваяЗадача.Объект.ТипМероприятия = ТипВЦ;
			НоваяЗадача.Объект.Результат = РезультатОтправлено; 
			// НоваяЗадача.Объект.Контакт = РезультатНомер;
			//НоваяЗадача.КонтрагентКЛ = К;
			НоваяЗадача.Открыть();
		Иначе
			Предупреждение("Не выбран объект мероприятия!",,"Интеграция с WhatsApp");
		КонецЕсли;
	Иначе
		Предупреждение("Нарушение прав доступа!",,"Предупреждение");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДолжникМероприятия(Команда)
	// Передать с ключом
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		К = Элементы.Список.ТекущиеДанные.Ссылка;
		ФормаМероприятия = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаСписка",,,Новый УникальныйИдентификатор());
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаМероприятия.Список, "Объект", К, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
		ФормаМероприятия.КоманднаяПанель.Видимость = Ложь;
		ФормаМероприятия.Открыть();
	Иначе
		Предупреждение("Не найден объект отбора!",,"Все мероприятия");
	КонецЕсли;
КонецПроцедуры
