
&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	ЛогинИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Ключ.Пустая() Тогда
	
		Ключи = ОбработкаБезопасноеХранилище.КлючиПочтаРФ();

		ПочтаРФ = ОбработкаБезопасноеХранилище.Получить(Объект.Ссылка, Ключи);
		
		Для каждого Ключ Из Ключи Цикл
		
			ЭтаФорма[Ключ] = ПочтаРФ[Ключ];
		
		КонецЦикла;
	
	КонецЕсли;
	
	Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтотОбъект.УникальныйИдентификатор, "");

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Ключи = ОбработкаБезопасноеХранилище.КлючиПочтаРФ();
	
	Для каждого Ключ Из Ключи Цикл
	
		Если ЭтаФорма[Ключ + "Изменен"] Тогда
		
			ЭтаФорма[Ключ + "Изменен"] = Ложь;
			ОбработкаБезопасноеХранилище.Записать(ТекущийОбъект.Ссылка, Ключ, ЭтаФорма[Ключ]);
		
		КонецЕсли;
	
	КонецЦикла;
	Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтотОбъект.УникальныйИдентификатор, "");
	
КонецПроцедуры
