
&НаКлиенте
Процедура ШаблонКомментарияПриИзменении(Элемент)
	
	//Справочники.ФункцииКомментариев.ВычислитьФункцию(Объект.ШаблонКомментария.Функция,Объект.Комментарий,)  ;
КонецПроцедуры
&НаСервере
Функция ПолучитьКомментарий(Ссылка)
	Возврат 	Ссылка.ПолучитьОбъект().ВычислитьФункцию();
КонецФункции



//Лебедева 26.02.2018 -> 05.06.2018
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 ВидимостьЭлементовДляСвязанногоДокумента();	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныйДокументПриИзменении(Элемент)
	 ВидимостьЭлементовДляСвязанногоДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлПриИзменении(Элемент)
	 ВидимостьЭлементовДляСвязанногоДокумента();
 КонецПроцедуры
 
&НаКлиенте
Процедура ВидимостьЭлементовДляСвязанногоДокумента()
	Если Объект.СвязанныйДокумент = ПредопределенноеЗначение("Перечисление.ВидыСвязанныхДокументов.ПрикрепитьФайлы") И Объект.ПрикрепитьФайл тогда
		Элементы.ПрикреплятьФайлВМероприятие.Видимость = Истина;
		Элементы.ТипФайла.Видимость = Истина;
	Иначе 
		Элементы.ПрикреплятьФайлВМероприятие.Видимость = Ложь;
		Объект.ПрикреплятьФайлВМероприятие = Ложь;	
		Элементы.ТипФайла.Видимость = Ложь;
		Объект.ТипФайла = Истина;
	КонецЕсли;
	Если Объект.СвязанныйДокумент = ПредопределенноеЗначение("Перечисление.ВидыСвязанныхДокументов.АктПередачи") И  Объект.ПрикрепитьФайл тогда
		Элементы.ГруппаАктПередачи.Видимость = Истина;
	Иначе 
		Элементы.ГруппаАктПередачи.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры	







	
	