
&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Обработка.MandarinОперации.Форма.Форма" Тогда
		ОбработатьОткрытиеMandarinОперации(ЭтаФорма.ВладелецФормы.Объект.ЕмаилПлательщика,ЭтаФорма.ВладелецФормы.Объект.ВидЗаказа,ЭтаФорма.ВладелецФормы.Объект.СсылкаДляПлательщика,ЭтаФорма.ВладелецФормы.Объект.ОбъектУчета);
	Иначе
		ПриОткрытииСервер(ЭтаФорма.ВладелецФормы.ИмяФормы,ЭтаФорма.ВладелецФормы.Должник,ЭтаФорма.ВладелецФормы.Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииСервер(ИмяФормыВладельца,Должник,ДО)
	ЕмаилКонст = ОбъектыСервер.ПолучитьЗначениеКонстанты("EmailАдресДолжника");	
	Если ИмяФормыВладельца = "Справочник.ДолговыеОбязательства.Форма.ФормаЭлемента" Тогда
		Если ЕмаилКонст.СправочникВладелец.ИмяПредопределенныхДанных = "Справочник_Контрагенты" Тогда
			EmailПолучателя = ОбъектыСервер.ПолучитьЗначениеСвойства(Должник,ЕмаилКонст.Код);
		ИначеЕсли ЕмаилКонст.СправочникВладелец.ИмяПредопределенныхДанных = "Справочник_ДолговыеОбязательства" Тогда
			EmailПолучателя = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,ЕмаилКонст.Код);
		КонецЕсли;			
	КонецЕсли;	
	УчетнаяЗаписьРассылки = ОбъектыСервер.ПолучитьЗначениеКонстанты("УчеткаEMailРассылок");
	
	ШаблонПисьма = ОбъектыСервер.ПолучитьЗначениеКонстанты("ШаблонПисьмаEmail");
	Если ШаблонПисьма.ОбъектУчета = Перечисления.ОбъектыУчета.ДолговыеОбязательства Тогда
		ТекстПисьма = Автоинформирование.ПолучитьПодсказку(ДО,ШаблонПисьма);
	ИначеЕсли
		 ШаблонПисьма.ОбъектУчета = Перечисления.ОбъектыУчета.Контрагенты Тогда
		 ТекстПисьма = Автоинформирование.ПолучитьПодсказку(Должник,ШаблонПисьма);
	Иначе
		ТекстПисьма = "";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработатьОткрытиеMandarinОперации(Емаил,ВидЗаказа,СсылкаДляПлательщика,ОбъектУчета)
	УчетнаяЗаписьРассылки = ОбъектыСервер.ПолучитьЗначениеКонстанты("УчеткаEMailРассылок");
	EmailПолучателя = Емаил;
	ШаблонПисьма = ?(ВидЗаказа = Перечисления.Mandarin_Действия.Токен,ОбъектыСервер.ПолучитьЗначениеКонстанты("MandarinШаблонТекстаТокен"),ОбъектыСервер.ПолучитьЗначениеКонстанты("MandarinШаблонТекстаОплата"));
	ТекстПисьма = Автоинформирование.ПолучитьПодсказку(ОбъектУчета,ШаблонПисьма);
	ТекстПисьма = ТекстПисьма + Строка(СсылкаДляПлательщика);
КонецПроцедуры


&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьСервер(УчетнаяЗаписьРассылки,EmailПолучателя,ТекстПисьма,ШаблонПисьма,ЭтаФорма.ВладелецФормы.Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ОтправитьСервер(УчетнаяЗапись,ЕмаилКуда,Текст,Шаблон,Об)
	Рассылка.ОтправитьЕмаилПоДО(УчетнаяЗапись,ЕмаилКуда,Текст,Шаблон,Об);
КонецПроцедуры	