
// Открывает форму текущих оповещений пользователя
Процедура ПроверитьТекущиеНапоминания() Экспорт	
	Если НапоминанияПользователяСервер.ПроверитьНаличиеПросроченныхЗадач() Тогда
		Форма = ПолучитьФорму("РегистрСведений.НапоминанияПользователя.Форма.ФормаОповещения",,,"М");
		//Чуров
		ОткрытьФорму(Форма);
		//Форма.Открыть();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПроверитьТекущиеНапоминания", 60, Истина);	
КонецПроцедуры

// Сбрасывает таймер проверки текущих напоминаний и выполняет проверку немедленно
Процедура СброситьТаймерПроверкиТекущихОповещений() Экспорт
	ОтключитьОбработчикОжидания("ПроверитьТекущиеНапоминания");
	ПроверитьТекущиеНапоминания();
КонецПроцедуры

Процедура ПроверитьСообщенияКПросмотру() Экспорт	
	Если НапоминанияПользователяСервер.ПроверитьНаличиеНеПрочитанныхСообщений() Тогда
		Параметры = Новый Структура("Сообщения", Истина);
		Форма = ПолучитьФорму("РегистрСведений.НапоминанияПользователя.Форма.ФормаОповещения",Параметры,,"С");
		ОткрытьФорму(Форма);
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПроверитьСообщенияКПросмотру", 60, Истина);	
КонецПроцедуры
