
&НаКлиенте
Процедура Отправить(Команда)
	Если ЗначениеЗаполнено(ЭтаФорма.Номер) И ЗначениеЗаполнено(ЭтаФорма.Договор) И ЗначениеЗаполнено(ЭтаФорма.Сообщение) Тогда
		Оповестить("ШаблонИзмененВайбер");
	Иначе
		Предупреждение("Не заполнены обязательные поля!",,"Интеграция с Viber");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Шаблоны(Команда)
	Если ЗначениеЗаполнено(ЭтаФорма.Номер) И ЗначениеЗаполнено(ЭтаФорма.Договор) Тогда
		// Открыть форму списка шаблонов
		ФормаСпискаШаблонов = ПолучитьФорму("Справочник.ШаблоныТекстаДляАвтоинформирования.Форма.ФормаСписка");
		ФормаСпискаШаблонов.СкрытоеПолеНомерДО = ЭтаФорма.Договор;
		ФормаСпискаШаблонов.Открыть();
	Иначе
		Предупреждение("Не заполнены обязательные поля!",,"Интеграция с Viber");
	КонецЕсли;
КонецПроцедуры
