#Область Интерфейс

Процедура ЗагрузитьИндексыВФоне(ПараметрыМодуля, АдресХранилища) Экспорт

	Результат = ЗагрузитьИндексы(
		ПараметрыМодуля["ДанныеБазы"],
		ПараметрыМодуля["ДанныеТабличногоДокумента"]
	);

КонецПроцедуры

Функция ЗагрузитьИндексы(ДанныеБазы, ДанныеСоответствий) Экспорт

	Попытка
	
		ФайлБазы = ОткрытьНаЧтениеФайлБазы(ДанныеБазы);
	
	Исключение
		ВызватьИсключение ОшибкаЗагрузки(ДанныеБазы, ОписаниеОшибки());
	КонецПопытки;
	
	Попытка
	
		ТаблицаСоответствий = ПолучитьФайлСоответствий(ДанныеСоответствий);
	
	Исключение
		ВызватьИсключение ОшибкаЗагрузки(ДанныеСоответствий, ОписаниеОшибки());
	КонецПопытки;
	
	Попытка
	
		ЗагрузитьСправочникИндексов(ФайлБазы["Таблица"], ТаблицаСоответствий);
	
	Исключение
		ЗакрытьФайлБазы(ФайлБазы);
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	Попытка
	
		ЗакрытьФайлБазы(ФайлБазы);
	
	Исключение
		ВызватьИсключение ОшибкаЗакрытия(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Истина;

КонецФункции

#КонецОбласти

#Область Техническая

#Область ФайлБазы

Функция ОткрытьНаЧтениеФайлБазы(ДанныеБазы)

	ПутьКФайлу = ДанныеБазы["Имя"];

	Таблица = Новый XBase;
	Таблица.ОткрытьФайл(ПутьКФайлу, , Истина);

	Если Таблица.Кодировка = КодировкаXBase.ANSI Тогда
		Таблица.Кодировка = КодировкаXBase.OEM;
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("Путь", ПутьКФайлу);
	Данные.Вставить("Таблица", Таблица);
	
	Возврат Данные;

КонецФункции // ()

Функция ЗакрытьФайлБазы(Файл)

	Файл["Таблица"].ЗакрытьФайл();

КонецФункции // ()

#КонецОбласти

#Область ТабличныйДокумент

Функция ПолучитьФайлСоответствий(ДанныеСоответствий)

	Попытка
	
		ТабличныйДокумент = УправлениеЗагрузкойСервер.ПолучитьТабличныйДокументИзФайлаХранилища(
			ДанныеСоответствий["Имя"]
		);
	
	Исключение
		ВызватьИсключение ОшибкаВременногоФайла(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ТабличныйДокумент;

КонецФункции // ()

#КонецОбласти

Процедура ЗагрузитьСправочникИндексов(Таблица, ПолеИсходнойТаблицы)

	Таблица.Первая(); // перешли к первой записи
	Пока Не Таблица.ВКонце() Цикл
	
		Если Таблица.ЗаписьУдалена() Тогда
			Продолжить;
		КонецЕсли;
		
		МЗ = РегистрыСведений.ЭталонныйСправочникИндексовРФ.СоздатьМенеджерЗаписи();
		МЗ.Индекс = Таблица.INDEX;

		НаименованиеРегиона = ?(
			ЗначениеЗаполнено(Таблица.REGION),
			Таблица.REGION,
			Таблица.AUTONOM
		);
		МЗ.НаименованиеРегиона = НаименованиеРегиона;
		
		КодРегиона = НайтиКодРегиона(НаименованиеРегиона, ПолеИсходнойТаблицы);
		МЗ.КодРегиона = КодРегиона;
		
		МЗ.Записать(Истина);
		
		Таблица.Следующая();
	
	КонецЦикла;

КонецПроцедуры

Функция НайтиКодРегиона(ИмяРегиона, ПолеИсходнойТаблицы)
	КодРег = 0;
	Для НомерСтроки = 2 По ПолеИсходнойТаблицы.ВысотаТаблицы Цикл
		КодРегионаЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, 1).Текст;
		НаименованиеРегионаЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, 2).Текст;
		НаименованиеРегионаЗнач = ВРег(НаименованиеРегионаЗнач);
		Если СтрНайти(ИмяРегиона, НаименованиеРегионаЗнач) > 0 Тогда
			КодРег = Число(КодРегионаЗнач);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КодРег;
КонецФункции

#КонецОбласти

#Область Исключения

Функция ОшибкаЗагрузки(Файл, ОписаниеОшибки)

	Возврат "Ошибка обработки файлов:" + Символы.ПС
			+ "Файл: " + Файл["Имя"] + Символы.ПС
			+ "Ошибка: " + ОписаниеОшибки;

КонецФункции // ()

Функция ОшибкаВременногоФайла(ОписаниеОшибки)

	Возврат "Не удалось востановить файл на сервере: " + ОписаниеОшибки;

КонецФункции // ()

Функция ОшибкаЗакрытия(ОписаниеОшибки)

	Возврат "Ошибка при закрытии файла: " + ОписаниеОшибки;

КонецФункции // ()

#КонецОбласти

#Область НаУдаление

Процедура Старый_ЗагрузитьСправочникИндексов(ПутьКФайлу, ПолеИсходнойТаблицы)
	
	Таблица = Новый XBase;
	Таблица.ОткрытьФайл(ПутьКФайлу, , Истина);

	Если Таблица.Кодировка = КодировкаXBase.ANSI Тогда
		Таблица.Кодировка = КодировкаXBase.OEM;
	КонецЕсли;
	
	Таблица.Первая(); // перешли к первой записи
	Пока Не Таблица.ВКонце() Цикл
	
		Если Таблица.ЗаписьУдалена() Тогда
			Продолжить;
		КонецЕсли;
		
		МЗ = РегистрыСведений.ЭталонныйСправочникИндексовРФ.СоздатьМенеджерЗаписи();
		МЗ.Индекс = Таблица.INDEX;

		НаименованиеРегиона = ?(
			ЗначениеЗаполнено(Таблица.REGION),
			Таблица.REGION,
			Таблица.AUTONOM
		);
		МЗ.НаименованиеРегиона = НаименованиеРегиона;
		
		КодРегиона = НайтиКодРегиона(НаименованиеРегиона, ПолеИсходнойТаблицы);
		МЗ.КодРегиона = КодРегиона;
		
		МЗ.Записать(Истина);
		
		Таблица.Следующая();
	
	КонецЦикла;
	
	Таблица.ЗакрытьФайл();

КонецПроцедуры

#КонецОбласти