Процедура ЗагрузитьСправочникИндексов(ПутьКФайлу, ПолеИсходнойТаблицы) Экспорт
	
	Таблица = Новый XBase;
	Таблица.ОткрытьФайл(ПутьКФайлу, , Истина);
		
	//Сообщить("В таблице " + Таблица.КоличествоЗаписей() + " записей.");
	//Сообщить("Таблица имеет кодировку: " + Таблица.Кодировка);
	Если Таблица.Кодировка = КодировкаXBase.ANSI Тогда
		Таблица.Кодировка = КодировкаXBase.OEM;
	КонецЕсли;	
	
	Таблица.Первая(); // перешли к первой записи
	Пока Не Таблица.ВКонце() Цикл
		Если Не Таблица.ЗаписьУдалена() Тогда
			МЗ = РегистрыСведений.ЭталонныйСправочникИндексовРФ.СоздатьМенеджерЗаписи();
			МЗ.Индекс = Таблица.INDEX;
			НаименованиеРегиона= ?(ЗначениеЗаполнено(Таблица.REGION),Таблица.REGION,Таблица.AUTONOM);
			МЗ.НаименованиеРегиона = НаименованиеРегиона;
			КодРегиона = НайтиКодРегиона(НаименованиеРегиона,ПолеИсходнойТаблицы);
			МЗ.КодРегиона = КодРегиона;
			МЗ.Записать(Истина);
		КонецЕсли;
		Таблица.Следующая();
	КонецЦикла;
	
	Таблица.ЗакрытьФайл();

КонецПроцедуры	

Функция НайтиКодРегиона(ИмяРегиона, ПолеИсходнойТаблицы)
	КодРег = 0;
	Для НомерСтроки = 2 По ПолеИсходнойТаблицы.ВысотаТаблицы Цикл
		КодРегионаЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, 1).Текст;
		НаименованиеРегионаЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, 2).Текст;
		НаименованиеРегионаЗнач = ВРег(НаименованиеРегионаЗнач);
		Если СтрНайти(ИмяРегиона, НаименованиеРегионаЗнач) > 0 Тогда
			КодРег = Число(КодРегионаЗнач);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КодРег;
КонецФункции	