Процедура ЗаполнитьДокументДаннымиИзРС() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ФССП_ОчередьЗагрузкиДолжников.Объект) = ТИП(Справочник.Контрагенты)
		|			ТОГДА ФССП_ОчередьЗагрузкиДолжников.Объект
		|		КОГДА ТИПЗНАЧЕНИЯ(ФССП_ОчередьЗагрузкиДолжников.Объект) = ТИП(Справочник.ДолговыеОбязательства)
		|			ТОГДА ФССП_ОчередьЗагрузкиДолжников.Объект.Должник
		|	КОНЕЦ КАК Объект
		|ИЗ
		|	РегистрСведений.ФССП_ОчередьЗагрузкиДолжников КАК ФССП_ОчередьЗагрузкиДолжников
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ФССП_ОчередьЗагрузкиДолжников.Объект) = ТИП(Справочник.Контрагенты)
		|			ТОГДА ФССП_ОчередьЗагрузкиДолжников.Объект
		|		КОГДА ТИПЗНАЧЕНИЯ(ФССП_ОчередьЗагрузкиДолжников.Объект) = ТИП(Справочник.ДолговыеОбязательства)
		|			ТОГДА ФССП_ОчередьЗагрузкиДолжников.Объект.Должник
		|	КОНЕЦ";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Док = Документы.ФССП_ОчередьЗагрузкиДолжников.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
		Док.Комментарий = "Технический документ по переходу с регистра сведений на регистр накопления";
		Пока Выборка.Следующий() Цикл
			Стр = Док.Объекты.Добавить();
			Стр.Объект = Выборка.Объект;	
		КонецЦикла;
		Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
КонецПроцедуры
