
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)		
	Если ЭтоНовый() Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	ЗаполнитьДолжников();
КонецПроцедуры

Процедура ЗаполнитьДолжников()
	Для Каждого Стр Из Объекты Цикл
		Если ТипЗнч(Стр.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
			Стр.Должник = Стр.Объект.Должник;
		Иначе
			Стр.Должник = Стр.Объект;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ФССПОчередьЗагрузкиДолжников.Записывать = Истина;
	Для Каждого ТекСтрокаОбъекты Из Объекты Цикл
		Движение = Движения.ФССПОчередьЗагрузкиДолжников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Должник = ТекСтрокаОбъекты.Должник;
		Движение.Ресурс = 1;
	КонецЦикла;
КонецПроцедуры


