
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запись.Дата = ТекущаяДата();
	Запись.Время = ТекущаяДата();
	Запись.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбновитьВремя", 1);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ЭтаФорма.Запись.ТипЗадачи) = Ложь Тогда
		Предупреждение("Не задан тип задачи!",,"Ошибка создания задачи");
		Отказ = Истина;
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Запись.Состояние) = Ложь Тогда
		Предупреждение("Не задано состояние задачи!",,"Ошибка создания задачи");
		Отказ = Истина;
	Иначе
		ПоказатьОповещениеПользователя(ЭтаФорма.Запись.ТипЗадачи,,"Задача создана",БиблиотекаКартинок.NC_НоваяЗадача);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВремя()
	Если ЗначениеЗаполнено(ЭтаФорма.ЭтотОбъект.Запись.Состояние) = Ложь Тогда
		Запись.Время = ТекущаяДата();
	КонецЕсли
КонецПроцедуры
