
&НаКлиенте
Процедура СписокДОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.СписокДО.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.СписокДО.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДолжникМероприятия(Команда)
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.СписокДО И Элементы.СписокДО.ТекущиеДанные <> Неопределено Тогда
		// Передать с ключом
		К = Элементы.СписокДО.ТекущиеДанные.Ссылка;
		ФормаМероприятия = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаСписка",,,Новый УникальныйИдентификатор());
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаМероприятия.Список, "Объект", К, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
		ФормаМероприятия.Открыть();
	Иначе
		Предупреждение("Не найден объект отбора!",,"Контроль сроков");
	КонецЕсли;
КонецПроцедуры

