
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не ОбъектыСервер.РазыменоватьСсылку(ВыбраннаяСтрока, "ЭтоГруппа") Тогда	
		СтандартнаяОбработка = Ложь;
		ИмяОтчета = ОбъектыСервер.РазыменоватьСсылку(ВыбраннаяСтрока, "ИмяОтчета");
		Если ИмяОтчета = "бтИсторияЗвонков" Тогда
			ИмяОтчета = "бит_ИсторияЗвонков";
		КонецЕсли;	
		Если ОбъектыСервер.РазыменоватьСсылку(ВыбраннаяСтрока, "Внутренний") Тогда
			ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма");		
		Иначе
			Попытка
				ОткрытьФорму("ВнешнийОтчет." + ИмяОтчета + ".Форма");
			Исключение
				Попытка	
					ПодключитьВнешнийОтчет(ВыбраннаяСтрока);
					ОткрытьФорму("ВнешнийОтчет." + ИмяОтчета + ".Форма");
				Исключение
					Сообщить("Ошибка получения отчета!");
				КонецПопытки;
			КонецПопытки;			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПодключитьВнешнийОтчет(ОтчетСсылка)
	АдресХранилища = ПоместитьВоВременноеХранилище(ОтчетСсылка.Хранилище.Получить(), Новый УникальныйИдентификатор());
	ВнешниеОтчеты.Подключить(АдресХранилища, ОтчетСсылка.ИмяОтчета, Ложь);
КонецПроцедуры
