
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьУчастки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчастки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Отделы.Ссылка Как Участок
		|ИЗ
		|	Справочник.Отделы КАК Отделы";

	Результат = Запрос.Выполнить();
	
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = Участки.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		Для Каждого Стр Из СписокУчастков Цикл
			Если Стр.Значение = НС.Участок Тогда
				НС.Выбрать = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗакрыть(Команда)
	
	М = Новый СписокЗначений;
	Для Каждого Стр Из Участки Цикл
		Если Стр.Выбрать Тогда
			М.Добавить(Стр.Участок);
		КонецЕсли;
	КонецЦикла;
	ЭтаФорма.Закрыть(М);
	
КонецПроцедуры
