
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);		
		Объект.ПланируемаяДата = ТекущаяДата();		
	КонецЕсли;
	ТипСообщенияПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ТипСообщенияПриИзменении(Элемент)
	ТипСообщенияПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура ТипСообщенияПриИзмененииСервер()
	Если Объект.ТипСообщения = Перечисления.ТипыСообщений.КСотруднику Тогда
		Элементы.Организация.Видимость = Ложь;
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Ответственный.Видимость = Истина;
		Элементы.ТипСотрудника.Видимость = Ложь;
		Элементы.Объект.Видимость = Ложь;
		
	ИначеЕсли Объект.ТипСообщения = Перечисления.ТипыСообщений.КДолговомуОбязательству Тогда
		Элементы.Организация.Видимость = Ложь;
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Ответственный.Видимость = Ложь;
		Элементы.ТипСотрудника.Видимость = Ложь;
		Элементы.Объект.Видимость = Истина;
		
	ИначеЕсли Объект.ТипСообщения = Перечисления.ТипыСообщений.КСотрудникуИДО Тогда	
		Элементы.Организация.Видимость = Ложь;
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Ответственный.Видимость = Истина;
		Элементы.ТипСотрудника.Видимость = Ложь;
		Элементы.Объект.Видимость = Истина;
		
	ИначеЕсли Объект.ТипСообщения = Перечисления.ТипыСообщений.КТипуСотрудника Тогда
		Элементы.Организация.Видимость = Ложь;
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Ответственный.Видимость = Ложь;
		Элементы.ТипСотрудника.Видимость = Истина;
		Элементы.Объект.Видимость = Истина;
		
	Иначе
		Элементы.Организация.Видимость = Ложь;
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Ответственный.Видимость = Ложь;
		Элементы.ТипСотрудника.Видимость = Ложь;
		Элементы.Объект.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = СокрЛП(Объект.Наименование);
	Объект.Текст = СокрЛП(Объект.Текст);
	Если Объект.Наименование = "" Тогда
		Объект.Наименование = "Сообщение";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыполнение(Команда)
	Объект.Выполнена = Ложь;
	Записать();
КонецПроцедуры

&НаСервере
Функция ЯвляетсяЛиТекущийПользовательАдресатом()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Сообщения.Ссылка
	                      |ИЗ
	                      |	Задача.Сообщения КАК Сообщения
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник = &Сотрудник) КАК ОбъектыВРаботеОстатки
	                      |		ПО Сообщения.Объект = ОбъектыВРаботеОстатки.Объект
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |		ПО (ОбъектыВРаботеОстатки.Объект = ОтветственныеСотрудники.Объект)
	                      |			И (ОтветственныеСотрудники.Пользователь = &Сотрудник)
	                      |ГДЕ
	                      |	(Сообщения.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.КСотруднику)
	                      |				И Сообщения.Сотрудник = &Сотрудник
	                      |			ИЛИ Сообщения.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.КДолговомуОбязательству)
	                      |				И НЕ ОбъектыВРаботеОстатки.Объект ЕСТЬ NULL 
	                      |			ИЛИ Сообщения.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.КСотрудникуИДО)
	                      |				И НЕ ОбъектыВРаботеОстатки.Объект ЕСТЬ NULL 
	                      |				И Сообщения.Сотрудник = &Сотрудник
	                      |			ИЛИ Сообщения.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.КТипуСотрудника)
	                      |				И НЕ ОтветственныеСотрудники.Объект ЕСТЬ NULL 
	                      |				И Сообщения.ТипСотрудника = ОтветственныеСотрудники.ТипСотрудника)
	                      |	И Сообщения.Ссылка = &Ссылка");
						  
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Объект.Ссылка.Пустая() И Не Объект.Прочитано И ЯвляетсяЛиТекущийПользовательАдресатом() Тогда
		Объект.Прочитано = Истина;
		ЭтаФорма.Записать();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//ДокументОбъект = РеквизитФормыВЗначение("Объект");
	//ДокументОбъект.ПриЗаписи(Неопределено);
КонецПроцедуры

