
Функция ПолучитьПрофильИнтернетПочтовоеПодключения(УчетнаяЗапись) Экспорт	
	//Лучше использовать ЭлектроннаяПочта.СформироватьИнтернетПрофиль(УчетнаяЗапись);
	Возврат РаботаСЭлектроннымиСообщениями.СформироватьИнтернетПрофиль(УчетнаяЗапись);
	
	//Профиль = Новый ИнтернетПочтовыйПрофиль;
	//
	//Профиль.АдресСервераPOP3 = УчетнаяЗапись.POP3Сервер;
	//Профиль.АдресСервераSMTP = УчетнаяЗапись.SMTPСервер;
	//Если УчетнаяЗапись.ВремяОжидания > 0 Тогда
	//	Профиль.ВремяОжидания = УчетнаяЗапись.ВремяОжидания;
	//КонецЕсли; 
	//Профиль.Пароль           = УчетнаяЗапись.Пароль;
	//Профиль.Пользователь     = УчетнаяЗапись.Пользователь;
	//Профиль.ПортPOP3         = УчетнаяЗапись.ПортPOP3;
	//Профиль.ПортSMTP         = УчетнаяЗапись.ПортSMTP;
	//
	//Если УчетнаяЗапись.ТребуетсяSMTPАутентификация Тогда
	//	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	//	Профиль.ПарольSMTP       = УчетнаяЗапись.ПарольSMTP;
	//	Профиль.ПользовательSMTP = УчетнаяЗапись.ПользовательSMTP;
	//Иначе
	//	Профиль.ПарольSMTP       = "";
	//	Профиль.ПользовательSMTP = "";
	//КонецЕсли; 
	//
	//Возврат Профиль;	
КонецФункции 
