
&НаКлиенте
Процедура ОК(Команда)
	ЗаписатьИнтерфейс();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИнтерфейс()
	СписокФорм = Интерфейс.СписокФорм;
	Для Каждого Форма Из СписокФорм Цикл
		Идентификатор = Форма.ФормаСНастройками.ПутьКНастройкам;
		НастройкиФормы = Форма.ФормаСНастройками.Настройки.Получить();
		ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "", НастройкиФормы,, Пользователь.Код); 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьКоВсемПользователям(Команда)
	ПрименитьКоВсемПользователямСервер();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
Процедура ПрименитьКоВсемПользователямСервер()
	СписокФорм = Интерфейс.СписокФорм;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Код
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	НЕ Пользователи.Уволен
	                      |	И НЕ Пользователи.ПометкаУдаления");
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл 
		Для Каждого Форма Из СписокФорм Цикл
			Идентификатор = Форма.ФормаСНастройками.ПутьКНастройкам;
			НастройкиФормы = Форма.ФормаСНастройками.Настройки.Получить();
			ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "", НастройкиФормы,, Результат.Код); 
		КонецЦикла; 
	КонецЦикла;
КонецПроцедуры
