
Процедура ВводНачальныхОстатковИзРеестра(Кредитор, Реестр) Экспорт
	КодТело = "0164";
	КодПроценты = "0165";
	КодПени = "0167"; 
	КодКомиссия = "0166";
	КодРеестр = "0093";
	Док = Документы.ВводНачальныхОстатковВнесудебка.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Автор = ПараметрыСеанса.ТекущийПользователь;
	Док.Организация = Справочники.Организации.НайтиПоКоду("000000001");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДолговыеОбязательстваДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ПО ДолговыеОбязательстваДополнительныеРеквизиты.Ссылка = ДолговыеОбязательства.Ссылка
	|			И (ДолговыеОбязательстваДополнительныеРеквизиты.Свойство.Код = ""0094"")
	|ГДЕ
	|	ДолговыеОбязательства.Кредитор = &Кредитор
	|	И ДолговыеОбязательстваДополнительныеРеквизиты.Значение = &Реестр";
	Запрос.УстановитьПараметр("Кредитор", Справочники.Контрагенты.НайтиПоНаименованию(Кредитор));
	Запрос.УстановитьПараметр("Реестр", Реестр);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДО = Выборка.Ссылка.ПолучитьОбъект();
		ОсновнойДолг = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, КодТело);
		Проценты = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, КодПроценты);
		Комиссия = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, КодКомиссия);
		Пени = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, КодПени);
		Стр = Док.Объекты.Добавить();
		Стр.Объект = ДО.Ссылка;
		Стр.ОсновнойДолг = ОсновнойДолг;
		Стр.Проценты = Проценты;
		Стр.Составляющая1 = Комиссия;
		Стр.Пени = Пени;
	КонецЦикла;			
	Док.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

Процедура ОбновлениеОстатковИзРеестров(Дата) Экспорт
	КодТело = "0164";
	КодПроценты = "0165";
	КодПени = "0167"; 
	КодКомиссия = "0166";
	Док = Документы.ВводНачальныхОстатковВнесудебка.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Автор = ПараметрыСеанса.ТекущийПользователь;
	Док.Организация = Справочники.Организации.НайтиПоКоду("000000001");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО ДолговыеОбязательства.Ссылка = ДополнительныеСведения.Объект
	|			И (ДополнительныеСведения.Свойство.Код = ""0185"")
	|ГДЕ
	|	ДополнительныеСведения.Значение = &Дата";
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
			ДО = Выборка.Ссылка.ПолучитьОбъект();
			ОсновнойДолг = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, КодТело);
			Проценты = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, КодПроценты);
			Комиссия = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, КодКомиссия);
			Пени = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, КодПени);
			Стр = Док.Объекты.Добавить();
			Стр.Объект = ДО.Ссылка;
			Стр.ОсновнойДолг = ОсновнойДолг;
			Стр.Проценты = Проценты;
			Стр.Составляющая1 = Комиссия;
			Стр.Пени = Пени;
	КонецЦикла;
	Док.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры
