
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Попытка	
		Таблица = ЭтаФорма.ВладелецФормы.Объект.НастройкаСоответствий; 
		
		ТаблицаКонтакты = ЭтаФорма.ВладелецФормы.Объект.НастройкаСоответствийКонтакты; 
		
		Объект.ТипДоговоров = ЭтаФорма.ВладелецФормы.Объект.ТипДоговоров;
		Объект.ТипДолговыхОбязательств = ЭтаФорма.ВладелецФормы.Объект.ТипДолговыхОбязательств;
		Объект.ТипДолжников = ЭтаФорма.ВладелецФормы.Объект.ТипДолжников;
		Объект.ТипЗалогов = ЭтаФорма.ВладелецФормы.Объект.ТипЗалогов;
		Объект.ТипИсполнительныхДокументов = ЭтаФорма.ВладелецФормы.Объект.ТипИсполнительныхДокументов;
		Объект.ТипКонтрагентов = ЭтаФорма.ВладелецФормы.Объект.ТипКонтрагентов;
		Объект.ТипКредиторов = ЭтаФорма.ВладелецФормы.Объект.ТипКредиторов;
		Объект.ТипУслуг = ЭтаФорма.ВладелецФормы.Объект.ТипУслуг;
		
		Объект.УчетПоДО = ЭтаФорма.ВладелецФормы.Объект.УчетПоДО;
		Объект.УчетПоИД = ЭтаФорма.ВладелецФормы.Объект.УчетПоИД;
		Объект.УчетПоЗ = ЭтаФорма.ВладелецФормы.Объект.УчетПоЗ;
		Объект.УчетПоД = ЭтаФорма.ВладелецФормы.Объект.УчетПоД;
		Объект.УчетПоУ = ЭтаФорма.ВладелецФормы.Объект.УчетПоУ;
		Объект.УчетПоДолжникам = ЭтаФорма.ВладелецФормы.Объект.УчетПоДолжникам;
		Объект.УчетПоКредиторам = ЭтаФорма.ВладелецФормы.Объект.УчетПоКредиторам;
		Объект.УчетПоКонтрагентам = ЭтаФорма.ВладелецФормы.Объект.УчетПоКонтрагентам;  
		
		Объект.КонтрольД = ЭтаФорма.ВладелецФормы.Объект.КонтрольД;
		Объект.КонтрольДО = ЭтаФорма.ВладелецФормы.Объект.КонтрольДО;
		Объект.КонтрольЗ = ЭтаФорма.ВладелецФормы.Объект.КонтрольЗ;
		Объект.КонтрольДолжники = ЭтаФорма.ВладелецФормы.Объект.КонтрольДолжники;
		Объект.КонтрольИД = ЭтаФорма.ВладелецФормы.Объект.КонтрольИД;
		Объект.КонтрольКонтрагенты = ЭтаФорма.ВладелецФормы.Объект.КонтрольКонтрагенты;
		Объект.КонтрольКредиторы = ЭтаФорма.ВладелецФормы.Объект.КонтрольКредиторы;
		Объект.КонтрольУ = ЭтаФорма.ВладелецФормы.Объект.КонтрольУ;
				
		ЗаполнитьТаблицу(Таблица, ТаблицаКонтакты);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу(Таблица, ТаблицаКонтакты)
	Объект.НастройкаСоответствий.Загрузить(Таблица.Выгрузить());	
	Объект.НастройкаСоответствийКонтакты.Загрузить(ТаблицаКонтакты.Выгрузить());	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("НастройкиСоответствийФормаЭлементаЗакрыть",Объект.Ссылка);
КонецПроцедуры

