
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура Реквизит1ПриИзменении(Элемент)
	Реквизит1ПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура Реквизит1ПриИзмененииНаСервере()
	Для Каждого Элемент Из Метаданные.НайтиПоТипу(ВыборОбъектов.Типы()[0]).СтандартныеРеквизиты Цикл 
	 НовСтрока = Отбор.Добавить();
	 НовСтрока.Реквизит = Элемент.Имя;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПередНачаломИзменения(Элемент, Отказ)
	ОтборПередНачаломИзмененияНаСервере(Элементы.Отбор.ТекущиеДанные.Реквизит);
КонецПроцедуры

&НаСервере
Процедура ОтборПередНачаломИзмененияНаСервере(Реквизит)
	Для Каждого Элемент Из Метаданные.НайтиПоТипу(ВыборОбъектов.Типы()[0]).СтандартныеРеквизиты Цикл 
		Если Элемент.Имя = Реквизит Тогда 
			Элементы.ОтборЗначение.ОграничениеТипа = Новый ОписаниеТипов(Элемент.Тип);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Отобрать(Команда)
		ОтобратьНаСервере();
	

КонецПроцедуры
Процедура ОтобратьНаСервере();
Запрос = Новый Запрос;
		
СтрокаЗапроса = Метаданные.НайтиПоТипу(ВыборОбъектов.Типы()[0]).Имя;

Если Справочники.ТипВсеСсылки().СодержитТип(ВыборОбъектов.Типы()[0]) Тогда
	Стр = "Справочник";
ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ВыборОбъектов.Типы()[0])Тогда 
	Стр = "Документ";	
ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(ВыборОбъектов.Типы()[0])Тогда 
	Стр = "Задача";	
КонецЕсли;
СтрокаЗапроса = Стр+"."+СтрокаЗапроса;
ПерваяСтрока = Истина;
Номер = 0;
Для Каждого Элемент Из Отбор Цикл
		
	Если Элемент.Использовать Тогда
	 Номер = Номер + 1;
	   Если ПерваяСтрока Тогда 
		   СтрТмп = " ГДЕ "+"ВыбранныйДокумент."+Элемент.Реквизит+"= &Параметр"+Формат(Номер, "ЧН=; ЧГ=");
		   СтрокаОтбора = СтрТмп;
		   Запрос.УстановитьПараметр("Параметр"+Формат(Номер, "ЧН=; ЧГ="), Элемент.Значение);
	   Иначе
		   СтрТмп = " И "+"ВыбранныйДокумент."+Элемент.Реквизит+"= &Параметр"+Формат(Номер, "ЧН=; ЧГ=");
		   СтрокаОтбора = СтрокаОтбора+СтрТмп;
		   Запрос.УстановитьПараметр("Параметр"+Формат(Номер, "ЧН=; ЧГ="), Элемент.Значение);
	   КонецЕсли;
	 
	ПерваяСтрока = Ложь;   

	КонецЕсли;
        	
КонецЦикла;                                  


Запрос.Текст = "ВЫБРАТЬ
				|	ВыбранныйДокумент.Ссылка
				|ИЗ
				|	 "+ СтрокаЗапроса +" КАК ВыбранныйДокумент" +СтрокаОтбора ; 
				
Сообщить(Запрос.Текст);
Выборка = Запрос.Выполнить().Выбрать();
Пока Выборка.Следующий() Цикл
	НовСтрока = РезультатОтбора.Добавить();
	Новстрока.Ссылка = Выборка.Ссылка;
	Новстрока.Вид = Метаданные.НайтиПоТипу(ВыборОбъектов.Типы()[0]).Имя;
КонецЦикла;
 				 

КонецПроцедуры

&НаКлиенте
Процедура РезультатОтбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмРеквизитНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ИзмРеквизитНачалоВыбораИзСпискаСервер();
КонецПроцедуры
&НаСервере
Процедура ИзмРеквизитНачалоВыбораИзСпискаСервер()
	    Элементы.ИзмРеквизит.СписокВыбора.ЗагрузитьЗначения(Отбор.Выгрузить().ВыгрузитьКолонку("Реквизит"));
				
КонецПроцедуры

&НаКлиенте
Процедура ДействиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	   ДействиеНачалоВыбораСервер(Элементы.ИзмРеквизит.ТекстРедактирования)
КонецПроцедуры
Процедура ДействиеНачалоВыбораСервер(Реквизит)
 Для Каждого Элем Из Метаданные.НайтиПоТипу(ВыборОбъектов.Типы()[0]).СтандартныеРеквизиты Цикл 
    	Если Элем.Имя = Реквизит Тогда 
    		Элементы.Действие.ОграничениеТипа = Новый ОписаниеТипов(Элем.Тип);       
    		Прервать;
    	КонецЕсли;
    	
    КонецЦикла;
 КонецПроцедуры


&НаКлиенте
Процедура Изменить(Команда)
	Для Каждого Элемент ИЗ РезультатОтбора Цикл
		Об = Элемент.Ссылка.ПолучитьОбъект();
		Выполнить("Об."+ИзмРеквизит+" = Действие;");
		Об.Записать();
		
		КонецЦикла;
	 
 КонецПроцедуры
