
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр СведенияОСчетах
	Движения.БанковскиеСчета.Записывать = Истина;
	Для Каждого ТекСтрокаСчета Из Счета Цикл
		Движение = Движения.БанковскиеСчета.Добавить();
		Движение.Счет = ТекСтрокаСчета.Счет;
		Движение.Банк = ТекСтрокаСчета.Банк;
	КонецЦикла;

	// регистр ОстаткиНаСчетах
	Движения.ОстаткиНаСчетах.Записывать = Истина;
	Для Каждого ТекСтрокаСчета Из Счета Цикл
		Движение = Движения.ОстаткиНаСчетах.Добавить();
		Движение.Период = Дата;
		Движение.Счет = ТекСтрокаСчета.Счет;
		Движение.Событие = ТекСтрокаСчета.ТипДокументаОтвета;
		Движение.Остаток = ТекСтрокаСчета.Остаток;
	КонецЦикла;

КонецПроцедуры
