
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СообщениеБанкротстваДанныеСообщения.Свойство КАК СвойствоСообщения,
	|	СообщениеБанкротстваДанныеСообщения.Значение КАК ЗначениеСообщения,
	|	СообщениеБанкротстваДанныеСообщения.ГУИД КАК ГУИД
	|ИЗ
	|	Документ.СообщениеБанкротства.ДанныеСообщения КАК СообщениеБанкротстваДанныеСообщения
	|ГДЕ
	|	СообщениеБанкротстваДанныеСообщения.Ссылка = &Ссылка
	|	И СообщениеБанкротстваДанныеСообщения.Значение <> """"";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей       = РегистрыСведений.ДанныеСообщенийОБанкротстве.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	Пока Выборка.Следующий() Цикл	
		НоваяЗапись        = НаборЗаписей.Добавить();
		НоваяЗапись.Период = Дата;		
		НоваяЗапись.Контрагент = Контрагент;
		НоваяЗапись.ИДДолжника = ИДДолжника;
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка);		  
	КонецЦикла;
	НаборЗаписей.Записать(); 
	
	НаборЗаписей       = РегистрыСведений.ИдентификаторыСообщенийБанкротство.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НоваяЗапись        = НаборЗаписей.Добавить();
	НоваяЗапись.ИДСообщения = Номер;
	НоваяЗапись.ИДДолжника = ИДДолжника;
	НоваяЗапись.НомерСудебногоДела = НомерСудебногоДела;
	НаборЗаписей.Записать(); 	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
		мНомерСудебногоДела = ДанныеСообщения.НайтиСтроки(Новый Структура("Свойство", Справочники.БанкротствоИерархияСвойств.НайтиПоРеквизиту("ПолныйПутьКДанным","Сообщение/CaseNumber/")));
		Если мНомерСудебногоДела.Количество( ) <> 0  Тогда
			НомерСудебногоДела = мНомерСудебногоДела[0].Значение;	
		КонецЕсли;
		
		мИДДолжника = ДанныеСообщения.НайтиСтроки(Новый Структура("Свойство", Справочники.БанкротствоИерархияСвойств.НайтиПоРеквизиту("ПолныйПутьКДанным","Сообщение/BankruptId/")));
		Если мИДДолжника.Количество() <> 0 Тогда
			ИДДолжника = мИДДолжника[0].Значение;	
		КонецЕсли;

		мТипСообщения = ДанныеСообщения.НайтиСтроки(Новый Структура("Свойство", Справочники.БанкротствоИерархияСвойств.НайтиПоРеквизиту("ПолныйПутьКДанным","Сообщение/MessageInfo/MessageType/")));
		Если мТипСообщения.Количество() <> 0 Тогда
			ТипСообщения = мТипСообщения[0].Значение;	
		КонецЕсли;	
		
		мТипСудебногоРешения = ДанныеСообщения.НайтиСтроки(Новый Структура("Свойство", Справочники.БанкротствоИерархияСвойств.НайтиПоРеквизиту("ПолныйПутьКДанным","Сообщение/MessageInfo/CourtDecision/DecisionType/Name/")));
		Если мТипСудебногоРешения.Количество() <> 0 Тогда
			ТипСудебногоРешения = мТипСудебногоРешения[0].Значение;	
		КонецЕсли;

КонецПроцедуры