
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		Абонент = ОбъектыСервер.РазыменоватьСсылку(ПараметрКоманды, "Должник");
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Контрагенты") Тогда
		Абонент = ПараметрКоманды;
	КонецЕсли;
	УсловияОтбора = Новый Структура("Объект", Абонент);
	ПараметрыФормы = Новый Структура("Отбор", УсловияОтбора);
	ОткрытьФорму("РегистрСведений.СообщенияСМС.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
