Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Для Каждого Эл из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Для каждого пЭл из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если Эл.ИдентификаторПользовательскойНастройки = пЭл.ИдентификаторПользовательскойНастройки Тогда
				Эл.Использование = пЭл.Использование; 
				Эл.ПравоеЗначение = пЭл.ПравоеЗначение;
			КонецЕсли;	
		КонецЦИКЛА;	
	КонецЦикла;
	КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//ДокументРезультат.ПоказатьУровеньГруппировокСтрок(YYYYY); //Здесь указываем УРОВЕНЬ группировки
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(2);
КонецПроцедуры   