
// Обработчик события нажатия на кнопку "Очистить" формы
//
&НаКлиенте
Процедура ОчиститьКлассификаторВыполнить()
	
	//Чуров А.И.
	ОткрытьФорму("РегистрСведений.АдресныйКлассификатор.Форма.ФормаОчисткиАдресногоКлассификатора");
	//ОткрытьФормуМодально("РегистрСведений.АдресныйКлассификатор.Форма.ФормаОчисткиАдресногоКлассификатора");
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

// Обработчик события нажатия на кнопку "Проверить обновление" формы
//
&НаКлиенте
Процедура ПроверитьОбновление()
	
	Результат = УдалитьАдресныйКлассификаторКлиент.ПроверитьОбновлениеАдресныхОбъектов();
	
	Если Не Результат.Статус Тогда
		УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение.Количество() <> 0 Тогда
		
		КоличествоОбновлений = 0;
		
		СписокСтрока = "";
		
		АдресныеОбъекты = Новый Массив;
		
		Для Каждого АО Из Результат.Значение Цикл
			Если АО.ОбновлениеДоступно Тогда
				КоличествоОбновлений = КоличествоОбновлений + 1;
				АдресныеОбъекты.Добавить(Лев(АО.КодАдресногоОбъекта, 2));
				СписокСтрока = СписокСтрока + Лев(АО.КодАдресногоОбъекта, 2)
				                            + " - " + АО.Наименование
				                            + " "   + АО.Сокращение + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
		
		Если КоличествоОбновлений > 0 Тогда
			Текст = НСтр("ru = 'На сервере присутствуют обновления для следующих адресных объектов:'")
						+ Символы.ПС
						+ СписокСтрока;
						
#Если ВебКлиент Тогда
			//Чуров
			ПоказатьПредупреждение(,Текст);
			//Предупреждение(Текст);
#Иначе
			Текст = Текст + НСтр("ru = 'Приступить к обновлению адресного классификатора?'");
			//Чуров
			//Результат = Вопрос(Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Обновление адресного классификатора");	
			//Если Результат = КодВозвратаДиалога.Да Тогда
			//	ОткрытьФорму("РегистрСведений.АдресныйКлассификатор.Форма.ФормаЗагрузкиАдресногоКлассификатора",
			//				Новый Структура("АдресныеОбъекты", АдресныеОбъекты) );
			//КонецЕсли;

			ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьОбновлениеЗавершение", ЭтаФорма, Новый Структура("АдресныеОбъекты, Текст", АдресныеОбъекты, Текст)), Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Обновление адресного классификатора");

#КонецЕсли
		Иначе
			//Чуров
			ПоказатьПредупреждение(,НСтр("ru = 'Обновление не требуется. Информационная база содержит актуальные адресные сведения.'"), , 
					НСтр("ru = 'Адресный классификатор'"));
			//Предупреждение(НСтр("ru = 'Обновление не требуется. Информационная база содержит актуальные адресные сведения.'"), , 
			//		НСтр("ru = 'Адресный классификатор'"));
		КонецЕсли;
	Иначе
		//Чуров
		ПоказатьПредупреждение(,НСтр("ru = 'Обновление не требуется. Информационная база содержит актуальные адресные сведения.'"), , 
				НСтр("ru = 'Адресный классификатор'"));
		//Предупреждение(НСтр("ru = 'Обновление не требуется. Информационная база содержит актуальные адресные сведения.'"), , 
		//		НСтр("ru = 'Адресный классификатор'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбновлениеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	АдресныеОбъекты = ДополнительныеПараметры.АдресныеОбъекты;
	Текст = ДополнительныеПараметры.Текст;
	
	//Чуров
	//Результат = Неопределено;
	//Результат = Вопрос(Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Обновление адресного классификатора");			
	//Если Результат = КодВозвратаДиалога.Да Тогда
	//	ОткрытьФорму("РегистрСведений.АдресныйКлассификатор.Форма.ФормаЗагрузкиАдресногоКлассификатора",
	//	Новый Структура("АдресныеОбъекты", АдресныеОбъекты) );
	//КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьОбновлениеЗавершениеЗавершение", ЭтаФорма, Новый Структура("АдресныеОбъекты", АдресныеОбъекты)), Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Обновление адресного классификатора");

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбновлениеЗавершениеЗавершение(РезультатВопроса1, ДополнительныеПараметры1) Экспорт
	
	АдресныеОбъекты = ДополнительныеПараметры1.АдресныеОбъекты;
	
	Результат = РезультатВопроса1;			
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьФорму("РегистрСведений.АдресныйКлассификатор.Форма.ФормаЗагрузкиАдресногоКлассификатора",
		Новый Структура("АдресныеОбъекты", АдресныеОбъекты) );
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеАдресногоКлассификатора" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКлассификатор(Команда)
	УдалитьАдресныйКлассификаторКлиент.ЗагрузитьАдресныйКлассификатор();
КонецПроцедуры
