
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЗначениеЗаполнено(ПользовательУслуги) Тогда
		ПользовательУслуги = Константы.СервисСУЛогин.Получить();	
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если Статус = Перечисления.ВидСтатусаЗаполненияСУ.КОтправкеКлиент Тогда
		МенеджерЗаписи = РегистрыСведений.КОтправкеДокументовСУКлиент.СоздатьМенеджерЗаписи();	
		МенеджерЗаписи.Документ = Ссылка;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.КОтправкеДокументовСУКлиент.СоздатьНаборЗаписей();	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		РеглЗад = РегламентныеЗадания.НайтиПредопределенное("Сервис_СудебныеУчастки");
		РеглЗад.Использование = Истина;
		РеглЗад.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	МенеджерЗаписи = РегистрыСведений.КОтправкеДокументовСУКлиент.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Документ = Ссылка;
	МенеджерЗаписи.Удалить();
КонецПроцедуры
