
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.СправкаОбОтсутствииЗадолженности.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СправкаОбОтсутствииЗадолженности.Ссылка КАК Ссылка,
	|	СправкаОбОтсутствииЗадолженности.ВерсияДанных КАК ВерсияДанных,
	|	СправкаОбОтсутствииЗадолженности.ПометкаУдаления КАК ПометкаУдаления,
	|	СправкаОбОтсутствииЗадолженности.Номер КАК Номер,
	|	СправкаОбОтсутствииЗадолженности.Дата КАК Дата,
	|	СправкаОбОтсутствииЗадолженности.Проведен КАК Проведен,
	|	СправкаОбОтсутствииЗадолженности.Договор КАК Договор,
	|	СправкаОбОтсутствииЗадолженности.Должник КАК Должник,
	|	СправкаОбОтсутствииЗадолженности.Цедент КАК Цедент,
	|	СправкаОбОтсутствииЗадолженности.ДатаЦессии КАК ДатаЦессии,
	|	СправкаОбОтсутствииЗадолженности.ДоговорЦессии КАК ДоговорЦессии,
	|	СправкаОбОтсутствииЗадолженности.ДатаВыдачи КАК ДатаВыдачи
	|ИЗ
	|	Документ.СправкаОбОтсутствииЗадолженности КАК СправкаОбОтсутствииЗадолженности
	|ГДЕ
	|	СправкаОбОтсутствииЗадолженности.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Тело = Макет.ПолучитьОбласть("Тело");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Тело.Параметры.Заполнить(Выборка);
		ФорматДаты = "ДФ=dd.MM.yyyy";
		Тело.Параметры.Дата = Формат(Выборка.Дата, ФорматДаты);
		Тело.Параметры.ДатаЦессии = Формат(Выборка.ДатаЦессии, ФорматДаты);
		Тело.Параметры.ДатаВыдачи = Формат(Выборка.ДатаВыдачи, ФорматДаты);
		ТабДок.Вывести(Тело, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
