
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Элементы.ЧасовойПояс.СписокВыбора.Очистить();
	Массив = ПолучитьДопустимыеЧасовыеПояса();
	МассивПредставлений = Новый Массив;
	Для Каждого Пояс Из Массив Цикл
		Если Найти(ПредставлениеЧасовогоПояса(Пояс), "GMT") > 0 И МассивПредставлений.Найти(ПредставлениеЧасовогоПояса(Пояс)) = Неопределено Тогда
			Строка = Элементы.ЧасовойПояс.СписокВыбора.Добавить(Пояс, ПредставлениеЧасовогоПояса(Пояс));
			МассивПредставлений.Добавить(ПредставлениеЧасовогоПояса(Пояс));
		КонецЕсли;
	КонецЦикла;
	Элементы.ЧасовойПояс.СписокВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	ФЗ_230.ЗаполнитьКонстантыИзФЗ();
	
	НаборКонстант.АдресИндекс = Константы.АдресИндекс.Получить();
	
	НаборКонстант.БудниВремяОт = Константы.БудниВремяОт.Получить();
	НаборКонстант.БудниВремяДо = Константы.БудниВремяДо.Получить();
	НаборКонстант.ВыходныеВремяОт = Константы.ВыходныеВремяОт.Получить();
	НаборКонстант.ВыходныеВремяДо = Константы.ВыходныеВремяДо.Получить();
	
	НаборКонстант.ЗвонкиДень = Константы.ЗвонкиДень.Получить();
	НаборКонстант.ЗвонкиНеделя = Константы.ЗвонкиНеделя.Получить();
	НаборКонстант.ЗвонкиМесяц = Константы.ЗвонкиМесяц.Получить();
	
	НаборКонстант.СообщенияДень = Константы.СообщенияДень.Получить();
	НаборКонстант.СообщенияНеделя = Константы.СообщенияНеделя.Получить();
	НаборКонстант.СообщенияМесяц = Константы.СообщенияМесяц.Получить();
	
	НаборКонстант.ОтзывПерсональныхДанных = Истина;
	НаборКонстант.ЧасовойПоясЗвонка = Истина;
	НаборКонстант.КоличествоРезультативныхЗвонков = Истина;
	НаборКонстант.КоличествоСМС = Истина;
	
	//++КазанцевЯА
	КалендарныеГрафикиПереопределяемый.ЗаполнитьКалендарьПо230ФЗ();
	//--КазанцевЯА
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьКалендарь230ФЗ(Команда)
	ПараметрыФормы = Новый Структура("Ключ", ПолучитьСсылкаНаПроизводственныеКалендариФЗ230());
	ОткрытьФорму("Справочник.ПроизводственныеКалендари.ФормаОбъекта",ПараметрыФормы);
КонецПроцедуры

Функция ПолучитьСсылкаНаПроизводственныеКалендариФЗ230()
	Возврат Справочники.ПроизводственныеКалендари.ФЗ230; 	
КонецФункции
