
&НаКлиенте
Процедура Сохранить(Команда)
	Закрыть(ПреобразоватьТЗ());
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивКонтрагентов = Параметры.ТаблицаКонтрагентов;	
	Для каждого Эл Из МассивКонтрагентов Цикл 
		НовСтр            = Контрагенты.Добавить();
		НовСтр.Контрагент = Эл;
	КонецЦикла;
	//Контрагенты.Загрузить(Параметры.ТаблицаКонтрагентов);
КонецПроцедуры

&НаСервере
Функция ПреобразоватьТЗ()
	ПустыеСтроки = Контрагенты.НайтиСтроки(Новый Структура("Контрагент",Справочники.Контрагенты.ПустаяСсылка()));
	Для каждого Строка Из ПустыеСтроки Цикл
		Контрагенты.Удалить(Строка);
	КонецЦикла;   
	//Возврат РеквизитФормыВЗначение("Контрагенты");
	Возврат Контрагенты;
КонецФункции