
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтаФорма.ОграничениеПоЗвонкам = Истина Тогда
		ЭтаФорма.ОграничениеИконка1 = БиблиотекаКартинок.ОформлениеЗнакВоcклицательныйЗнак;
		ЭтаФорма.Элементы.ОграничениеПоЗвонкам.ЦветТекста = WebЦвета.Красный;
	Иначе
		ЭтаФорма.ОграничениеИконка1 = БиблиотекаКартинок.ОформлениеЗнакФлажок;
		ЭтаФорма.Элементы.ОграничениеПоЗвонкам.ЦветТекста = WebЦвета.Зеленый;
	КонецЕсли;
	Если ЭтаФорма.ОграничениеПоСМС = Истина Тогда
		ЭтаФорма.Элементы.ОграничениеПоСМС.ЦветТекста = WebЦвета.Красный;
		ЭтаФорма.ОграничениеИконка2 = БиблиотекаКартинок.ОформлениеЗнакВоcклицательныйЗнак;
	Иначе
		ЭтаФорма.Элементы.ОграничениеПоСМС.ЦветТекста = WebЦвета.Зеленый;
		ЭтаФорма.ОграничениеИконка2 = БиблиотекаКартинок.ОформлениеЗнакФлажок;
	КонецЕсли;
	Если ЭтаФорма.ОграничениеПоВЦ = Истина Тогда
		ЭтаФорма.Элементы.ОграничениеПоВЦ.ЦветТекста = WebЦвета.Красный;
		ЭтаФорма.ОграничениеИконка3 = БиблиотекаКартинок.ОформлениеЗнакВоcклицательныйЗнак;
	Иначе
		ЭтаФорма.Элементы.ОграничениеПоВЦ.ЦветТекста = WebЦвета.Зеленый;
		ЭтаФорма.ОграничениеИконка3 = БиблиотекаКартинок.ОформлениеЗнакФлажок;
	КонецЕсли;
	Если ЭтаФорма.ОграничениеПоЗвонкам = Ложь
		И ЭтаФорма.ОграничениеПоСМС = Ложь
		И ЭтаФорма.ОграничениеПоВЦ = Ложь Тогда
		Сообщить("Ограничений по числу взаимодействий нет");
	КонецЕсли;
КонецПроцедуры
