
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтаФорма.ОграничениеПоЗвонкам = Истина Тогда
		ЭтаФорма.ОграничениеИконка1 = БиблиотекаКартинок.ОформлениеЗнакВоcклицательныйЗнак;
		ЭтаФорма.Элементы.ОграничениеПоЗвонкам.ЦветТекста = WebЦвета.Красный;
	Иначе
		ЭтаФорма.ОграничениеИконка1 = БиблиотекаКартинок.ОформлениеЗнакФлажок;
		ЭтаФорма.Элементы.ОграничениеПоЗвонкам.ЦветТекста = WebЦвета.Зеленый;
	КонецЕсли;
	Если ЭтаФорма.ОграничениеПоСообщениям = Истина Тогда
		ЭтаФорма.Элементы.ОграничениеПоСообщениям.ЦветТекста = WebЦвета.Красный;
		ЭтаФорма.ОграничениеИконка2 = БиблиотекаКартинок.ОформлениеЗнакВоcклицательныйЗнак;
	Иначе
		ЭтаФорма.Элементы.ОграничениеПоСообщениям.ЦветТекста = WebЦвета.Зеленый;
		ЭтаФорма.ОграничениеИконка2 = БиблиотекаКартинок.ОформлениеЗнакФлажок;
	КонецЕсли;
	Если ЭтаФорма.ОграничениеПоЗвонкам = Ложь
		И ЭтаФорма.ОграничениеПоСообщениям = Ложь Тогда
		Сообщить("Ограничений по числу взаимодействий нет");
	КонецЕсли;
КонецПроцедуры
