
&НаСервере
Процедура ПриОткрытииНаСервере()
	ЭтаФорма.РольАБД = РольДоступна("АБД");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Проверить доступность служебных функций
	ПриОткрытииНаСервере();	
	Если ЭтаФорма.РольАБД = Истина Тогда
		ЭтаФорма.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	// Записать текущие настройки
	ПоказатьОповещениеПользователя("Настройки проведения тех. работ",,"Настройки сохранены",БиблиотекаКартинок.NC_Сохранено);
	ЭтаФорма.Записать();
КонецПроцедуры
