Процедура ОткрытьФормуПечати(ФормаИнициатор, ОбъектИнициатор) Экспорт

	ПараметрыМероприятия = Новый Структура;
	ПараметрыМероприятия.Вставить("Объект", ОбъектИнициатор);
	ОткрытьФорму("Обработка.ПечатьУЭД.Форма.Форма", ПараметрыМероприятия, ФормаИнициатор, ОбъектИнициатор);

КонецПроцедуры

// ДанныеДляЗаполнения = Структура с данными;
#Область ЗаполнитьРеквизиты

Процедура ОткрытьФормуСЗаполнениемЗаполнитьРеквизиты(ИмяФормы, Источник, ДанныеДляЗаполнения) Экспорт

	ОткрытьФорму(ИмяФормы, , Источник);
	Если ДанныеДляЗаполнения.Свойство("ТабличнаяЧасть") Тогда
	
		Оповестить("ЗаполнитьТаблицу", ДанныеДляЗаполнения["ТабличнаяЧасть"], Источник);
		ДанныеДляЗаполнения.Удалить("ТабличнаяЧасть");
	
	КонецЕсли;
	Оповестить("ЗаполнитьОбъект", ДанныеДляЗаполнения, Источник);

КонецПроцедуры

Процедура ОбработатьОповещениеЗаполнитьРеквизиты(ОбъектФормы, ДанныеДляЗаполнения) Экспорт

	Для каждого СоответствиеДляЗаполнения Из ДанныеДляЗаполнения Цикл
	
		ОбъектФормы[СоответствиеДляЗаполнения.Ключ] = СоответствиеДляЗаполнения.Значение;
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

// ДанныеДляЗаполнения = Массив структур с данными;
#Область ЗаполнитьТаблицу

Процедура ОткрытьФормуСЗаполнениемТабличнойЧасти(ИмяФормы, Источник, ДанныеДляЗаполнения) Экспорт

	ОткрытьФорму(ИмяФормы, , Источник);
	Оповестить("ЗаполнитьТаблицу", ДанныеДляЗаполнения, Источник);

КонецПроцедуры

Процедура ОбработатьОповещениеЗаполнитьТаблицу(ТаблицаДляЗаполнения, ДанныеДляЗаполнения) Экспорт

	//ЗаполнитьЗначенияСвойств(стр,ИП);
	Для каждого ДанныеСтроки Из ДанныеДляЗаполнения Цикл

		СтрокаТаблицы = ТаблицаДляЗаполнения.Добавить();
		Для каждого СоответствиеДляЗаполнения Из ДанныеСтроки Цикл
		
			СтрокаТаблицы[СоответствиеДляЗаполнения.Ключ] = СоответствиеДляЗаполнения.Значение;
		
		КонецЦикла;
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ЗаполнитьВсюФорму



#КонецОбласти


