
Функция ЕстьДоступЭЦП() Экспорт

	Права = РольДоступна("тсАдминистрирование")
		ИЛИ РольДоступна("ПолныеПрава")
		ИЛИ РольДоступна("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	
	НастройкиЭЦП = ПолучитьНастройкиЭЦП();
	
	Возврат Права И НастройкиЭЦП;

КонецФункции // ()

Функция ПолучитьНастройкиЭЦП()

	Возврат Константы.ИспользоватьШифрование.Получить()
		И Константы.ИспользоватьЭлектронныеПодписи.Получить();

КонецФункции // ()

Функция ЕстьДоступНаПарсинг() Экспорт   
	
	ЕстьДоступ = РольДоступна("ПарсингДокументов") ИЛИ РольДоступна("ПолныеПрава"); 

	Возврат ЕстьДоступ;

КонецФункции // ()
