////////////////////////////////////////////////////////////////////////////////
// Для взаимодействия

&НаКлиенте
Функция УбратьВИмениФайла(Текст) Экспорт

	ЗапрещенныеСимволы = Список();
	
	НовыйТекст = Новый Массив;

	Номер = 0;
	Пока Номер < СтрДлина(Текст) Цикл
	
		Номер = Номер + 1;
		ТекущийСимвол = Сред(Текст, Номер, 1);
		Если ЗапрещенныеСимволы.Получить(ТекущийСимвол) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		НовыйТекст.Добавить(ТекущийСимвол);
	
	КонецЦикла;
	
	Возврат СтрСоединить(НовыйТекст, "");

КонецФункции // ()

&НаКлиенте
Функция Список() Экспорт

	ЗапрещенныеСимволы = Новый Соответствие;
	ЗапрещенныеСимволы.Вставить("\", Истина);
	ЗапрещенныеСимволы.Вставить("/", Истина);
	ЗапрещенныеСимволы.Вставить("|", Истина);
	ЗапрещенныеСимволы.Вставить("*", Истина);
	ЗапрещенныеСимволы.Вставить("?", Истина);
	ЗапрещенныеСимволы.Вставить(":", Истина);
	ЗапрещенныеСимволы.Вставить("""", Истина);
	ЗапрещенныеСимволы.Вставить("<", Истина);
	ЗапрещенныеСимволы.Вставить(">", Истина);
	
	Возврат ЗапрещенныеСимволы;

КонецФункции // ()
