////////////////////////////////////////////////////////////////////////////////
// Для взаимодействия

#Область ПрограммныйИнтерфейс

&НаКлиенте
Функция УбратьВИмениФайла(Текст) Экспорт

	ЗапрещенныеСимволы = Список();
	
	НовыйТекст = Новый Массив;

	Номер = 0;
	Пока Номер < СтрДлина(Текст) Цикл
	
		Номер = Номер + 1;
		ТекущийСимвол = Сред(Текст, Номер, 1);
		Если ЗапрещенныеСимволы.Получить(ТекущийСимвол) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		НовыйТекст.Добавить(ТекущийСимвол);
	
	КонецЦикла;
	
	Возврат СтрСоединить(НовыйТекст, "");

КонецФункции // ()

&НаКлиенте
Функция Список() Экспорт

	ЗапрещенныеСимволы = Новый Соответствие;
	ЗапрещенныеСимволы.Вставить("\", Истина);
	ЗапрещенныеСимволы.Вставить("/", Истина);
	ЗапрещенныеСимволы.Вставить("|", Истина);
	ЗапрещенныеСимволы.Вставить("*", Истина);
	ЗапрещенныеСимволы.Вставить("?", Истина);
	ЗапрещенныеСимволы.Вставить(":", Истина);
	ЗапрещенныеСимволы.Вставить("""", Истина);
	ЗапрещенныеСимволы.Вставить("<", Истина);
	ЗапрещенныеСимволы.Вставить(">", Истина);
	
	Возврат ЗапрещенныеСимволы;

КонецФункции // ()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция УбратьЗапрещенныеСимволыДляИмениФайлов(Текст) Экспорт

	Запрещенные = ЗапрещенныеСимволыВиндовс();
	
	Возврат Убрать(Текст, Запрещенные);

КонецФункции // ()

Функция УбратьЗапрещенныеСимволыДляБизнесПроцесса(Текст) Экспорт

	Запрещенные = ЗапрещенныеСимволыБизнесПроцессов();
	
	Возврат Убрать(Текст, Запрещенные);

КонецФункции // ()

Функция ПроверитьЗапрещенныеСимволыДляИмениФайлв(Текст) Экспорт

	Запрещенные = ЗапрещенныеСимволыВиндовс();
	
	Возврат Проверить(Текст, Запрещенные);

КонецФункции // ()

Функция ПроверитьЗапрещенныеСимволыДляБизнесПроцесса(Текст) Экспорт

	Запрещенные = ЗапрещенныеСимволыБизнесПроцессов();
	
	Возврат Проверить(Текст, Запрещенные);

КонецФункции // ()

#Область ОбрабатываемыеСимволы

Функция СимволыБизнесПроцессов() Экспорт

	НаборСимволов = ЗапрещенныеСимволыБизнесПроцессов();
	
	Возврат МассивСимволов(НаборСимволов);

КонецФункции // ()

Функция СимволыВиндовс() Экспорт

	НаборСимволов = ЗапрещенныеСимволыВиндовс();
	
	Возврат МассивСимволов(НаборСимволов);

КонецФункции // ()

Функция СимволыПробельные() Экспорт

	НаборСимволов = ПробельныеСимволы();
	
	Возврат МассивСимволов(НаборСимволов);

КонецФункции // ()

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Конфигурация

Функция ЗапрещенныеСимволыБизнесПроцессов()

	Набор = Новый Соответствие;
	
	Набор.Вставить("{", Истина);
	Набор.Вставить("}", Истина);
	Набор.Вставить("""", Истина);
	
	Возврат Набор;

КонецФункции // ()

Функция ЗапрещенныеСимволыВиндовс()

	Набор = Новый Соответствие;
	
	Набор.Вставить("\", Истина);
	Набор.Вставить("/", Истина);
	Набор.Вставить("*", Истина);
	Набор.Вставить(":", Истина);
	Набор.Вставить(">", Истина);
	Набор.Вставить("<", Истина);
	Набор.Вставить("?", Истина);
	Набор.Вставить("""", Истина);
	Набор.Вставить("|", Истина);
	
	Возврат Набор;

КонецФункции // ()

Функция ПробельныеСимволы()

	Набор = Новый Соответствие;
	
	Набор.Вставить(Символы.ВТаб, Истина);
	Набор.Вставить(Символы.ВК, Истина);
	Набор.Вставить(Символы.НПП, Истина);
	Набор.Вставить(Символы.ПС, Истина);
	Набор.Вставить(Символы.ПФ, Истина);
	Набор.Вставить(Символы.Таб, Истина);
	Набор.Вставить("¶", Истина);
	
	Возврат Набор;

КонецФункции // ()

#КонецОбласти

Функция МассивСимволов(НаборСимволов)

	Набор = Новый Массив;
	
	Для каждого ТекущийСимвол Из НаборСимволов Цикл
	
		Набор.Добавить(ТекущийСимвол.Ключ);
	
	КонецЦикла;
	
	Возврат Набор;

КонецФункции // ()

Функция Проверить(Знач Текст, Запрещенные)

	Текст = СокрЛП(Текст);
	СимволыТекста = СтрРазделитьНаСимволы(Текст);
	
	Пробельные = ПробельныеСимволы();
	
	Для каждого СимволТекста Из СимволыТекста Цикл
	
		Если Запрещенные.Получить(СимволТекста) = Истина Тогда
		
			Возврат Истина;
		
		КонецЕсли;
		
		Если Пробельные.Получить(СимволТекста) = Истина Тогда
		
			Возврат Истина;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции // ()

Функция Убрать(Знач Текст, Запрещенные)

	Текст = СокрЛП(Текст);
	СимволыТекста = СтрРазделитьНаСимволы(Текст);
	
	Результат = Новый Массив;
	
	Пробельные = ПробельныеСимволы();
	
	Для каждого СимволТекста Из СимволыТекста Цикл
	
		Если Запрещенные.Получить(СимволТекста) = Истина Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		Если Пробельные.Получить(СимволТекста) = Истина Тогда
		
			Результат.Добавить(" ");
			Продолжить;
		
		КонецЕсли;
		
		Результат.Добавить(СимволТекста);
	
	КонецЦикла;
	
	Возврат СтрСоединить(Результат, "");

КонецФункции // ()

Функция СтрРазделитьНасимволы(Знач Текст)

	Результат = Новый Массив;

	Номер = 1;
	Пока Номер <= СтрДлина(Текст) Цикл
	
		ТекущийСимвол = Сред(Текст, Номер, 1);
		Результат.Добавить(ТекущийСимвол);
		
		Номер = Номер + 1;
	
	КонецЦикла;
	
	Возврат Результат;

КонецФункции // ()


#КонецОбласти