Процедура ЗаписьВспомогательногоСправочникаМероприятие(Источник,Отказ) Экспорт
	
	Если Источник.обменДанными.Загрузка = Истина Тогда
		возврат;
	КонецЕсли;
	
	СправочникСсылка = Справочники.Мероприятия.НайтиПоКоду(Источник.Номер);
	Если СправочникСсылка = Неопределено или СправочникСсылка.Пустая() Тогда
		СправочникОбъект = Справочники.Мероприятия.СоздатьЭлемент();
	Иначе
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
	КонецЕсли;
	СправочникОбъект.Код = Источник.Номер;
	СправочникОбъект.Наименование = Источник.Наименование;
	СправочникОбъект.Дата = Источник.Дата;
	СправочникОбъект.Заказ = Источник.Заказ;
	СправочникОбъект.ТипМероприятия = Источник.ТипМероприятия;
	СправочникОбъект.Выполнена = Источник.Выполнена;
	СправочникОбъект.ПометкаУдаления = Источник.ПометкаУдаления;
	СправочникОбъект.ОбменДанными.Загрузка = Истина;
	//Мероприятие.ВыполнитьЗадачу();
	СправочникОбъект.Записать();
	
КонецПроцедуры

Процедура СоздатьМероприятие(Источник,Отказ) Экспорт
	
	//Если Источник.обменДанными.Загрузка = Истина Тогда
	//	возврат;
	//КонецЕсли;
	
	ЗадачаСсылка = Задачи.Мероприятия.НайтиПоНомеру(Источник.Код);
	Если ЗадачаСсылка = Неопределено или ЗадачаСсылка.Пустая() Тогда
		ЗадачаОбъект = Задачи.Мероприятия.СоздатьЗадачу();
	иначе
		ЗадачаОбъект = ЗадачаСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗадачаОбъект.Номер = Источник.Код;
	ЗадачаОбъект.Наименование = Источник.Наименование;
	ЗадачаОбъект.Дата = Источник.Дата;
	ЗадачаОбъект.Заказ = Источник.Заказ;
	ЗадачаОбъект.ТипМероприятия = Источник.ТипМероприятия;
	ЗадачаОбъект.Выполнена = Источник.Выполнена;
	ЗадачаОбъект.ПометкаУдаления = Источник.ПометкаУдаления;
	//Мероприятие.ВыполнитьЗадачу();
	ЗадачаОбъект.ОбменДанными.Загрузка = Истина;
	ЗадачаОбъект.Записать();

	
КонецПроцедуры //СоздатьМероприятие()