
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Макет = Отчеты.МировыеСоглашения.ПолучитьМакет("Макет");
	ТабДок.Очистить();
	
    ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(ОбластьЗаголовок);		
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	
	ТабДок.ФиксацияСверху = 4;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОбИзмененииДоговора.ОбъектУчета КАК ОбъектУчета,
		|	СведенияОбИзмененииДоговора.Ссылка КАК МировоеСоглашение,
		|	СведенияОбИзмененииДоговора.ДатаИзмененияДоговора КАК ДатаМС,
		|	СведенияОбИзмененииДоговора.ДатаВступленияИзменения КАК ДатаВступленияМСВСилу,
		|	СведенияОбИзмененииДоговора.ДатаПлановогоПрекращенияИзменения КАК ДатаПлановогоПрекращенияМС,
		|	СведенияОбИзмененииДоговора.ДатаФактическогоПрекращенияИзменения КАК ДатаФактическогоПрекращенияМС,
		|	СведенияОбИзмененииДоговора.ПолноеПрощение КАК ПолноеПрощениеОбязательства,
		|	СведенияОбИзмененииДоговора.ДатаПрекращенияОбязательства КАК ДатаПрощенияОбязательства,
		|	ИсполнительныеДокументы.ДатаИД КАК ДатаПолученияИД,
		|	ФССП_ИсполнительноеПроизводство.ДатаВозбуждения КАК ДатаВозбужденияИП
		|ИЗ
		|	Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
		|		ПРАВОЕ СОЕДИНЕНИЕ Документ.СведенияОбИзмененииДоговора КАК СведенияОбИзмененииДоговора
		|		ПО (СведенияОбИзмененииДоговора.ОбъектУчета = ИсполнительныеДокументы.Владелец)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФССП_ИсполнительноеПроизводство КАК ФССП_ИсполнительноеПроизводство
		|		ПО ИсполнительныеДокументы.Ссылка = ФССП_ИсполнительноеПроизводство.НомерИД
		|			И (НЕ СведенияОбИзмененииДоговора.ПометкаУдаления)
		|			И (СведенияОбИзмененииДоговора.Проведен)
		|			И (НЕ ФССП_ИсполнительноеПроизводство.ПометкаУдаления)
		|			И (НЕ ИсполнительныеДокументы.ПометкаУдаления)
		|ГДЕ
		|	СведенияОбИзмененииДоговора.ТипИзменения = &ТипИзменения"; 
	Запрос.УстановитьПараметр("ТипИзменения", Перечисления.НБКИ_ТипыИзмененияДоговора.МировоеСоглашение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		ОбластьДанных = Макет.ПолучитьОбласть("ДанныеОтчета"); 

		ЗаполнитьЗначенияСвойств(ОбластьДанных.Параметры, ВыборкаДетальныеЗаписи);  
		ТабДок.Вывести(ОбластьДанных);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
		
			
КонецПроцедуры
