
//Для ЛУЧа
//Процедура ПриЗаписи(Отказ, Замещение)
//	ДатаПроведения = ТекущаяДата();
//	Документ = ЭтотОбъект.Отбор.Регистратор.Значение;
//	ПлановаяЗадолженность = (ТипЗнч(ЭтотОбъект) = Тип("РегистрНакопленияНаборЗаписей.Счета"));
//	
//	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацииТоваровУслугФизическимЛицам") И 
//			Документ.ПоставитьВОчередь = Ложь Тогда
//		Возврат;	
//	КонецЕсли;
//	
//	Если ЭтотОбъект.Количество() = 0 Тогда
//		Набор = РегистрыСведений.ОчередьНаСинхронизациюОстатков.СоздатьМенеджерЗаписи();
//		
//		Набор.Документ = Документ;
//		Набор.ПлановаяЗадолженность = ПлановаяЗадолженность;		
//		Набор.ДатаПроведения = ДатаПроведения;
//		
//		Набор.Записать();
//		Возврат;
//	КонецЕсли;
//	
//	Для Каждого Элемент Из ЭтотОбъект Цикл
//		Набор = РегистрыСведений.ОчередьНаСинхронизациюОстатков.СоздатьМенеджерЗаписи();
//		
//		Набор.Документ = Документ;
//		Набор.Договор = Элемент.ДоговорКонтрагента;
//		Набор.ДвижениеПриход = (Элемент.ВидДвижения = ВидДвиженияНакопления.Приход);
//		Набор.ПлановаяЗадолженность = ПлановаяЗадолженность;
//		Набор.НомерСтроки_ = Элемент.НомерСтроки;
//
//		Набор.ДатаПроведения = ДатаПроведения;
//		Набор.Организация = Элемент.Организация;
//		Набор.ФактическаяДата = Элемент.ФактическаяДата;
//		Набор.Сумма = Элемент.Сумма;
//		
//		Набор.Записать();
//	КонецЦикла;	
//КонецПроцедуры
