
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Используется = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ОткрываемоеЗначение") Тогда
		ЗначениеВРеквизитФормы(Параметры.ОткрываемоеЗначение.ПолучитьОбъект(), "Объект");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ОткрытоИзВидаСкоринга() Тогда
	
		Элементы.Отбор.ТолькоПросмотр = Истина;
		Элементы.Используется.ТолькоПросмотр = Истина;
		Возврат;
	
	КонецЕсли;

	ВариантОтбора = ВладелецФормы.Родитель.ПолучитьТекущийВариантОтбора(Объект.Код);
	Если ВариантОтбора <> Неопределено Тогда
	
		Объект.Отбор = ВариантОтбора;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ОткрытоИзВидаСкоринга()

	Возврат ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы")
			И ТипЗнч(ВладелецФормы.Родитель) = Тип("ФормаКлиентскогоПриложения")
			И ВладелецФормы.Родитель.ИмяФормы = "ПланВидовХарактеристик.ВидыСкоринга.Форма.ФормаЭлемента";

КонецФункции // ()

#Область Действия

&НаКлиенте
Процедура ДействияПередНачаломИзменения(Элемент, Отказ)
	ТекСтрока = Элементы.Действия.ТекущиеДанные;
	Если ТекСтрока.Действие = ПредопределенноеЗначение(
			"Перечисление.ВариантыДействийДляСкоринга.ПроизвольноеДействие") Тогда        
		Если ТипЗнч(ТекСтрока.Шаблон) <> Тип("СправочникСсылка.ДействияДляКатегорийСкоринга") Тогда
			ТекСтрока.Шаблон = ПредопределенноеЗначение(
					"Справочник.ДействияДляКатегорийСкоринга.ПустаяСсылка");
		КонецЕсли;		
	Иначе
		Если ТипЗнч(ТекСтрока.Шаблон) <> Тип("СправочникСсылка.ШаблоныТекстаДляАвтоинформирования") Тогда
			ТекСтрока.Шаблон = ПредопределенноеЗначение(
					"Справочник.ШаблоныТекстаДляАвтоинформирования.ПустаяСсылка");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДействияДействиеПриИзменении(Элемент)
	ТекСтрока = Элементы.Действия.ТекущиеДанные;
	Если ТекСтрока.Действие = ПредопределенноеЗначение(
			"Перечисление.ВариантыДействийДляСкоринга.ПроизвольноеДействие") Тогда
		Если ТипЗнч(ТекСтрока.Шаблон) <> Тип("СправочникСсылка.ДействияДляКатегорийСкоринга") Тогда
			ТекСтрока.Шаблон = ПредопределенноеЗначение(
					"Справочник.ДействияДляКатегорийСкоринга.ПустаяСсылка");
		КонецЕсли;	
	Иначе
		Если ТипЗнч(ТекСтрока.Шаблон) <> Тип("СправочникСсылка.ШаблоныТекстаДляАвтоинформирования") Тогда
			ТекСтрока.Шаблон = ПредопределенноеЗначение(
					"Справочник.ШаблоныТекстаДляАвтоинформирования.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Используется = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОтборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
	
	ВариантОтбора = ВладелецФормы.Родитель.ПолучитьТекущийВариантОтбора(Объект.Код);
	ОткрытьНастройкуОтбора(ВариантОтбора);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуОтбора(ВариантОтбора)

	ПараметрыВарианта = Новый Структура;
	ПараметрыВарианта.Вставить("Отбор", ВариантОтбора);
	ПараметрыВарианта.Вставить("Владелец", Объект.Владелец);
	
	ОткрытьФорму(
		"Справочник.Категории.Форма.ФормаНастройкиОтбора",
		ПараметрыВарианта,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		Новый ОписаниеОповещения("ОбновитьКомпоновщикВладельца", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКомпоновщикВладельца(ДанныеЗакрытия, ДополнительныеПараметры) Экспорт

	Если ДанныеЗакрытия = Неопределено Тогда
	
		Возврат;
	
	КонецЕсли;
	
	Результат = ДанныеЗакрытия["Результат"];
	Если Не Результат Тогда
	
		Возврат;
	
	КонецЕсли;
	
	Объект.Отбор = ДанныеЗакрытия["ПредставлениеОтбора"];
	
	ДанныеОбновления = Новый Структура;
	ДанныеОбновления.Вставить("Отбор", ДанныеЗакрытия["Отбор"]);
	ДанныеОбновления.Вставить("КодКатегории", Объект.Код);
	Оповестить("ОбновитьКатегориюСкоринга", ДанныеОбновления, Объект.Ссылка);
	Записать();

КонецПроцедуры
