Процедура ОжидатьЗавершение(Контролер, Описание) Экспорт

	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		Контролер["Ожидание"],
		Описание["ОповещениеОЗавершении"],
		Описание["ПараметрыОжидания"]
	);

КонецПроцедуры // ()

Функция ПотокВыполняется(Контроллер) Экспорт

	Возврат Контроллер["Статус"] = "Выполняется";

КонецФункции // ()

Функция ВПотокеОшибки(Контроллер) Экспорт

	Возврат Контроллер["Статус"] = "Ошибка";

КонецФункции // ()

Функция ТекстОшибки(Контроллер) Экспорт

	Если Не ЗначениеЗаполнено(Контроллер["Ожидание"]) Тогда
	
		Возврат "";
	
	КонецЕсли;
	
	Возврат Контроллер["Ожидание"]["КраткоеПредставлениеОшибки"];

КонецФункции 

//  ОповещениеОЗавершении  - ОписаниеОповещения - оповещение, которое вызывается при завершении фонового задания. 
//                           Параметры процедуры-обработчика оповещения: 
//   * Результат - Структура, Неопределено - структура со свойствами или Неопределено, если задание было отменено. Свойства: 
//	   ** Статус           - Строка - "Выполнено", если задание было успешно выполнено;
//	                                  "Ошибка", если задание завершено с ошибкой.
//	   ** АдресРезультата  - Строка - адрес временного хранилища, в которое будет
//	                                  помещен (или уже помещен) результат работы процедуры.
//	   ** АдресДополнительногоРезультата - Строка - если установлен параметр ДополнительныйРезультат, 
//	                                     содержит адрес дополнительного временного хранилища,
//	                                     в которое будет помещен (или уже помещен) результат работы процедуры.
//	   ** КраткоеПредставлениеОшибки   - Строка - краткая информация об исключении, если Статус = "Ошибка".
//	   ** ПодробноеПредставлениеОшибки - Строка - подробная информация об исключении, если Статус = "Ошибка".
//	   ** Сообщения        - ФиксированныйМассив, Неопределено - массив объектов СообщениеПользователю, 
//                                                сформированных в процедуре-обработчике длительной операции.
//   * ДополнительныеПараметры - Произвольный - произвольные данные, переданные в описании оповещения. 
//  ПараметрыОжидания      - Структура - см. ДлительныеОперацииКлиент.ПараметрыОжидания.
Функция ОписаниеПользовательскогоОтображения(ФормаВладелец, ПараметрыОтображения) Экспорт

	ПараметрыОжидания = НастроитьПараметрыОжидания(ФормаВладелец, ПараметрыОтображения);
	
	ОповещениеОЗавершении = ПараметрыОтображения["ОповещениеОЗавершении"];
	
	Описание = Новый Структура;
	Описание.Вставить("ПараметрыОжидания", ПараметрыОжидания);
	Описание.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	
	Возврат Описание;

КонецФункции // ()

// Возвращаемое значение:
//  Структура              - параметры выполнения задания: 
//   * ФормаВладелец          - УправляемаяФорма, Неопределено - форма, из которой вызывается длительная операция.
//   * ТекстСообщения         - Строка - текст сообщения, выводимый на форме ожидания.
//                                       Если не задан, то выводится "Пожалуйста, подождите...".
//   * ВыводитьОкноОжидания   - Булево - если Истина, то открыть окно ожидания с визуальной индикацией длительной операции. 
//                                       Если используется собственный механизм индикации, то следует указать Ложь.
//   * ВыводитьПрогрессВыполнения - Булево - выводить прогресс выполнения в процентах на форме ожидания.
//   * ОповещениеОПрогрессеВыполнения - ОписаниеОповещения - оповещение, которое периодически вызывается при 
//                                      проверке готовности фонового задания. Параметры процедуры-обработчика оповещения:
//     ** Прогресс - Структура, Неопределено - структура со свойствами или Неопределено, если задание было отменено. Свойства: 
//	     *** Статус               - Строка - "Выполняется", если задание еще не завершилось;
//                                           "Выполнено", если задание было успешно выполнено;
//	                                         "Ошибка", если задание завершено с ошибкой;
//                                           "Отменено", если задание отменено пользователем или администратором.
//	     *** ИдентификаторЗадания - УникальныйИдентификатор - идентификатор запущенного фонового задания.
//	     *** Прогресс             - Структура, Неопределено - результат функции ДлительныеОперации.ПрочитатьПрогресс, 
//                                                            если ВыводитьПрогрессВыполнения = Истина.
//	     *** Сообщения            - ФиксированныйМассив, Неопределено - если ВыводитьСообщения = Истина, массив объектов СообщениеПользователю, 
//                                  очередная порция сообщений, сформированных в процедуре-обработчике длительной операции.
//     ** ДополнительныеПараметры - Произвольный - произвольные данные, переданные в описании оповещения. 
//
//   * ВыводитьСообщения      - Булево - выводить в оповещения о завершении и прогресс сообщения, 
//                                       сформированные в процедуре-обработчике длительной операции.
//   * Интервал               - Число  - интервал в секундах между проверками готовности длительной операции.
//                                       По умолчанию 0 - после каждой проверки интервал увеличивается с 1 до 15 секунд
//                                       с коэффициентом 1.4.
//   * ОповещениеПользователя - Структура - содержит свойства:
//     ** Показать            - Булево - если Истина, то по завершении длительной операции вывести оповещение пользователя.
//     ** Текст               - Строка - текст оповещения пользователя.
//     ** НавигационнаяСсылка - Строка - навигационная ссылка оповещения пользователя.
//     ** Пояснение           - Строка - пояснение оповещения пользователя.
//   
//   * ПолучатьРезультат - Булево - Служебный параметр. Не предназначен для использования.
Функция НастроитьПараметрыОжидания(ФормаВладелец, ПараметрыОтображения)

	Результат = ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаВладелец);
	Результат.Вставить("ТекстСообщения", ПараметрыОтображения["Сообщение"]);
	Результат.Вставить("ВыводитьПрогрессВыполнения", Истина);
	//	Результат.Вставить("ОповещениеОПрогрессеВыполнения", Неопределено);
	// Результат.Вставить("ВыводитьСообщения", Ложь);
	
	//ОповещениеПользователя = Новый Структура;
	//ОповещениеПользователя.Вставить("Показать", Истина);
	//ОповещениеПользователя.Вставить("Текст", "Завершено");
	//ОповещениеПользователя.Вставить("НавигационнаяСсылка", Неопределено);
	//ОповещениеПользователя.Вставить("Пояснение", Неопределено);
	//Результат.Вставить("ОповещениеПользователя", ОповещениеПользователя);
	
	Возврат Результат;

КонецФункции // ()

