
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Ахантер = "https://www.ahunter.ru/site/demo/address";	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(Отказ)
	ЭтаФорма.РольАБД = РольДоступна("АБД");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Получить непредопредленное значение с сервера
	ПриОткрытииНаСервере(Отказ);
	// Проверить права доступа
	Если ЭтаФорма.РольАБД = Ложь Тогда
		Предупреждение("Нарушение прав доступа",,"Предупреждение");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Нормализовать(Команда)
	document = ЭтаФорма.Элементы.Ахантер.Документ;
	adress = document.querySelector("#js-AddressField");
	adress.value = ЭтаФорма.АдресДляНормализации;
	searchbutton = document.querySelector(".u-ButtonGrey");
	searchbutton.click();
	ПодключитьОбработчикОжидания("ПолучитьГАР", 1, Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьГАР()
	document = Элементы.Ахантер.Документ;
	gar = document.querySelector(".b-Table:nth-child(4) > .b-Row:nth-child(4) > .b-LPaddingStd").firstChild.nodeValue;
	ЭтаФорма.РезультатНормализации = gar;
КонецПроцедуры

