
Функция ПолучитьКоличествоДел(Сотрудник, ТипСотрудника) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(*) КАК КолВо
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(&ТекДата, Сотрудник = &Ответственный) КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |		ПО ОбъектыВРаботеОстатки.Объект = ОтветственныеСотрудники.Объект
	                      |			И (ОтветственныеСотрудники.ТипСотрудника = &ТипСотрудника)
	                      |			И (ОтветственныеСотрудники.Пользователь = &Ответственный)
	                      |			И Не ОбъектыВРаботеОстатки.Объект.ПометкаУдаления");
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТипСотрудника", ТипСотрудника);
	Запрос.УстановитьПараметр("Ответственный", Сотрудник);
	Возврат Запрос.Выполнить().Выгрузить()[0].КолВо;
КонецФункции
