
#Область ПрограммныйИнтерфейс

Функция РасширенияШаблоновWordOpenOffice() Экспорт

	Возврат "Шаблон документа (*.dot;*.dotx;*.ott)|*.dot;*.dotx;*.ott|";

КонецФункции // ()

Функция РасширенияШаблоновУниверсальное() Экспорт

	Возврат "Шаблон документа(*.docx)|*.docx|";

КонецФункции

Функция ФорматУниверсальногоФайла() Экспорт

	ЗашитыеДанные = УправлениеПечатьюУЗВспомогательныйКлиентСервер;
	Возврат ЗашитыеДанные.ФорматУниверсальногоФайла();

КонецФункции // ()

Функция ФорматPDFФайла() Экспорт

	Возврат ".pdf";

КонецФункции

Функция ФорматZIPФайла() Экспорт

	Возврат ".zip";

КонецФункции

Функция ИмяФайлаССодержимымВАрхивеDOCX(Каталог) Экспорт

	Возврат Каталог + "word" + ПолучитьРазделительПути() + "document.xml";

КонецФункции // ()

Функция ТекстНовойСтрокиАрхиваDOCX() Экспорт

	Возврат "<w:p w:rsidRDefault=""005874EA"" w:rsidR=""005874EA""><w:r><w:br w:type=""page""/></w:r></w:p>";

КонецФункции

#КонецОбласти
