
&НаКлиенте
Процедура ОК(Команда)
	//Оповестить("ОК_ПереименованиеФайла",ИмяФайла);
	ЭтаФорма.Закрыть(ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Если СокрЛП(ИмяФайла)="" Тогда 
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Имя файла не должно быть пустым";
	Сообщение.Поле = "ИмяФайла" ;
	Сообщение.Сообщить();
	Отказ = Истина;
	КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНовоеИмяФайла(РезультатЗакрытия,Параметры) Экспорт
	ДопПарам = Новый Структура;
	ДопПарам.Вставить("Диалог", Параметры.Диалог);
	ДопПарам.Вставить("Расширение",Параметры.Файл.Расширение);
	ДопПарам.Вставить("НовоеИмяФайла",РезультатЗакрытия);
	КудаЗаписать = Параметры.Диалог.Каталог + "\" + РезультатЗакрытия + Параметры.Файл.Расширение;
	Параметры.Данные.НачатьЗапись(Новый ОписаниеОповещения("ЗавершениеЗаписиПереименование",ЭтаФорма,ДопПарам),КудаЗаписать);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеЗаписиПереименование(ДопПарам) Экспорт
	Диалог = ДопПарам.Диалог;
	Расширение = ДопПарам.Расширение;
	ИмяФайла = ДопПарам.НовоеИмяФайла;
	ПутьКФайлу = строка(Диалог.Каталог + "\" + ИмяФайла+Расширение);
	Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
	НачатьЗапускПриложения(Оповещение,ПутьКФайлу,,Истина);
КонецПроцедуры