
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектыСервер.ОграничитьТипОбъекта(Элементы.ОбъектыОбъект);
	
	//
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
	
	Элементы.Схема.ТолькоПросмотр = (Объект.Операция = 
			ПредопределенноеЗначение("Справочник.ОперацииБП.Произвольная"));
			
	МассивДанных = Объект.Ссылка.ТочкаСтарта.Получить();
	Если МассивДанных <> Неопределено Тогда
		ТСИсполнитель = МассивДанных.ТСИсполнитель;
		ТСОбъектРодитель = МассивДанных.ТСОбъектРодитель;
		ТССхема = МассивДанных.ТССхема;
		ТСТипМероприятия = МассивДанных.ТСТипМероприятия;
		ТСТочка = МассивДанных.ТСТочка;
		ТСМассив.Загрузить(МассивДанных.ТСМассив);
	КонецЕсли;
	
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
	Элементы.ОбъектыПодборПоНастройкам.Видимость = Константы.ИспользоватьНастройкиПодбораОбъектовУчета.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ОперацияПриИзменении(Элемент)
	Элементы.Схема.ТолькоПросмотр = (Объект.Операция = 
			ПредопределенноеЗначение("Справочник.ОперацииБП.Произвольная"));
			
	ЗаполнитьСхему();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСхему()
	Объект.Схема = РегистрыСведений.НастройкиБП.ПолучитьСхемуПоОперации(Объект.Организация, Объект.Подразделение, Объект.Операция);
КонецПроцедуры

&НаСервере
Процедура ПодборВтаблЧасть(Результат)
	Об = РеквизитФормыВЗначение("Объект");		
	РаботаСДокументами.ЗанестиРезультатПодбораВТабличнуюЧасть(Об.ДолговыеОбязательства, Результат);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСтадию(Команда)
	#Если Вебклиент Тогда
		Сообщить("Данный функционал не доступен на Веб-клиенте!");
		Объект.ТССтартоватьСВыбраннойСтадии = Ложь;
	#Иначе
		
		Форма = ПолучитьФорму("Документ.ЗапускБП.Форма.ФормаТочкиСтарта",, ЭтотОбъект);
		Форма.ТекСхема = Объект.Схема;
		//Чуров
		//Если ОткрытьФорму(Форма) = Истина Тогда
		//Если Форма.ОткрытьМодально() = Истина Тогда
		//Форма.ОткрытьМодально();
		ОткрытьФорму(Форма);
		//Форма.Открыть();
		//ТСИсполнитель = Форма.ТСИсполнитель;
		//Объект.ТСМероприятие = Форма.ТСМероприятие;
		//ТСОбъектРодитель = Форма.ТСОбъектРодитель;
		//Объект.ТСПуть = Форма.ТСПуть;
		//ТССхема = Форма.ТССхема;
		//ТСТипМероприятия = Форма.ТСТипМероприятия;
		//ТСТочка = Форма.ТСТочка;
		//
		//ТСМассив.Очистить();
		//Для Каждого Элемент Из Форма.ТСМассив Цикл
		//	НоваяСтрока = ТСМассив.Добавить();
		//	НоваяСтрока.Идентификатор = Элемент.Идентификатор;
		//	НоваяСтрока.Схема = Элемент.Схема;
		//	НоваяСтрока.ОбъектРодитель = Элемент.ОбъектРодитель;
		//КонецЦикла;
		//КонецЕсли;
	#КонецЕсли	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФормуДокументаИзФормыТочкиСтарта(ФормаТочкиСтарта)
	Форма = ФормаТочкиСтарта;
	ТСИсполнитель = Форма.ТСИсполнитель;
	Объект.ТСМероприятие = Форма.ТСМероприятие;
	ТСОбъектРодитель = Форма.ТСОбъектРодитель;
	Объект.ТСПуть = Форма.ТСПуть;
	ТССхема = Форма.ТССхема;
	ТСТипМероприятия = Форма.ТСТипМероприятия;
	ТСТочка = Форма.ТСТочка;
	ТСМассив.Очистить();
	Для Каждого Элемент Из Форма.ТСМассив Цикл
		НоваяСтрока = ТСМассив.Добавить();
		НоваяСтрока.Идентификатор = Элемент.Идентификатор;
		НоваяСтрока.Схема = Элемент.Схема;
		НоваяСтрока.ОбъектРодитель = Элемент.ОбъектРодитель;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПоместитьВХранилище(Отказ);
КонецПроцедуры

&НаСервере
Процедура ПоместитьВХранилище(Отказ)
	МассивДанных = Новый Структура("ТСИсполнитель, ТСОбъектРодитель, ТССхема, ТСТипМероприятия, ТСТочка, ТСМассив", 
			ТСИсполнитель, ТСОбъектРодитель, ТССхема, ТСТипМероприятия, ТСТочка, ТСМассив.Выгрузить());
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ПоместитьВХранилище(МассивДанных);
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПолеПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтрокуОбъект(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Элементы.ОбъектыОбъект.ВыбиратьТип = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элементы.ОбъектыОбъект.ВыбиратьТип = (Элементы.Объекты.ТекущиеДанные.Объект = Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.ЗапускБП.Форма.ФормаТочкиСтарта" Тогда
		Если ВыбранноеЗначение <> Неопределено Тогда
			ЗаполнитьФормуДокументаИзФормыТочкиСтарта(ИсточникВыбора);
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПодборПоНастройкам(Команда)
	ОбъектыКлиент.ПодборПоНастройкам(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Источник)
	Если ИмяСобытия = "УдалитьДублиОбъектов" И Источник = "ФормаПодборДО" Тогда
		УдалитьДублиОбъектовПодбора();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьДублиОбъектовПодбора()
	ТЗ = Объект.Объекты.Выгрузить();
	ТЗ.Свернуть("Объект");
	Объект.Объекты.Загрузить(ТЗ);
КонецПроцедуры



