
Функция ПолучитьДанныеПоиска(мСлова, ТЗПадежиМесяцов, ПДДлинаСловаВСимволах, ЗаглавныеБуквыЦифры) Экспорт

	СловаПоиска = Новый Массив;
	ДатыПоиска = Новый Массив;
	Для Индекс = 0 По мСлова.ВГраница() Цикл
		Слово = мСлова[Индекс];
		Если СтрДлина(Слово) >= ПДДлинаСловаВСимволах Тогда
			
			Месяц = ТЗПадежиМесяцов.Найти(Слово, "Месяц");
			НайденаяДата = СтроковыеФункцииКлиентСервер.СтрокаВДату(Слово);
			Если Месяц <> Неопределено
				И Индекс <> 0
				И Индекс <> мСлова.ВГраница()
				И Индекс <> мСлова.ВГраница() - 1 Тогда
				
				НайденаяДата = СтроковыеФункцииКлиентСервер.СтрокаВДату(
					мСлова[Индекс - 1] + "." + Месяц.Номер + "." + мСлова[Индекс + 1]
				);
				Если ТипЗнч(НайденаяДата) = Тип("Дата") И НайденаяДата < Дата(2077, 1, 1) Тогда
					ДатыПоиска.Добавить(НайденаяДата);
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(НайденаяДата) = Тип("Дата") И НайденаяДата <> Дата(1, 1, 1) И НайденаяДата < Дата(2077, 1, 1) Тогда
				ДатыПоиска.Добавить(НайденаяДата);
			ИначеЕсли ЗаглавныеБуквыЦифры Тогда
				
				НайденоеСлово = ЗаглавныеБуквыЦифрыСлова(Слово);
				Если НайденоеСлово <> Неопределено Тогда
					СловаПоиска.Добавить(НайденоеСлово);
				КонецЕсли;
				
			Иначе
				СловаПоиска.Добавить(Слово);	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеПоиска = Новый Структура;
	ДанныеПоиска.Вставить("Слова", СловаПоиска);
	ДанныеПоиска.Вставить("Даты", ДатыПоиска);
	
	Возврат ДанныеПоиска;

КонецФункции

Функция ЗаглавныеБуквыЦифрыСлова(Знач Слово)
	
	ПервыйСимвол = Лев(Слово,1);
	
	Если ПервыйСимвол = ВРег(ПервыйСимвол) Тогда
		Возврат Слово;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
