
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ФиксированиеПогашенийОбеспечительством    
	Если ЭтотОбъект.ПогашеноОсновноеОбязательство Тогда
		Движения.ФиксированиеПогашенийОбеспечительством.Записывать = Истина;
		Движение = Движения.ФиксированиеПогашенийОбеспечительством.Добавить();
		Движение.Период = ЭтотОбъект.ДатаПрекращенияОбеспечительства;
		Движение.ОбъектОбеспечительства = ОбъектОбеспечительства;
		Движение.ВидОбеспечения = ВидОбеспечения;
		//По умолчанию Обеспечительством гасится вся сумма, возможно переделать!   
		стрЗадолженность = ОбъектыСервер.ВычислитьЗадолженностьНаДату(ОбъектОбеспечительства, ТекущаяДатаСеанса()); 
		Задолженность = стрЗадолженность[0].Сумма;
		Движение.СуммаПогашеннаяОбеспечением = Задолженность;
		Движение.КодНБКИОбеспечения = КредитныеИстории.ВычислитьКодВидаОбеспечительства(ВидОбеспечения);
		
		СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектОбеспечительства, ЭтотОбъект.Ссылка, "2.5");
		
		Если НЕ СобытиеЗафиксировано Тогда 
			КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектОбеспечительства, Движение.Период, ЭтотОбъект.Ссылка,"2.5");
		КонецЕсли; 
		
	КонецЕсли;	  
	
	СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектОбеспечительства, ЭтотОбъект.Ссылка, "2.4");
	
	Если НЕ СобытиеЗафиксировано Тогда 
		КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектОбеспечительства, ЭтотОбъект.ДатаЗаключенияДоговора, ЭтотОбъект.Ссылка,"2.4");
	КонецЕсли;  


КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		ВалютаСтоимостиПредметаДоговора = ДанныеЗаполнения.ВалютаДоговора;
		ОбъектОбеспечительства = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры    

Процедура ОбработкаУдаленияПроведения(Отказ)
	КредитныеИстории.УдалитьСобытияИсточника(ОбъектОбеспечительства, ЭтотОбъект.Ссылка);
КонецПроцедуры


