
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Проверка - Есть владелец формы, есть реквизит ИмяФормы у Владельца
	Если ЭтаФорма.ВладелецФормы = Неопределено
		ИЛИ ТипЗнч(ЭтаФорма.ВладелецФормы) <> Тип("ФормаКлиентскогоПриложения") Тогда
	
		Возврат;
	
	КонецЕсли;
	
	Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.ЗагрузкаДанныхДолжника.Форма.ФормаДокумента" Тогда
		Объект.Назначение = "Документ ссылка: Загрузка данных должника";
	ИначеЕсли ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.ПоступлениеПлатежей.Форма.ФормаДокумента" Тогда
		Объект.Назначение = "Документ ссылка: Поступление платежей";
	ИначеЕсли ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.ЗагрузкаЗадолженности.Форма.ФормаДокумента" Тогда
		Объект.Назначение = "Документ ссылка: Загрузка задолженности";
	ИначеЕсли ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.АктуализацияЗадолженности.Форма.ФормаДокумента" Тогда
		Объект.Назначение = "Документ ссылка: Актуализация задолженности";
	КонецЕсли;
	// Проверка у Владельца у реквизита Объект, ВыборСоответствий есть в Объекте,
	Если ЭтаФорма.ВладелецФормы.Объект.Свойство("ВыборСоответствий") = Ложь Тогда
	
		Возврат;
	
	КонецЕсли;
	Таблица = ЭтаФорма.ВладелецФормы.Объект.ВыборСоответствий;
	ЗаполнитьТаблицу(Таблица);
	//Попытка
	//	Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.ЗагрузкаДанныхДолжника.Форма.ФормаДокумента" Тогда
	//		Объект.Назначение = "Документ ссылка: Загрузка данных должника";
	//	ИначеЕсли ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.ПоступлениеПлатежей.Форма.ФормаДокумента" Тогда
	//		Объект.Назначение = "Документ ссылка: Поступление платежей";
	//	ИначеЕсли ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.ЗагрузкаЗадолженности.Форма.ФормаДокумента" Тогда
	//		Объект.Назначение = "Документ ссылка: Загрузка задолженности";
	//	ИначеЕсли ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.АктуализацияЗадолженности.Форма.ФормаДокумента" Тогда
	//		Объект.Назначение = "Документ ссылка: Актуализация задолженности";
	//	КонецЕсли;
	//	Таблица = ЭтаФорма.ВладелецФормы.Объект.ВыборСоответствий;
	//	ЗаполнитьТаблицу(Таблица);
	//Исключение
	//КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу(Таблица)
	Объект.ВыборСоответствий.Загрузить(Таблица.Выгрузить());
КонецПроцедуры
