
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Попытка
		Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.ЗагрузкаДанныхДолжника.Форма.ФормаДокумента" Тогда
			Объект.Назначение = "Документ ссылка: Загрузка данных должника";
		ИначеЕсли ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.ПоступлениеПлатежей.Форма.ФормаДокумента" Тогда
			Объект.Назначение = "Документ ссылка: Поступление платежей";
		ИначеЕсли ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.ЗагрузкаЗадолженности.Форма.ФормаДокумента" Тогда
			Объект.Назначение = "Документ ссылка: Загрузка задолженности";
		ИначеЕсли ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.АктуализацияЗадолженности.Форма.ФормаДокумента" Тогда
			Объект.Назначение = "Документ ссылка: Актуализация задолженности";
		КонецЕсли;
		Таблица = ЭтаФорма.ВладелецФормы.Объект.ВыборСоответствий;
		ЗаполнитьТаблицу(Таблица);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу(Таблица)
	Объект.ВыборСоответствий.Загрузить(Таблица.Выгрузить());
КонецПроцедуры
