#Область Настройки

Функция ПолучитьПространствоИменCBR()

	Возврат "http://web.cbr.ru/";

КонецФункции // ()

Функция ПолучитьИмяСервисаCBR()

	Возврат "DailyInfo";

КонецФункции // ()

Функция ПолучитьИмяПортаCBR()

	Возврат "DailyInfoSoap";

КонецФункции // ()

#КонецОбласти

#Область Подключение

Функция ПолучитьПроксиCBR() Экспорт

	Прокси = WSСсылки.CBR_DailyInfoWebServ.СоздатьWSПрокси(
		ПолучитьПространствоИменCBR(),
		ПолучитьИмяСервисаCBR(),
		ПолучитьИмяПортаCBR(),
		,
		ТаймаутСоединения.ДляМгновеннойОперации());
	Возврат Прокси;

КонецФункции // ()

Функция ПолучитьПараметрыДляЗаполненияCBR(Прокси, ИмяКомандыCBR) Экспорт

	ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(ПолучитьПространствоИменCBR()).Получить(ИмяКомандыCBR);

	WSПараметр = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
	
	Возврат WSПараметр;

КонецФункции // ()

#КонецОбласти

#Область ОбщиеФункции

// "2021-11-01T00:00:00+03:00"
Функция ПолучитьДатуИзСтрокиCBR(ДатаCBR) Экспорт

	Возврат Дата(Сред(СтрЗаменить(ДатаCBR, "-", ""), 0, 8));

КонецФункции

// "7,55"
Функция ПолучитьЧислоИзСтрокиCBR(ЧислоCBR) Экспорт

	ТипЧисло = Новый ОписаниеТипов("Число");
	Возврат ТипЧисло.ПривестиЗначение(ЧислоCBR);

КонецФункции

#КонецОбласти

Функция ПолучитьКлючевыеСтавкиЗаПериод(fromDate, ToDate) Экспорт

	Прокси = ПолучитьПроксиCBR();
	WSПараметр = ПолучитьПараметрыДляЗаполненияCBR(Прокси, "KeyRate");

	WSПараметр.ToDate = ToDate;
	WSПараметр.fromDate = fromDate;

	Ставка = Прокси.KeyRate(WSПараметр);
	ЗначенияСтавки = Ставка.KeyRateResult.diffgram.KeyRate.KR;
	
	Возврат ЗначенияСтавки;

КонецФункции
