
#Область ПрограммныйИнтерфейс

Функция УниверсальныйТег() Экспорт

	Тег = Новый Структура;
	Тег.Вставить("Начало", "{v8 ");
	Тег.Вставить("Конец", "}");
	
	Возврат Тег;

КонецФункции // ()

Функция ФорматУниверсальногоФайла() Экспорт

	Возврат ".docx";

КонецФункции

Функция ЗаменитьСимволТега(Знач Текст, СтарыйТег, Тег) Экспорт

	Текст = СтрЗаменить(Текст, СтарыйТег["Начало"], "");
	Текст = СтрЗаменить(Текст, СтарыйТег["Конец"], "");
	
	Возврат Тег["Начало"] + Текст + Тег["Конец"];

КонецФункции // ()

#КонецОбласти