
&НаКлиенте
Процедура ДобавитьНачисление(Команда)
	// Создаем новый док
	Форма = ПолучитьФорму("Документ.ЗагрузкаИсторииПлатежей.Форма.ФормаДокумента");
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		Строка = Форма.Объект.Объекты.Добавить();
		Строка.Объект = ТекущийЗайм;
		Строка.ДатаПлатежа = Элементы.Список.ТекущиеДанные.Дата;
	КонецЕсли;
	Форма.ОткрытьМодально();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ГрафикНачисленийПерерасчитан" Тогда
		ПерезагрузитьГрафик();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПерезагрузитьГрафик()
	Срез = РасчетЗадолженностиМФО.ПолучитьСрез(ТекущийЗайм);
	Если Срез <> Неопределено Тогда
		График.Загрузить(Срез);  
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерерасчетНаСервере(Займ)
	РасчетЗадолженностиМФО.РассчитатьГрафикПоЗайму(Займ, ТекущаяДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура Перерасчет(Команда)
//	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда	
		ПерезагрузитьГрафик();
//	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийЗайм = ЭтаФорма.Параметры.Займ;
	ПерезагрузитьГрафик();
	//Список.Параметры.УстановитьЗначениеПараметра("Займ", ТекущийЗайм);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьУЭД(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог для сохранения документа...";
	Диалог.МножественныйВыбор = Ложь;
	

	Если Диалог.Выбрать() Тогда
		
		
		ТабДок = Новый ТабличныйДокумент;
		
		ПечатьНаСервере(ТабДок, ТекущийЗайм);
		
		Каталог = Диалог.Каталог + "\";            
		ИмяФайла = Каталог + "Расчет Исковых требований " + Строка(ТекущийЗайм) + ".xlsx";
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
		
		ЗапуститьПриложение(ИмяФайла);
		
	КонецЕсли;
	
	
	//Сообщить("Расчет индексации произведен");


КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере(ТабДок,Займ)
	ТекущийДоговор = РасчетЗадолженностиМФО.ПолучитьТекущийДоговор(Займ, ТекущаяДатаСеанса());
	РасчетЗадолженностиМФО.ПечатнаяФормаРачетИсковыхТребованийГрафик(ТабДок, ТекущийДоговор);
КонецПроцедуры
