
&НаКлиенте
Процедура ОткрытьДело(Команда)
	// Открыть дело на ЕФРСБ
	ПоказатьОповещениеПользователя("Интеграция с Федресурсом",,"Запуск приложения...",БиблиотекаКартинок.NC_ПодсистемаБанкротство);
	КомандаДелоНаЕФРСБ = ЭтаФорма.Запись.Дело;
    ЗапуститьПриложение(КомандаДелоНаЕФРСБ);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СтрНайти(ЭтаФорма.Запись.Дело, "https") <> 0 Тогда
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ОткрытьДело.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры
