Функция Старт(ДанныеДляПроверки, НачалоДанных) Экспорт

	ЗначенияЯчеек = ДанныеДляПроверки["ЗначенияЯчеек"];
	
	НаборДанных = Новый Массив;
	Значения = Новый Соответствие;
	
	Для НомерСтроки = 0 По ЗначенияЯчеек.Количество() - 1 Цикл
		
		НомераСтрок = Значения.Получить(ЗначенияЯчеек[НомерСтроки]);
		Если НомераСтрок = Неопределено Тогда
		
			НомераСтрок = Новый Массив;

		КонецЕсли;
	
		НомераСтрок.Добавить(НачалоДанных + НомерСтроки);
		Значения.Вставить(ЗначенияЯчеек[НомерСтроки], НомераСтрок);
		
	КонецЦикла;
	
	Для каждого Элемент Из Значения Цикл
	
		Если Элемент.Значение.Количество() = 1 Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		ДанныеОбработки = Новый Структура;
		ДанныеОбработки.Вставить("ЗначениеЯчейки", Элемент.Ключ);
		ДанныеОбработки.Вставить("НомерСтроки", СтрСоединить(Элемент.Значение, ", "));
		ДанныеОбработки.Вставить("ДанныеСтрок", Элемент.Значение);
		ДанныеОбработки.Вставить("Значение", Элемент.Ключ);
		НаборДанных.Добавить(ДанныеОбработки);
	
	КонецЦикла;
	
	Возврат НаборДанных;

КонецФункции // ()