
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Метаданные.ОпределяемыеТипы.Отправители
		.Тип.СодержитТип(ТипЗнч(Параметры.Клиент)) Тогда
	
		Запись.Клиент = Параметры.Клиент;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	РегистрыСведений.ИдентификаторыЧатовТелеграм.ЗаписатьДанные(
		Запись.Клиент,
		Запись.ИмяАкаунта,
		Запись.Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНаСервере();
	
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
