
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НБКИДокументКорректировкаRUTDF") Тогда
		Для Каждого ТекСтрокаОбъекты Из ДанныеЗаполнения.Объекты Цикл
			НоваяСтрока = ОбъектыДляУстановки.Добавить();
			НоваяСтрока.ОбъектУчета = ТекСтрокаОбъекты.Объект;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.КредитныеИстории_УникальныеЗначенияСделок.Записывать = Истина;
	Для Каждого ТекСтрокаОбъектыДляУстановки Из ОбъектыДляУстановки Цикл
		Движение = Движения.КредитныеИстории_УникальныеЗначенияСделок.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектУчета = ТекСтрокаОбъектыДляУстановки.ОбъектУчета;    
		Движение.ТипУникальногоЗначения = ТипУникальногоЗначения;
		Движение.УникальноеЗначение = ТекСтрокаОбъектыДляУстановки.УИДпоГОСТ;
	КонецЦикла; 
	
	//Поставить проверку на наличие уида в КИ, если нет, заполнить новым.
	
	Если ЭтотОбъект.УстановитьВКачествеОсновных Тогда
		ПроставитьУИДЫвОсновнуюКИ();
	КонецЕсли;	

КонецПроцедуры  

Процедура ПроставитьУИДЫвОсновнуюКИ() 
	
	Для Каждого стрОбъект Из ОбъектыДляУстановки Цикл  
		НаборЗаписей = РегистрыСведений.КредитныеИсторииДанныеСделки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сделка.Установить(стрОбъект.ОбъектУчета); 	
		НаборЗаписей.Прочитать(); 
		
		Если НаборЗаписей.Количество() > 0 Тогда
			Для Каждого Запись Из НаборЗаписей Цикл
				Если ЗначениеЗаполнено(Запись.UID) Тогда
					Прервать;
				Иначе	
					Запись.UID = стрОбъект.УИДпоГОСТ; 
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;	
		НаборЗаписей.Записать();
	КонецЦикла;	
	
КонецПроцедуры

