Функция ПоискКонтрагентаПоФИО(ФИО, Инициалы, Условия) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СклонениеФИО.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.СклонениеФИО КАК СклонениеФИО
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЭтоПолноеФИО = ИСТИНА
	|				ТОГДА СклонениеФИО.Именительный = &ФИО
	|						ИЛИ СклонениеФИО.Родительный = &ФИО
	|						ИЛИ СклонениеФИО.Творительный = &ФИО
	|						ИЛИ СклонениеФИО.Предолжный = &ФИО
	|						ИЛИ СклонениеФИО.Дательный = &ФИО
	|			ИНАЧЕ СклонениеФИО.Именительный ПОДОБНО ""%"" + &ФИО + ""%""
	|						И СклонениеФИО.Инициалы = &Инициалы
	|					ИЛИ СклонениеФИО.Родительный ПОДОБНО ""%"" + &ФИО + ""%""
	|						И СклонениеФИО.Инициалы = &Инициалы
	|					ИЛИ СклонениеФИО.Творительный ПОДОБНО ""%"" + &ФИО + ""%""
	|						И СклонениеФИО.Инициалы = &Инициалы
	|					ИЛИ СклонениеФИО.Предолжный ПОДОБНО ""%"" + &ФИО + ""%""
	|						И СклонениеФИО.Инициалы = &Инициалы
	|					ИЛИ СклонениеФИО.Дательный ПОДОБНО ""%"" + &ФИО + ""%""
	|						И СклонениеФИО.Инициалы = &Инициалы
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ЭтоПолноеФИО", Условия["ЭтоПолноеФИО"]);
	Запрос.УстановитьПараметр("ФИО", ФИО);
	Запрос.УстановитьПараметр("Инициалы", Инициалы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Контрагент = Выборка.Контрагент;
		
		Если Условия["КАОдин"] И Выборка.Количество() = 1 Тогда
			Возврат Контрагент;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Условия["ДопРеквДата"]) Тогда
			ДатаРождения = ОбъектыСервер.ПолучитьЗначениеСвойства(
				Контрагент,
				Условия["ДопРеквДата"].Код
			);
			Для Каждого Стр Из Условия["мДаты"] Цикл
				Если ДатаРождения = Стр Тогда
					Возврат Контрагент;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Условия["ДопИннСнилс"]) Тогда
			ИннСнилс = ОбъектыСервер.ПолучитьЗначениеСвойства(
				Контрагент,
				Условия["ДопИннСнилс"].Код
			);
			Для Каждого Стр Из Условия["мСлова"] Цикл
				Если ИннСнилс = Стр Тогда
					Возврат Контрагент;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Условия["ДопРеквДата"])
			И НЕ ЗначениеЗаполнено(Условия["ДопИннСнилс"]) Тогда
			Возврат Контрагент;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции // ()

Функция ИзмененоВРучную(Контрагент, Именительный) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СклонениеФИО.Именительный КАК Именительный,
		|	СклонениеФИО.Родительный КАК Родительный,
		|	СклонениеФИО.Творительный КАК Творительный,
		|	СклонениеФИО.Предолжный КАК Предолжный,
		|	СклонениеФИО.Дательный КАК Дательный,
		|	СклонениеФИО.Инициалы КАК Инициалы,
		|	СклонениеФИО.Контрагент КАК Контрагент,
		|	СклонениеФИО.ИзмененоВРучную КАК ИзмененоВРучную
		|ИЗ
		|	РегистрСведений.СклонениеФИО КАК СклонениеФИО
		|ГДЕ
		|	СклонениеФИО.Контрагент = &Контрагент
		|	И СклонениеФИО.Именительный = &Именительный
		|	И СклонениеФИО.ИзмененоВРучную = ИСТИНА";
	
	Запрос.УстановитьПараметр("Именительный", Именительный);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
	
		Возврат Неопределено;
	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Возврат ВыборкаДетальныеЗаписи;

КонецФункции // ()


