Функция РеквизитыНаименования(Имущество, ДопустимыеТипы) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвойстваИмущества.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ втСведенияДляНаименования
		|ИЗ
		|	ПланВидовХарактеристик.СвойстваИмущества КАК СвойстваИмущества
		|ГДЕ
		|	СвойстваИмущества.ВключатьВНаименование = ИСТИНА
		|	И СвойстваИмущества.ПометкаУдаления = ЛОЖЬ
		|	И СвойстваИмущества.ТипИмущества В(&ТипыИмущества)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОбИмуществеСрезПоследних.Свойство КАК Свойство,
		|	СведенияОбИмуществеСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.СведенияОбИмуществе.СрезПоследних(
		|			,
		|			Имущество = &Имущество
		|				И Свойство В
		|					(ВЫБРАТЬ
		|						втСведенияДляНаименования.Ссылка КАК Ссылка
		|					ИЗ
		|						втСведенияДляНаименования КАК втСведенияДляНаименования)) КАК СведенияОбИмуществеСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Свойство";
	
	Запрос.УстановитьПараметр("Имущество", Имущество);
	Запрос.УстановитьПараметр("ТипыИмущества", ДопустимыеТипы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Значение");

КонецФункции // ()

