
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Идентификатор = Параметры.КлючОбъекта + "/НастройкиФормы";
	//ЭлементОтбора = Список.Отбор.Элементы[0];
	ЭлементОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0];
	ЭлементОтбора.ПравоеЗначение = Идентификатор;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ЗагрузитьНастройку(Элементы.Список.ТекущаяСтрока);
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройку(НастройкаСсылка)
	НастройкиФормы = НастройкаСсылка.Настройки.Получить();
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "", НастройкиФормы); 
КонецПроцедуры
