
&НаКлиенте
Функция ПолучитьИмяУстройстваПоУмолчанию()
	Возврат "(по умолчанию)";
КонецФункции

&НаКлиенте
Процедура ДиректорияЗаписанныхФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	стрКаталогНач = Запись.ДиректорияЗаписанныхФайлов;
	длг = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	длг.Каталог = стрКаталогНач;
	бит_ТелефонияКлиентПереопределяемый.ПоказВыборФайла(длг, "БитФонНастройки_ВыборДиректорииЗаписиЗавершение", стрКаталогНач);
КонецПроцедуры

&НаКлиенте
Процедура ДиректорияЗаписанныхФайловЗавершение(ВыбранныеФайлы, НачальныйКаталог)
	Если ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		выбранКаталог = ВыбранныеФайлы[0];
		Запись.ДиректорияЗаписанныхФайлов = выбранКаталог;
		Если выбранКаталог <> НачальныйКаталог Тогда
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДоступность();
	Элементы.ВерсияБитфона.Заголовок = "Версия БИТ.Phone " + бит_ТелефонияСервер.ПолучитьВерсиюПодсистемы();
	
	стрПоУмолчанию = ПолучитьИмяУстройстваПоУмолчанию();
	Элементы.УстройствоВыводаЗвонка.СписокВыбора.Очистить();
	Элементы.УстройствоВыводаЗвонка.СписокВыбора.Добавить(стрПоУмолчанию);
	списокУстройств = бит_ТелефонияКлиентСервер.СтрРазбить(Параметры.СписокУстройствВывода, ";");
	Для Каждого ЗвукУстройствоЭл Из списокУстройств Цикл
		ЗвукУстройство = ЗвукУстройствоЭл.Значение;
		Элементы.УстройствоВыводаЗвонка.СписокВыбора.Добавить(ЗвукУстройство);
	КонецЦикла;
	УстройствоВыводаЗвонка = Запись.УстройствоВыводаЗвукаВходящегоЗвонка;
	Если НЕ ЗначениеЗаполнено(УстройствоВыводаЗвонка) Тогда
		УстройствоВыводаЗвонка = стрПоУмолчанию;
	КонецЕсли;
	
	ОбновитьСписокКодеков();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступность()
	Элементы.ПрефиксВыходаНаВнешнююЛинию.Доступность = НЕ Запись.ИспользоватьПрямойНабор;
	//
	Элементы.СтационарныйТелефон.Доступность = Запись.ИспользоватьСтационарныйТелефон;
    Элементы.ТипПриемаЗвонка.Доступность = Запись.ИспользоватьСтационарныйТелефон;
	//
	Элементы.СоздаватьСобытияПриВнутреннихЗвонках.Доступность = (Запись.СоздаватьСобытиеПриВходящемЗвонке ИЛИ Запись.СоздаватьСобытиеПриИсходящемЗвонке);
	//
	Если (Запись.ПрофильНастроек = ПредопределенноеЗначение("Перечисление.бит_ПрофилиНастроекБИТPhone.БИТ_АТС")) ИЛИ
		(Запись.ПрофильНастроек = ПредопределенноеЗначение("Перечисление.бит_ПрофилиНастроекБИТPhone.Произвольные"))
	Тогда
		Элементы.ГруппаDND.Доступность = Истина;
	Иначе
		Элементы.ГруппаDND.Доступность = Ложь;
	КонецЕсли;
	//
	Элементы.КомандаПереадресации.Доступность = Запись.ТипПереводаЗвонка = ПредопределенноеЗначение("Перечисление.бит_ТипПереводаЗвонка.Условный");
	//
	Элементы.КомандаНеБеспокоить.Доступность = Запись.ИспользоватьКомандуНеБеспокоитьНаАТС;
	Элементы.КомандаОтменаНеБеспокоить.Доступность = Запись.ИспользоватьКомандуНеБеспокоитьНаАТС;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокКодеков()
	СписокКодеков.Очистить();
	массКодеков = бит_БитфонКлиент.РазобратьСписокКодеков(Запись.СписокКодеков);
	Для Каждого кодекПриор Из массКодеков Цикл
		строкаКодек = СписокКодеков.Добавить();
		ЗаполнитьЗначенияСвойств(строкаКодек, кодекПриор);
	КонецЦикла;
	СписокКодеков.Сортировать("Приоритет Убыв");
КонецПроцедуры

&НаКлиенте
Процедура ПрофильНастроекПриИзменении(Элемент)
	
	бит_БитфонКлиент.ОбработчикИзмененияПрофиляНастроек(Запись, Истина);
	
	ОбновитьДоступность();
	
	ОбновитьСписокКодеков();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьСобытиеПриВходящемЗвонкеПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьСобытиеПриИсходящемЗвонкеПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ТипПереводаЗвонкаПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСтационарныйТелефонПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПрямойНаборПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКомандуНеБеспокоитьНаАТСПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	стрСписокКодеков = Запись.СписокКодеков;
	Если СписокКодеков.Количество() > 0 Тогда
		стрСписокКодеков = "";
		Для Каждого строкаКодек Из СписокКодеков Цикл
			стрКодек = строкаКодек.Кодек;
			стрПриор = Строка(строкаКодек.Приоритет);
			стрСписокКодеков = стрСписокКодеков + стрКодек + "=" + стрПриор + ";";
		КонецЦикла;
	КонецЕсли;
	ТекущийОбъект.СписокКодеков = стрСписокКодеков;
КонецПроцедуры

&НаКлиенте
Процедура УстройствоВыводаЗвонкаПриИзменении(Элемент)
	стрПоУмолчанию = ПолучитьИмяУстройстваПоУмолчанию();
	стрУстройствоВывода = УстройствоВыводаЗвонка;
	Если стрУстройствоВывода = стрПоУмолчанию Тогда
		стрУстройствоВывода = "";
	КонецЕсли;
	Если Запись.УстройствоВыводаЗвукаВходящегоЗвонка <> стрУстройствоВывода Тогда
		Запись.УстройствоВыводаЗвукаВходящегоЗвонка = стрУстройствоВывода;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокКодековПриоритетПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПапкуСЛогФайлом(Команда)
	бит_ТелефонияКлиентПереопределяемый.ЗапускПрограммы("%APPDATA%\BIT");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапросВТехподдержку(Команда)
	бит_БитфонКлиент.ОтправитьЗапросВТехподдержкуСАрхивомЛога();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "БитФонНастройки_ВыборДиректорииЗаписиЗавершение" Тогда
		ДиректорияЗаписанныхФайловЗавершение(Параметр.Результат, Параметр.ПараметрОповещения);
	КонецЕсли;
КонецПроцедуры
