
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	СсылкаДопРИС = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка");
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные; 
	Если ТекущиеДанные <> Неопределено Тогда
		//Если Элемент.ТекущаяСтрока.Предопределенный Тогда
		//	Элемент.КоманднаяПанель.ПодчиненныеЭлементы.Найти("СписокПеренестиЭлемент").Доступность = Ложь;
		//	Элемент.КонтекстноеМеню.ПодчиненныеЭлементы.Найти("СписокКонтекстноеМенюПеренестиЭлемент").Доступность = Ложь;
		//Иначе
		//	Элемент.КоманднаяПанель.ПодчиненныеЭлементы.Найти("СписокПеренестиЭлемент").Доступность = Истина;
		//	Элемент.КонтекстноеМеню.ПодчиненныеЭлементы.Найти("СписокКонтекстноеМенюПеренестиЭлемент").Доступность = Истина;
		//КонецЕсли;	     
		
		Если ТекущиеДанные.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.тсЗначенияСвойствОбъектов") Тогда
			СсылкаДопРИС = ТекущиеДанные.Ссылка;
		КонецЕсли;	 
	КонецЕсли; 	
	
	УстановитьОтборПоПолю("Владелец", СсылкаДопРИС);
	Элементы.Значения.Доступность = Не СсылкаДопРИС.Пустая();
	Элементы.ЗначенияКоманднаяПанель.Доступность = Не СсылкаДопРИС.Пустая();
КонецПроцедуры

&НаКлиенте
Процедура КомандаВверх(Команда)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ПереместитьКатегориюВверхВниз(Элементы.Список.ТекущаяСтрока, Истина);
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВниз(Команда)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ПереместитьКатегориюВверхВниз(Элементы.Список.ТекущаяСтрока, Ложь);
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПереместитьКатегориюВверхВниз(ТекущаяСтрока, ПереместитьВверх)
	ПорядковыйНомер = ТекущаяСтрока.ПорядковыйНомер;	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ДополнительныеРеквизитыИСведения.ПорядковыйНомер КАК ПорядковыйНомер
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	                      |ГДЕ
	                      |	ДополнительныеРеквизитыИСведения.Родитель = &Родитель
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПорядковыйНомер УБЫВ");
	Запрос.УстановитьПараметр("Родитель", ТекущаяСтрока.Родитель);
	Результат = Запрос.Выполнить().Выбрать();
	Если Не Результат.Следующий() Тогда
		Возврат;
	КонецЕсли;
	МаксимальныйНомер = Результат.ПорядковыйНомер;
	
	Если Не ((ПереместитьВверх И ПорядковыйНомер > 1) ИЛИ (Не ПереместитьВверх И ПорядковыйНомер < МаксимальныйНомер)) Тогда	
		Возврат;
	КонецЕсли;
		
	Если ПереместитьВверх Тогда	
	    ПорядковыйНомер2 = ПорядковыйНомер - 1;
	Иначе
		ПорядковыйНомер2 = ПорядковыйНомер + 1;
	КонецЕсли;	
	Запрос.УстановитьПараметр("ПорядковыйНомер", ПорядковыйНомер);
	Запрос.УстановитьПараметр("ПорядковыйНомер2", ПорядковыйНомер2);		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеРеквизитыИСведения.ПорядковыйНомер КАК ПорядковыйНомер,
	               |	ДополнительныеРеквизитыИСведения.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ДополнительныеРеквизитыИСведения.ПорядковыйНомер = &ПорядковыйНомер
	               |			ТОГДА &ПорядковыйНомер2
	               |		ИНАЧЕ &ПорядковыйНомер
	               |	КОНЕЦ КАК ПорядковыйНомерНовый
	               |ИЗ
	               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	               |ГДЕ
	               |	ДополнительныеРеквизитыИСведения.Родитель = &Родитель
	               |	И (ДополнительныеРеквизитыИСведения.ПорядковыйНомер = &ПорядковыйНомер
	               |			ИЛИ ДополнительныеРеквизитыИСведения.ПорядковыйНомер = &ПорядковыйНомер2)";
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл;
		ЭлементОбъект = Результат.Ссылка.ПолучитьОбъект();
		ЭлементОбъект.ПорядковыйНомер = Результат.ПорядковыйНомерНовый;
		ЭлементОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПолю(Поле, Значение)
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(Поле);	
	Для Каждого ЭлементОтбораСобытий Из Значения.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл		
		Если ЭлементОтбораСобытий.ЛевоеЗначение = ПолеКомпоновки Тогда
			ЭлементОтбораСобытий.ПравоеЗначение = Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
