
&НаКлиенте
Процедура КаталогФайловДляОбработкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог файлов для обработки...";
	Диалог.МножественныйВыбор = Ложь;
	Если Диалог.Выбрать() Тогда
		Объект.КаталогФайловДляОбработки = Диалог.Каталог;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогОшибочныхФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог ошибочных файлов...";
	Диалог.МножественныйВыбор = Ложь;
	Если Диалог.Выбрать() Тогда
		Объект.КаталогОшибочныхФайлов = Диалог.Каталог;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогПеремещенныхФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог файлов для перемещения...";
	Диалог.МножественныйВыбор = Ложь;
	Если Диалог.Выбрать() Тогда
		Объект.КаталогПеремещенныхФайлов = Диалог.Каталог;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогФайловДляОбработкиОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;        
	ЗапуститьПриложение(Объект.КаталогФайловДляОбработки);	
КонецПроцедуры

&НаКлиенте
Процедура КаталогПеремещенныхФайловОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;        
	ЗапуститьПриложение(Объект.КаталогПеремещенныхФайлов);	
КонецПроцедуры

&НаКлиенте
Процедура КаталогОшибочныхФайловОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;        
	ЗапуститьПриложение(Объект.КаталогОшибочныхФайлов);
КонецПроцедуры
