
&НаКлиенте
Процедура РеквизитыПоискаИДДолжника(Команда)
	ОткрытьФорму("РегистрСведений.БанкротствоРеквизитыПоискаИДДолжника.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура БанкротствоИерархияСвойств(Команда)
	ОткрытьФорму("Справочник.БанкротствоИерархияСвойств.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура БанкротствоЗначенияСвойств(Команда)
	ОткрытьФорму("Справочник.БанкротствоЗначенияСвойств.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура БанкротствоАдресСервисаПриИзменении(Элемент)
	СервисИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура БанкротствоЛогинПриИзменении(Элемент)
	ЛогинИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура БанкроствоПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Ключи = ОбработкаБезопасноеХранилище.КлючиБанкротство();

	Банкротство = ОбработкаБезопасноеХранилище.Получить("Банкротство", Ключи);
	
	Для каждого Ключ Из Ключи Цикл
	
		ЭтаФорма[Ключ] = Банкротство[Ключ];
	
	КонецЦикла;
	Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтотОбъект.УникальныйИдентификатор, "");
	
	Сервис = ?(ЗначениеЗаполнено(Сервис), Сервис, "/Bankruptcy/MessageService/WebService.svc");

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Ключи = ОбработкаБезопасноеХранилище.КлючиБанкротство();
	
	Для каждого Ключ Из Ключи Цикл
	
		Если ЭтаФорма[Ключ + "Изменен"] Тогда
		
			ЭтаФорма[Ключ + "Изменен"] = Ложь;
			ОбработкаБезопасноеХранилище.Записать("Банкротство", Ключ, ЭтаФорма[Ключ]);
		
		КонецЕсли;
	
	КонецЦикла;
	Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтотОбъект.УникальныйИдентификатор, "");

КонецПроцедуры
