#Область ПрограммныйИнтерфейс

Функция НайтиОтправителя(ИмяАкаунта) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИдентификаторыЧатовТелеграм.Клиент КАК Клиент
		|ИЗ
		|	РегистрСведений.ИдентификаторыЧатовТелеграм КАК ИдентификаторыЧатовТелеграм
		|ГДЕ
		|	ИдентификаторыЧатовТелеграм.ИмяАкаунта = &ИмяАкаунта";
	
	Запрос.УстановитьПараметр("ИмяАкаунта", ИмяАкаунта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи.Клиент;
	
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции // ()

Функция ДанныеАкаунта(Клиент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИдентификаторыЧатовТелеграм.ИмяАкаунта КАК ИмяАкаунта,
		|	ИдентификаторыЧатовТелеграм.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.ИдентификаторыЧатовТелеграм КАК ИдентификаторыЧатовТелеграм
		|ГДЕ
		|	ИдентификаторыЧатовТелеграм.Клиент = &Клиент";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Описание = Новый Структура;
	
	Если Выборка.Следующий() Тогда
	
		Описание.Вставить("ИмяАкаунта", Выборка.ИмяАкаунта);
		Описание.Вставить("Идентификатор", Выборка.Идентификатор);
		
		Возврат Описание;
	
	КонецЕсли;
	
	Возврат Описание;

КонецФункции // ()

Процедура ЗаписатьДанные(Клиент, ИмяАкаунта, ИД) Экспорт

	Запись = СоздатьМенеджерЗаписи();
	
	Запись.ИмяАкаунта = ИмяАкаунта;
	
	Запись.Клиент = ИзменитьНаВладельцаМесенджера(Клиент);
	
	Идентификатор = ИД;
	Если ТипЗнч(ИД) = Тип("Число") Тогда
	
		Идентификатор = Формат(ИД, "ЧГ=0");
	
	КонецЕсли;
	Запись.Идентификатор = Идентификатор;
	
	Запись.Записать(Истина);

КонецПроцедуры

Функция ИзменитьНаВладельцаМесенджера(Знач Клиент) Экспорт

	Если Метаданные.ОпределяемыеТипы.ОбъектыОбщенияВЧате
		.Тип.СодержитТип(ТипЗнч(Клиент)) Тогда
	
		Клиент = УправлениеМетаданными.МенеджерОбъектаПоСсылке(Клиент)
			.ВладелецМесенджера(Клиент);
	
	КонецЕсли;
	
	Возврат Клиент;

КонецФункции // ()

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти