
&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	Стр = "
	|DRIVER="+Объект.ODBCDriver+";
	|SERVER="+Объект.Сервер+";
	|DATABASE="+Объект.НазваниеБазыДанных+"; 
	|UID="+Объект.Пользователь+";
	|PWD="+Объект.Пароль+"";
	Соединение = Новый COMОбъект("ADODB.Connection");
	
	Соединение.ConnectionString = (Стр);
	
	Попытка
		Соединение.Open();
		Сообщить("Соединение установлено");
		Соединение.Close();
	Исключение
		Сообщить("Некорректно заданы параметры соединения!");
	КонецПопытки;


КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	#Если ВебКлиент тогда
		Сообщить("Проверка соединения на Веб-Клиенте недоступна!");
	#Иначе	
		ПроверитьСоединениеНаСервере();
	#КонецЕсли
КонецПроцедуры

&НаСервере
Функция СформироватьСписокДрайверов()
	// получить список всех драйверов ODBC
	значенияРеестра = Неопределено;
	типыЗначенийРеестра = Неопределено;
	обРегПров = ПолучитьCOMОбъект("winmgmts:\\.\root\default:StdRegProv");
	стрПутьРеестра = "SOFTWARE\ODBC\ODBCINST.INI\ODBC Drivers";
	HKEY_LOCAL_MACHINE = 2147483650;
	обРегПров.EnumValues(HKEY_LOCAL_MACHINE, стрПутьРеестра, значенияРеестра, типыЗначенийРеестра);
	
	стрMySQL_ODBCДрайвер = Новый Массив;
	Для Каждого стрДрайверODBC ИЗ значенияРеестра Цикл
		стрMySQL_ODBCДрайвер.Добавить(стрДрайверODBC);
	КонецЦикла;
	
	Возврат стрMySQL_ODBCДрайвер;
	
КонецФункции	


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МассивОДБС = СформироватьСписокДрайверов();
	Для Каждого Эл из МассивОДБС Цикл
		нстр = СписокODBC.Добавить();
		нстр.Наименование = Эл;
	КонецЦикла;	 
	
КонецПроцедуры



