
&НаСервере
Процедура ПроверитьСоединениеНаСервере()

	Записать();
	Стр = Справочники.НастройкиПодключенияКСерверу.СтрокаСоединения(
		Объект.Ссылка
	);

	Соединение = Новый COMОбъект("ADODB.Connection");
	
	Соединение.ConnectionString = (Стр);
	
	Попытка
		Соединение.Open();
		Соединение.Close();
		ТекстСообщения = "Соединение установлено";
	Исключение
		ТекстСообщения = "Некорректно заданы параметры соединения!";
	КонецПопытки;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	#Если ВебКлиент тогда
		Сообщить("Проверка соединения на Веб-Клиенте недоступна!");
	#Иначе	
		ПроверитьСоединениеНаСервере();
	#КонецЕсли
КонецПроцедуры

&НаСервере
Функция СформироватьСписокДрайверов()
	// получить список всех драйверов ODBC
	значенияРеестра = Неопределено;
	типыЗначенийРеестра = Неопределено;
	обРегПров = ПолучитьCOMОбъект("winmgmts:\\.\root\default:StdRegProv");
	стрПутьРеестра = "SOFTWARE\ODBC\ODBCINST.INI\ODBC Drivers";
	HKEY_LOCAL_MACHINE = 2147483650;
	обРегПров.EnumValues(HKEY_LOCAL_MACHINE, стрПутьРеестра, значенияРеестра, типыЗначенийРеестра);
	
	стрMySQL_ODBCДрайвер = Новый Массив;
	Для Каждого стрДрайверODBC ИЗ значенияРеестра Цикл
		стрMySQL_ODBCДрайвер.Добавить(стрДрайверODBC);
	КонецЦикла;
	
	Возврат стрMySQL_ODBCДрайвер;
	
КонецФункции	


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МассивОДБС = СформироватьСписокДрайверов();
	Для Каждого Эл из МассивОДБС Цикл
		нстр = СписокODBC.Добавить();
		нстр.Наименование = Эл;
	КонецЦикла;	 
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ПользовательИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Ключ.Пустая() Тогда
	
		Ключи = ОбработкаБезопасноеХранилище.КлючиАвтообзвон();

		Автообзвон = ОбработкаБезопасноеХранилище.Получить(Объект.Ссылка, Ключи);
		
		Для каждого Ключ Из Ключи Цикл
		
			ЭтаФорма[Ключ] = Автообзвон[Ключ];
		
		КонецЦикла;
	
	КонецЕсли;
	
	Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтотОбъект.УникальныйИдентификатор, "");

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Ключи = ОбработкаБезопасноеХранилище.КлючиАвтообзвон();
	
	Для каждого Ключ Из Ключи Цикл
	
		Если ЭтаФорма[Ключ + "Изменен"] Тогда
		
			ЭтаФорма[Ключ + "Изменен"] = Ложь;
			ОбработкаБезопасноеХранилище.Записать(ТекущийОбъект.Ссылка, Ключ, ЭтаФорма[Ключ]);
		
		КонецЕсли;
	
	КонецЦикла;
	Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтотОбъект.УникальныйИдентификатор, "");

КонецПроцедуры



