 
&НаКлиенте
Перем ТекущийУИДАбонента;
&НаКлиенте
Перем КомпонентаОбъект;
&НаКлиенте
Перем ТекущийIPАдрес;

// Для работы в режиме тонкого клиента

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитаНаСервере(ИмяОбъекта, ИмяРеквизита)
Возврат ИмяОбъекта[ИмяРеквизита];
КонецФункции

//

#Область События

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщиеНачальныеНастройки();
	
	ОбъектыСервер.ОграничитьТипОбъекта(Элементы.Объект);
	
	//Заплатка
	Если Параметры.Ключ.Пустая() Тогда
		// Объект.ПланируемаяДата = ТекущаяДатаСеанса();
		// Объект.ВремяСоздания = ТекущаяДатаСеанса();
		// Использовать время клиента
		Объект.ПланируемаяДата = ТекущаяДата();
		Объект.ВремяСоздания = ТекущаяДата();
	КонецЕсли;
	
	//Заплатка
	НастройкаСотрудникВРегионе();
	//
	
	ДополнительныеРеквизиты.Загрузить(Объект.ДополнительныеРеквизиты.Выгрузить());
	
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);	
		Если Параметры.ЗначенияЗаполнения.Свойство("Объект") Тогда
			Если ТипЗнч(Параметры.ЗначенияЗаполнения.Объект) = Тип("Массив") Тогда
				КолВо = Параметры.ЗначенияЗаполнения.Объект.Количество();
				Объект.Объект = Параметры.ЗначенияЗаполнения.Объект[КолВо - 1];
			Иначе
				Объект.Объект = Параметры.ЗначенияЗаполнения.Объект;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(Параметры.Объект) Тогда
			Объект.Объект = Параметры.Объект;
		КонецЕсли;
		Если Параметры.ЗначенияЗаполнения.Свойство("Ответственный") И
				Не Параметры.ЗначенияЗаполнения.Ответственный.Пустая() Тогда
			Объект.Организация = Параметры.ЗначенияЗаполнения.Ответственный.Организация;
			Объект.Подразделение = Параметры.ЗначенияЗаполнения.Ответственный.Подразделение;
			Объект.Ответственный = Параметры.ЗначенияЗаполнения.Ответственный;
		КонецЕсли;
		Если Параметры.ЗначенияЗаполнения.Свойство("ТипМероприятия") Тогда
			Объект.ТипМероприятия = Параметры.ЗначенияЗаполнения.ТипМероприятия;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Объект) Тогда
		Элементы.ОбъектУчета_Контрагенты.Видимость = Ложь;
		Элементы.ОбъектУчета_ДоговорыКонтрагентов.Видимость = Ложь;
		Элементы.ОбъектУчета_УслугиПоДоговорам.Видимость = Ложь;
		Элементы.ОбъектУчета_ДолговыеОбязательства.Видимость = Ложь;
		Элементы.ОбъектУчета_ИсполнительныеДокументы.Видимость = Ложь;
		Элементы.ОбъектУчета_Залоги.Видимость = Ложь;
	Иначе
		Элементы.ОбъектУчета_Пусто.Доступность = Ложь;
		Элементы.ОбъектУчета_Контрагенты.Видимость = Ложь;
		Элементы.ОбъектУчета_ДоговорыКонтрагентов.Видимость = Ложь;
		Элементы.ОбъектУчета_УслугиПоДоговорам.Видимость = Ложь;
		Элементы.ОбъектУчета_ДолговыеОбязательства.Видимость = Ложь;
		Элементы.ОбъектУчета_ИсполнительныеДокументы.Видимость = Ложь;
		Элементы.ОбъектУчета_Залоги.Видимость = Ложь;
		
		Если Объект.Объект = Неопределено Тогда	
			Элементы.ОбъектУчета_Пусто.Доступность = Истина;
			ТекущийЭлемент = Элементы.Объект;
			Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_Пусто;		
		ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
			Элементы.ОбъектУчета_Контрагенты.Видимость = Истина;
			ТекущийЭлемент = Элементы.Контрагент;
			Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_Контрагенты;		
		ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Элементы.ОбъектУчета_ДоговорыКонтрагентов.Видимость = Истина;
			ТекущийЭлемент = Элементы.ДоговорКонтрагента;
			Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_ДоговорыКонтрагентов;		
		ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.УслугиПоДоговору") Тогда	
			Элементы.ОбъектУчета_УслугиПоДоговорам.Видимость = Истина;
			ТекущийЭлемент = Элементы.УслугаПоДоговору;
			Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_УслугиПоДоговорам;
		ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
			Элементы.ОбъектУчета_ДолговыеОбязательства.Видимость = Истина;
			ТекущийЭлемент = Элементы.ДолговоеОбязательство;
			Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_ДолговыеОбязательства;
		ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ИсполнительныеДокументы") Тогда	
			Элементы.ОбъектУчета_ИсполнительныеДокументы.Видимость = Истина;
			ТекущийЭлемент = Элементы.ИсполнительныйДокумент;
			Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_ИсполнительныеДокументы;
		ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Залоги") Тогда	
			Элементы.ОбъектУчета_Залоги.Видимость = Истина;
			ТекущийЭлемент = Элементы.Залог;
			Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_Залоги;
		КонецЕсли;
		
		Контрагент = Объект.Объект;
		ДоговорКонтрагента = Объект.Объект;
		УслугаПоДоговору = Объект.Объект;
		ДолговоеОбязательство = Объект.Объект;
		ИсполнительныйДокумент = Объект.Объект;
		Залог = Объект.Объект;
		
		//
		Попытка
			КонтрагентКЛ = Объект.Объект.Должник;
		Исключение
			Попытка
				КонтрагентКЛ = Объект.Объект.Контрагент;
			Исключение
				Попытка
					КонтрагентКЛ = Объект.Объект.Владелец.Должник;
				Исключение
					КонтрагентКЛ = Объект.Объект;
				КонецПопытки;
			КонецПопытки;
		КонецПопытки;
	КонецЕсли;

	//	
	Если ТипЗнч(Объект.Ответственный) = Тип("ПланВидовХарактеристикСсылка.ТипыСотрудников") Тогда
		ТипСотрудника = Объект.Ответственный;		
		Если Константы.ЗапретитьУчетПоСотрудникам.Получить() Тогда
			Элементы.Ответственный.Видимость = Ложь;
		Иначе
			Элементы.Ответственный.ТолькоПросмотр = Истина;	
			ЗаполнитьОтветственный();
		КонецЕсли;
	Иначе
		Элементы.ТипСотрудника.Видимость = Константы.УчетПоТипамСотрудников.Получить();
		ТипСотрудника = ПланыВидовХарактеристик.ТипыСотрудников.ПустаяСсылка();
		
		Если Константы.ЗапретитьУчетПоСотрудникам.Получить() Тогда		
			Если Объект.Ссылка.Пустая() Тогда
				Объект.Ответственный = ПланыВидовХарактеристик.ТипыСотрудников.ПустаяСсылка();
				Элементы.Ответственный.Видимость = Ложь;				
			КонецЕсли;
			Ответственный = Объект.Ответственный;
			Элементы.ТипСотрудника.АвтоОтметкаНезаполненного = Истина;
		Иначе
			Ответственный = ?(Объект.Ответственный = Неопределено, Пользователи.ТекущийПользователь(), Объект.Ответственный);
		КонецЕсли;		
	КонецЕсли;
	
	ОбщиеРазрешения();
	ОбщиеЗапрещения();
	РазрешенияПереносСроковМероприятий();
	РазрешенияАдминистратора();
	
	// Заблокировать мероприятие для редактирования другими пользователями
	Попытка
		ЭтаФорма.ЗаблокироватьДанныеФормыДляРедактирования();
	Исключение
		ЭтаФорма.Доступность = Ложь;
	КонецПопытки;
	
КонецПроцедуры

// Серверная процедура при открытии формы

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	// Сбросить предупреждения
	ЭтаФорма.ПредупреждениеАрхив = Неопределено;
	ЭтаФорма.ПредупреждениеЮД = Неопределено;
	
	// Получить значения свойств
	Если ЗначениеЗаполнено(ЭтаФорма.ДолговоеОбязательство) = Истина Тогда
		ДО = ЭтаФорма.ДолговоеОбязательство.ПолучитьОбъект();
		Архив = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Архив");
		Категория = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, "0181");
		ЮД = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Передано в ЮД");
		ПричинаАрхивации = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, "0182");
		
		Если Категория = Архив Тогда
			ЭтаФорма.ПредупреждениеАрхив = Истина;
		ИначеЕсли ПричинаАрхивации = ЮД И ЭтаФорма.Объект.ТипМероприятия <> ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокВходящий") Тогда
			ЭтаФорма.ПредупреждениеЮД = Истина;
		ИначеЕсли ПричинаАрхивации = ЮД И ЭтаФорма.Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокВходящий") Тогда
			ЭтаФорма.ПредупреждениеЮД = Истина;
			ЭтаФорма.Элементы.НомерЮД.Видимость = Истина;
		КонецЕсли;
		
		// Выгрузить информацию о долге 
		ПолучитьОтветственногоНаСервере();
		ПолучитьОстатокНаСервере();
		ПолучитьДатуВыдачиНаСервере();
		ПолучитьДниПросрочкиНаСервере();
		ПолучитьВозрастНаСервере();
		
		// Вернуть панель инструментов, если договор не был опознан и изменен
		Если ЭтаФорма.Элементы.ГруппаИнструменты.Видимость = Ложь Тогда
			ЭтаФорма.Элементы.ГруппаИнструменты.Видимость = Истина;			
			ЭтаФорма.Элементы.ГруппаДолжникИнформация.Видимость = Истина;
			ЭтаФорма.Элементы.ГруппаЗадолженность.Видимость = Истина;
		КонецЕсли;
		
		// Проверить заполнение контрагента	
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Контрагент) = Истина Тогда
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.ДолговоеОбязательство) = Ложь И ЗначениеЗаполнено(ЭтаФорма.Контрагент) = Ложь Тогда
		// Присвоить неопознанный объект
		НеопознанныйОбъектНаСервере();
		// Скрыть панель инструментов и информацию о долге
		ЭтаФорма.Элементы.ГруппаИнструменты.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаДолжникИнформация.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаЗадолженность.Видимость = Ложь;
	КонецЕсли;
	
	// Скрыть панель инструментов и информацию о долге, если договор не был опознан
	Если ЭтаФорма.Объект.Объект = Справочники.ДолговыеОбязательства.НайтиПоНаименованию("Неопознанный") Тогда
		ЭтаФорма.Элементы.ГруппаИнструменты.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаДолжникИнформация.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаЗадолженность.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

//

// Клиентская процедура при открытии формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Проверить состояние блокировки
	Если ЭтаФорма.Доступность = Ложь Тогда
		ЭтаФорма.Закрыть();
		Если ЗначениеЗаполнено(ЭтаФорма.Объект.Автор) = Истина Тогда
			ПоказатьОповещениеПользователя("Мероприятие заблокировано",,"Мероприятие уже редактирует " + ЭтаФорма.Объект.Автор, БиблиотекаКартинок.NC_Заблокировано);
			Возврат;
		Иначе
			ПоказатьОповещениеПользователя("Мероприятие заблокировано",,"Мероприятие уже редактирует другой сотрудник", БиблиотекаКартинок.NC_Заблокировано);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Настройка видимости элементов
	ТипМероприятияПриИзменении(Неопределено);
	
	// Получить значения с сервера
	ПриОткрытииНаСервере();
	
	// Запретить закрытие незаполненного мероприятия
	Если ЭтаФорма.Объект.Выполнена = Ложь И ЭтаФорма.Объект.Контакт = ""
		И ЭтаФорма.Объект.ТипМероприятия <> ПредопределенноеЗначение("Справочник.ТипыМероприятий.ПустаяСсылка") Тогда
		ЭтаФорма.Записать();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
	// Показать предупреждение об архивации
	Если ЭтаФорма.ПредупреждениеАрхив = Истина Тогда
		Предупреждение("Договор в архиве",,"Предупреждение");
	ИначеЕсли ЭтаФорма.ПредупреждениеЮД = Истина Тогда
		Предупреждение("Договор в юридическом департаменте",,"Предупреждение");
	КонецЕсли;
	
	//ДобавитьДополнительныеРеквизиты();
	//Если НЕ Объект.КомментарийИзменен И Не Объект.Выполнена Тогда 
	//	ЗаполнитьКомментарий();
	//КонецЕсли;	
	//Если Объект.Ссылка.Пустая() И Объект.ТипМероприятия = ПроверкаТелефонныйЗвонокИсходящий() Тогда
		//Форма = ПолучитьФорму("Обработка.СценарийДиалога.Форма.ФормаОбработки",,ЭтаФорма);
		//Форма.Макет = ПолучитьСценарийДиалогаПоТипуМероприятия(Объект.ТипМероприятия);
		//Если НЕ Форма.Макет.Пустая() Тогда
		//	Если Не ЗначениеЗаполнено(Объект.ФактическаяДата) Тогда
		//		Объект.ФактическаяДата = ТекущаяДата();
		//	КонецЕсли;
		//	Если Не ЗначениеЗаполнено(Объект.ПланируемаяДата) Тогда
		//		Объект.ПланируемаяДата = ТекущаяДата();
		//	КонецЕсли;
		//	Если Не ЗначениеЗаполнено(Объект.ПланируемоеВремя) Тогда
		//		Объект.ПланируемоеВремя = ТекущаяДата();
		//	КонецЕсли;
		//	
		//	Если Форма.ОткрытьМодально() = Истина Тогда
		//		РезультатПриИзменении(Неопределено);                    
		//	КонецЕсли;
		//КонецЕсли;
	//КонецЕсли;
	
	// Попытки необходимы, чтобы при создании мероприятия из Рабочего стола заполнялся "объект".
	// Первая попытка заполняет объект, если выбран пользователь на Рабочем Столе (при нажатии кнопки "Создать").
	// Вторая попытка заполняет объект, если выбрано ДолговоеОбязательство на Рабочем столе (при нажатии кнопки "Создать")
	Попытка
		Объект.Объект = ЭтаФорма.ВладелецФормы.Родитель.Родитель.Элементы.СписокДО.ТекущиеДанные.Объект;
	Исключение
	КонецПопытки;
	Попытка
		Объект.Объект = ЭтаФорма.ВладелецФормы.Родитель.Родитель.Родитель.ТекущийЭлемент.ТекущиеДанные.ДолговыеОбязательства;
	Исключение	
	КонецПопытки;
	
	Элементы.ГруппаЗаписьРазговора.Видимость = ЗначениеЗаполнено(Объект.бтЗаписьРазговора);
	
	// Запретить управление звонком пока не будет обработан статус Битфона
	ВыключитьДоступностьГруппыЗвонка();
	
	// Передать управление обработчику ожидания
	ПодключитьОбработчикОжидания("УстановитьСтатусНеБеспокоить", 5, Истина);
	
КонецПроцедуры

//

&НаКлиенте
Процедура ОбработатьСписокКонтактов();
	
	Если ЭтаФорма.СозданоИзДО = Истина ИЛИ ЭтаФорма.СозданоИзКонтрагента = Истина Тогда
		// Выбрать контакт по совпадению номера
		Если ЭтаФорма.Объект.ТипМероприятия <> ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокВходящий")
			И ЭтаФорма.Элементы.Контакт.СписокВыбора.Количество() > 0 Тогда
			ЭлементСпискаВыбора = 0;
			КонтактНайден = Ложь;
			Пока ЭлементСпискаВыбора < ЭтаФорма.Элементы.Контакт.СписокВыбора.Количество() И Не КонтактНайден Цикл
				Представление = ЭтаФорма.Элементы.Контакт.СписокВыбора[ЭлементСпискаВыбора].Представление;
				ЧислоВхождений = СтрЧислоВхождений(ВРег(Представление), Объект.Контакт);
				Если ЧислоВхождений = 1 Тогда
					ПоказатьОповещениеПользователя("Предупреждение",,"Выбран контакт по совпадению номера",БиблиотекаКартинок.NC_Выполнено);
					ЭтаФорма.Объект.Контакт = ЭтаФорма.Элементы.Контакт.СписокВыбора[ЭлементСпискаВыбора].Значение;
					ЭтаФорма.Записать();
					// Вернуть флаг модифицированности
					ЭтаФорма.Модифицированность = Истина;
					КонтактНайден = Истина;
				КонецЕсли;
				ЭлементСпискаВыбора = ЭлементСпискаВыбора + 1;
			КонецЦикла;
		КонецЕсли;
	Иначе
		// Выбрать контакт по совпадению имени
		Если ЭтаФорма.Объект.Выполнена = Ложь Тогда
			Если ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
				ОбъектДолжник = ОбъектыСервер.РазыменоватьСсылку(Объект.Объект, "Должник");
			ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
				ОбъектДолжник = Объект.Объект;
			КонецЕсли;
			Если ЭтаФорма.Объект.ТипМероприятия <> ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокВходящий")
				И ЭтаФорма.Элементы.Контакт.СписокВыбора.Количество() > 0 Тогда
				ЭлементСпискаВыбора = 0;
				КонтактНайден = Ложь;
				Пока ЭлементСпискаВыбора < ЭтаФорма.Элементы.Контакт.СписокВыбора.Количество() И Не КонтактНайден Цикл
					Представление = ЭтаФорма.Элементы.Контакт.СписокВыбора[ЭлементСпискаВыбора].Представление;
					ЧислоВхождений = СтрЧислоВхождений(ВРег(Представление), ВРег(ОбъектДолжник));
					Если ЧислоВхождений = 1 Тогда
						ПоказатьОповещениеПользователя("Предупреждение",,"Выбран контакт по совпадению имени",БиблиотекаКартинок.NC_Выполнено);
						ЭтаФорма.Объект.Контакт = ЭтаФорма.Элементы.Контакт.СписокВыбора[ЭлементСпискаВыбора].Значение;
						ЭтаФорма.Записать();
						// Вернуть флаг модифицированности
						ЭтаФорма.Модифицированность = Истина;
						КонтактНайден = Истина;
					КонецЕсли;
					ЭлементСпискаВыбора = ЭлементСпискаВыбора + 1;
				КонецЦикла;
				Если КонтактНайден = Ложь Тогда
					Если ЭтаФорма.Элементы.Контакт.СписокВыбора.Количество() = 1 Тогда
						ЭтаФорма.Объект.Контакт = ЭтаФорма.Элементы.Контакт.СписокВыбора[0].Значение;
						ЭтаФорма.Записать();
						// Вернуть флаг модифицированности
						ЭтаФорма.Модифицированность = Истина;
					Иначе
						// Очистить значение реквизита
						ПоказатьОповещениеПользователя("Предупреждение",,"Не удалось найти подходящий контакт",БиблиотекаКартинок.NC_Предупреждение);
						ЭтаФорма.Объект.Контакт = "";
						ЭтаФорма.Записать();
						// Вернуть флаг модифицированности
						ЭтаФорма.Модифицированность = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Проверка на совпадение номеров
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Контакт) = Истина Тогда
		ФормаПоискаНомера = ПолучитьФорму("ОбщаяФорма.ПоискНомераВБазе");
		// Обрезать неинформативную часть и передать с ключом
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаПоискаНомера.СписокДО, "Ссылка.Должник.Телефоны.Номер", Строка(Прав(Объект.Контакт, 7)), ВидСравненияКомпоновкиДанных.Содержит, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
		ФормаПоискаНомера.ПолучитьКоличествоСтрокВДинамическомСпискеНаСервере();
		Если ФормаПоискаНомера.ЕстьСовпадения = Истина Тогда
			ПоказатьОповещениеПользователя("Поиск номера в базе",,"Найдены совпадающие должники",БиблиотекаКартинок.NC_РозыскДолжника);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	Если ПередВыполнениемСервер(Отказ) = Истина И Отказ = Ложь Тогда		
		//СоздатьСлед	
		Если Не Объект.СледующееМероприятие.Пустая() Тогда
			////Если Вопрос("Хотите создать следующее мероприятие?", 
			////		РежимДиалогаВопрос.ДаНет,,, "Создать следующее мероприятие?") = КодВозвратаДиалога.Да Тогда	
				Закрыть();
				СоздатьСледующееМероприятие(Отказ);
			////КонецЕсли;
		КонецЕсли;
		
		НастройкиНеИзменяемыеЭлементыПослеВыполнения();
		
		ОповеститьОбИзменении(Объект.Ссылка);
		Оповестить("ОбновитьТД");
		// Оповестить("ОбновитьТД") используется И при записи,
		// а необходимо только, когда выполнено Мероприятие.  
		Оповестить("ОбновитьПланировщик", Истина, Объект.Ссылка);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПередВыполнениемСервер(Отказ)
	НачатьТранзакцию();
	Попытка
		//Сами делаем запись и отказ
		//Если Записать() Тогда	
		Если Не Объект.Выполнена Тогда
			ТекстСообщения = "";
			ПроверкаЗаполненияПолейПередВыполнением(Отказ, ТекстСообщения);	
			Если Отказ ИЛИ ТекстСообщения <> "" Тогда		
				Сообщить(ТекстСообщения);
				ВызватьИсключение "!!!";
			Иначе
				ПеренестиТЧДопРеквизиты(Отказ, ТекстСообщения);
				Если Отказ Тогда
					Сообщить(ТекстСообщения);
					ВызватьИсключение "!!!";
				КонецЕсли;
				
				ПроверитьОбязательныеДопРеквизиты(Отказ, ТекстСообщения);
				Если Отказ Тогда
					Сообщить(ТекстСообщения);
					ВызватьИсключение "!!!";
				КонецЕсли;
				ЗаписатьЗначениеСвойства();
													
				СохранитьСостояниеБП();
				Объект.Выполнена = Истина;
				Объект.ВыполненоКакНеАктуальное = Ложь;
				//Объект.ДатаВыполнения = ТекущаяДатаСеанса(); //+1 для того, чтобы отмена нормально работала, 
						//если идет параллельное выбивание другого мероприятия, которое в свою очередь, 
						//создает новое мероприятие, НО это не пашет в других случаях...
				// Использовать время клиента
				Объект.ДатаВыполнения = ТекущаяДата();
				Объект.ФактическаяДата = Объект.ДатаВыполнения; //НИКА!!!
				Объект.МоментВремени = ПолучитьМоментВремени(Объект.ДатаВыполнения);
				Объект.Исполнитель = УдалитьОбщегоНазначения.ТекущийПользователь();
				
				// Исправить подсчет времени работы
				Если Объект.ВремяРаботы = 0 И Не ЗначениеЗаполнено(ЭтаФорма.ВремяЗавершенияРазговора) Тогда
					Объект.ВремяРаботы = Объект.ДатаВыполнения - Объект.Дата;
				ИначеЕсли Объект.ВремяРаботы = 0 И ЗначениеЗаполнено(ЭтаФорма.ВремяЗавершенияРазговора) Тогда
					Объект.ВремяРаботы = Объект.ДатаВыполнения - ЭтаФорма.ВремяЗавершенияРазговора;
				КонецЕсли;
				
				// Добавить результаты с кодом 000000031 и 000000075 для обещаний с WhatsApp и Viber
				Если Объект.Результат = Справочники.РезультатыМероприятий.НайтиПоКоду("000000001")
					ИЛИ Объект.Результат = Справочники.РезультатыМероприятий.НайтиПоКоду("000000002")
					ИЛИ Объект.Результат = Справочники.РезультатыМероприятий.НайтиПоКоду("000000031")
					ИЛИ Объект.Результат = Справочники.РезультатыМероприятий.НайтиПоКоду("000000075") Тогда
					
					Сотрудник = ПараметрыСеанса.ТекущийПользователь;
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	ОтветственныеСотрудники.Пользователь КАК Пользователь
						|ИЗ
						|	РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
						|ГДЕ
						|	ОтветственныеСотрудники.Объект = &Объект";
					
					Запрос.УстановитьПараметр("Объект", Объект.Объект);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					Выборка = РезультатЗапроса.Выбрать();
					
					//Пока Выборка.Следующий() Цикл
					//	
					//	Если Выборка.Пользователь.Подразделение = Сотрудник.Подразделение Тогда
					//	
					//		ТекущийОтветственный = Выборка.Пользователь;
					//	
					//	КонецЕсли; 
					//	
					//КонецЦикла;
					Выборка.Следующий();
					ТекущийОтветственный = Выборка.Пользователь;
		
					
					Если ТекущийОтветственный <> Сотрудник Тогда
					
						Акт = Документы.АктПередачи.СоздатьДокумент();
						Акт.Дата = ТекущаяДата();
						Акт.Организация = Справочники.Организации.НайтиПоКоду("000000001");
						Акт.Автор = Сотрудник;
						
						Акт.ПодразделениеПередающее = ТекущийОтветственный.Подразделение;
						Акт.СотрудникПередающий = ТекущийОтветственный;
						Акт.ТипСотрудникаПередающего = ТекущийОтветственный.ТипСотрудника;
						
						Акт.ПодразделениеПринимающее = Сотрудник.Подразделение;
						Акт.СотрудникПринимающий = Сотрудник;
						Акт.ТипСотрудникаПринимающего = Сотрудник.ТипСотрудника;
						
						Стр = Акт.Объекты.Добавить();
						Стр.Объект = Объект.Объект;
						Попытка
						
							Акт.Записать(РежимЗаписиДокумента.Проведение);
						
						Исключение
							Сообщить("Не удалось передать договор!");
						КонецПопытки;					
					КонецЕсли; 				
				КонецЕсли;
				
				Записать();
						    
				Если ВыполнитьФункциюДопРеквизитов(Отказ) ИЛИ Отказ Тогда
					ВызватьИсключение "!!!";
				КонецЕсли;
							
				ПродолжитьВыполнениеБП(Отказ);
				Если Отказ Тогда
					ВызватьИсключение "!!!";
				КонецЕсли;
				Элементы.ДекорацияВыполнено.Видимость = Истина;
				Элементы.ФормаОтменитьВыполнение.Доступность = Истина;
				
				//СоздатьСлед	
				ЗафиксироватьТранзакцию();
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;			
		ЗафиксироватьТранзакцию();
		Возврат Ложь;
	Исключение
		ОтменитьТранзакцию();
		Отказ = Истина;
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаСервере
Функция ВыполнитьФункциюДопРеквизитов(Отказ)
	Попытка
		Если Не Объект.Результат.ФункцияДопРеквизитов.Пустая() Тогда
			МероприятиеТекущее = РеквизитФормыВЗначение("Объект");
			Справочники.ФункцииДополнительныхРеквизитов.ВычислитьФункцию(Объект.Результат.ФункцияДопРеквизитов.Функция,
					МероприятиеТекущее, Неопределено, Отказ);
			ЗначениеВРеквизитФормы(МероприятиеТекущее, "Объект");
		КонецЕсли;
		Возврат Ложь;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат Истина;
	КонецПопытки;
КонецФункции

&НаСервере
Процедура ПродолжитьВыполнениеБП(Отказ)
	Если Объект.БизнесПроцесс <> Неопределено И Не Объект.БизнесПроцесс.Пустая() Тогда
		Объект.БизнесПроцесс.ПолучитьОбъект().ПродолжитьВыполнениеБП(Отказ, Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьСледующееМероприятие(Отказ)
	НовоеМероприятие = Задачи.Мероприятие.СоздатьЗадачу();
	НовоеМероприятие.Дата = ТекущаяДатаСеанса();
	
	НовоеМероприятие.Объект = Объект.Объект; 
    НовоеМероприятие.ТипМероприятия = Объект.Результат.ТипСледующегоМероприятия;
	
	НовоеМероприятие.Организация = Объект.Организация;
	НовоеМероприятие.Подразделение = Объект.Подразделение;
	НовоеМероприятие.Ответственный = ?(Объект.Результат.ТипСотрудника.Пустая(), 
			ПланыВидовХарактеристик.ТипыСотрудников.РуководительПодразделения, Объект.Результат.ТипСотрудника);
		
	НовоеМероприятие.ПланируемаяДата = ТекущаяДатаСеанса();
	НовоеМероприятие.Автор = Объект.Ссылка;
	
	Если Не НовоеМероприятие.ТипМероприятия.ФункцияПередСозданиемИзБП.Пустая() Тогда
		Справочники.ФункцииДополнительныхРеквизитов.ВычислитьФункцию(
				НовоеМероприятие.ТипМероприятия.ФункцияПередСозданиемИзБП.Функция, НовоеМероприятие, НовоеМероприятие);
	КонецЕсли;
	//++КазанцевЯА-БП
	Если Константы.КонтрольСроковМероприятий.Получить() И НовоеМероприятие.ТипМероприятия.СрокВыполнения > 0 Тогда
		НовоеМероприятие.СрокВыполнения = ТекущаяДатаСеанса() + НовоеМероприятие.ТипМероприятия.СрокВыполнения * 60;
		ОсновнойКалендарьПредприятия = Константы.ОсновнойКалендарьПредприятия.Получить();
		Если Константы.ПереноситьВыходныеИПраздникиМероприятий.Получить() И ЗначениеЗаполнено(ОсновнойКалендарьПредприятия) Тогда
			УстановитьПривилегированныйРежим(Истина);
			ПроизводственныйКалендарь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнойКалендарьПредприятия, "ПроизводственныйКалендарь");
			ПараметрыПолучения = КалендарныеГрафики.ПараметрыПолученияБлижайшихРабочихДат();
			ПараметрыПолучения.ПолучатьПредшествующие = Ложь;
			ПараметрыПолучения.ВызыватьИсключение = Ложь;
			свДата = НачалоДня(НовоеМероприятие.СрокВыполнения);
			свВремя = НовоеМероприятие.СрокВыполнения - свДата;
			мСрокВыполнения = Новый Массив;
			мСрокВыполнения.Добавить(свДата);
			ДниКалендаря = КалендарныеГрафики.БлижайшиеРабочиеДаты(ПроизводственныйКалендарь, мСрокВыполнения, ПараметрыПолучения);
			Если ЗначениеЗаполнено(ДниКалендаря) Тогда
				НовоеМероприятие.СрокВыполнения = ДниКалендаря.Получить(свДата) + свВремя;  
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось установить срок мероприятия, возможно не заполнен календарь";
				Сообщение.Сообщить();  
			КонецЕсли;
			УстановитьПривилегированныйРежим(Ложь);	
		КонецЕсли;
	КонецЕсли;
	//--КазанцевЯА-БП
	
	Попытка
		НовоеМероприятие.Записать();
		Автоинформирование.СформироватьЗаданиеИзБизнесПроцесса(НовоеМероприятие);
	Исключение
		Отказ = Истина;
		Возврат;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПроверкаЗаполненияПолейПередВыполнением(Отказ, ТекстСообщения)
	ТекстСообщения = "";
	ОтказПроверкиЗаполнения = Ложь;
	Если Объект.Результат.Пустая() И Не МероприятиеБезРезультатов() Тогда
		ОтказПроверкиЗаполнения = Истина;
		ТекстСообщения = "Результат мероприятия должен быть определен!";
		//Возврат;
	КонецЕсли;
	Если Не ОтказПроверкиЗаполнения И Объект.Результат.УказатьКонтактноеЛицо И 
			Объект.КонтактноеЛицо.Пустая() Тогда
		ОтказПроверкиЗаполнения = Истина;
		ТекстСообщения = "Поле ""Контактное лицо"" должно быть заполнено!";
		//Возврат;
	КонецЕсли;
	Если Не ОтказПроверкиЗаполнения И Объект.Результат.ПрикрепитьФайл И 
				Не ЗначениеЗаполнено(Объект.СвязанныйДокумент) Тогда
		ОтказПроверкиЗаполнения = Истина;
		ТекстСообщения = "Связанный документ должен быть указан!";
		//Возврат;
	КонецЕсли;
	Если Не ОтказПроверкиЗаполнения И Объект.Результат.ЗаполнитьКомментарий И 
			Не ЗначениеЗаполнено(Объект.Комментарий) Тогда
		ОтказПроверкиЗаполнения = Истина;
		ТекстСообщения = "Комментарий должен быть заполнен!";
		//Возврат;
	КонецЕсли;
	Отказ = ОтказПроверкиЗаполнения;
КонецПроцедуры

#КонецОбласти

#Область Конфигурация

// Расширяется в блоке ЖКХ
&НаСервереБезКонтекста
Функция ОсновныеОбъекты()

	Основные = Новый Массив;
	Основные.Добавить(Тип("СправочникСсылка.ДолговыеОбязательства"));
	
	Возврат Основные;

КонецФункции // ()


#КонецОбласти

&НаСервере
Функция ПолучитьМоментВремени(ДатаВыполнения)
	Возврат Задачи.Мероприятие.ПолучитьМоментВремени(ДатаВыполнения);
КонецФункции

&НаСервере
Процедура СохранитьСостояниеБП()
	Если Не Объект.БизнесПроцесс.Пустая() Тогда
		Объект.ВыполненныеСтрелки.Загрузить(Объект.БизнесПроцесс.ВыполненныеСтрелки.Выгрузить());
		Объект.ЗапущенныеСтадии.Загрузить(Объект.БизнесПроцесс.ЗапущенныеСтадии.Выгрузить());
	КонецЕсли;
КонецПроцедуры              

&НаСервере
Функция ПолучитьОтветственного(ОбъектСсылка, ОбъектПодразделение)
	Набор = РегистрыСведений.ОтветственныеСотрудники.СоздатьМенеджерЗаписи();
	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.ИсполнительныеДокументы") Тогда
		Набор.Объект = ОбъектСсылка.Владелец;
	Иначе
		Набор.Объект = ОбъектСсылка;
	КонецЕсли;
	Набор.ТипСотрудника = ПланыВидовХарактеристик.ТипыСотрудников.РуководительПодразделения;
	Набор.Прочитать();
	Если Не Набор.Пользователь.Пустая() Тогда
		Возврат Набор.Пользователь;
	КонецЕсли;
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Сотрудник
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	                      |			,
	                      |			Подразделение = &Подразделение
	                      |				И Объект = &Объект
	                      |				И Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки");
	Запрос.УстановитьПараметр("Подразделение", ОбъектПодразделение);
	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.ИсполнительныеДокументы") Тогда
		Запрос.УстановитьПараметр("Объект", ОбъектСсылка.Владелец);
	Иначе
		Запрос.УстановитьПараметр("Объект", ОбъектСсылка);
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Сотрудник;
	Иначе
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоДереву(Команда)
	#Если ВебКлиент Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сценарии диалога не поддерживаются на Веб-Клиенте!";
		Сообщение.Сообщить();
		Возврат;
	#КонецЕсли	

	Если Объект.ТипМероприятия.Пустая() Тогда
		Сообщить("Тип мероприятия должен быть заполнен!");
		Возврат;
	Иначе                       
		//Объект.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
		Если Не ЗначениеЗаполнено(Объект.ФактическаяДата) Тогда
			Объект.ФактическаяДата = ОбщегоНазначенияКлиент.ДатаСеанса();
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ПланируемаяДата) Тогда
			Объект.ПланируемаяДата = ОбщегоНазначенияКлиент.ДатаСеанса();
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ПланируемоеВремя) Тогда
			Объект.ПланируемоеВремя = ОбщегоНазначенияКлиент.ДатаСеанса();
		КонецЕсли;
		Сценарий = ПолучитьСценарийДиалогаПоТипуМероприятия(Объект.ТипМероприятия);
		Если Сценарий.Пустая() Тогда
			Сообщить("Для данного типа мероприятия сценарий диалога не определен!");
		Иначе
			Форма = ПолучитьФорму("Обработка.СценарийДиалога.Форма.ФормаОбработки",,ЭтаФорма);
			Форма.Макет = Сценарий;
			Форма.Открыть();
			//Чуров А.И.
			//Если ОткрытьФорму(Форма) = Истина Тогда
			////Если Форма.ОткрытьМодально() = Истина Тогда
			//	РезультатПриИзменении(Элементы.Результат);
			//КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСценарийДиалогаПоТипуМероприятия(ТипМероприятия)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСкоринга.ПустаяСсылка) КАК Скоринг,
	                      |	ЗНАЧЕНИЕ(Справочник.Категории.ПустаяСсылка) КАК Категория
	                      |ПОМЕСТИТЬ Таблица
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	СостоянияПоКатегориямОстатки.Скоринг,
	                      |	СостоянияПоКатегориямОстатки.Категория
	                      |ИЗ
	                      |	РегистрНакопления.СостоянияПоКатегориям.Остатки(, Объект = &Объект) КАК СостоянияПоКатегориямОстатки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	НастройкаСценариев.Сценарий
	                      |ИЗ
	                      |	Таблица КАК Таблица,
	                      |	РегистрСведений.НастройкаСценариев КАК НастройкаСценариев
	                      |ГДЕ
	                      |	(Таблица.Скоринг = НастройкаСценариев.Скоринг
	                      |			ИЛИ НастройкаСценариев.Скоринг = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСкоринга.ПустаяСсылка))
	                      |	И (Таблица.Категория = НастройкаСценариев.Категория
	                      |			ИЛИ НастройкаСценариев.Категория = ЗНАЧЕНИЕ(Справочник.Категории.ПустаяСсылка))
	                      |	И НастройкаСценариев.Используется = ИСТИНА
	                      |	И НастройкаСценариев.ТипМероприятия = &ТипМероприятия
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НастройкаСценариев.Приоритет УБЫВ");
	Запрос.УстановитьПараметр("Объект", Объект.Объект);
	Запрос.УстановитьПараметр("ТипМероприятия", ТипМероприятия);	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Сценарий;
	Иначе
		Возврат ПредопределенноеЗначение("Справочник.ДеревоРешений.ПустаяСсылка");	
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура РезультатПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.ФактическаяДата) Тогда
		Объект.ФактическаяДата = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли;
	
	ДобавитьДополнительныеРеквизиты();
	
	СвязанныйДокумент = ЗаполнитьДанныеПоРезультату();
	Если СвязанныйДокумент = ПредопределенноеЗначение("Перечисление.ВидыСвязанныхДокументов.ОбещанныйПлатеж") Тогда
		Элементы.ГруппаСвязанныйДокумент.Видимость = Истина;
		Если Элемент <> Неопределено Тогда
			Если Не ЗначениеЗаполнено(Объект.СвязанныйДокумент) ИЛИ 
					ТипЗнч(Объект.СвязанныйДокумент) <> Тип("ДокументСсылка.ОбещанныеПлатежи") Тогда
				Форма = ПолучитьФорму("Документ.ОбещанныеПлатежи.Форма.ФормаДокумента",, ЭтаФорма);	
				Форма.Объект.Объект = Объект.Объект;
				// Процедура ЗакрепитьДолжникаНаСервере не работает из связанного документа!
				ПоказатьОповещениеПользователя("Обещанные платежи",,"Обещание сохранено",БиблиотекаКартинок.NC_ПодсистемаКонтрольЗадолженности);
				ЗакрепитьДолжникаНаСервере();
				Форма.ОткрытьМодально();
				Если Не Форма.Объект.Ссылка.Пустая() Тогда
					Объект.СвязанныйДокумент = Форма.Объект.Ссылка;
				Иначе
					Объект.СвязанныйДокумент = ПредопределенноеЗначение("Документ.ОбещанныеПлатежи.ПустаяСсылка");
				КонецЕсли;
			Иначе
				//Чуров
				//ПоказатьЗначение(,Объект.СвязанныйДокумент);
				ОткрытьЗначение(Объект.СвязанныйДокумент);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли СвязанныйДокумент = ПредопределенноеЗначение("Перечисление.ВидыСвязанныхДокументов.НеподтвержденныйПлатеж") 
			Тогда
		Элементы.ГруппаСвязанныйДокумент.Видимость = Истина;
		Если Элемент <> Неопределено Тогда
			Если Не ЗначениеЗаполнено(Объект.СвязанныйДокумент) 
					ИЛИ ТипЗнч(Объект.СвязанныйДокумент) <> Тип("ДокументСсылка.НеподтвержденныеПлатежи") Тогда

				ВходящиеПараметры = Новый Структура;
				ВходящиеПараметры.Вставить("ВходящийОбъект", Объект.Объект);
				ОткрытьФорму("Документ.НеподтвержденныеПлатежи.Форма.ФормаДокумента", ВходящиеПараметры, ЭтаФорма);

			Иначе
				//ПоказатьЗначение(,Объект.СвязанныйДокумент);
				ОткрытьЗначение(Объект.СвязанныйДокумент); 
			КонецЕсли;      
		КонецЕсли;	
		
	ИначеЕсли СвязанныйДокумент = ПредопределенноеЗначение("Перечисление.ВидыСвязанныхДокументов.ПрикрепитьФайлы") Тогда
		Элементы.ГруппаСвязанныйДокумент.Видимость = Истина;
		Если ТипЗнч(Объект.СвязанныйДокумент) <> Тип("ДокументСсылка.ПрикрепитьФайлы") Тогда
			Объект.СвязанныйДокумент = ПредопределенноеЗначение("Документ.ПрикрепитьФайлы.ПустаяСсылка");
		КонецЕсли;
			
	ИначеЕсли СвязанныйДокумент = ПредопределенноеЗначение("Перечисление.ВидыСвязанныхДокументов.УдалитьРеструктуризацияДолга") Тогда	
		Элементы.ГруппаСвязанныйДокумент.Видимость = Истина;
		Если ТипЗнч(Объект.СвязанныйДокумент) <> Тип("ДокументСсылка.УдалитьРеструктуризацияДолга") Тогда
			Объект.СвязанныйДокумент = ПредопределенноеЗначение("Документ.УдалитьРеструктуризацияДолга.ПустаяСсылка");
		КонецЕсли;
		
	ИначеЕсли СвязанныйДокумент = ПредопределенноеЗначение("Перечисление.ВидыСвязанныхДокументов.ЗагрузкаЗадолженности") Тогда	
		Элементы.ГруппаСвязанныйДокумент.Видимость = Истина;
		Если ТипЗнч(Объект.СвязанныйДокумент) <> Тип("ДокументСсылка.ЗагрузкаЗадолженности") Тогда
			Объект.СвязанныйДокумент = ПредопределенноеЗначение("Документ.ЗагрузкаЗадолженности.ПустаяСсылка");
		КонецЕсли;
		
	ИначеЕсли СвязанныйДокумент = ПредопределенноеЗначение("Перечисление.ВидыСвязанныхДокументов.ПоступлениеПлатежей") Тогда	
		Элементы.ГруппаСвязанныйДокумент.Видимость = Истина;
		Если ТипЗнч(Объект.СвязанныйДокумент) <> Тип("ДокументСсылка.ПоступлениеПлатежей") Тогда
			Объект.СвязанныйДокумент = ПредопределенноеЗначение("Документ.ПоступлениеПлатежей.ПустаяСсылка");
		КонецЕсли;
		
	ИначеЕсли СвязанныйДокумент = ПредопределенноеЗначение("Перечисление.ВидыСвязанныхДокументов.АктуализацияЗадолженности") Тогда	
		Элементы.ГруппаСвязанныйДокумент.Видимость = Истина;
		Если ТипЗнч(Объект.СвязанныйДокумент) <> Тип("ДокументСсылка.АктуализацияЗадолженности") Тогда
			Объект.СвязанныйДокумент = ПредопределенноеЗначение("Документ.АктуализацияЗадолженности.ПустаяСсылка");
		КонецЕсли;
		
	ИначеЕсли СвязанныйДокумент = ПредопределенноеЗначение("Перечисление.ВидыСвязанныхДокументов.ВходящаяКорреспонденция") Тогда	
		Элементы.ГруппаСвязанныйДокумент.Видимость = Истина;
		Если ТипЗнч(Объект.СвязанныйДокумент) <> Тип("СправочникСсылка.ВходящаяКорреспонденция") Тогда
			Объект.СвязанныйДокумент = ПредопределенноеЗначение("Справочник.ВходящаяКорреспонденция.ПустаяСсылка");
		КонецЕсли;
	ИначеЕсли СвязанныйДокумент = ПредопределенноеЗначение("Перечисление.ВидыСвязанныхДокументов.ИсходящаяКорреспонденция") Тогда	
		Элементы.ГруппаСвязанныйДокумент.Видимость = Истина;
		Если ТипЗнч(Объект.СвязанныйДокумент) <> Тип("СправочникСсылка.ИсходящаяКорреспонденция") Тогда
			Объект.СвязанныйДокумент = ПредопределенноеЗначение("Справочник.ИсходящаяКорреспонденция.ПустаяСсылка");
		КонецЕсли;
	// Лебедева 05.06.2018 => 06.06.2018
	ИначеЕсли СвязанныйДокумент = ПредопределенноеЗначение("Перечисление.ВидыСвязанныхДокументов.ЗавершениеРаботыОрганизации") Тогда	
		Элементы.ГруппаСвязанныйДокумент.Видимость = Истина;
		Если Не ЗначениеЗаполнено(Объект.СвязанныйДокумент) ИЛИ  ТипЗнч(Объект.СвязанныйДокумент) <> Тип("ДокументСсылка.ЗавершениеРаботыОрганизации") Тогда
			Форма = ПолучитьФорму("Документ.ЗавершениеРаботыОрганизации.Форма.ФормаДокумента",, ЭтаФорма);
			//Заполнение ДО = > из Мероприятия
			Форма.Объект.Объекты.Очистить();
			СтрокаДО = Форма.Объект.Объекты.Добавить();
			СтрокаДО.Объект = Объект.Объект; 
			ОткрытьФорму(Форма);
			Если Не Форма.Объект.Ссылка.Пустая() Тогда
				Объект.СвязанныйДокумент = Форма.Объект.Ссылка;
			Иначе
				Объект.СвязанныйДокумент = ПредопределенноеЗначение("Документ.ЗавершениеРаботыОрганизации.ПустаяСсылка");
			КонецЕсли;
		Иначе
			ОткрытьЗначение(Объект.СвязанныйДокумент);
		КонецЕсли;
	ИначеЕсли СвязанныйДокумент = ПредопределенноеЗначение("Перечисление.ВидыСвязанныхДокументов.АктПередачи") Тогда	
		Элементы.ГруппаСвязанныйДокумент.Видимость = Истина;
		Если ТипЗнч(Объект.СвязанныйДокумент) <> Тип("ДокументСсылка.АктПередачи") Тогда
			Объект.СвязанныйДокумент = ПредопределенноеЗначение("Документ.АктПередачи.ПустаяСсылка");
		КонецЕсли;
		//Если Не ЗначениеЗаполнено(Объект.СвязанныйДокумент) ИЛИ 
		//	ТипЗнч(Объект.СвязанныйДокумент) <> Тип("ДокументСсылка.АктПередачи") Тогда
		//	Форма = ПолучитьФорму("Документ.АктПередачи.Форма.ФормаДокумента",, ЭтаФорма);
		//	//Заполнение реквизитов Акта из результата мероприятия
		//	Форма.Объект.Организация = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "Организация");
		//	Форма.Объект.ПодразделениеПринимающее = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "ПодразделениеПринимающее");
		//	Форма.Объект.СотрудникПринимающий = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "СотрудникПринимающий");
		//	Форма.Объект.ТипСотрудникаПринимающего = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "ТипСотрудникаПринимающего");
		//	Форма.Объект.ПодразделениеПередающее = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "ПодразделениеПередающее");
		//	Форма.Объект.СотрудникПередающий = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "СотрудникПередающий");
		//	Форма.Объект.ТипСотрудникаПередающего = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "ТипСотрудникаПередающего");
		//	//Заполнение ДО = > из Мероприятия
		//	Форма.Объект.Объекты.Очистить();
		//	СтрокаДО = Форма.Объект.Объекты.Добавить();
		//	СтрокаДО.Объект = Объект.Объект; 
		//	СтрокаДО.ДолговоеОбязательство = Объект.Объект;
		//	ОткрытьФорму(Форма);
		//	Если Не Форма.Объект.Ссылка.Пустая() Тогда
		//		Объект.СвязанныйДокумент = Форма.Объект.Ссылка;
		//	Иначе
		//		Объект.СвязанныйДокумент = ПредопределенноеЗначение("Документ.АктПередачи.ПустаяСсылка");
		//	КонецЕсли;
		//Иначе
		//	ОткрытьЗначение(Объект.СвязанныйДокумент);
		//КонецЕсли;
	ИначеЕсли СвязанныйДокумент = ПредопределенноеЗначение("Перечисление.ВидыСвязанныхДокументов.СудебноеДело") Тогда
		Элементы.ГруппаСвязанныйДокумент.Видимость = Истина;
		Если ТипЗнч(Объект.СвязанныйДокумент) <> Тип("ДокументСсылка.СудебноеДело") Тогда
			Объект.СвязанныйДокумент = ПредопределенноеЗначение("Документ.СудебноеДело.ПустаяСсылка");
			Элементы.ПрикрепитьСудебноеДело.Видимость = Истина;
		КонецЕсли;
	Иначе
		// Если мероприятие подразумевает прикрепление документа, то поле формы должно быть доступно всегда
		//Если Не ЗначениеЗаполнено(Объект.СвязанныйДокумент) Тогда
		//	
		//	Объект.СвязанныйДокумент = Неопределено;
		//	Элементы.СвязанныйДокумент.Доступность = Ложь;  
		//КонецЕсли;
	КонецЕсли;
	
	//
	Если Не Объект.Результат.Пустая() И Не ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "СвязанныйДокумент.Пустая()") И
			ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "ПрикрепитьФайл") Тогда
		Элементы.СвязанныйДокумент.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.СвязанныйДокумент.АвтоОтметкаНезаполненного = Неопределено;
	КонецЕсли;
	
	//
	Элементы.Комментарий.АвтоОтметкаНезаполненного = ?(ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, 
			"ЗаполнитьКомментарий"), Истина, Неопределено);
	
	Если Элемент <> Неопределено Тогда
		ЗаполнитьКомментарий();
	КонецЕсли;
	//Лебедева, 26.02.2018 если у РЕЗУЛЬАТАТА МЕРОПРИЯТИЯ связанный документ = прикрепить файлы, тогда показываем кнопку "Файл".
	Элементы.ПрикрепитьФайл.Видимость = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "ПрикреплятьФайлВМероприятие");
	Элементы.ПрикрепитьАктПередачи.Видимость = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "ПрикреплятьАктПередачи");
	ДобавитьДополнительныеРеквизитыОбъекта();   
	ПроверитьДопРеквизитыВРезультате();
	
	// Обновить комментарий при установке результата "Входящий звонок"
	РезультатВходящийЗвонокНаСервере();
	Если ЭтаФорма.Объект.Результат = ЭтаФорма.РезультатВходящийЗвонок Тогда
		ВходящийЗвонокПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВыполнитьФункциюКомментария()
	Значение = "";	
	ПеренестиТЧДопРеквизиты();
	Реквизит = РеквизитФормыВЗначение("Объект");	
 	Возврат Справочники.ФункцииКомментариев.ВычислитьФункцию(Объект.Результат.ШаблонКомментария.Функция, Реквизит,
			Значение);	
КонецФункции

&НаСервере
Функция ЗаполнитьДанныеПоРезультату()
	Если Объект.Результат.Пустая() Тогда
		Объект.СледующееМероприятие = Неопределено;
		Возврат "";
	Иначе
		Объект.СледующееМероприятие = Объект.Результат.ТипСледующегоМероприятия;
		Возврат Объект.Результат.СвязанныйДокумент;
	КонецЕсли;
	
	//Элементы.КонтактноеЛицо.АвтоОтметкаНезаполненного = Объект.Результат.УказатьКонтактноеЛицо;
	//Элементы.ПрикрепитьФайл.АвтоОтметкаНезаполненного = Объект.Результат.ПрикрепитьФайл;
КонецФункции

&НаСервере
Функция МероприятиеБезРезультатов()
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	РезультатыМероприятий.Ссылка
	                      |ИЗ
	                      |	Справочник.РезультатыМероприятий КАК РезультатыМероприятий
	                      |ГДЕ
	                      |	РезультатыМероприятий.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", Объект.ТипМероприятия);
	Возврат Запрос.Выполнить().Пустой();
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Обновить родителя формы
	Если ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("ТаблицаФормы") И ЭтаФорма.ВладелецФормы.Видимость = Истина Тогда
		ЭтаФорма.ВладелецФормы.Обновить();
	КонецЕсли;
	Оповестить("ОбновитьТД");
КонецПроцедуры

&НаСервере
функция ПроверкаТелефонныйЗвонокИсходящий()
	Возврат Справочники.ТипыМероприятий.ТелефонныйЗвонокИсходящий;	
КонецФункции

&НаКлиенте
Процедура УстановитьСтатусНеБеспокоить()
	ФормаНабора = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
	Если ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусНеБеспокоить = Ложь И ФормаНабора.ИдетРазговор = Ложь Тогда
		ПоказатьОповещениеПользователя("БИТ.Phone",,"Установка статуса «Не беспокоить»...",БиблиотекаКартинок.NC_НеБеспокоить);
		ЭтаФорма.УстановленСтатусНеБеспокоить = Истина;
		ФормаНабора.кнНеБеспокоить(Неопределено);
		ПодключитьОбработчикОжидания("ВключитьДоступностьГруппыЗвонка", 3, Истина);
	Иначе
		// Разрешить управление звонком
		ВключитьДоступностьГруппыЗвонка();
	КонецЕсли;
	// Передать управление обработчику ожидания
	ПодключитьОбработчикОжидания("ПроверитьСостояниеБИТФон", 1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьДоступностьГруппыЗвонка()
	ЭтаФорма.Элементы.ГруппаУправлениеЗвонком.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВключитьДоступностьГруппыЗвонка()
	ЭтаФорма.Элементы.ГруппаУправлениеЗвонком.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСостояниеБИТФон()
	ФормаНабора = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
	Если ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусПодключен = Истина И ФормаНабора.МикрофонВключен = Истина
		ИЛИ ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусНеБеспокоить = Истина И ФормаНабора.МикрофонВключен = Истина Тогда
		ЭтаФорма.Элементы.ОтключитьМикрофон.ЦветФона = Новый Цвет();
	ИначеЕсли ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусПодключен = Истина И ФормаНабора.МикрофонВключен = Ложь
		ИЛИ ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусНеБеспокоить = Истина И ФормаНабора.МикрофонВключен = Ложь Тогда
		// Исправить произвольное включение микрофона, если получено значение Ложь
		ФормаНабора.КнОМик(Неопределено);
		ФормаНабора.КнОМик(Неопределено);
		//
		ЭтаФорма.Элементы.ОтключитьМикрофон.ЦветФона = WebЦвета.СветлоРозовый;
	ИначеЕсли ФормаНабора.Открыта() = Ложь ИЛИ ФормаНабора.СтатусПодключен = Ложь И ФормаНабора.СтатусНеБеспокоить = Ложь Тогда
		ЭтаФорма.Элементы.ОтключитьМикрофон.ЦветФона = Новый Цвет();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура НеопознанныйОбъектНаСервере()	
	ЭтаФорма.Объект.Объект = Справочники.ДолговыеОбязательства.НайтиПоНаименованию("Неопознанный");
КонецПроцедуры

&НаСервере
Процедура ДобавитьДополнительныеРеквизиты()
	//Элементы.КонтактноеЛицо.Видимость = (Не Объект.ТипМероприятия.Пустая() И 
	//		Не Объект.ТипМероприятия.ВидКИДляИсходящегоЗвонка.Пустая()) ИЛИ (Не Объект.ТипМероприятия.Пустая() И ЗначениеЗаполнено(Объект.ТипМероприятия.ВидКИДляРассылки));		
	//Элементы.ГруппаКонтакт.Видимость = Элементы.КонтактноеЛицо.Видимость;	
	
	УправлениеЗаполнением.ДобавитьДополнительныеРеквизиты(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТипМероприятияПриИзменении(Элемент)
	Если Объект.ТипМероприятия.Пустая() Тогда
		Объект.Результат = ПредопределенноеЗначение("Справочник.РезультатыМероприятий.ПустаяСсылка");
		Элементы.ФормаПечатьУЭД.Видимость = Ложь;
		Элементы.ОтправитьСМС.Видимость = Ложь;
		Элементы.ПрикрепитьФайл.Видимость = Ложь;
		Элементы.ПрикрепитьАктПередачи.Видимость = Ложь;
		Элементы.Инструкция.Видимость = Ложь;
		Объект.Контакт = "";
		Элементы.ГруппаКонтакт.Видимость = Ложь;
		Объект.КонтактноеЛицо = Неопределено;
		Элементы.КонтактноеЛицо.Видимость = Ложь;
		// Скрыть дополнительные элементы
		ЭтаФорма.Элементы.ОткрепитьДолжника.Видимость = Ложь;
		ЭтаФорма.Элементы.ЗакрепитьДолжника.Видимость = Ложь;
		ЭтаФорма.Элементы.ВходящийЗвонок.Видимость = Ложь;
		ЭтаФорма.Элементы.НаписатьВWhatsApp.Видимость = Ложь;
		ЭтаФорма.Элементы.НаписатьВViber.Видимость = Ложь;
		Попытка
			Элементы.ПозвонитьДолжнику.Доступность = Истина;
		Исключение
		КонецПопытки;
	Иначе
		Если ТипСотрудника.Пустая() И Не ЗначениеЗаполнено(Ответственный) Тогда
			ТипСотрудника = ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "ТипСотрудника");
			ТипСотрудникаПриИзменении(Неопределено);
		КонецЕсли;
		
		Если Объект.Результат = ПредопределенноеЗначение("Справочник.РезультатыМероприятий.ПустаяСсылка") Тогда
			Объект.Результат = ПолучитьРезультатМероприятия(Объект.ТипМероприятия);
		КонецЕсли; 
		РезультатПриИзменении(Неопределено);
		
		Элементы.ФормаПечатьУЭД.Видимость = ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "КнопкаПечатиШаблона");
		Элементы.ОтправитьСМС.Видимость = ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "КнопкаОтправкиСМС");
		
		// Интеграция с подсистемой ВЦ
		ТипВЦНаСервере();
		Если ЭтаФорма.Объект.ТипМероприятия = ЭтаФорма.ТипВЦ Тогда
			ЭтаФорма.Элементы.НаписатьВWhatsApp.Видимость = Истина;
		ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Объект.ТипМероприятия) = Ложь ИЛИ ЭтаФорма.Объект.ТипМероприятия <> ТипВЦ Тогда
			ЭтаФорма.Элементы.НаписатьВWhatsApp.Видимость = Ложь;
		КонецЕсли;
		
		// Интеграция с подсистемой Вайбер
		ТипВайберНаСервере();
		Если ЭтаФорма.Объект.ТипМероприятия = ЭтаФорма.ТипВайбер Тогда
			ЭтаФорма.Элементы.НаписатьВViber.Видимость = Истина;
		ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Объект.ТипМероприятия) = Ложь ИЛИ ЭтаФорма.Объект.ТипМероприятия <> ТипВайбер Тогда
			ЭтаФорма.Элементы.НаписатьВViber.Видимость = Ложь;
		КонецЕсли;
		
		// Скрыть кнопки заявок
		НовоеЗакреплениеНаСервере();
		НовоеОткреплениеНаСервере();
		Если ЭтаФорма.Объект.ТипМероприятия = ЭтаФорма.ТипЗаявкаЗакрепление Тогда
			ЭтаФорма.Элементы.НовоеЗакрепление.Видимость = Ложь;
			ЭтаФорма.Элементы.НовоеОткрепление.Видимость = Ложь;
			ЭтаФорма.Элементы.ОткрепитьДолжника.Видимость = Ложь;
		ИначеЕсли ЭтаФорма.Объект.ТипМероприятия = ЭтаФорма.ТипЗаявкаОткрепление Тогда
			ЭтаФорма.Элементы.НовоеЗакрепление.Видимость = Ложь;
			ЭтаФорма.Элементы.НовоеОткрепление.Видимость = Ложь;
			ЭтаФорма.Элементы.ЗакрепитьДолжника.Видимость = Ложь;
		ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Объект.ТипМероприятия) = Ложь
			ИЛИ ЭтаФорма.Объект.ТипМероприятия <> ЭтаФорма.ТипЗаявкаОткрепление
			ИЛИ ЭтаФорма.Объект.ТипМероприятия <> ЭтаФорма.ТипЗаявкаЗакрепление Тогда
			ЭтаФорма.Элементы.ОткрепитьДолжника.Видимость = Ложь;
			ЭтаФорма.Элементы.ЗакрепитьДолжника.Видимость = Ложь;
		КонецЕсли;
		
		// Скрыть кнопку пометки входящего звонка
		Если ЭтаФорма.Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокВходящий") Тогда
			ЭтаФорма.Элементы.ВходящийЗвонок.Видимость = Истина;
		Иначе
			ЭтаФорма.Элементы.ВходящийЗвонок.Видимость = Ложь;
		КонецЕсли;
		
		Элементы.ОткрытьИнструментПлатежныеСистемы.Видимость = ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "КнопкаПлатежныеСистемы");
		
		//Элементы.ПрикрепитьФайл.Видимость = ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "КнопкаПрикрепленияФайла");
		
		Элементы.Инструкция.Заголовок = ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "Инструкция");
		//Элементы.Инструкция.Видимость = ЗначениеЗаполнено(Инструкция);
		
		Если ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "ВидКИДляИсходящегоЗвонка.Пустая()") Тогда
			Элементы.ГруппаКонтакт.Видимость = ЗначениеЗаполнено(ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "ВидКИДляРассылки"));
			Попытка
				Элементы.ПозвонитьДолжнику.Доступность = Ложь;
			Исключение
			КонецПопытки;
		Иначе
			Элементы.ГруппаКонтакт.Видимость = Истина;
			Попытка
				Элементы.ПозвонитьДолжнику.Доступность = Не ЗначениеЗаполнено(Объект.бтЗаписьРазговора); // могу звонить, только если нет записи разговора
			Исключение
			КонецПопытки;
			ЗаполнитьСписокКонтактов(Элемент = Неопределено);
			// Обработать список контактов
			ОбработатьСписокКонтактов();
		КонецЕсли;
		
		Попытка
			Если 
				//Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокИсходящий")
				//И НЕ 
				НЕ ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "ВидКИДляИсходящегоЗвонка.Пустая()") Тогда
				Элементы.ПозвонитьДолжнику.Доступность = Не ЗначениеЗаполнено(Объект.бтЗаписьРазговора); // могу звонить, только если нет записи разговора;
			Иначе
				Элементы.ПозвонитьДолжнику.Доступность = Ложь;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Если Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокВходящий") Тогда
		Элементы.ГруппаКонтакт.Видимость = Истина;
		Элементы.КонтактноеЛицо.Видимость = Истина;
	КонецЕсли;
	ДобавитьДополнительныеДанные();
	Сценарий = ПолучитьСценарийДиалогаПоТипуМероприятия(Объект.ТипМероприятия);
	Элементы.ФормаЗаполнитьПоДереву.Видимость = Не Сценарий.Пустая();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКонтактов(ЭлементНеопределено)
	Элементы.Контакт.СписокВыбора.Очистить();
	Если Не ЭлементНеопределено Тогда
		Объект.Контакт = "";
	КонецЕсли;
	
	Если Не Объект.ТипМероприятия.ВидКИДляИсходящегоЗвонка.Пустая() ИЛИ ЗначениеЗаполнено(Объект.ТипМероприятия.ВидКИДляРассылки) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка,
		                      |	ДополнительныеРеквизитыИСведения.ВидСтроки КАК ВидСтроки
		                      |ПОМЕСТИТЬ Табл
		                      |ИЗ
		                      |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		                      |ГДЕ
		                      |	ДополнительныеРеквизитыИСведения.ВидКИ = &ВидКИ
		                      |	И ДополнительныеРеквизитыИСведения.СправочникВладелец = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Контрагенты)
		                      |	И НЕ ДополнительныеРеквизитыИСведения.ПометкаУдаления
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВложенныйЗапрос.Свойство КАК Свойство,
		                      |	ВложенныйЗапрос.Значение КАК Значение,
		                      |	Табл.ВидСтроки КАК ВидСтроки,
		                      |	NULL КАК Комментарий
		                      |ИЗ
		                      |	Табл КАК Табл
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                      |			ДополнительныеСведения.Свойство КАК Свойство,
		                      |			ДополнительныеСведения.Значение КАК Значение
		                      |		ИЗ
		                      |			РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		                      |		ГДЕ
		                      |			ДополнительныеСведения.Объект = &Объект
		                      |		
		                      |		ОБЪЕДИНИТЬ ВСЕ
		                      |		
		                      |		ВЫБРАТЬ
		                      |			КонтрагентыДополнительныеРеквизиты.Свойство,
		                      |			КонтрагентыДополнительныеРеквизиты.Значение
		                      |		ИЗ
		                      |			Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
		                      |		ГДЕ
		                      |			КонтрагентыДополнительныеРеквизиты.Ссылка = &Объект) КАК ВложенныйЗапрос
		                      |		ПО Табл.Ссылка = ВложенныйЗапрос.Свойство
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	КонтрагентыТелефоны.ВидТелефона,
		                      |	КонтрагентыТелефоны.Номер,
		                      |	КонтрагентыТелефоны.КонтактноеЛицо,
		                      |	КонтрагентыТелефоны.Комментарий
		                      |ИЗ
		                      |	Справочник.Контрагенты.Телефоны КАК КонтрагентыТелефоны
		                      |ГДЕ
		                      |	КонтрагентыТелефоны.Ссылка = &Объект
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Свойство");
		ВидКИ = Объект.ТипМероприятия.ВидКИДляИсходящегоЗвонка;
		Если ЗначениеЗаполнено(Объект.ТипМероприятия.ВидКИДляРассылки) И ТипЗнч(Объект.ТипМероприятия.ВидКИДляРассылки) = Тип("СправочникСсылка.ВидыКИ") Тогда
			ВидКИ = Объект.ТипМероприятия.ВидКИДляРассылки;
		КонецЕсли;	
		Запрос.УстановитьПараметр("ВидКИ", ВидКИ);
		Запрос.УстановитьПараметр("Объект", КонтрагентКЛ);
		Результат = Запрос.Выполнить().Выбрать();
		//Элементы.Контакт.СписокВыбора.Очистить();
		Пока Результат.Следующий() Цикл 
			Если Результат.ВидСтроки = Перечисления.ВидыТипаСтрока.Телефон Тогда
				Ном = Найти(Результат.Значение, ";");	
				Стр = Лев(Результат.Значение, Ном - 1);	
				
				Ном = Найти(Стр, ",");
				Если Ном > 0 Тогда
					Элементы.Контакт.СписокВыбора.Добавить(Лев(Стр, Ном - 1), Результат.Свойство.Наименование + ": " + Стр);	
				Иначе
					Элементы.Контакт.СписокВыбора.Добавить(Стр, Результат.Свойство.Наименование + ": " + Стр);
				КонецЕсли;
				
			ИначеЕсли Результат.ВидСтроки = Перечисления.ВидыТипаСтрока.Адрес Тогда
				Ном = Найти(Результат.Значение, ";");	
				Стр = Лев(Результат.Значение, Ном - 1);		
				Элементы.Контакт.СписокВыбора.Добавить(Стр, Результат.Свойство.Наименование + ": " + Стр);
			Иначе
				Стр = Результат.Значение;
				Ном = Найти(Стр, ";");
				Если ТипЗнч(Результат.Свойство) = Тип("СправочникСсылка.ВидыТелефонов") Тогда
					Если ЗначениеЗаполнено(Результат.ВидСтроки) Тогда
						Абонент = Результат.ВидСтроки.ТипОтношенияКДолжнику.Наименование + Результат.ВидСтроки.Наименование;
					Иначе
						Абонент = Строка(Результат.Свойство);
					КонецЕсли;
					Если ЗначениеЗаполнено(Результат.ВидСтроки) И ЗначениеЗаполнено(Результат.Комментарий) Тогда
						// Выгрузить комментарий
						Абонент = Строка(Результат.ВидСтроки) + " " + "(" + Строка(Результат.Комментарий) + ")";
					КонецЕсли;
				Иначе
					Абонент = Результат.Свойство.Наименование;
				КонецЕсли;
				Пока Ном > 0 Цикл
					Элементы.Контакт.СписокВыбора.Добавить(Стр, Абонент + ": " + Лев(Стр, Ном - 1));
					Стр = Сред(Стр, Ном + 1);
				КонецЦикла;
				Если Стр <> "" Тогда
					Элементы.Контакт.СписокВыбора.Добавить(Стр, Абонент + ": " + Стр);
				КонецЕсли;
			КонецЕсли;		
		КонецЦикла;
		
		Если Объект.Контакт = "" И Элементы.Контакт.СписокВыбора.Количество() > 0 Тогда
			Объект.Контакт = Элементы.Контакт.СписокВыбора[0].Значение;
		КонецЕсли;
		
		// То же для долгового обязательства
		//////////////////////////////////
		Если ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка,
			                      |	ДополнительныеРеквизитыИСведения.ВидСтроки КАК ВидСтроки
			                      |ПОМЕСТИТЬ Табл
			                      |ИЗ
			                      |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
			                      |ГДЕ
			                      |	ДополнительныеРеквизитыИСведения.ВидКИ = &ВидКИ
			                      |	И ДополнительныеРеквизитыИСведения.СправочникВладелец = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_ДолговыеОбязательства)
			                      |	И НЕ ДополнительныеРеквизитыИСведения.ПометкаУдаления
			                      |;
			                      |
			                      |////////////////////////////////////////////////////////////////////////////////
			                      |ВЫБРАТЬ
			                      |	ВложенныйЗапрос.Свойство КАК Свойство,
			                      |	ВложенныйЗапрос.Значение КАК Значение,
			                      |	Табл.ВидСтроки КАК ВидСтроки,
			                      |	NULL КАК Комментарий
			                      |ИЗ
			                      |	Табл КАК Табл
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			                      |			ДополнительныеСведения.Свойство КАК Свойство,
			                      |			ДополнительныеСведения.Значение КАК Значение
			                      |		ИЗ
			                      |			РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			                      |		ГДЕ
			                      |			ДополнительныеСведения.Объект = &Объект
			                      |		
			                      |		ОБЪЕДИНИТЬ ВСЕ
			                      |		
			                      |		ВЫБРАТЬ
			                      |			КонтрагентыДополнительныеРеквизиты.Свойство,
			                      |			КонтрагентыДополнительныеРеквизиты.Значение
			                      |		ИЗ
			                      |			Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
			                      |		ГДЕ
			                      |			КонтрагентыДополнительныеРеквизиты.Ссылка = &Объект) КАК ВложенныйЗапрос
			                      |		ПО Табл.Ссылка = ВложенныйЗапрос.Свойство
			                      |
			                      |ОБЪЕДИНИТЬ ВСЕ
			                      |
			                      |ВЫБРАТЬ
			                      |	КонтрагентыТелефоны.ВидТелефона,
			                      |	КонтрагентыТелефоны.Номер,
			                      |	КонтрагентыТелефоны.КонтактноеЛицо,
			                      |	КонтрагентыТелефоны.Комментарий
			                      |ИЗ
			                      |	Справочник.Контрагенты.Телефоны КАК КонтрагентыТелефоны
			                      |ГДЕ
			                      |	КонтрагентыТелефоны.Ссылка = &Объект
			                      |
			                      |УПОРЯДОЧИТЬ ПО
			                      |	Свойство");
			ВидКИ = Объект.ТипМероприятия.ВидКИДляИсходящегоЗвонка;
			Если ЗначениеЗаполнено(Объект.ТипМероприятия.ВидКИДляРассылки) И ТипЗнч(Объект.ТипМероприятия.ВидКИДляРассылки) = Тип("СправочникСсылка.ВидыКИ") Тогда
				ВидКИ = Объект.ТипМероприятия.ВидКИДляРассылки;
			КонецЕсли;	
			Запрос.УстановитьПараметр("ВидКИ", ВидКИ);
			Запрос.УстановитьПараметр("Объект", Объект.Объект);
			Результат = Запрос.Выполнить().Выбрать();
			//Элементы.Контакт.СписокВыбора.Очистить();
			Пока Результат.Следующий() Цикл
				Если ТипЗнч(Результат.Значение) = Тип("СправочникСсылка.СудебныеПриставы") ИЛИ ТипЗнч(Результат.Значение) = Тип("СправочникСсылка.Судьи") Тогда
					Для Каждого Эл из Результат.Значение.Телефоны Цикл
						Стр = Эл.Номер;
						Ном = Найти(Стр, ";");
						Пока Ном > 0 Цикл
							Элементы.Контакт.СписокВыбора.Добавить(Стр, Результат.Свойство.Наименование + ": " + Результат.Значение.Наименование + ": " + Строка(Эл.ВидТелефона) + ": " + Лев(Стр, Ном - 1));
							Стр = Сред(Стр, Ном + 1);
						КонецЦикла;
						Если Стр <> "" Тогда
							Элементы.Контакт.СписокВыбора.Добавить(Стр, Результат.Свойство.Наименование + ": " + Результат.Значение.Наименование + ": " + Строка(Эл.ВидТелефона) + ": " + Стр);
						КонецЕсли;
					КонецЦикла;
				Иначе
					Если Результат.ВидСтроки = Перечисления.ВидыТипаСтрока.Телефон Тогда
						Ном = Найти(Результат.Значение, ";");	
						Стр = Лев(Результат.Значение, Ном - 1);	
						
						Ном = Найти(Стр, ",");
						Если Ном > 0 Тогда
							Элементы.Контакт.СписокВыбора.Добавить(Лев(Стр, Ном - 1), Результат.Свойство.Наименование + ": " + Стр);	
						Иначе
							Элементы.Контакт.СписокВыбора.Добавить(Стр, Результат.Свойство.Наименование + ": " + Стр);
						КонецЕсли;
						
					ИначеЕсли Результат.ВидСтроки = Перечисления.ВидыТипаСтрока.Адрес Тогда
						Ном = Найти(Результат.Значение, ";");	
						Стр = Лев(Результат.Значение, Ном - 1);		
						Элементы.Контакт.СписокВыбора.Добавить(Стр, Результат.Свойство.Наименование + ": " + Стр);
					Иначе
						Стр = Результат.Значение;
						Ном = Найти(Стр, ";");
						Если ТипЗнч(Результат.Свойство) = Тип("СправочникСсылка.ВидыТелефонов") Тогда
							Если ЗначениеЗаполнено(Результат.ВидСтроки) Тогда
								Абонент = Результат.ВидСтроки.ТипОтношенияКДолжнику.Наименование + Результат.ВидСтроки.Наименование;
							Иначе
								Абонент = Строка(Результат.Свойство);
							КонецЕсли;
							Если ЗначениеЗаполнено(Результат.ВидСтроки) И ЗначениеЗаполнено(Результат.Комментарий) Тогда
								// Выгрузить комментарий
								Абонент = Строка(Результат.ВидСтроки) + " " + "(" + Строка(Результат.Комментарий) + ")";
							КонецЕсли;
						Иначе
							Абонент = Результат.Свойство.Наименование;
						КонецЕсли;					
						Пока Ном > 0 Цикл
							Элементы.Контакт.СписокВыбора.Добавить(Стр, Абонент + ": " + Лев(Стр, Ном - 1));
							Стр = Сред(Стр, Ном + 1);
						КонецЦикла;
						Если Стр <> "" Тогда
							Элементы.Контакт.СписокВыбора.Добавить(Стр, Абонент + ": " + Стр);
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
			
			Если Объект.Контакт = "" И Элементы.Контакт.СписокВыбора.Количество() > 0 Тогда
				Объект.Контакт = Элементы.Контакт.СписокВыбора[0].Значение;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ДобавитьДополнительныеДанные()
	//Удалить текущие
	МассивРеквизитов = Новый Массив();
	Для Каждого Элемент Из ДополнительныеДанные.НайтиСтроки(Новый Структура()) Цикл
		МассивРеквизитов.Добавить("РеквизитДанные_" + СтрЗаменить(Элемент.Свойство.Код, " ", "_"));
		Элементы.Удалить(Элементы.Найти("РеквизитДанные_" + СтрЗаменить(Элемент.Свойство.Код, " ", "_")));
		ДополнительныеДанные.Удалить(Элемент);
	КонецЦикла;
	ЭтаФорма.ИзменитьРеквизиты(, МассивРеквизитов);
	
	//Добавить новые	
	Если Не Объект.ТипМероприятия.Пустая() И Не Объект.ТипМероприятия.ФункцияДопДанных.Пустая() И
			ЗначениеЗаполнено(Объект.Объект) Тогда
		ФункцияДопДанных = Объект.ТипМероприятия.ФункцияДопДанных;
		ДополнительныеДанные.Загрузить(ФункцияДопДанных.ВозвращаемыеКолонки.Выгрузить());
		ПолученноеЗначение = Справочники.ФункцииДополнительныхДанных.ВычислитьФункцию(
				ФункцияДопДанных.Функция, РеквизитФормыВЗначение("Объект"), ДополнительныеДанные.Выгрузить());
		ДополнительныеДанные.Загрузить(ПолученноеЗначение);
			
		Для Каждого Элемент Из ДополнительныеДанные Цикл 
			МассивРеквизитов.Очистить();
			Реквизит = Новый РеквизитФормы("РеквизитДанные_" + СтрЗаменить(Элемент.Свойство.Код, " ", "_"), Элемент.Свойство.ТипЗначения,, 
					Элемент.Свойство.Наименование);
			МассивРеквизитов.Добавить(Реквизит);		
			ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов);
			Выполнить("ЭтаФорма.РеквизитДанные_" + СтрЗаменить(Элемент.Свойство.Код, " ", "_") + " = Элемент.Значение;");
			
			ПолеФормы = Элементы.Добавить("РеквизитДанные_" + СтрЗаменить(Элемент.Свойство.Код, " ", "_"), Тип("ПолеФормы"), 
					Элементы.ГруппаДопДанные);
			ПолеФормы.Вид = ВидПоляФормы.ПолеВвода;
			ПолеФормы.ПутьКДанным = "РеквизитДанные_" + СтрЗаменить(Элемент.Свойство.Код, " ", "_");
			ПолеФормы.ВыбиратьТип = Ложь;
			ПолеФормы.ТолькоПросмотр = Истина;
			ПолеФормы.УстановитьДействие("Открытие", "ДополнительныеДанныеОткрытие");
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатМероприятия(ТипМероприятия)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 2
	                      |	РезультатыМероприятий.Ссылка
	                      |ИЗ
	                      |	Справочник.РезультатыМероприятий КАК РезультатыМероприятий
	                      |ГДЕ
	                      |	РезультатыМероприятий.Владелец = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ТипМероприятия);
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 1 Тогда
	    Возврат Таблица[0].Ссылка;
	Иначе
		Возврат Справочники.РезультатыМероприятий.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПозвонитьДолжнику(Команда)
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Контакт) Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.ДолговоеОбязательство) = Истина Тогда
			
			// Проверка на нарушение 230-ФЗ
			
			Если Не ЗначениеЗаполнено(Объект.ТипМероприятия) 
				И НЕ ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "ВидКИДляИсходящегоЗвонка.Пустая()") Тогда
				Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокИсходящий");	
			КонецЕсли;
			
			Если ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
				ОбъектДолжник = ОбъектыСервер.РазыменоватьСсылку(Объект.Объект, "Должник");
			ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
				ОбъектДолжник = Объект.Объект;
			Иначе
				Возврат;
			КонецЕсли;
			
			Если ОбъектыСервер.ПолучитьЗначениеКонстанты("ОтзывПерсональныхДанных") И ОбъектыСервер.РазыменоватьСсылку(ОбъектДолжник, "ОтзывПерсональныхДанных") Тогда
				Предупреждение("У данного должника отозваны персональные данные!",,"Отзыв персональных данных");
				// Пометить мероприятие на удаление и закрыть форму
				ПоказатьОповещениеПользователя("Удаление мероприятия",,"Установлена пометка удаления",БиблиотекаКартинок.NC_УдалениеМероприятия);
				ЭтаФорма.Объект.ПометкаУдаления = Истина;
				ЭтаФорма.Записать();
				ЭтаФорма.Закрыть();
				Возврат;
			КонецЕсли;	
			
			Если КонтрольСобытий.КонтрольЧасовогоПояса(ОбъектДолжник) Тогда
				Предупреждение("Данное действие приведет к нарушению 230-ФЗ!",,"Контроль часового пояса");
				// Пометить мероприятие на удаление и закрыть форму
				ПоказатьОповещениеПользователя("Удаление мероприятия",,"Установлена пометка удаления",БиблиотекаКартинок.NC_УдалениеМероприятия);
				ЭтаФорма.Объект.ПометкаУдаления = Истина;
				ЭтаФорма.Записать();
				ЭтаФорма.Закрыть();
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если КонтрольСобытий.РезультативныеЗвонки(ОбъектДолжник) Тогда
			Ответ = Вопрос("Действие приведет к нарушению 230-ФЗ! Вы уверены?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Контроль звонков");
			Если Ответ = КодВозвратаДиалога.Да Тогда
				// Создать новую запись в регистре нарушений 230-ФЗ
				ЗаписатьНарушениеПоЗвонкам();
			Иначе
				// Пометить мероприятие на удаление и закрыть форму
				ПоказатьОповещениеПользователя("Удаление мероприятия",,"Установлена пометка удаления",БиблиотекаКартинок.NC_УдалениеМероприятия);
				ЭтаФорма.Объект.ПометкаУдаления = Истина;
				ЭтаФорма.Записать();
				ЭтаФорма.Закрыть();
				Возврат;
			КонецЕсли;
		КонецЕсли;
			
			// Если ОбъектыСервер.ПолучитьЗначениеКонстанты("ЗапретТелефонныхНомеров") И КонтрольСобытий.ЗапретЗвонка(Элементы.ДолжникТелефоны.ТекущиеДанные.ЗапретЗвонка, Элементы.ДолжникТелефоны.ТекущиеДанные.НачалоЗапретаЗвонка, Элементы.ДолжникТелефоны.ТекущиеДанные.КонецЗапретаЗвонка) Тогда
			//	Предупреждение("Внимание! Для данного номера установлен запрет исходящих звонков");
			//	Возврат;
			// КонецЕсли;
		
		ВидТелефонии = Бит_ТелефонияСерверПереопределяемый.ПолучитьВидТелефонии();
		ЭтаФорма.КлючУникальности = Новый УникальныйИдентификатор;
		Если ВидТелефонии = ПредопределенноеЗначение("Перечисление.ВидыТелефонии.БИТФон") Тогда
			Ф = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
			Ф.ФормаМероприятие = ЭтаФорма.КлючУникальности;
			// Проверить состояние Битфона
			Если Ф.Открыта() = Ложь Тогда
				Ф.Открыть();
				ЭтаФорма.Активизировать();
				ЭтаФорма.УстановленСтатусНеБеспокоить = Истина;
				Ф.кнНеБеспокоить(Неопределено);
				ПоказатьОповещениеПользователя("БИТ.Phone",,"Установка статуса «Не беспокоить»...",БиблиотекаКартинок.NC_НеБеспокоить);
				// Передать управление обработчику ожидания
				ПодключитьОбработчикОжидания("УстановленСтатусНеБеспокоить", 5, Истина);
				//
			ИначеЕсли Ф.Открыта() = Истина И Ф.СтатусНеБеспокоить = Истина И Ф.ИдетРазговор = Ложь Тогда
				// Передать управление обработчику ожидания
				ПодключитьОбработчикОжидания("УстановленСтатусНеБеспокоить", 1, Истина);
				//
			ИначеЕсли Ф.Открыта() = Истина И Ф.СтатусПодключен = Истина И Ф.ИдетРазговор = Истина
				ИЛИ Ф.Открыта() = Истина И Ф.СтатусНеБеспокоить = Истина И Ф.ИдетРазговор = Истина Тогда
				Предупреждение("На канале уже идет разговор!",,"БИТ.Phone");
			КонецЕсли;
		КонецЕсли;
		// Передать управление обработчику ожидания
		ПодключитьОбработчикОжидания("ПроверитьСостояниеБИТФон", 1, Истина);
	Иначе
		Предупреждение("Не выбран контакт!",,"Исходящий звонок");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНарушениеПоЗвонкам()
	МенеджерЗаписи = РегистрыСведений.ЖурналНарушений.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Дата = ТекущаяДата();
	МенеджерЗаписи.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Договор = ЭтаФорма.Объект.Объект;
	МенеджерЗаписи.ТипНарушения = Перечисления.ТипыНарушений230ФЗ.ПревышениеКоличестваЗвонков;
	
	МенеджерЗаписи.Записать();
КонецПроцедуры

&НаКлиенте
Процедура УстановленСтатусНеБеспокоить()
	ПоказатьОповещениеПользователя("БИТ.Phone",,"Набор выбранного номера...",БиблиотекаКартинок.NC_ИсходящийЗвонок);
	ЭтаФорма.Элементы.ПозвонитьДолжнику.ЦветФона = WebЦвета.СветлоЗеленый;
	Ф = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма"); 
	Ф.НомерЛиния1 = Объект.Контакт;
	Ф.НомерЛиния2 = Объект.Контакт;
	Ф.НомерЛиния3 = Объект.Контакт;
	Ф.НомерЛиния4 = Объект.Контакт;
	Ф.НачатьРазговорКл(Неопределено);
	// Сбросить служебные флаги
	ЭтаФорма.УстановленСтатусНеБеспокоить = Ложь;
КонецПроцедуры
			
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Номер = Найти(Событие, ":");
	Если Номер > 0 Тогда
		Данные = Сред(Событие, Номер + 1);
		Событие = Лев(Событие, Номер - 1);
	Иначе
		Данные = "";
	КонецЕсли;
	
	
	Если Событие = "ТекущаяЗадача" Тогда
		////Элементы.Должник.ТолькоПросмотр = Истина;
		////
		////Должник = Неопределено;
		////ДО = Неопределено;
		////Кампания = Неопределено;
		////ПолучитьДолжникаИДОПоУИДТекущейЗадачи(Должник, ДО, Кампания, Данные);
		////
		////НовоеМероприятие();
		////Если Должник <> Неопределено Тогда
		////	//Создать форму
		////	ФормаМероприятия.Организация = ПолучитьТекущегоПользователя("Организация");
		////	ФормаМероприятия.Подразделение = ПолучитьТекущегоПользователя("Подразделение");
		////	ФормаМероприятия.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокИсходящий");
		////	ФормаМероприятия.Автор = Кампания;
		////	//ФормаМероприятия.Ответственный = ФормаМероприятия.Автор;
		////	//ФормаМероприятия.Исполнитель = ФормаМероприятия.Автор;
		////	ФормаМероприятия.Должник = Должник; 		
		////	ФормаМероприятия.ДолговоеОбязательство = ДО;
		////	ФормаМероприятия.ПланируемаяДата = ТекущаяДата();
		////	ФормаМероприятия.ПланируемоеВремя = ТекущаяДата();
		////	ФормаМероприятия.БизнесПроцесс = Кампания;
		////	
		////	ТипМероприятияПриИзменении(ФормаМероприятия);
		////	
		////	ЗаполнитьФормуМероприятием();
		////КонецЕсли;
		
	ИначеЕсли Событие = "Коммутация" Тогда
		//////СвязьПоВладельцуД_ДО(Истина);
		
		СтатусОператора = ПредопределенноеЗначение("Перечисление.СтатусыОператора.Занят");
		УстановитьСтатусОператора();
		Попытка
			КомпонентаОбъект.ПослатьУдаленноеСообщение(КЦАдресIPЦКТ, 5090, 5091, "СменилСтатус" + ":" + 
					ПолучитьНомерОператора());
		Исключение
		КонецПопытки;	
		
		Объект.бтЗаписьРазговора = Данные;
		////////Открыть форму
		////////Если Не ФормаМероприятия.Ссылка.Пустая() Тогда
		//////	//ОбъектМероприятие = ФормаМероприятия;
		//////	ЗаполнитьФормуМероприятием();
		//////	УстановитьОтбор(События1, "Должник", ОбъектМероприятие.Должник, Истина);
		//////	УстановитьОтбор(События1, "ДолговоеОбязательство", ОбъектМероприятие.ДолговоеОбязательство, 
		//////			Не ОбъектМероприятие.ДолговоеОбязательство.Пустая());
		//////	УстановитьОтбор(События2, "Должник", ОбъектМероприятие.Должник, Истина);
		//////	УстановитьОтбор(События2, "ДолговоеОбязательство", ОбъектМероприятие.ДолговоеОбязательство, 
		//////			Не ОбъектМероприятие.ДолговоеОбязательство.Пустая());
		//////	УстановитьОтбор(События3, "Должник", ОбъектМероприятие.Должник, Истина);
		//////	УстановитьОтбор(События3, "ДолговоеОбязательство", ОбъектМероприятие.ДолговоеОбязательство, 
		//////			Не ОбъектМероприятие.ДолговоеОбязательство.Пустая());
		//////	ПолучитьМакет(ФормаМероприятия);		
		//////	МакетПриИзменении(ФормаМероприятия);			
		//////	//НовоеМероприятие();
		////////КонецЕсли;
		
	ИначеЕсли Событие = "КоммутацияВходящийВызов" Тогда	
		////Элементы.Должник.ТолькоПросмотр = Ложь;
		////СвязьПоВладельцуД_ДО(Ложь);
		////		
		////СтатусОператора = ПредопределенноеЗначение("Перечисление.СтатусыОператора.Занят");
		////УстановитьСтатусОператора();
		////Попытка
		////	КомпонентаОбъект.ПослатьУдаленноеСообщение(КЦАдресIPЦКТ, 5090, 5091, "СменилСтатус" + ":" + 
		////			ПолучитьНомерОператора());
		////Исключение
		////КонецПопытки;
		////НовоеМероприятие();	
		////
		////ФормаМероприятия.Организация = ПолучитьТекущегоПользователя("Организация");
		////ФормаМероприятия.Подразделение = ПолучитьТекущегоПользователя("Подразделение");
		////ФормаМероприятия.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокВходящий");
		////ФормаМероприятия.Автор = ОбщегоНазначения.ТекущийПользователь();
		//////ФормаМероприятия.Ответственный = ФормаМероприятия.Автор;
		//////ФормаМероприятия.Исполнитель = ФормаМероприятия.Автор;
		////ФормаМероприятия.ПланируемаяДата = ТекущаяДата();
		////ФормаМероприятия.ПланируемоеВремя = ТекущаяДата();
		////ФормаМероприятия.бтЗаписьРазговора = Данные;
		////
		////ТипМероприятияПриИзменении(ФормаМероприятия);	
		////ЗаполнитьФормуМероприятием();
		////ПолучитьМакет(ФормаМероприятия);
		////МакетПриИзменении(ФормаМероприятия);
		
	ИначеЕсли Событие = "КоммутацияПереадресация"	Тогда
		////СтатусОператора = ПредопределенноеЗначение("Перечисление.СтатусыОператора.Занят");
		////УстановитьСтатусОператора();
		////Попытка
		////	КомпонентаОбъект.ПослатьУдаленноеСообщение(КЦАдресIPЦКТ, 5090, 5091, "СменилСтатус" + ":" + 
		////			ПолучитьНомерОператора());
		////Исключение
		////КонецПопытки;
		////
		////НовоеМероприятие(Данные);
		////
		////ЗаполнитьФормуМероприятием();
		////ПолучитьМакет(ФормаМероприятия);
		////МакетПриИзменении(ФормаМероприятия);
		
	ИначеЕсли Событие = "ОператорВключен" Тогда
		СтатусОператора = ПредопределенноеЗначение("Перечисление.СтатусыОператора.Включен");
		Элементы.ФормаКЦГотовПринятьЗвонок.Картинка = БиблиотекаКартинок.Пауза;
		Элементы.ФормаКЦГотовПринятьЗвонок.Заголовок = "Пауза";
		УстановитьСтатусОператора();
		КомпонентаОбъект.ПослатьУдаленноеСообщение(КЦАдресIPЦКТ, 5090, 5091, "СменилСтатус" + ":" + 
				ПолучитьНомерОператора());
		
	ИначеЕсли Событие = "ОператорНаПаузе" Тогда
		СтатусОператора = ПредопределенноеЗначение("Перечисление.СтатусыОператора.Пауза");	
		Элементы.ФормаКЦГотовПринятьЗвонок.Картинка = БиблиотекаКартинок.Продолжение;
		Элементы.ФормаКЦГотовПринятьЗвонок.Заголовок = "Продолжить";
		УстановитьСтатусОператора();
		КомпонентаОбъект.ПослатьУдаленноеСообщение(КЦАдресIPЦКТ, 5090, 5091, "СменилСтатус" + ":" + 
				ПолучитьНомерОператора());
		
	ИначеЕсли Событие = "ОператорВыключен" Тогда
		СтатусОператора = ПредопределенноеЗначение("Перечисление.СтатусыОператора.Выключен");
		СостояниеОператора = Неопределено;
		ТекущийУИДАбонента = Неопределено;
		Элементы.ФормаКЦГотовПринятьЗвонок.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;		
		Элементы.ФормаКЦГотовПринятьЗвонок.Заголовок = "Включен";
		УстановитьСтатусОператора();
		КомпонентаОбъект.ПослатьУдаленноеСообщение(КЦАдресIPЦКТ, 5090, 5091, "СменилСтатус" + ":" + 
				ПолучитьНомерОператора());
		//Кусок из ОБНОВИТЬ ОПЕРАТОРОВ
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОператоры Тогда
			//////КЦОбновитьОператоров(Неопределено);
		КонецЕсли;
		//
				
	ИначеЕсли Событие = "ГотовПринятьЗвонок" Тогда			
		СтатусОператора = ПредопределенноеЗначение("Перечисление.СтатусыОператора.Включен");
		УстановитьСтатусОператора();
		КомпонентаОбъект.ПослатьУдаленноеСообщение(КЦАдресIPЦКТ, 5090, 5091, "СменилСтатус" + ":" + 
				ПолучитьНомерОператора());
		
	ИначеЕсли Событие = "ОператорСвободен" Тогда
		СтатусОператора = ПредопределенноеЗначение("Перечисление.СтатусыОператора.Включен");
		УстановитьСтатусОператора();
		КомпонентаОбъект.ПослатьУдаленноеСообщение(КЦАдресIPЦКТ, 5090, 5091, "СменилСтатус" + ":" + 
				ПолучитьНомерОператора());
		
	ИначеЕсли Событие = "ОбновитьОператоров" Тогда
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОператоры Тогда
			//////КЦОбновитьОператоров(Неопределено);
		КонецЕсли;
		
	ИначеЕсли Событие = "ТестЗапрос" Тогда
		Если КомпонентаОбъект <> Неопределено Тогда
			КомпонентаОбъект.ПослатьУдаленноеСообщение(КЦАдресIPЦКТ, 5090, 5091, "ТестОтвет" + ":" + 
					ПолучитьНомерОператора());
		КонецЕсли;	
				
	ИначеЕсли Событие = "СообщениеПользователю" Тогда
		Сообщить(Данные);
	КонецЕсли;
		
	//Сообщить("ВнешнееСобытие - ФормаРабСтол " + Строка(Событие) + " " + Строка(Данные));
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерОператора()
    Возврат Формат(ПараметрыСеанса.ТекущийПользователь.НомерОператора, "ЧГ=");	
КонецФункции

&НаСервере
Процедура ПолучитьДолжникаИДОПоУИДТекущейЗадачи(Должник, ДО, Кампания, УИД)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КампанииОбзвонаДолговыеОбязательства.Должник,
	                      |	КампанииОбзвонаДолговыеОбязательства.ДолговоеОбязательство,
	                      |	КампанииОбзвонаДолговыеОбязательства.Ссылка
	                      |ИЗ
	                      |	БизнесПроцесс.КампанииОбзвона.ДолговыеОбязательства КАК КампанииОбзвонаДолговыеОбязательства
	                      |ГДЕ
	                      |	КампанииОбзвонаДолговыеОбязательства.УИД = &УИД");
	Попытка
		Запрос.УстановитьПараметр("УИД", Новый УникальныйИдентификатор(УИД));
	Исключение
		Должник = Неопределено;
		ДО = Неопределено;
		Кампания = Неопределено;
		Возврат;
	КонецПопытки;
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Должник = Результат.Должник;
		ДО = Результат.ДолговоеОбязательство;
		Кампания = Результат.Ссылка;
	Иначе
		Должник = Неопределено;
		ДО = Неопределено;
		Кампания = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусОператора()
	УстановитьПривилегированныйРежим(Истина);
	Набор = РегистрыСведений.СостоянияОператоров.СоздатьМенеджерЗаписи();
	Набор.Оператор = ПараметрыСеанса.ТекущийПользователь;
	Набор.СтатусОператора = СтатусОператора;
	Набор.СостояниеОператора = СостояниеОператора;
	Набор.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИЗакрыть(Команда)
	Отказ = Ложь;
	ПередВыполнением(Отказ);
	Если Не Отказ Тогда
		Попытка
			// Записать нулевую длительность разговора
			Если ЗначениеЗаполнено(ЭтаФорма.Объект.ДлительностьРазговора) = Ложь Тогда
				ЭтаФорма.Объект.ДлительностьРазговора = "0:00:00";
				Записать();
			КонецЕсли;
			Закрыть();
			// Вернуть сотрудника на линию
			ФормаНабора = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
			Если ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусПодключен = Ложь И ФормаНабора.ИдетРазговор = Ложь
				ИЛИ ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусНеБеспокоить = Истина И ФормаНабора.ИдетРазговор = Ложь Тогда
				ФормаНабора.КнПодключить(Неопределено);
				// Сбросить УИД формы мероприятия
				ФормаНабора.ФормаМероприятие = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Ответственный = ?(ТипСотрудника.Пустая(), Ответственный, ТипСотрудника); //!!!!!
	УправлениеСвойствами.ПередЗаписьюНаСервере2(ЭтаФорма, ТекущийОбъект, Отказ, ТекущийОбъект.Выполнена);
		
	Если РольДоступна("тсАдминистрирование") Тогда
		Отказ = Ложь;
	КонецЕсли;
	//ТекущийОбъект.ДополнительныеРеквизиты.Загрузить(ДополнительныеРеквизиты.Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ПеренестиТЧДопРеквизиты(Отказ = Ложь, ТекстСообщения = "")
	Для Каждого Элемент Из ДополнительныеРеквизиты Цикл
		Попытка
			Выполнить("Элемент.Значение = ЭтаФорма.Реквизит_" + СтрЗаменить(Элемент.Свойство.Код, " ", "_") + ";");
		Исключение
			Отказ = Истина;
			Возврат;
		КонецПопытки;
	КонецЦикла;
	
	Объект.ДополнительныеРеквизиты.Очистить();
	Для Каждого Элемент Из ДополнительныеРеквизиты Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
	        НоваяСтрока = Объект.ДополнительныеРеквизиты.Добавить();
			НоваяСтрока.Свойство = Элемент.Свойство;
			НоваяСтрока.Значение = Элемент.Значение;
		ИначеЕсли Элемент.Обязательное Тогда
			Отказ = Истина;	
			ТекстСообщения = "Не заполнены обязательные реквизиты!";
		КонецЕсли;
	КонецЦикла;
	//Объект.ДополнительныеРеквизиты.Загрузить(ДополнительныеРеквизиты.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеДанныеОткрытие(Элемент, СтандартнаяОбработка)
	Значение = Неопределено;
	Выполнить("Значение = " + Элемент.Имя + ";");
	
	Если ТипЗнч(Значение) = Тип("СправочникСсылка.ТипыПрикрепляемыхФайлов") Тогда
		СтандартнаяОбработка = Ложь;
		Путь = "";
        Данные = СписокВыборНаСервере(Значение, Путь);
		Если Данные = Неопределено Тогда
			// Использовать функцию Предупреждение
			Предупреждение("Файл не найден!");
			Возврат;
		КонецЕсли;
		Файл = Новый Файл(Путь);	
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		Диалог.Заголовок = "Выберите файл";
		Диалог.ПолноеИмяФайла = Файл.Имя; 
		Диалог.Фильтр = "*" + Файл.Расширение + "|*" + Файл.Расширение;  
		Диалог.МножественныйВыбор = Ложь;
		//Диалог.Каталог = ТекущиеДанные.Путь;
		Если Диалог.Выбрать() Тогда
			Данные.Записать(Диалог.ПолноеИмяФайла);
			ЗапуститьПриложение(Диалог.ПолноеИмяФайла);
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыОткрытие(Элемент, СтандартнаяОбработка)
	//Значение = Неопределено;
	//Выполнить("Значение = " + Элемент.Имя + ";");
	//
	//Если Значение = ПредопределенноеЗначение("Документ.ПрикрепитьФайлы.ПустаяСсылка") Тогда
	//	СтандартнаяОбработка = Ложь;
	//	
	//   	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	//	Диалог.Заголовок = "Выберите файл";
	//	//Диалог.ПолноеИмяФайла = НаборКонстант.ПутьКПапкеКомпоненты; 
	//	Диалог.Фильтр = "Все|*.*";  
	//	Диалог.МножественныйВыбор = Ложь;
	//	//Диалог.Каталог = ТекущиеДанные.Путь;
	//	Если Диалог.Выбрать() Тогда
	//		Форма = ПолучитьФорму("Документ.ПрикрепитьФайлы.Форма.ФормаДокумента",, ЭтаФорма);
	//		Форма.Объект.Объект = Объект.Объект;
	//		Форма.Записать();
	//		Выполнить(Элемент.Имя + " = Форма.Объект.Ссылка;");
	//		Форма.Объект.Файлы.Добавить().Путь = Диалог.ПолноеИмяФайла;
	//		Форма.Модифицированность = Истина;
	//		Форма.Открыть(); 					
	//	КонецЕсли;
	//КонецЕсли;
	
	// Лебедева; 19.02.2018
	СтандартнаяОбработка = Ложь;
	СтрокаЗапуска = "";
	Попытка
		Стр = СтрЗаменить(Элемент.Имя, "Реквизит_", "РеквизитСвойство_");
		Строки = ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Вычислить(Стр)));	
	Исключение		
		Стр = СтрЗаменить(Элемент.Имя, "Реквизит_", "РеквизитСвойство_");
		Строки = ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ОбъектыСервер.ПолучитьДопРиСПоКоду(
				СтрЗаменить(Сред(Элемент.Имя, 10), "_", " "))));
	КонецПопытки;
	Если Строки.Количество() > 0 Тогда
		СтрокаЗапуска = Строки[0].Значение;
	КонецЕсли;
		
	Попытка
		ЗапуститьПриложение(СтрокаЗапуска);
	Исключение
		//Чуров
		//ПоказатьЗначение(,СтрокаЗапуска);
		ОткрытьЗначение(СтрокаЗапуска);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыПриИзменении(Элемент)
	Модифицированность = Истина;
	ЗаполнитьКомментарий();
КонецПроцедуры

&НаСервере
Функция СписокВыборНаСервере(ТипФайла, Путь)
    Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                          |	ПрикрепитьФайлыФайлы.Хранилище,
                          |	ПрикрепитьФайлыФайлы.Путь
                          |ИЗ
                          |	Документ.ПрикрепитьФайлы.Файлы КАК ПрикрепитьФайлыФайлы
                          |ГДЕ
                          |	ПрикрепитьФайлыФайлы.Ссылка.Объект = &Объект
                          |	И ПрикрепитьФайлыФайлы.ТипФайла = &ТипФайла
                          |
                          |УПОРЯДОЧИТЬ ПО
                          |	ПрикрепитьФайлыФайлы.Ссылка.Дата УБЫВ");
	Запрос.УстановитьПараметр("Объект", Объект.Объект);
	Запрос.УстановитьПараметр("ТипФайла", ТипФайла);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Путь = Результат[0].Путь;
		Возврат Результат[0].Хранилище.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СвязанныйДокументОткрытие(Элемент, СтандартнаяОбработка)
	Если Объект.СвязанныйДокумент = ПредопределенноеЗначение("Документ.ПрикрепитьФайлы.ПустаяСсылка") Тогда
		СтандартнаяОбработка = Ложь;
		
   		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок = "Выберите файл";
		//Диалог.ПолноеИмяФайла = НаборКонстант.ПутьКПапкеКомпоненты; 
		Диалог.Фильтр = "Все|*.*";  
		Диалог.МножественныйВыбор = Ложь;
		//Диалог.Каталог = ТекущиеДанные.Путь;
		Если Диалог.Выбрать() Тогда
			ЗначЗаполнения = Новый Структура("ЗначенияЗаполнения", Новый Структура("Объект", Объект.Объект));			
			Форма = ПолучитьФорму("Документ.ПрикрепитьФайлы.Форма.ФормаДокумента", ЗначЗаполнения, ЭтаФорма);
			Форма.Записать();
			
			Объект.СвязанныйДокумент = Форма.Объект.Ссылка;
			Файл = Новый Файл(Диалог.ПолноеИмяФайла);
			СтрокаФайл = Форма.Объект.Файлы.Добавить();
			СтрокаФайл.Путь = Диалог.ПолноеИмяФайла;
			СтрокаФайл.Размер = Форма.ОкруглитьРазмерФайла(Файл.Размер());
			Форма.Модифицированность = Истина;
			Форма.Открыть(); 					
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыполнение(Команда) Экспорт
	Если ОтменитьВыполнениеЗадачи() Тогда
		//Элементы.ДекорацияВыполнено.Видимость = Ложь;
		//Элементы.ФормаОтменитьВыполнение.Доступность = Ложь;
		НастройкиНеИзменяемыеЭлементыПослеВыполнения();
		
		ОповеститьОбИзменении(Объект.Ссылка);
		Оповестить("ОбновитьТД");
		Оповестить("ОбновитьПланировщик", Ложь, Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОтменитьВыполнениеЗадачи()
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Объект.БизнесПроцесс.Пустая() Тогда
		//1) Проверяем есть ли выполненные мероприятия с более поздней датой
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	Мероприятие.Номер,
		                      |	Мероприятие.Дата
		                      |ИЗ
		                      |	Задача.Мероприятие КАК Мероприятие
		                      |ГДЕ
		                      |	(Мероприятие.ДатаВыполнения > &ДатаВыполнения
		                      |			ИЛИ Мероприятие.ДатаВыполнения = &ДатаВыполнения
		                      |				И Мероприятие.МоментВремени > &МоментВремени)
		                      |	И Мероприятие.БизнесПроцесс = &БизнесПроцесс
		                      |	И Мероприятие.Выполнена
		                      |	И (НЕ Мероприятие.ПометкаУдаления)
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Мероприятие.ДатаВыполнения УБЫВ,
		                      |	Мероприятие.МоментВремени УБЫВ");
		Запрос.УстановитьПараметр("БизнесПроцесс", Объект.БизнесПроцесс);
		Запрос.УстановитьПараметр("ДатаВыполнения", Объект.ДатаВыполнения);
		Запрос.УстановитьПараметр("МоментВремени", Объект.МоментВремени);
		
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Сначала необходимо отменить мероприятие с номером " + Результат.Номер;
			Сообщение.Сообщить();
			Возврат Ложь;	
		КонецЕсли;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		Если Не Объект.БизнесПроцесс.Пустая() Тогда	
			//2.1) помечаем мероприятия на удаление у которых дата >= текущеемероприятие.датавыполнения
			Запрос.Текст = "ВЫБРАТЬ
			               |	Мероприятие.Ссылка
			               |ИЗ
			               |	Задача.Мероприятие КАК Мероприятие
			               |ГДЕ
			               |	Мероприятие.Дата >= &ДатаВыполнения
			               |	И Мероприятие.БизнесПроцесс = &БизнесПроцесс
			               |	И (НЕ Мероприятие.Выполнена)
			               |	И (НЕ Мероприятие.ПометкаУдаления)";
			Результат = Запрос.Выполнить().Выбрать();
			Пока Результат.Следующий() Цикл
				ОбъектМероприятия = Результат.Ссылка.ПолучитьОбъект();
				ОбъектМероприятия.УстановитьПометкуУдаления(Истина);
			КонецЦикла;
			
			//4) восстанавливаем состояние БП
			БПОбъект = Объект.БизнесПроцесс.ПолучитьОбъект();
			БПОбъект.ВыполненныеСтрелки.Загрузить(Объект.ВыполненныеСтрелки.Выгрузить());
			БПОбъект.ЗапущенныеСтадии.Загрузить(Объект.ЗапущенныеСтадии.Выгрузить());
			БПОбъект.Завершен = Ложь;
			БПОбъект.Записать();
	    КонецЕсли;
	
		//3) Текущее мероприятие помечаем как не выполненное
		Объект.Выполнена = Ложь;
		Объект.ВыполненоКакНеАктуальное = Ложь;
		Объект.Исполнитель = Неопределено;
		Объект.ДатаВыполнения = Дата(1,1,1);
		Объект.МоментВремени = 0;
		Записать();	
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Сообщить("Ошибка блокировки!");
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Если Объект.Комментарий = "" Тогда 
		//Объект.КомментарийИзменен = Ложь;
	Иначе 
		Объект.КомментарийИзменен = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФактическаяДатаПриИзменении(Элемент)
	Если Объект.ФактическаяДата = Дата(1,1,1) Тогда
		Объект.ФактическаяДата = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли;
	ЗаполнитьКомментарий();
КонецПроцедуры

&НаКлиенте
Процедура ПланируемаяДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ПланируемаяДата)
		И Объект.ПланируемаяДата < НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		Объект.ПланируемаяДата = Дата(1, 1, 1);
		//Чуров
		ПоказатьПредупреждение(, "Указана дата меньше текущей!");
		//Вопрос("Указана дата меньше текущей!", РежимДиалогаВопрос.ОК);
	КонецЕсли;
	ЗаполнитьКомментарий();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Если Не Элементы.КонтактноеЛицо.Видимость Тогда
	//	Объект.КонтактноеЛицо = Неопределено;
	//	Объект.Контакт = "";
	//КонецЕсли;
		
	// Удаленная процедура создания акта передачи при открытии формы мероприятия
КонецПроцедуры

&НаКлиенте
Процедура ПечатьУЭД(Команда)

	ТекущийШаблон = ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "ПечатнаяФорма");
	Печатать = ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "КнопкаПечать");
	ПрикрепитьФайлы = ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "КнопкаПрикрепитьФайл");

	Если НЕ ЗначениеЗаполнено(ТекущийШаблон) Тогда
		
		ОткрытиеФормКлиент.ОткрытьФормуПечати(ЭтаФорма, Объект.Объект);
		
		Возврат;
		
	КонецЕсли;
	
	Если ЭтоУниверсальнаяПечатьНаСервере(ТекущийШаблон) Тогда
	
		НастройкиПечати = ПечатьЭлектронныхДокументовКлиент.ИнициализацияПараметровПечати();
		
		НастройкиПечати = ПечатьЭлектронныхДокументовКлиент.ВыборКаталогаСохранения(НастройкиПечати);
		Если НЕ НастройкиПечати.КаталогВыбран Тогда
		
			Возврат;
		
		КонецЕсли;
		НастройкиПечати.Вставить("Прикрепить", ПрикрепитьФайлы);
		НастройкиПечати.Вставить("Распечатать", Печатать);
		НастройкиПечати.Вставить("ПерезаписатьСуществующие", Истина);
		НастройкиПечати.Вставить("ИмяПечатнойФормы", ТекущийШаблон);
		
		КомплектыБинарныйФормат = СформироватьКомплекты();
		НастройкиПечати.Вставить("Комплекты", КомплектыБинарныйФормат);
		
		УспешнаяПечать = ПечатьЭлектронныхДокументовКлиент.СформироватьКомплекты(НастройкиПечати);
		ТекстСообщения = "Формирование документов";
		ТекстСообщения = ТекстСообщения + ?(УспешнаяПечать, " прошло успешно!", " не получилось!");
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		
		Возврат;
	
	КонецЕсли;
	
	// Лебедева 20.02.2018

	ТекущееДО = Объект.Объект;
	ТекущиеПараметры = Новый Структура("Объект, Шаблон", ТекущееДО,ТекущийШаблон);
	ПечатьЭлектронныхДокументовКлиент.ПечатьОбработка(ТекущиеПараметры, Печатать,ПрикрепитьФайлы);

КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	Контрагент = Объект.Объект;
	ДоговорКонтрагента = Объект.Объект;
	УслугаПоДоговору = Объект.Объект;
	ДолговоеОбязательство = Объект.Объект;
	ИсполнительныйДокумент = Объект.Объект;
	
	Элементы.ОбъектУчета_Пусто.Доступность = Ложь;
	Если Объект.Объект = Неопределено Тогда	
		Элементы.ОбъектУчета_Пусто.Доступность = Истина;
		ТекущийЭлемент = Элементы.Объект;
		Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_Пусто;		
	ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		Элементы.ОбъектУчета_Контрагенты.Видимость = Истина;
		ТекущийЭлемент = Элементы.Контрагент;
		Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_Контрагенты;		
	ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Элементы.ОбъектУчета_ДоговорыКонтрагентов.Видимость = Истина;
		ТекущийЭлемент = Элементы.ДоговорКонтрагента;
		Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_ДоговорыКонтрагентов;		
	ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.УслугиПоДоговору") Тогда	
		Элементы.ОбъектУчета_УслугиПоДоговорам.Видимость = Истина;
		ТекущийЭлемент = Элементы.УслугаПоДоговору;
		Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_УслугиПоДоговорам;
	ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		Элементы.ОбъектУчета_ДолговыеОбязательства.Видимость = Истина;
		ТекущийЭлемент = Элементы.ДолговоеОбязательство;
		Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_ДолговыеОбязательства;
	ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ИсполнительныеДокументы") Тогда	
		Элементы.ОбъектУчета_ИсполнительныеДокументы.Видимость = Истина;
		ТекущийЭлемент = Элементы.ИсполнительныйДокумент;
		Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_ИсполнительныеДокументы;
	ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Залоги") Тогда
		Элементы.ОбъектУчета_Залоги.Видимость = Истина;
		ТекущийЭлемент = Элементы.Залог;
		Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_Залоги;
	КонецЕсли;
	
	//
	Попытка
		КонтрагентКЛ = ОбъектыСервер.РазыменоватьСсылку(Объект.Объект, "Должник");
	Исключение
		Попытка
			КонтрагентКЛ = ОбъектыСервер.РазыменоватьСсылку(Объект.Объект, "Контрагент");
		Исключение
			КонтрагентКЛ = Объект.Объект;
		КонецПопытки;
	КонецПопытки;
	ЗаполнитьСписокКонтактов(Элемент = Неопределено);
	
	//
	Модифицированность = Истина; //!!!!! - добавлено из конфы "аааа"
	
	//
	Если Не ТипСотрудника.Пустая() Тогда //!!!!!
		ЗаполнитьОтветственный();        //!!!!!
	КонецЕсли;
	
	// Обновить данные при изменении типа объекта
	Если ЗначениеЗаполнено(ЭтаФорма.ДолговоеОбязательство) = Истина Тогда
		ОбъектПростойПриИзменении(Неопределено);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПростойПриИзменении(Элемент)
	Если Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_Контрагенты Тогда
		Объект.Объект = Контрагент;
		КонтрагентКЛ = Объект.Объект;
	ИначеЕсли Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_ДоговорыКонтрагентов Тогда	
		Объект.Объект = ДоговорКонтрагента;
		КонтрагентКЛ = ОбъектыСервер.РазыменоватьСсылку(Объект.Объект, "Контрагент");
	ИначеЕсли Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_УслугиПоДоговорам Тогда	
		Объект.Объект = УслугаПоДоговору;	
		КонтрагентКЛ = ОбъектыСервер.РазыменоватьСсылку(Объект.Объект, "Контрагент");
	ИначеЕсли Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_ДолговыеОбязательства Тогда
		Объект.Объект = ДолговоеОбязательство;
		КонтрагентКЛ = ОбъектыСервер.РазыменоватьСсылку(Объект.Объект, "Должник");
	ИначеЕсли Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_ИсполнительныеДокументы Тогда	
		Объект.Объект = ИсполнительныйДокумент;
		КонтрагентКЛ = ОбъектыСервер.РазыменоватьСсылку(Объект.Объект, "Должник");
	ИначеЕсли Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_Залоги Тогда
		Объект.Объект = Залог;
		КонтрагентКЛ = ОбъектыСервер.РазыменоватьСсылку(Объект.Объект.Владелец, "Должник");
	КонецЕсли;
	ЗаполнитьСписокКонтактов(Элемент = Неопределено);
		
	Модифицированность = Истина; //!!!!!
	
	//
	Если Не ТипСотрудника.Пустая() Тогда //!!!!!
		ЗаполнитьОтветственный();        //!!!!!
	КонецЕсли;
	
	// Обновить данные при имзенении номера ДО
	Если ЗначениеЗаполнено(ЭтаФорма.ДолговоеОбязательство) = Истина Тогда
		ПолучитьОтветственногоНаСервере();
		ПолучитьОстатокНаСервере();
		ПолучитьДатуВыдачиНаСервере();
		ПолучитьДниПросрочкиНаСервере();
		ПолучитьВозрастНаСервере();
		ПриОткрытии(Неопределено);
		ПоказатьОповещениеПользователя("Предупреждение",,"Номер договора был изменен. Проверьте правильность выбранного контакта",БиблиотекаКартинок.NC_Предупреждение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОчистка(Элемент, СтандартнаяОбработка)
	Объект.Объект = Неопределено;
	Элементы.ОбъектУчета_Пусто.Доступность = Истина;
	Элемент.Родитель.Видимость = Ложь;
				
	Элементы.ГруппаОбъектУчета.ТекущаяСтраница = Элементы.ОбъектУчета_Пусто;
	ТекущийЭлемент = Элементы.Объект;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеГруппы(Команда)
	Элементы.ОбъектУчета_Пусто.Видимость = Истина;
	Элементы.ОбъектУчета_Контрагенты.Видимость = Истина;
	Элементы.ОбъектУчета_ДоговорыКонтрагентов.Видимость = Истина;
	Элементы.ОбъектУчета_УслугиПоДоговорам.Видимость = Истина;
	Элементы.ОбъектУчета_ДолговыеОбязательства.Видимость = Истина;
	Элементы.ОбъектУчета_ИсполнительныеДокументы.Видимость = Истина;
	Элементы.ОбъектУчета_Залоги.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТипСотрудникаПриИзменении(Элемент)
	Если ТипСотрудника.Пустая() Тогда
		Элементы.Ответственный.ТолькоПросмотр = Ложь;
		Ответственный = УдалитьОбщегоНазначения.ТекущийПользователь();
	Иначе
		Элементы.Ответственный.ТолькоПросмотр = Истина;
		ЗаполнитьОтветственный();
	КонецЕсли;
	
	Модифицированность = Истина;
КонецПроцедуры

#Область ПодборОтветственного

&НаСервере
Процедура ЗаполнитьОтветственный()

	Если Объект.Выполнена Тогда
		Ответственный = Объект.Исполнитель; //заплатка
		Возврат;
	КонецЕсли;
	
	ПроверяемыйОбъект = Объект.Объект;
	Если Не ЭтоОсновнойОбъект(ПроверяемыйОбъект) Тогда
	
		Старый_ЗаполнитьОтветственный();
		Возврат;
	
	КонецЕсли;
	
	Ответственные = Задачи.Мероприятие.ПолучитьОтветственных(ПроверяемыйОбъект, ТипСотрудника);
	Если Ответственные.Количество() = 1 Тогда
	
		Ответственный = Ответственные[0];
		Возврат;
	
	КонецЕсли;
	
	Ответственный = СтрСоединить(Ответственные, ", ");

КонецПроцедуры

// Проверка расширяется в блоке ЖКХ
&НаСервереБезКонтекста
Функция ЭтоОсновнойОбъект(ПроверяемыйОбъект)

	ОсновныеОбъекты = ОсновныеОбъекты();

	Если ОсновныеОбъекты.Найти(ТипЗнч(ПроверяемыйОбъект)) <> Неопределено Тогда
	
		Возврат Истина;
	
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции // ()

// Хотелось бы удалить, остается для совместимости
&НаСервере
Процедура Старый_ЗаполнитьОтветственный()
	
	Ответственный = "";
	Если ЗначениеЗаполнено(Объект.Объект) Тогда
		
		Запрос = РегистрыСведений.ОтветственныеСотрудники.ЗапросДляОпределенияОтветственного();
		
		Запрос.УстановитьПараметр("ТипСотрудника", ТипСотрудника);
		//заплатка +
		Если ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
			Запрос.УстановитьПараметр("Объект", Объект.Объект);
		ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если Константы.ДетализацияПоДоговорам.Получить() Тогда
				Запрос.УстановитьПараметр("Объект", Объект.Объект);
			ИначеЕсли Константы.ДетализацияПоКА.Получить() Тогда
				Запрос.УстановитьПараметр("Объект", Объект.Объект.Контрагент);
			Иначе
				Запрос.УстановитьПараметр("Объект", Объект.Объект);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.УслугиПоДоговору") Тогда
			Если Константы.ДетализацияПоУслугам.Получить() Тогда
				Запрос.УстановитьПараметр("Объект", Объект.Объект);	
			ИначеЕсли Константы.ДетализацияПоДоговорам.Получить() Тогда
				Запрос.УстановитьПараметр("Объект", Объект.Объект.Владелец);
			ИначеЕсли Константы.ДетализацияПоКА.Получить() Тогда
				Запрос.УстановитьПараметр("Объект", Объект.Объект.Контрагент);
			Иначе
				Запрос.УстановитьПараметр("Объект", Объект.Объект);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
			Если Константы.ДетализацияПоДО.Получить() Тогда
				Запрос.УстановитьПараметр("Объект", Объект.Объект);	
			ИначеЕсли Константы.ДетализацияПоКА.Получить() Тогда
				Запрос.УстановитьПараметр("Объект", Объект.Объект.Должник);
			Иначе
				Запрос.УстановитьПараметр("Объект", Объект.Объект);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ИсполнительныеДокументы") Тогда	
			Если Константы.ДетализацияПоИД.Получить() Тогда
				Запрос.УстановитьПараметр("Объект", Объект.Объект);				
			ИначеЕсли Константы.ДетализацияПоДО.Получить() Тогда
				Запрос.УстановитьПараметр("Объект", Объект.Объект.Владелец);
			ИначеЕсли Константы.ДетализацияПоКА.Получить() Тогда
				Запрос.УстановитьПараметр("Объект", Объект.Объект.Должник);
			Иначе
				Запрос.УстановитьПараметр("Объект", Объект.Объект);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Залоги") Тогда	
			Если Константы.ДетализацияПоЗ.Получить() Тогда
				Запрос.УстановитьПараметр("Объект", Объект.Объект);				
			ИначеЕсли Константы.ДетализацияПоДО.Получить() Тогда
				Запрос.УстановитьПараметр("Объект", Объект.Объект.Владелец);
			ИначеЕсли Константы.ДетализацияПоКА.Получить() Тогда
				Запрос.УстановитьПараметр("Объект", Объект.Объект.Владелец.Должник);
			Иначе
				Запрос.УстановитьПараметр("Объект", Объект.Объект);
			КонецЕсли;
			
		КонецЕсли;	
						
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() = 1 Тогда
			Ответственный = Результат[0].Ссылка;	
		ИначеЕсли Результат.Количество() > 1 Тогда
			Для Каждого Элемент Из Результат Цикл
				Ответственный = Ответственный + "; " + Элемент.Наименование;
			КонецЦикла;
			Ответственный = Сред(Ответственный, 3);
		КонецЕсли;
	КонецЕсли;
	
	Если Ответственный = "" Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура РезультатНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
  	СписокФункцийДляОтбора = СформироватьСписокРезультатов();
	
	Форма = ПолучитьФорму("Справочник.РезультатыМероприятий.ФормаВыбора",,ЭтаФорма,,,);
	Отбор = Форма.Список.Отбор.Элементы;
	
	НовыйЭлемент = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлемент.ПравоеЗначение = Объект.ТипМероприятия;
	НовыйЭлемент.Использование = Истина;
		
	НовыйЭлемент = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФункцияВидимости");
	НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;	
	НовыйЭлемент.ПравоеЗначение = СписокФункцийДляОтбора;
	НовыйЭлемент.Использование = Истина;
		
	//Чуров А.И.
	ОткрытьФорму(Форма);
	//Результат = ОткрытьФормуМодально("Справочник.РезультатыМероприятий.ФормаВыбора");
	//Если Результат <> Неопределено Тогда
	//	Объект.Результат = Результат;
	//	РезультатПриИзменении("");
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "МероприятиеРезультатНачалоВыбора" и Источник = ЭтаФорма.УникальныйИдентификатор Тогда	
		Если Параметр <> Неопределено Тогда
			Объект.Результат = Параметр;
			РезультатПриИзменении("");
			Модифицированность = истина;
		КонецЕсли;	
	КонецЕсли;
	
	Если ИмяСобытия = "ЗакрытиеСценария" Тогда
		 РезультатПриИзменении(Элементы.Результат);
	 КонецЕсли;
	 
	 Если ИмяСобытия = "СохранениеДокумент" И Параметр["Владелец"] = ЭтаФорма Тогда
	
		Объект.СвязанныйДокумент = Параметр["ДокументСсылка"];
	
	КонецЕсли;
	 
	Если ИмяСобытия = "ЗаписьДолжника" Тогда
		ЗаполнитьСписокКонтактов(Истина);
		ФормаОбновления = ПолучитьФорму("ОбщаяФорма.ОбновлениеКонтактныхДанных");
		ФормаОбновления.Открыть();
	КонецЕсли;
		 
	Если ИмяСобытия = "ОбновитьВремяРаботы" Тогда
		ЭтаФорма.Записать();
		// Проверка на выполнение мероприятия
		Если ЗначениеЗаполнено(ЭтаФорма.Объект.Дата) И ЭтаФорма.Объект.Выполнена = Истина Тогда
			Возврат;
		Иначе
			ЭтаФорма.ВремяЗавершенияРазговора = ТекущаяДата();
			ПодключитьОбработчикОжидания("ПрошлоВремя30", 30, Истина);
			ПодключитьОбработчикОжидания("ПрошлоВремя60", 60, Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "СброшенныйЗвонок" Тогда
		Если ЭтаФорма.УстановленСтатусНеБеспокоить = Истина Тогда
			ПоказатьОповещениеПользователя("БИТ.Phone",,"Установлен статус «Не беспокоить»",БиблиотекаКартинок.NC_НеБеспокоить);
			Возврат;
		Иначе
			ЭтаФорма.Записать();
			РезультатСбросНаСервере();
			Если ЗначениеЗаполнено(ЭтаФорма.Объект.Результат) = Истина Тогда
				Возврат;
			ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Объект.Результат) = Ложь Тогда
				ЭтаФорма.Объект.Результат = РезультатСброс;
				ЭтаФорма.Объект.Комментарий = "Автоматическое закрытие → " + Объект.Комментарий;
				ВыполнитьИЗакрыть(Неопределено);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "ОтменитьСтатусНеБеспокоить" Тогда
		Если ЭтаФорма.УстановленСтатусНеБеспокоить = Истина Тогда
			ЭтаФорма.УстановленСтатусНеБеспокоить = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "АктивизироватьНовоеМероприятие" Тогда
		ЭтаФорма.Активизировать();
	КонецЕсли;
	
	Если ИмяСобытия = "НеудачныйЗвонок" Тогда
		Если ЭтаФорма.УстановленСтатусНеБеспокоить = Истина Тогда
			ПоказатьОповещениеПользователя("БИТ.Phone",,"Установлен статус «Не беспокоить»",БиблиотекаКартинок.NC_НеБеспокоить);
			Возврат;
		Иначе
			ЭтаФорма.Записать();
			РезультатНетКонтактаНаСервере();
			Если ЗначениеЗаполнено(ЭтаФорма.Объект.Результат) = Истина Тогда
				Возврат;
			ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Объект.Результат) = Ложь Тогда
				ЭтаФорма.Объект.Результат = РезультатНетКонтакта;
				ЭтаФорма.Объект.Комментарий = "Автоматическое закрытие → " + Объект.Комментарий;
				ВыполнитьИЗакрыть(Неопределено);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
		Если ИмяСобытия = "ОбновитьДлительностьРазговора" Тогда
		ФормаНабора = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
		ЭтаФорма.Объект.ДлительностьРазговора = ФормаНабора.ДлительностьРазговора;
		ЭтаФорма.Записать();
		КонецЕсли;
	
		Если ИмяСобытия = "ШаблонИзмененВЦ" Тогда
		ТипВЦНаСервере();
		Если ЭтаФорма.Объект.ТипМероприятия <> ТипВЦ Тогда
			Возврат;
		ИначеЕсли ЭтаФорма.Объект.ТипМероприятия = ТипВЦ Тогда	
			ФормаВЦ = ПолучитьФорму("ОбщаяФорма.ОтправкаНаWhatsApp");
			ЭтаФорма.Объект.Комментарий = ФормаВЦ.Сообщение;
			ВыполнитьИЗакрыть(Неопределено);
			ФормаВЦ.Закрыть();
		КонецЕсли;		
	КонецЕсли;
	
		Если ИмяСобытия = "ШаблонИзмененВайбер" Тогда
		ТипВайберНаСервере();
		Если ЭтаФорма.Объект.ТипМероприятия <> ТипВайбер Тогда
			Возврат;
		ИначеЕсли ЭтаФорма.Объект.ТипМероприятия = ТипВайбер Тогда	
			ФормаВайбер = ПолучитьФорму("ОбщаяФорма.ОтправкаНаViber");
			ЭтаФорма.Объект.Комментарий = ФормаВайбер.Сообщение;
			ФормаВайбер.Закрыть();
			ВыполнитьИЗакрыть(Неопределено);
		КонецЕсли;		
	КонецЕсли;
	
	Если ИмяСобытия = "ШаблонИзмененСМС" Тогда
		Если ЭтаФорма.Объект.ТипМероприятия <> ПредопределенноеЗначение("Справочник.ТипыМероприятий.ОтправкаСМС") Тогда
			Возврат;
		ИначеЕсли ЭтаФорма.Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ОтправкаСМС") Тогда	
			ФормаСМС = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОтправкаСМС");
			ЭтаФорма.Объект.Комментарий = ФормаСМС.ТекстСМС;
			ФормаСМС.Закрыть();
			ВыполнитьИЗакрыть(Неопределено);
		КонецЕсли;		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ТипВЦНаСервере()
	ЭтаФорма.ТипВЦ = Справочники.ТипыМероприятий.НайтиПоНаименованию("WhatsApp");
КонецПроцедуры

&НаСервере
Процедура ТипВайберНаСервере()
	ЭтаФорма.ТипВайбер = Справочники.ТипыМероприятий.НайтиПоНаименованию("Viber");
КонецПроцедуры

&НаСервере
Процедура РезультатСбросНаСервере()
	// Получить значения с сервера
	ЭтаФорма.РезультатСброс = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Сброс");
КонецПроцедуры

&НаСервере
Процедура РезультатНетКонтактаНаСервере()
	// Получить значения с сервера
	ЭтаФорма.РезультатНетКонтакта = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Нет контакта");
КонецПроцедуры

&НаСервере
Процедура РезультатВходящийЗвонокНаСервере()
	// Получить значения с сервера
	ЭтаФорма.РезультатВходящийЗвонок = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Входящий звонок");
КонецПроцедуры

&НаСервере
Функция СформироватьСписокРезультатов()
	СписокРезультатов = Новый СписокЗначений();	
	Запрос = Новый Запрос("ВЫБРАТЬ
						|	РезультатыМероприятий.ФункцияВидимости
						|ИЗ
						|	Справочник.РезультатыМероприятий КАК РезультатыМероприятий
						|ГДЕ
						|	РезультатыМероприятий.Владелец = &Владелец
						|
						|СГРУППИРОВАТЬ ПО
						|	РезультатыМероприятий.ФункцияВидимости");
	Запрос.УстановитьПараметр("Владелец", Объект.ТипМероприятия);
	Результат = Запрос.Выполнить().Выбрать();	
	Пока Результат.Следующий() Цикл
		//строгая проверка, повышает отказоустойчивость!!!
		Если УправлениеСвойствами.ВычислитьФункциюВидимости(Результат.ФункцияВидимости.Функция, Объект.Объект) = Ложь Тогда 
			СписокРезультатов.Добавить(Результат.ФункцияВидимости);			
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокРезультатов;	
КонецФункции

&НаСервере
Функция ПолучитьЗаписьРазговора()
	Возврат Объект.бтЗаписьРазговора;
КонецФункции

&НаКлиенте
Процедура бтЗаписьРазговораОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	стрЗаписьРазговора = ПолучитьЗаписьРазговора();
	Если ЗначениеЗаполнено(стрЗаписьРазговора) Тогда
		бит_БИТфонКлиент.ВоспроизвестиЗаписьРазговора(стрЗаписьРазговора);
	КонецЕсли;
КонецПроцедуры

// Область взаимодействий

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Контакт) Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.ДолговоеОбязательство) = Истина Тогда
			
			// Проверка на нарушение 230-ФЗ
			
			Если ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
				ОбъектДолжник = ОбъектыСервер.РазыменоватьСсылку(Объект.Объект, "Должник");
			ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
				ОбъектДолжник = Объект.Объект;
			Иначе
				Возврат;
			КонецЕсли;
			
			Если КонтрольСобытий.КонтрольЧасовогоПояса(ОбъектДолжник) Тогда
				Предупреждение("Действие приведет к нарушению 230-ФЗ!",,"Контроль часового пояса");
				// Пометить мероприятие на удаление и закрыть форму
				ПоказатьОповещениеПользователя("Удаление мероприятия",,"Установлена пометка удаления",БиблиотекаКартинок.NC_УдалениеМероприятия);
				ЭтаФорма.Объект.ПометкаУдаления = Истина;
				ЭтаФорма.Записать();
				ЭтаФорма.Закрыть();
				Возврат;
			КонецЕсли;
			
			Если КонтрольСобытий.КонтрольСМС(ОбъектДолжник) Тогда
				Ответ = Вопрос("Действие приведет к нарушению 230-ФЗ! Вы уверены?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Контроль СМС");
				Если Ответ = КодВозвратаДиалога.Да Тогда
					// Создать новую запись в регистре нарушений 230-ФЗ
					ЗаписатьНарушениеПоСообщениямСМС();
				Иначе
					// Пометить мероприятие на удаление и закрыть форму
					ПоказатьОповещениеПользователя("Удаление мероприятия",,"Установлена пометка удаления",БиблиотекаКартинок.NC_УдалениеМероприятия);
					ЭтаФорма.Объект.ПометкаУдаления = Истина;
					ЭтаФорма.Записать();
					ЭтаФорма.Закрыть();
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			ФормаСМС = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОтправкаСМС");
			// ФормаСМС.ВладелецФормы = ЭтаФорма;
			стрСМСЛогин = "";
			стрСМСПароль = "";
			стрОтправитель = "";
			Автоинформирование.ПолучитьПараметрыОтправкиСМС(стрСМСЛогин, стрСМСПароль, стрОтправитель);
			ФормаСМС.СМСЛогин = стрСМСЛогин;
			ФормаСМС.СМСПароль = стрСМСПароль;
			Если ЗначениеЗаполнено(стрОтправитель) Тогда
				ФормаСМС.Элементы.Отправитель.СписокВыбора.Добавить(стрОтправитель);
				ФормаСМС.Отправитель = стрОтправитель;
			КонецЕсли;
			
			ФормаСМС.НомерПолучателя = Объект.Контакт;
			// Попытаемся получить договор с рабочего стола
			Попытка
				ФормаСМС.Договор = ЭтаФорма.Объект.Объект;
				// Попытаемся получить договор из мероприятия
			Исключение
				ФормаСМС.Договор = ЭтаФорма.Объект.Ссылка;
			КонецПопытки;
			ФормаСМС.ТекстСМС = Автоинформирование.ПолучитьПодсказку(Объект.Объект, ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "ШаблонСМС"));
			ФормаСМС.ОткрытьМодально();
		Иначе
			Предупреждение("Не выбран контакт для отправки!",,"Отправка СМС");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНарушениеПоСообщениямСМС()
	МенеджерЗаписи = РегистрыСведений.ЖурналНарушений.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Дата = ТекущаяДата();
	МенеджерЗаписи.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Договор = ЭтаФорма.Объект.Объект;
	МенеджерЗаписи.ТипНарушения = Перечисления.ТипыНарушений230ФЗ.ПревышениеКоличестваЗвонков;
	
	МенеджерЗаписи.Записать();
КонецПроцедуры

//

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	ФормаДокумент = ПолучитьФорму("Документ.ПрикрепитьФайлы.Форма.ФормаДокумента");
	ФормаДокумент.ВладелецФормы = ЭтаФорма;
	ФормаДокумент.Объект.Объект = Объект.Объект;
	ФормаДокумент.Объект.Файлы.Очистить();
	Строка = ФормаДокумент.Объект.Файлы.Добавить();
	//Строка.ТипФайла = ОбъектыСервер.РазыменоватьСсылку(Объект.ТипМероприятия, "ТипФайла");
	//Лебедева 26.02.2018
	Строка.ТипФайла = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "ТипФайла");
	Результат = ОткрытьФорму(ФормаДокумент);
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьЗапись(Команда)
	ФормаДокумент = ПолучитьФорму("Документ.ПрикрепитьФайлы.Форма.ФормаДокумента");
	ФормаДокумент.ВладелецФормы = ЭтаФорма;
	ФормаДокумент.Объект.Объект = Объект.Объект;
	Строка = ФормаДокумент.Объект.Файлы.Добавить();
	Строка.ТипФайла = ПредопределенноеЗначение("Справочник.ТипыПрикрепляемыхФайлов.ЗаписьЗвонка");
	Строка.Путь = Объект.бтЗаписьРазговора;
	ФормаДокумент.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНомер(Команда)
	контрагент = бит_ТелефонияКлиентПереопределяемый.ЗадатьНомерКонтрагентаМер(Объект.Контакт, Объект.Объект);
	ОбъектПростойПриИзменении(Неопределено);
	ОграничитьТипОбъектаЗвонок();	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтрагента(Команда)
	бит_ТелефонияКлиентПереопределяемый.СоздатьНовогоКонтрагентаМер(Объект.Контакт, Объект.Объект);
	ОбъектПростойПриИзменении(Неопределено);
	ОграничитьТипОбъектаЗвонок();
КонецПроцедуры

&НаСервере
Процедура ОграничитьТипОбъектаЗвонок() 
	СтрокаТипов = ", СправочникСсылка.Контрагенты";
	
	Если Константы.ДетализацияПоДоговорам.Получить() Тогда
	    СтрокаТипов = СтрокаТипов + ", СправочникСсылка.ДоговорыКонтрагентов";
	КонецЕсли;	
	Если Константы.ДетализацияПоУслугам.Получить() Тогда
	    СтрокаТипов = СтрокаТипов + ", СправочникСсылка.УслугиПоДоговору";
	КонецЕсли;
	Если Константы.ДетализацияПоДО.Получить() Тогда
	    СтрокаТипов = СтрокаТипов + ", СправочникСсылка.ДолговыеОбязательства";
	КонецЕсли;	
	Если Константы.ДетализацияПоИД.Получить() Тогда
	    СтрокаТипов = СтрокаТипов + ", СправочникСсылка.ИсполнительныеДокументы";
	КонецЕсли;	
	Если Константы.ДетализацияПоЗ.Получить() Тогда
		СтрокаТипов = СтрокаТипов + ", СправочникСсылка.Залоги";
	КонецЕсли;
	
	Элементы.Объект.ОграничениеТипа = Новый ОписаниеТипов(Сред(СтрокаТипов, 3));	
КонецПроцедуры

//! ЗАПИСЬ ДОПРЕКВИЗИТОВ ДО и КА через Карточку мероприятия
// Получает значение выбранных в результате мероприятия допреквизитов у объекта 
&НаСервере
Процедура ДобавитьДополнительныеРеквизитыОбъекта()
	ЗапросДО = Новый Запрос;
	ЗапросДО.Текст = 
		"ВЫБРАТЬ
		|	РезультатыМероприятийДополнительныеРеквизитыОбъекта.НаименованиеСвойства КАК НаименованиеСвойства,
		|	ДолговыеОбязательстваДополнительныеРеквизиты.Значение КАК Значение,
		|	РезультатыМероприятийДополнительныеРеквизитыОбъекта.Обязательное КАК Обязательное
		|ИЗ
		|	Справочник.РезультатыМероприятий.ДополнительныеРеквизитыОбъекта КАК РезультатыМероприятийДополнительныеРеквизитыОбъекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДолговыеОбязательстваДополнительныеРеквизиты
		|		ПО РезультатыМероприятийДополнительныеРеквизитыОбъекта.НаименованиеСвойства = ДолговыеОбязательстваДополнительныеРеквизиты.Свойство
		|			И (ДолговыеОбязательстваДополнительныеРеквизиты.Ссылка = &Объект)
		|ГДЕ
		|	РезультатыМероприятийДополнительныеРеквизитыОбъекта.Ссылка = &Ссылка
		|	И РезультатыМероприятийДополнительныеРеквизитыОбъекта.НаименованиеСвойства.ЭтоДополнительноеСведение = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РезультатыМероприятийДополнительныеРеквизитыОбъекта.НаименованиеСвойства,
		|	ДополнительныеСведения.Значение,
		|	РезультатыМероприятийДополнительныеРеквизитыОбъекта.Обязательное
		|ИЗ
		|	Справочник.РезультатыМероприятий.ДополнительныеРеквизитыОбъекта КАК РезультатыМероприятийДополнительныеРеквизитыОбъекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО РезультатыМероприятийДополнительныеРеквизитыОбъекта.НаименованиеСвойства.Ссылка = ДополнительныеСведения.Свойство
		|			И (ДополнительныеСведения.Объект = &Объект)
		|ГДЕ
		|	РезультатыМероприятийДополнительныеРеквизитыОбъекта.НаименованиеСвойства.Ссылка.ЭтоДополнительноеСведение = ИСТИНА
		|	И РезультатыМероприятийДополнительныеРеквизитыОбъекта.Ссылка = &Ссылка";
	
	ЗапросКА = Новый Запрос;
	ЗапросКА.Текст = 
	
	"ВЫБРАТЬ
	|	РезультатыМероприятийДополнительныеРеквизитыКА.НаименованиеСвойства КАК НаименованиеСвойства,
	|	КонтрагентыДополнительныеРеквизиты.Значение КАК Значение,
	|	РезультатыМероприятийДополнительныеРеквизитыКА.Обязательное КАК Обязательное
	|ИЗ
	|	Справочник.РезультатыМероприятий.ДополнительныеРеквизитыКА КАК РезультатыМероприятийДополнительныеРеквизитыКА
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	|		ПО РезультатыМероприятийДополнительныеРеквизитыКА.НаименованиеСвойства = КонтрагентыДополнительныеРеквизиты.Свойство
	|			И (КонтрагентыДополнительныеРеквизиты.Ссылка = &ОбъектКА)
	|ГДЕ
	|	РезультатыМероприятийДополнительныеРеквизитыКА.Ссылка = &Ссылка
	|	И РезультатыМероприятийДополнительныеРеквизитыКА.НаименованиеСвойства.ЭтоДополнительноеСведение = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РезультатыМероприятийДополнительныеРеквизитыКА.НаименованиеСвойства,
	|	ДополнительныеСведения.Значение,
	|	РезультатыМероприятийДополнительныеРеквизитыКА.Обязательное
	|ИЗ
	|	Справочник.РезультатыМероприятий.ДополнительныеРеквизитыКА КАК РезультатыМероприятийДополнительныеРеквизитыКА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО РезультатыМероприятийДополнительныеРеквизитыКА.НаименованиеСвойства.Ссылка = ДополнительныеСведения.Свойство
	|			И (ДополнительныеСведения.Объект = &ОбъектКА)
	|ГДЕ
	|	РезультатыМероприятийДополнительныеРеквизитыКА.НаименованиеСвойства.Ссылка.ЭтоДополнительноеСведение = ИСТИНА
	|	И РезультатыМероприятийДополнительныеРеквизитыКА.Ссылка = &Ссылка";
		
	
	Ссылка = Объект.Результат;
	Если ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		ОбъектДО = Объект.Объект;
		ОбъектКА = Объект.Объект.Должник;
		
		ЗапросКА.УстановитьПараметр("ОбъектКА", ОбъектКА);
		ЗапросДО.УстановитьПараметр("Объект", ОбъектДО);
		ЗапросКА.УстановитьПараметр("Ссылка", Ссылка);
		ЗапросДО.УстановитьПараметр("Ссылка", Ссылка);

		
		РезультатЗапросаКА = ЗапросКА.Выполнить();
		ВыборкаДетальныеЗаписиКА = РезультатЗапросаКА.Выбрать();
		ДополнительныеРеквизитыДолжника.Очистить();
		Пока ВыборкаДетальныеЗаписиКА.Следующий() Цикл
			НоваяСтрока = ДополнительныеРеквизитыДолжника.Добавить();
			НоваяСтрока.Значение= ВыборкаДетальныеЗаписиКА.Значение;
			НоваяСтрока.Свойство = ВыборкаДетальныеЗаписиКА.НаименованиеСвойства;
			НоваяСтрока.Обязательное = ВыборкаДетальныеЗаписиКА.Обязательное;
		КонецЦикла;
		
		РезультатЗапросаДО = ЗапросДО.Выполнить();
		ВыборкаДетальныеЗаписиДО = РезультатЗапросаДО.Выбрать();
		ДополнительныеРеквизитыОбъекта.Очистить();
		Пока ВыборкаДетальныеЗаписиДО.Следующий() Цикл
			НоваяСтрока = ДополнительныеРеквизитыОбъекта.Добавить();
			НоваяСтрока.Значение= ВыборкаДетальныеЗаписиДО.Значение;
			НоваяСтрока.Свойство = ВыборкаДетальныеЗаписиДО.НаименованиеСвойства;
			НоваяСтрока.Обязательное = ВыборкаДетальныеЗаписиДО.Обязательное;
		КонецЦикла;
	
	ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		ОбъектКА = Объект.Объект;
		ДополнительныеРеквизитыОбъекта.Очистить();
		ЗапросКА.УстановитьПараметр("ОбъектКА", ОбъектКА);
		ЗапросКА.УстановитьПараметр("Ссылка", Ссылка);

		РезультатЗапросаКА = ЗапросКА.Выполнить();
		ВыборкаДетальныеЗаписиКА = РезультатЗапросаКА.Выбрать();
		ДополнительныеРеквизитыДолжника.Очистить();
		Пока ВыборкаДетальныеЗаписиКА.Следующий() Цикл
			НоваяСтрока = ДополнительныеРеквизитыДолжника.Добавить();
			НоваяСтрока.Значение= ВыборкаДетальныеЗаписиКА.Значение;
			НоваяСтрока.Свойство = ВыборкаДетальныеЗаписиКА.НаименованиеСвойства;
			НоваяСтрока.Обязательное = ВыборкаДетальныеЗаписиКА.Обязательное;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыОбъектаПередНачаломИзменения(Элемент, Отказ)
	ТипЭлемента = ОбъектыСервер.РазыменоватьСсылку(Элемент.ТекущиеДанные.Свойство, "ТипЗначения");	
	
	Элемент.ПодчиненныеЭлементы[1].РежимВыбораИзСписка = Ложь;
	Элемент.ПодчиненныеЭлементы[1].СписокВыбора.Очистить();
	
	Если Строка(ТипЭлемента) = "Строка" Тогда
		ВидСтроки = ОбъектыСервер.РазыменоватьСсылку(Элемент.ТекущиеДанные.Свойство, "ВидСтроки");		
		Если ВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Строка") Тогда
			ЭтоСписокЗначений = ОбъектыСервер.РазыменоватьСсылку(Элемент.ТекущиеДанные.Свойство, "СписокДоступныхЗначений");
			Если ЭтоСписокЗначений Тогда 
				Элемент.ПодчиненныеЭлементы[1].РежимВыбораИзСписка = Истина;
				НазначенныйСписок = УдалитьОбщегоНазначения.ПередатьСписокЗначенийДопРеквизитов(Элемент.ТекущиеДанные.Свойство);
				Элемент.ПодчиненныеЭлементы[1].СписокВыбора.Очистить();
				Для Каждого ЭлСписка из НазначенныйСписок Цикл
					Элемент.ПодчиненныеЭлементы[1].СписокВыбора.Добавить(ЭлСписка.Значение);
					Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
					Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Ложь;
					Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Ложь;
				КонецЦикла; 	
			Иначе
				Элемент.ПодчиненныеЭлементы[1].СписокВыбора.Очистить();
				Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Ложь;
				Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Ложь;
				Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Истина;
				Элемент.ПодчиненныеЭлементы[1].РежимВыбораИзСписка = Ложь;
			КонецЕсли;

		ИначеЕсли ВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Телефон") ИЛИ 
			ВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Адрес") Тогда
			Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
			Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Ложь;
			Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Ложь;	
		ИначеЕсли ВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.ПутьКФайлу") Тогда
			Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
			Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Истина;
			Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Истина;
		КонецЕсли;
	ИначеЕсли ТипЭлемента = Новый ОписаниеТипов("СправочникСсылка.тсЗначенияСвойствОбъектов") Тогда
		Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
		Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Ложь;
		Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Ложь;	
	ИначеЕсли ОбъектыСервер.ЭтотТипЕстьСсылка(ТипЭлемента) Тогда		
		Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
		Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Истина;
		Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Ложь;
		Элемент.ПодчиненныеЭлементы[1].КнопкаОчистки = Истина;
	ИначеЕсли Строка(ТипЭлемента) = "Число" Тогда
		Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
		Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Ложь;
		Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Истина;
	ИначеЕсли Строка(ТипЭлемента) = "Булево" Тогда
		Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
		Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Ложь;
		Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Ложь;
	ИначеЕсли Строка(ТипЭлемента) = "Дата" Тогда
		Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
		Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Ложь;
		Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Истина;
	КонецЕсли;
	Элемент.ПодчиненныеЭлементы[1].ОграничениеТипа = ТипЭлемента;

КонецПроцедуры
//Лебедева, 08.06.2018: Запись через карточку мероприятия допреквизитов и свойств объекта
&НаСервере
Процедура ЗаписатьЗначениеСвойства()
	Если ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		Для каждого стр из ДополнительныеРеквизитыОбъекта Цикл
			СсылкаНаОбъект = Объект.Объект;	
			Значение = Стр.Значение;
			КодСвойства = Стр.Свойство.Код;
			ОбъектыСервер.ЗаписатьЗначениеСвойства(СсылкаНаОбъект,КодСвойства,Значение);	
		КонецЦикла;
		Для каждого стр из ДополнительныеРеквизитыДолжника Цикл
			СсылкаНаОбъект = Объект.Объект.Должник;	
			Значение = Стр.Значение;
			КодСвойства = Стр.Свойство.Код;
			ОбъектыСервер.ЗаписатьЗначениеСвойства(СсылкаНаОбъект,КодСвойства,Значение);	
		КонецЦикла;
	ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		Для каждого стр из ДополнительныеРеквизитыДолжника Цикл
			СсылкаНаОбъект = Объект.Объект;	
			Значение = Стр.Значение;
			КодСвойства = Стр.Свойство.Код;
			ОбъектыСервер.ЗаписатьЗначениеСвойства(СсылкаНаОбъект,КодСвойства,Значение);	
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры
// Установка состава карточки
&НаСервере
Процедура ПроверитьДопРеквизитыВРезультате()	
	Элементы.ГруппаДО.Видимость = ?(ДополнительныеРеквизитыОбъекта.Количество() > 0, Истина, Ложь);
	Элементы.ГруппаДолжник.Видимость = ?(ДополнительныеРеквизитыДолжника.Количество() > 0, Истина, Ложь);
	Элементы.ГруппаДополнительныеРеквизитыОбъекта.Видимость = Элементы.ГруппаДО.Видимость ИЛИ Элементы.ГруппаДолжник.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыДолжникаПередНачаломИзменения(Элемент, Отказ)
	ТипЭлемента = ОбъектыСервер.РазыменоватьСсылку(Элемент.ТекущиеДанные.Свойство, "ТипЗначения");	
	Если Строка(ТипЭлемента) = "Строка" Тогда
		ВидСтроки = ОбъектыСервер.РазыменоватьСсылку(Элемент.ТекущиеДанные.Свойство, "ВидСтроки");		
		Если ВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Строка") Тогда
			Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Ложь;
			Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Ложь;
			Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Истина;
		ИначеЕсли ВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Телефон") ИЛИ 
			ВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Адрес") Тогда
			Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
			Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Ложь;
			Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Ложь;	
		ИначеЕсли ВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.ПутьКФайлу") Тогда
			Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
			Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Истина;
			Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Истина;
		КонецЕсли;
	ИначеЕсли ТипЭлемента = Новый ОписаниеТипов("СправочникСсылка.тсЗначенияСвойствОбъектов") Тогда
		Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
		Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Ложь;
		Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Ложь;	
	ИначеЕсли ОбъектыСервер.ЭтотТипЕстьСсылка(ТипЭлемента) Тогда		
		Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
		Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Истина;
		Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Ложь;
		Элемент.ПодчиненныеЭлементы[1].КнопкаОчистки = Истина;
	ИначеЕсли Строка(ТипЭлемента) = "Число" Тогда
		Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
		Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Ложь;
		Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Истина;
	ИначеЕсли Строка(ТипЭлемента) = "Булево" Тогда
		Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
		Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Ложь;
		Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Ложь;
	ИначеЕсли Строка(ТипЭлемента) = "Дата" Тогда
		Элемент.ПодчиненныеЭлементы[1].КнопкаВыбора = Истина;
		Элемент.ПодчиненныеЭлементы[1].КнопкаОткрытия = Ложь;
		Элемент.ПодчиненныеЭлементы[1].РедактированиеТекста = Истина;
	КонецЕсли;
	Элемент.ПодчиненныеЭлементы[1].ОграничениеТипа = ТипЭлемента;
КонецПроцедуры

&НаСервере
Процедура ПроверитьОбязательныеДопРеквизиты(Отказ=Ложь, ТекстСообщения = "")
	Для Каждого Элемент Из ДополнительныеРеквизитыОбъекта Цикл
		Если НЕ ЗначениеЗаполнено(Элемент.Значение) и Элемент.Обязательное = Истина Тогда
			Отказ = Истина;	
			ТекстСообщения = "Не заполнены обязательные реквизиты долгового!";
		КонецЕсли;
	КонецЦикла;
	Для Каждого Элемент Из ДополнительныеРеквизитыДолжника Цикл
		Если НЕ ЗначениеЗаполнено(Элемент.Значение) и Элемент.Обязательное = Истина Тогда
			Отказ = Истина;	
			ТекстСообщения = "Не заполнены обязательные реквизиты должника!";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура ПрикрепитьАктПередачи(Команда)
	Если Не ЗначениеЗаполнено(Объект.СвязанныйДокумент) ИЛИ 
		ТипЗнч(Объект.СвязанныйДокумент) <> Тип("ДокументСсылка.АктПередачи") Тогда
		Форма = ПолучитьФорму("Документ.АктПередачи.Форма.ФормаДокумента",, ЭтаФорма);
		//Заполнение реквизитов Акта из результата мероприятия
		Форма.Объект.Организация = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "Организация");
		Форма.Объект.ПодразделениеПринимающее = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "ПодразделениеПринимающее");
		Форма.Объект.СотрудникПринимающий = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "СотрудникПринимающий");
		Форма.Объект.ТипСотрудникаПринимающего = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "ТипСотрудникаПринимающего");
		Форма.Объект.ПодразделениеПередающее = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "ПодразделениеПередающее");
		Форма.Объект.СотрудникПередающий = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "СотрудникПередающий");
		Форма.Объект.ТипСотрудникаПередающего = ОбъектыСервер.РазыменоватьСсылку(Объект.Результат, "ТипСотрудникаПередающего");
		//Заполнение ДО = > из Мероприятия
		Форма.Объект.Объекты.Очистить();
		СтрокаДО = Форма.Объект.Объекты.Добавить();
		СтрокаДО.Объект = Объект.Объект; 
		СтрокаДО.ДолговоеОбязательство = Объект.Объект;
		Форма.ОткрытьМодально();
		Если Не Форма.Объект.Ссылка.Пустая() Тогда
			Объект.СвязанныйДокумент = Форма.Объект.Ссылка;
		Иначе
			Объект.СвязанныйДокумент = ПредопределенноеЗначение("Документ.АктПередачи.ПустаяСсылка");
		КонецЕсли;
	Иначе
		ОткрытьЗначение(Объект.СвязанныйДокумент);
	КонецЕсли;
КонецПроцедуры

//!КонецЗаписи

&НаКлиенте
Процедура ДополнительныеРеквизитыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Свойство = Неопределено;
	СвойствоВидСтроки = Неопределено;
	Код = Сред(Элемент.Имя, Найти(Элемент.Имя, "_") + 1);
	УправлениеСвойствами.ПолучитьСвойствоПоКоду(СтрЗаменить(Код, "_", " "), Свойство, СвойствоВидСтроки);
	
	Если СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Адрес") ИЛИ
			СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Телефон") Тогда
	    Строки = ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Свойство));
		ТекСтрокаПараметры = Строки[0].Параметры;
						
		СписокСтрок = СтрЗаменить(ТекСтрокаПараметры, ";", Символы.ПС);
		ЗначенияПолей = Новый СписокЗначений();
		Если СтрЧислоСтрок(СписокСтрок) > 1 Тогда
			Для Индекс = 1 По СтрЧислоСтрок(СписокСтрок) Цикл
				Стр = СтрПолучитьСтроку(СписокСтрок, Индекс);
				Если Стр <> "" Тогда 
					СписокПодстрок = СтрЗаменить(Стр, "=", Символы.ПС);
					ЗначенияПолей.Добавить(СтрПолучитьСтроку(СписокПодстрок, 2), СтрПолучитьСтроку(СписокПодстрок, 1));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;			
		Если СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Адрес") Тогда
			ИмяФормыРедактирования = "ОбщаяФорма.ВводАдреса";
		ИначеЕсли СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Телефон") Тогда
			ИмяФормыРедактирования = "ОбщаяФорма.ВводТелефона";
		КонецЕсли;
			
		Пар = Новый Структура;
		Пар.Вставить("ЗначенияПолей",                ЗначенияПолей);
		Пар.Вставить("Вид",                          ""); //"Адрес");
		Пар.Вставить("БылиВнесеныИзменения",         Ложь);
		Пар.Вставить("Представление",                Элемент.ТекстРедактирования);
		Пар.Вставить("РедактированиеТолькоВДиалоге", Не Элемент.РедактированиеТекста);
		Пар.Вставить("АдресТолькоРоссийский",        Ложь);
			
		//Чуров
		Результат = ОткрытьФорму(ИмяФормыРедактирования, Пар);	
		//Результат = ОткрытьФормуМодально(ИмяФормыРедактирования, Пар);	
		Если ТипЗнч(Результат) = Тип("Структура") Тогда
			Строки[0].Значение = Результат.Представление;
			ЭтаФорма[Элемент.Имя] = Результат.Представление;
			ЗначенияПолей = Результат.ЗначенияПолей;
			Модифицированность = Истина;
			
			РезультатЗначение = "";
			Для Каждого Элемент Из ЗначенияПолей Цикл
				РезультатЗначение = РезультатЗначение + Элемент.Представление + "=" + Элемент.Значение + ";"; 
			КонецЦикла;
			
			Строки[0].Параметры = РезультатЗначение;
		КонецЕсли;
		
	ИначеЕсли СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.АдресФИАС") Тогда 
		
		Строки = ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Свойство)); 
		ТекСтрока = Строки[0]; 
		
		ИмяФормыРедактирования = "Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса"; 
		Если ТекСтрока.Параметры = "" Тогда 
			ЗнПолей = ""; 
		Иначе 
			ЗнПолей = бит_АдресныйКлассификатор.ПолучитьJSONИзXML(ТекСтрока.Параметры); 
		КонецЕсли; 
		Пар = Новый Структура; 
		Пар.Вставить("ЗначенияПолей", ЗнПолей); 
		Пар.Вставить("Вид", ""); //"Адрес"); 
		Пар.Вставить("БылиВнесеныИзменения", Ложь); 
		Пар.Вставить("Представление", Элемент.ТекстРедактирования); 
		Пар.Вставить("РедактированиеТолькоВДиалоге", Не Элемент.РедактированиеТекста); 
		Пар.Вставить("АдресТолькоРоссийский", Ложь); 
		
		Результат = ОткрытьФормуМодально(ИмяФормыРедактирования, Пар); 
		
		Если ТипЗнч(Результат) = Тип("Структура") Тогда 
			Строки[0].Значение = Результат.Представление; 
			ЭтаФорма[Элемент.Имя] = Результат.Представление; 
			Модифицированность = Истина; 
			СтрокаJSON = Результат.Значение; 
			
			Если СтрокаJSON = "" Тогда 
				СтрокаJSON = бит_АдресныйКлассификатор.ПолучитьJSONИзXML(СтрокаJSON); 
			КонецЕсли; 
			
			Строки[0].Параметры = бит_АдресныйКлассификатор.ПолучитьСтрокуXML(СтрокаJSON); 
		КонецЕсли;
		
	ИначеЕсли СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.ПутьКФайлу") Тогда	
		#Если Не ВебКлиент Тогда
			СтандартнаяОбработка = Ложь;
			Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
			Диалог.Заголовок = "Выберите файл";
			Диалог.ПолноеИмяФайла = ЭтаФорма[Элемент.Имя];
			Диалог.МножественныйВыбор = Ложь;
			Если Диалог.Выбрать() Тогда
				ЭтаФорма[Элемент.Имя] = Диалог.ПолноеИмяФайла;
			КонецЕсли;	
		#Иначе
			СтандартнаяОбработка = Ложь;
			Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
			Диалог.Заголовок = "Выберите файл";
			Диалог.ПолноеИмяФайла = ЭтаФорма[Элемент.Имя];
			//Фильтр = "EXE (*.exe)|*.exe"; 
			//Диалог.Фильтр = Фильтр; 
			Диалог.МножественныйВыбор = Ложь;
			//Диалог.Каталог = "F:\";
			Диалог.Показать(Новый ОписаниеОповещения("ДополнительныеРеквизитыНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Диалог, Элемент", Диалог, Элемент)));
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	Элемент = ДополнительныеПараметры.Элемент;
	
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ЭтаФорма[Элемент.Имя] = Диалог.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнструментПлатежныеСистемыMandarin()
	ФормаМандарин = ПолучитьФорму("Обработка.MandarinОперации.Форма.Форма");
	ФормаМандарин.ВладелецФормы = ЭтаФорма;
	ФормаМандарин.Объект.ОбъектУчета = Объект.Объект;
	ФормаМандарин.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнструментПлатежныеСистемы(Команда)
	Если ОбъектыСервер.ПолучитьЗначениеКонстанты("ИспользоватьMandarin") Тогда
		ОткрытьИнструментПлатежныеСистемыMandarin();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПереносаСроковВыполнения(Команда)
	Элементы.ГруппаСрокВыполненияТЧ.Видимость = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьСудебноеДело(Команда)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Основание", Объект.Объект);	
	ОткрытьФорму("Документ.СудебноеДело.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаСервере
Функция ПолучитьДолжникаСМС(Ссылка)

	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		Возврат Ссылка.Должник;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЭтоУниверсальнаяПечатьНаСервере(ТекущийШаблон)

	Возврат Справочники.тсВидыПечатныхДокументов.ЭтоУниверсальная(ТекущийШаблон);

КонецФункции // ()

&НаСервере
Функция СформироватьКомплекты()

	Основания = Новый Массив;
	ДолговоеОбязательствоМероприятия = Объект.Объект;
	Основания.Добавить(ДолговоеОбязательствоМероприятия);
	
	КомплектыБинарныйФормат = Справочники.тсВидыПечатныхДокументов.СформироватьУниверсальныеШаблоны(Объект.ТипМероприятия.ПечатнаяФорма, Основания);
	
	КомплектыБинарныйФорматСКоличеством = Новый Соответствие;

	ДанныеШаблона = КомплектыБинарныйФормат.Получить(ДолговоеОбязательствоМероприятия);
	ОснованиеСКоличеством = Новый Структура;
	ОснованиеСКоличеством.Вставить("Основание", ДолговоеОбязательствоМероприятия);
	ОснованиеСКоличеством.Вставить("Количество", 1);
	КомплектыБинарныйФорматСКоличеством.Вставить(ОснованиеСКоличеством, ДанныеШаблона);

	Возврат КомплектыБинарныйФорматСКоличеством;

КонецФункции // ()

//Заполнение комментария по  шаблону
&НаКлиенте
Функция ЗаполнитьКомментарий()
	Если ЗначениеЗаполнено(Объект.Результат) Тогда
		Результат = ВыполнитьФункциюКомментария();
		ДлинаБезТочки = СтрДлина(Результат) - 1;
		Если Объект.КомментарийИзменен ИЛИ Объект.Выполнена Тогда
			//Если Лев(Результат, ДлинаБезТочки) <> Лев(Объект.Комментарий, ДлинаБезТочки) Тогда
			//	Объект.Комментарий = Результат + Символы.ПС + Объект.Комментарий;
			//КонецЕсли;
		Иначе
			Объект.Комментарий = Объект.Комментарий + Результат;
		КонецЕсли;
	КонецЕсли;	
КонецФункции 


&НаКлиенте
Процедура ДополнительныеРеквизитыОбъектаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	типПВХЭлемент = ОбъектыСервер.РазыменоватьСсылку(Элемент.ТекущиеДанные.Свойство, "ТипЗначения"); 
	Если типПВХЭлемент = Новый ОписаниеТипов("СправочникСсылка.тсЗначенияСвойствОбъектов") Тогда
		СтандартнаяОбработка = Ложь;
		ФормаВыбора = ОткрытьФорму("Справочник.тсЗначенияСвойствОбъектов.ФормаВыбора", ,Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДопРеквизитыКарточекОбработкаВыбора(Элемент.Имя, ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыДолжникаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	типПВХЭлемент = ОбъектыСервер.РазыменоватьСсылку(Элемент.ТекущиеДанные.Свойство, "ТипЗначения"); 
	Если типПВХЭлемент = Новый ОписаниеТипов("СправочникСсылка.тсЗначенияСвойствОбъектов") Тогда
		СтандартнаяОбработка = Ложь;
		ФормаВыбора = ОткрытьФорму("Справочник.тсЗначенияСвойствОбъектов.ФормаВыбора", ,Элемент);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыДолжникаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДопРеквизитыКарточекОбработкаВыбора(Элемент.Имя, ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ДопРеквизитыКарточекОбработкаВыбора(ИмяСписка, ВыбранноеЗначение)
	Элементы[ИмяСписка].ТекущиеДанные.Значение = ВыбранноеЗначение;
КонецПроцедуры

#Область Конфигурация




#КонецОбласти

#Область НастройкиФормы

&НаСервере
Процедура НастройкаСотрудникВРегионе()

	Если Не Объект.Ссылка.Пустая() И Объект.Подразделение <> УдалитьОбщегоНазначения.ТекущийПользователь().Подразделение
			И РольДоступна("СотрудникВРегионе") Тогда
		//ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.Организация.ТолькоПросмотр = Истина;
		Элементы.Подразделение.ТолькоПросмотр = Истина;
		Элементы.ТипМероприятия.ТолькоПросмотр = Истина;
		Элементы.ТипСотрудника.ТолькоПросмотр = Истина;
		Элементы.Ответственный.ТолькоПросмотр = Истина;	
		
		Элементы.ОбъектУчета_Пусто.ТолькоПросмотр = Истина;
		Элементы.ОбъектУчета_Контрагенты.ТолькоПросмотр = Истина;
		Элементы.ОбъектУчета_ДоговорыКонтрагентов.ТолькоПросмотр = Истина;
		Элементы.ОбъектУчета_УслугиПоДоговорам.ТолькоПросмотр = Истина;
		Элементы.ОбъектУчета_ДолговыеОбязательства.ТолькоПросмотр = Истина;
		Элементы.ОбъектУчета_ИсполнительныеДокументы.ТолькоПросмотр = Истина;
		Элементы.ОбъектУчета_Залоги.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбщиеНачальныеНастройки()

	Элементы.ГруппаДополнительныеРеквизитыОбъекта.Видимость = Ложь;
	
	Элементы.ОбъектУчета_Контрагенты.Видимость = Ложь;
	Элементы.ОбъектУчета_ДоговорыКонтрагентов.Видимость = Ложь;
	Элементы.ОбъектУчета_УслугиПоДоговорам.Видимость = Ложь;
	Элементы.ОбъектУчета_ДолговыеОбязательства.Видимость = Ложь;
	Элементы.ОбъектУчета_ИсполнительныеДокументы.Видимость = Ложь;
	Элементы.ОбъектУчета_Залоги.Видимость = Ложь;

КонецПроцедуры

&НаСервере
Процедура ОбщиеРазрешения()

	НастройкиНеИзменяемыеЭлементыПослеВыполнения();

КонецПроцедуры

&НаСервере
Функция НастройкиНеИзменяемыеЭлементыПослеВыполнения()

	МероприятиеВыполнено = Объект.Выполнена;
	
	НастройкиНеИзменяемыеЭлементыПослеВыполнения_ТолькоПросмотр(МероприятиеВыполнено);

	Элементы.ФормаОтменитьВыполнение.Доступность = МероприятиеВыполнено;
	Элементы.ДекорацияВыполнено.Видимость = МероприятиеВыполнено;

КонецФункции // ()

&НаСервере
Процедура НастройкиНеИзменяемыеЭлементыПослеВыполнения_ТолькоПросмотр(МероприятиеВыполнено)

	Элементы.ГруппаШапка.ТолькоПросмотр = МероприятиеВыполнено;
	Элементы.Подразделение.ТолькоПросмотр = МероприятиеВыполнено;
	Элементы.ТипМероприятия.ТолькоПросмотр = МероприятиеВыполнено;
	Элементы.ТипСотрудника.ТолькоПросмотр = МероприятиеВыполнено;
	Элементы.Ответственный.ТолькоПросмотр = МероприятиеВыполнено;
	Элементы.Исполнитель.ТолькоПросмотр = МероприятиеВыполнено;

	Элементы.ГруппаПланирование.ТолькоПросмотр = МероприятиеВыполнено;
	Элементы.ПланируемаяДата.ТолькоПросмотр = МероприятиеВыполнено;

КонецПроцедуры



&НаСервере
Процедура ОбщиеЗапрещения()

	Если РольДоступна("тсАдминистрирование") Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.БизнесПроцесс <> Неопределено И Не Объект.БизнесПроцесс.Пустая() Тогда
		Элементы.ТипМероприятия.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РазрешенияАдминистратора()

	Если Не РольДоступна("тсАдминистрирование") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСрокВыполнения.ТолькоПросмотр = Ложь;
	Элементы.ГруппаШапка.ТолькоПросмотр =  Ложь;

КонецПроцедуры

&НаСервере
Процедура РазрешенияПереносСроковМероприятий()

	Если Не РольДоступна("ПереносСроковМероприятий") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСрокВыполнения.ТолькоПросмотр = Ложь;

КонецПроцедуры

#КонецОбласти	

&НаКлиенте
Процедура ПрошлоВремя30()
	ПоказатьОповещениеПользователя("Время закрытия",,"Прошло 30 секунд",БиблиотекаКартинок.NC_Таймер);
КонецПроцедуры	

&НаКлиенте
Процедура ПрошлоВремя60()
	ПоказатьОповещениеПользователя("Время закрытия",,"Прошло 60 секунд",БиблиотекаКартинок.NC_Таймер);
КонецПроцедуры

&НаСервере
Процедура ЗакрепитьДолжникаНаСервере()
	ДО = ЭтаФорма.ДолговоеОбязательство.Ссылка;
	Код = "0181";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("СТОП");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0182";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Ручной обзвон");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0183";
	Значение = ПараметрыСеанса.ТекущийПользователь;
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрепитьДолжника(Команда)
	НовоеЗакреплениеНаСервере();
	Если ЭтаФорма.Объект.ТипМероприятия = ЭтаФорма.ТипЗаявкаЗакрепление Тогда
		ПоказатьОповещениеПользователя("Закрепление должника",,"Должник закреплен",БиблиотекаКартинок.NC_Портфель);	
		ЗакрепитьДолжникаНаСервере();
		ПрикрепитьАктПередачи(Команда);
	Иначе
		Предупреждение("Не найдена заявка на закрепление!",,"Закрепление должника");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОткрепитьДолжникаНаСервере()
	ДО = ЭтаФорма.ДолговоеОбязательство.Ссылка;
	Код = "0181";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("В работе");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0182";
	Значение = "";
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0183";
	Значение = "";
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
КонецПроцедуры

&НаКлиенте
Процедура ОткрепитьДолжника(Команда)
	НовоеОткреплениеНаСервере();
	Если ЭтаФорма.Объект.ТипМероприятия = ЭтаФорма.ТипЗаявкаОткрепление Тогда
		ПоказатьОповещениеПользователя("Открепление должника",,"Должник откреплен",БиблиотекаКартинок.NC_Портфель);
		ОткрепитьДолжникаНаСервере();
		ПрикрепитьАктПередачи(Команда);
	Иначе
		Предупреждение("Не найдена заявка на открепление!",,"Открепление должника");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРазговор(Команда)
	ФормаНабора = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
	Если ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусПодключен = Истина И ФормаНабора.ИдетРазговор = Истина
		ИЛИ ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусНеБеспокоить = Истина И ФормаНабора.ИдетРазговор = Истина Тогда
		// Сбросить цвет кнопки звонка
		ЭтаФорма.Элементы.ПозвонитьДолжнику.ЦветФона = Новый Цвет();
		//
		ЭтаФорма.Элементы.ЗавершитьРазговор.ЦветФона = WebЦвета.СветлоРозовый;
		ФормаНабора.КнОтбой(Неопределено);
	ИначеЕсли ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусПодключен = Истина И ФормаНабора.ИдетРазговор = Ложь
		ИЛИ ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусНеБеспокоить = Истина И ФормаНабора.ИдетРазговор = Ложь Тогда
		Предупреждение("На канале нет активных разговоров!",,"БИТ.Phone");
	ИначеЕсли ФормаНабора.Открыта() = Ложь ИЛИ ФормаНабора.СтатусПодключен = Ложь И ФормаНабора.СтатусНеБеспокоить = Ложь Тогда
		Предупреждение("БИТ.Phone не подключен!",,"БИТ.Phone");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПереводВызоваНаСервере()
	ЭтаФорма.РезультатПеревод = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Перевод вызова");
КонецПроцедуры

&НаКлиенте
Процедура ПереводВызова(Команда)
	// Получить значения с сервера
	ПереводВызоваНаСервере();
	ФормаНабора = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
	Если ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусПодключен = Истина И ФормаНабора.ИдетРазговор = Истина
		ИЛИ ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусНеБеспокоить = Истина И ФормаНабора.ИдетРазговор = Истина Тогда
		Если ЭтаФорма.Объект.Результат <> ЭтаФорма.РезультатПеревод Тогда
			ЭтаФорма.Объект.Результат = ЭтаФорма.РезультатПеревод
		КонецЕсли;
		ФормаПеревода = ПолучитьФорму("ОбщаяФорма.ПереводЗвонка");
		ФормаПеревода.Открыть();
	ИначеЕсли ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусПодключен = Истина И ФормаНабора.ИдетРазговор = Ложь
		ИЛИ ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусНеБеспокоить = Истина И ФормаНабора.ИдетРазговор = Ложь Тогда
		Предупреждение("На канале нет активных разговоров!",,"БИТ.Phone");
	ИначеЕсли ФормаНабора.Открыта() = Ложь ИЛИ ФормаНабора.СтатусПодключен = Ложь И ФормаНабора.СтатусНеБеспокоить = Ложь Тогда
		Предупреждение("БИТ.Phone не подключен!",,"БИТ.Phone");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьМикрофон(Команда)
	ФормаНабора = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
	Если ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусПодключен = Истина И ФормаНабора.МикрофонВключен = Истина
		ИЛИ ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусНеБеспокоить = Истина И ФормаНабора.МикрофонВключен = Истина Тогда
		ФормаНабора.КнОМик(Неопределено);
		ЭтаФорма.Элементы.ОтключитьМикрофон.ЦветФона = WebЦвета.СветлоРозовый;
	ИначеЕсли ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусПодключен = Истина И ФормаНабора.МикрофонВключен = Ложь
		ИЛИ ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусНеБеспокоить = Истина И ФормаНабора.МикрофонВключен = Ложь Тогда
		ФормаНабора.КнОМик(Неопределено);
		ЭтаФорма.Элементы.ОтключитьМикрофон.ЦветФона = Новый Цвет();
	ИначеЕсли ФормаНабора.Открыта() = Ложь ИЛИ ФормаНабора.СтатусПодключен = Ложь И ФормаНабора.СтатусНеБеспокоить = Ложь Тогда
		Предупреждение("БИТ.Phone не подключен!",,"БИТ.Phone");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдержаниеВызова(Команда)
	ФормаНабора = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
	Если ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусПодключен = Истина И ФормаНабора.ИдетРазговор = Истина И ФормаНабора.ВызовУдержан = Ложь
		ИЛИ ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусНеБеспокоить = Истина И ФормаНабора.ИдетРазговор = Истина И ФормаНабора.ВызовУдержан = Ложь Тогда	
		ФормаНабора.КнУдержатьВызов(Неопределено);
		ЭтаФорма.Элементы.УдержаниеВызова.ЦветФона = WebЦвета.СветлоРозовый;
	ИначеЕсли ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусПодключен = Истина И ФормаНабора.ИдетРазговор = Истина И ФормаНабора.ВызовУдержан = Истина
		ИЛИ ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусНеБеспокоить = Истина И ФормаНабора.ИдетРазговор = Истина И ФормаНабора.ВызовУдержан = Истина Тогда
		ФормаНабора.КнУдержатьВызов(Неопределено);
		ЭтаФорма.Элементы.УдержаниеВызова.ЦветФона = Новый Цвет();
	ИначеЕсли ФормаНабора.Открыта() = Ложь ИЛИ ФормаНабора.СтатусПодключен = Ложь И ФормаНабора.СтатусНеБеспокоить = Ложь Тогда
		Предупреждение("БИТ.Phone не подключен!",,"БИТ.Phone");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоискНомераВБазе(Команда)
	ПоказатьОповещениеПользователя("Поиск номера в базе",,"Поиск совпадений...",БиблиотекаКартинок.NC_РозыскДолжника);
	ФормаПоискаНомера = ПолучитьФорму("ОбщаяФорма.ПоискНомераВБазе",,,Новый УникальныйИдентификатор());
    // Обрезать неинформативную часть и передать с ключом
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаПоискаНомера.СписокДО, "Ссылка.Должник.Телефоны.Номер", Строка(Прав(Объект.Контакт, 7)), ВидСравненияКомпоновкиДанных.Содержит, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	ФормаПоискаНомера.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ДолжникМероприятия(Команда)
	// Передать с ключом
	ФормаМероприятия = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаСписка",,,Новый УникальныйИдентификатор());
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаМероприятия.Список, "Объект.Должник", ЭтаФорма.КонтрагентКЛ, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	ФормаМероприятия.КоманднаяПанель.Видимость = Ложь;
	ФормаМероприятия.ОткрытьМодально();
КонецПроцедуры

&НаКлиенте
Процедура ДолжникОбязательства(Команда)
	// Передать с ключом
	ФормаОбязательства = ПолучитьФорму("Справочник.ДолговыеОбязательства.Форма.ФормаСписка",,,Новый УникальныйИдентификатор());
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаОбязательства.Список, "Должник", ЭтаФорма.КонтрагентКЛ, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	ФормаОбязательства.КоманднаяПанель.Видимость = Ложь;
	ФормаОбязательства.ОткрытьМодально();
КонецПроцедуры

&НаКлиенте
Процедура ДолжникОбещания(Команда)
	// Передать с ключом
    ФормаОбещания = ПолучитьФорму("Документ.ОбещанныеПлатежи.Форма.ФормаСписка",,,Новый УникальныйИдентификатор());
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаОбещания.Список, "Объект", ЭтаФорма.ДолговоеОбязательство, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	ФормаОбещания.КоманднаяПанель.Видимость = Ложь;
	ФормаОбещания.ОткрытьМодально();
КонецПроцедуры

&НаКлиенте
Процедура ДолжникПогашения(Команда)
    // Передать с ключом
	ФормаПогашения = ПолучитьФорму("РегистрНакопления.ЗадолженностьПоОбъектамВнесудебная.ФормаСписка",,,Новый УникальныйИдентификатор());
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаПогашения.Список, "Объект", ЭтаФорма.ДолговоеОбязательство, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	ФормаПогашения.КоманднаяПанель.Видимость = Ложь;
	ФормаПогашения.ОткрытьМодально();
КонецПроцедуры

&НаКлиенте
Процедура ДолжникПогашенияСудебные(Команда)
    // Передать с ключом
	ФормаПогашенияСудебные = ПолучитьФорму("РегистрНакопления.ЗадолженностьПоСудебнымРешениям.ФормаСписка",,,Новый УникальныйИдентификатор());
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаПогашенияСудебные.Список, "Займ", ЭтаФорма.ДолговоеОбязательство, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	ФормаПогашенияСудебные.КоманднаяПанель.Видимость = Ложь;
	ФормаПогашенияСудебные.ОткрытьМодально();
КонецПроцедуры

&НаКлиенте
Процедура ДолжникСМС(Команда)
	// Передать с ключом
    ФормаСпискаСМС = ПолучитьФорму("РегистрСведений.СообщенияСМС.ФормаСписка",,,Новый УникальныйИдентификатор());
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаСпискаСМС.Список, "Объект", ЭтаФорма.КонтрагентКЛ, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	ФормаСпискаСМС.КоманднаяПанель.Видимость = Ложь;
	ФормаСпискаСМС.ОткрытьМодально();
КонецПроцедуры

&НаКлиенте
Процедура ВходящийЗвонокПриИзменении(Элемент)
	Объект.Комментарий = "Входящий звонок → " + Объект.Комментарий; 
КонецПроцедуры

&НаСервере
Процедура ПолучитьОстатокНаСервере()
	// Получить значения с сервера
	НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ЭтаФорма.ДолговоеОбязательство);
	НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Сумма"));
	НаборЗаписей.Прочитать(); 
	Для каждого ЗаписьНабора из НаборЗаписей Цикл
		ЭтаФорма.ДолговоеОбязательствоСуммаОстатка = ЗаписьНабора.СуммаДО;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьДниПросрочкиНаСервере()
	// Получить значения с сервера
	ДО = ЭтаФорма.ДолговоеОбязательство.ПолучитьОбъект();
	ДниПросрочки = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, "0141");
	ЭтаФорма.ДолговоеОбязательствоДнейПросрочки = ДниПросрочки;
КонецПроцедуры

&НаСервере
Процедура ПолучитьДатуВыдачиНаСервере()
	// Получить значения с сервера
	ДО = ЭтаФорма.ДолговоеОбязательство.ПолучитьОбъект();
	ДатаВыдачи = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, "0161");
	ЭтаФорма.ДолговоеОбязательствоДатаВыдачи = ДатаВыдачи;
КонецПроцедуры

&НаСервере
Процедура ПолучитьОтветственногоНаСервере()
	// Получить значения с сервера
	ДО = ЭтаФорма.ДолговоеОбязательство.ПолучитьОбъект();
	ОтветственныйНаСервере = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, "0183");
	ЭтаФорма.ДолговоеОбязательствоОтветственный = ОтветственныйНаСервере;
	Если ЗначениеЗаполнено(ЭтаФорма.ДолговоеОбязательствоОтветственный) = Истина Тогда
		ЭтаФорма.Элементы.ДолговоеОбязательствоОтветственный.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.ДолговоеОбязательствоОтветственный.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьВозрастНаСервере()
	// Получить значения с сервера
	ДО = ЭтаФорма.ДолговоеОбязательство.Должник.ПолучитьОбъект();
	ДатаРожденияНаСервере = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, "0043");
	Если ЗначениеЗаполнено(ДатаРожденияНаСервере) Тогда 
		ВозрастНаСервере = (НачалоДня(ТекущаяДата()) - НачалоДня(ДатаРожденияНаСервере)) / 31536000; 
		ЭтаФорма.ДолговоеОбязательствоДолжникВозраст = ВозрастНаСервере;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасчетУсловий(Команда)
    ФормаРасчетУсловий = ПолучитьФорму("ОбщаяФорма.РасчетУсловий",,,Новый УникальныйИдентификатор());
	// Получить кредитора
	ФормаРасчетУсловий.Кредитор = ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Объект.Объект, "Кредитор");
	// Получить сумму ДО
	ПолучитьОстатокНаСервере();
	ФормаРасчетУсловий.СуммаОстатка = ЭтаФорма.ДолговоеОбязательствоСуммаОстатка;
	// Получить номер ДО
	ФормаРасчетУсловий.СкрытоеПолеНомерДО = ЭтаФорма.Объект.Объект;
	ФормаРасчетУсловий.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура НаписатьВВЦ(Команда)
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Контакт) Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.ДолговоеОбязательство) = Истина Тогда
			
			// Проверка на нарушение 230-ФЗ
			
			Если ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
				ОбъектДолжник = ОбъектыСервер.РазыменоватьСсылку(Объект.Объект, "Должник");
			ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
				ОбъектДолжник = Объект.Объект;
			Иначе
				Возврат;
			КонецЕсли;
			
			Если КонтрольСобытий.КонтрольЧасовогоПояса(ОбъектДолжник) Тогда
				Предупреждение("Действие приведет к нарушению 230-ФЗ!",,"Контроль часового пояса");
				// Пометить мероприятие на удаление и закрыть форму
				ПоказатьОповещениеПользователя("Удаление мероприятия",,"Установлена пометка удаления",БиблиотекаКартинок.NC_УдалениеМероприятия);
				ЭтаФорма.Объект.ПометкаУдаления = Истина;
				ЭтаФорма.Записать();
				ЭтаФорма.Закрыть();
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если КонтрольСобытий.КонтрольСМС(ОбъектДолжник) Тогда
			Ответ = Вопрос("Действие приведет к нарушению 230-ФЗ! Вы уверены?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Контроль WhatsApp");
			Если Ответ = КодВозвратаДиалога.Да Тогда
				// Создать новую запись в регистре нарушений 230-ФЗ
				ЗаписатьНарушениеПоСообщениямВЦ();
			Иначе
				// Пометить мероприятие на удаление и закрыть форму
				ПоказатьОповещениеПользователя("Удаление мероприятия",,"Установлена пометка удаления",БиблиотекаКартинок.NC_УдалениеМероприятия);
				ЭтаФорма.Объект.ПометкаУдаления = Истина;
				ЭтаФорма.Записать();
				ЭтаФорма.Закрыть();
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ФормаВЦ = ПолучитьФорму("ОбщаяФорма.ОтправкаНаWhatsApp");
		ФормаВЦ.Номер = СтрСоединить(СтрРазделить(ЭтаФорма.Объект.Контакт, "+( )"), "");
		ФормаВЦ.Договор = ЭтаФорма.Объект.Объект;
		ФормаВЦ.ОткрытьМодально();
		
		// Уменьшить число допустимых сообщений
        СоздатьСлужебноеСообщение();
		
	Иначе
		Предупреждение("Не выбран контакт для отправки!",,"Интеграция с WhatsApp");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьСлужебноеСообщение()
	СлужебнаяЗапись = РегистрыСведений.СообщенияСМС.СоздатьМенеджерЗаписи();
		
	СлужебнаяЗапись.GUID = Новый УникальныйИдентификатор();
	СлужебнаяЗапись.Объект = ЭтаФорма.Объект.Объект.Должник;
	СлужебнаяЗапись.Дата = ТекущаяДата();
	СлужебнаяЗапись.ТекстСообщения = "Корректировка количества допустимых сообщений по объекту";
	СлужебнаяЗапись.НомерТелефона = СтрСоединить(СтрРазделить(ЭтаФорма.Объект.Контакт, "+( )"), "");
	СлужебнаяЗапись.Статус = "Служебное";	
		
	СлужебнаяЗапись.Записать();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНарушениеПоСообщениямВЦ()
	МенеджерЗаписи = РегистрыСведений.ЖурналНарушений.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Дата = ТекущаяДата();
	МенеджерЗаписи.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Договор = ЭтаФорма.Объект.Объект;
	МенеджерЗаписи.ТипНарушения = Перечисления.ТипыНарушений230ФЗ.ПревышениеКоличестваСообщенийWhatsApp;
	
	МенеджерЗаписи.Записать();
КонецПроцедуры

&НаКлиенте
Процедура НаписатьВВайбер(Команда)
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Контакт) Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.ДолговоеОбязательство) = Истина Тогда
			
			// Проверка на нарушение 230-ФЗ
			
			Если ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
				ОбъектДолжник = ОбъектыСервер.РазыменоватьСсылку(Объект.Объект, "Должник");
			ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
				ОбъектДолжник = Объект.Объект;
			Иначе
				Возврат;
			КонецЕсли;
			
			Если КонтрольСобытий.КонтрольЧасовогоПояса(ОбъектДолжник) Тогда
				Предупреждение("Действие приведет к нарушению 230-ФЗ!",,"Контроль часового пояса");
				// Пометить мероприятие на удаление и закрыть форму
				ПоказатьОповещениеПользователя("Удаление мероприятия",,"Установлена пометка удаления",БиблиотекаКартинок.NC_УдалениеМероприятия);
				ЭтаФорма.Объект.ПометкаУдаления = Истина;
				ЭтаФорма.Записать();
				ЭтаФорма.Закрыть();
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если КонтрольСобытий.КонтрольСМС(ОбъектДолжник) Тогда
			Ответ = Вопрос("Действие приведет к нарушению 230-ФЗ! Вы уверены?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Контроль Viber");
			Если Ответ = КодВозвратаДиалога.Да Тогда
				// Создать новую запись в регистре нарушений 230-ФЗ
				ЗаписатьНарушениеПоСообщениямВайбер();
			Иначе
				// Пометить мероприятие на удаление и закрыть форму
				ПоказатьОповещениеПользователя("Удаление мероприятия",,"Установлена пометка удаления",БиблиотекаКартинок.NC_УдалениеМероприятия);
				ЭтаФорма.Объект.ПометкаУдаления = Истина;
				ЭтаФорма.Записать();
				ЭтаФорма.Закрыть();
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ФормаВайбер = ПолучитьФорму("ОбщаяФорма.ОтправкаНаViber");
		ФормаВайбер.Номер = СтрСоединить(СтрРазделить(ЭтаФорма.Объект.Контакт, "+( )"), "");
		ФормаВайбер.Договор = ЭтаФорма.Объект.Объект;
		ФормаВайбер.ОткрытьМодально();
		
		// Уменьшить число допустимых сообщений
		СоздатьСлужебноеСообщение();
		
	Иначе
		Предупреждение("Не выбран контакт для отправки!",,"Интеграция с Viber");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНарушениеПоСообщениямВайбер()
	МенеджерЗаписи = РегистрыСведений.ЖурналНарушений.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Дата = ТекущаяДата();
	МенеджерЗаписи.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Договор = ЭтаФорма.Объект.Объект;
	МенеджерЗаписи.ТипНарушения = Перечисления.ТипыНарушений230ФЗ.ПревышениеКоличестваСообщенийViber;
	
	МенеджерЗаписи.Записать();
КонецПроцедуры

&НаСервере
Процедура НовоеЗакреплениеНаСервере()
	// Получить значения с сервера
	ЭтаФорма.ТипЗаявкаЗакрепление = Справочники.ТипыМероприятий.НайтиПоНаименованию("Заявка на закрепление");
КонецПроцедуры

&НаСервере
Процедура НовоеОткреплениеНаСервере()
	// Получить значения с сервера
	ЭтаФорма.ТипЗаявкаОткрепление = Справочники.ТипыМероприятий.НайтиПоНаименованию("Заявка на открепление");
КонецПроцедуры

&НаКлиенте
Процедура НовоеЗакрепление(Команда)
	НовоеЗакреплениеНаСервере();
	К = ЭтаФорма.Объект.Объект;
	НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
	НоваяЗадача.Объект.Объект = К;
	НоваяЗадача.Объект.ТипМероприятия = ТипЗаявкаЗакрепление;
	// НоваяЗадача.Объект.Контакт = РезультатНомер;
	//НоваяЗадача.КонтрагентКЛ = К;
	НоваяЗадача.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура НовоеОткрепление(Команда)
	НовоеОткреплениеНаСервере();
	К = ЭтаФорма.Объект.Объект;
	НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
	НоваяЗадача.Объект.Объект = К;
	НоваяЗадача.Объект.ТипМероприятия = ТипЗаявкаОткрепление;
	// НоваяЗадача.Объект.Контакт = РезультатНомер;
	//НоваяЗадача.КонтрагентКЛ = К;
	НоваяЗадача.Открыть();
КонецПроцедуры

&НаСервере
Процедура ЗапланироватьЗвонокНаСервере()
	ЭтаФорма.РезультатЗапланироватьЗвонок = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Запланировать звонок");
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьЗвонок(Команда)
	ЗапланироватьЗвонокНаСервере();
	К = ЭтаФорма.Объект.Объект;
	НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
	НоваяЗадача.Объект.Объект = К;
	НоваяЗадача.Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокИсходящий");
	НоваяЗадача.Объект.Результат = ЭтаФорма.РезультатЗапланироватьЗвонок;
	// НоваяЗадача.Объект.Контакт = РезультатНомер;
	//НоваяЗадача.КонтрагентКЛ = К;
	НоваяЗадача.Открыть();
КонецПроцедуры

&НаСервере
Процедура ЗапланироватьСМСНаСервере()
	ЭтаФорма.РезультатЗапланироватьСМС = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Запланировать отправку");
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьСМС(Команда)
	ЗапланироватьСМСНаСервере();
	К = ЭтаФорма.Объект.Объект;
	НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
	НоваяЗадача.Объект.Объект = К;
	НоваяЗадача.Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ОтправкаСМС");
	НоваяЗадача.Объект.Результат = ЭтаФорма.РезультатЗапланироватьСМС;
	// НоваяЗадача.Объект.Контакт = РезультатНомер;
	//НоваяЗадача.КонтрагентКЛ = К;
	НоваяЗадача.Открыть();
КонецПроцедуры

&НаСервере
Процедура ЗапланироватьВЦНаСервере()
	ЭтаФорма.РезультатЗапланироватьВЦ = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Запланировать отправку");
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьВЦ(Команда)
	ТипВЦНаСервере();
	ЗапланироватьВЦНаСервере();
	К = ЭтаФорма.Объект.Объект;
	НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
	НоваяЗадача.Объект.Объект = К;
	НоваяЗадача.Объект.ТипМероприятия = ЭтаФорма.ТипВЦ;
	НоваяЗадача.Объект.Результат = ЭтаФорма.РезультатЗапланироватьВЦ;
	// НоваяЗадача.Объект.Контакт = РезультатНомер;
	//НоваяЗадача.КонтрагентКЛ = К;
	НоваяЗадача.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьИЗакрыть(Команда)
	// Записать без выполнения
	ПоказатьОповещениеПользователя("Планирование мероприятий",,"Мероприятие добавлено в планировщик",БиблиотекаКартинок.NC_Планировщик);
	ЭтаФорма.Записать();	
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьОператораИРегион(Команда)
	ФормаОпределитель = ПолучитьФорму("ОбщаяФорма.ОператорИРегионНомера");
	ФормаОпределитель.Номер = бит_ТелефонияКлиентСервер.ОчиститьНомерТолькоЦифры(ЭтаФорма.Объект.Контакт);
	ФормаОпределитель.Открыть();
КонецПроцедуры


