
Процедура ПередЗаписью(Отказ)
	Если ЭтотОбъект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	Категории.НомерСтроки КАК НомерСтроки
		                      |ИЗ
		                      |	Справочник.Категории КАК Категории
		                      |ГДЕ
		                      |	Категории.Владелец = &Владелец
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	НомерСтроки УБЫВ");
		Запрос.УстановитьПараметр("Владелец", ЭтотОбъект.Владелец);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			ЭтотОбъект.НомерСтроки = Результат.НомерСтроки + 1;
		Иначе
			ЭтотОбъект.НомерСтроки = 1;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Категории.НомерСтроки КАК НомерСтроки,
	                      |	Категории.Ссылка,
	                      |	Категории.НомерСтроки - 1 КАК НомерСтрокиНовый
	                      |ИЗ
	                      |	Справочник.Категории КАК Категории
	                      |ГДЕ
	                      |	Категории.Владелец = &Владелец
	                      |	И Категории.НомерСтроки > &НомерСтроки");
	Запрос.УстановитьПараметр("Владелец", ЭтотОбъект.Владелец);
	Запрос.УстановитьПараметр("НомерСтроки", ЭтотОбъект.НомерСтроки);	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ОбъектКатегория = Результат.Ссылка.ПолучитьОбъект();
		ОбъектКатегория.НомерСтроки = Результат.НомерСтрокиНовый;
		ОбъектКатегория.Записать();
	КонецЦикла;
КонецПроцедуры
