
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Набор = РегистрыСведений.НастройкиАвтораспределения.СоздатьМенеджерЗаписи();
	Набор.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Набор.Прочитать();
	АвтораспределениеВключено = Набор.Включено;
	ВариантАвтораспределения = Набор.ВариантРаспределения;
	ТипСотрудника = Набор.ТипСотрудника;	
	
	Набор = РегистрыСведений.СотрудникиАвтораспределения.СоздатьНаборЗаписей();
	Набор.Отбор.Ответственный.Использование = Истина;
	Набор.Отбор.Ответственный.Значение = ПараметрыСеанса.ТекущийПользователь;
	Набор.Прочитать();
	Сотрудники.Загрузить(Набор.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Модифицированность = Ложь;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Модифицированность = Истина;	
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	Если ПараметрыСеанса.ТекущийПользователь.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.НастройкиАвтораспределения.СоздатьМенеджерЗаписи();
	Набор.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Набор.Прочитать();
	Набор.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Набор.Включено = АвтораспределениеВключено;
	Набор.ВариантРаспределения = ВариантАвтораспределения;
	Набор.ТипСотрудника = ТипСотрудника;
	Набор.Записать();
		
	Набор = РегистрыСведений.СотрудникиАвтораспределения.СоздатьНаборЗаписей();
	Набор.Отбор.Ответственный.Использование = Истина;
	Набор.Отбор.Ответственный.Значение = ПараметрыСеанса.ТекущийПользователь;
	Набор.Прочитать();
	ТЗ = Сотрудники.Выгрузить();
	ТЗ.ЗаполнитьЗначения(ПараметрыСеанса.ТекущийПользователь, "Ответственный");
	Набор.Загрузить(ТЗ);
	Набор.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если Модифицированность Тогда
		СохранитьНастройки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
     