
#Область ПрограммныйИнтерфейс

Функция ПроверкаНБКИ() Экспорт

	Данные = ДанныеДляПроверки();
	
	Данные["Схема"] = СхемаНБКИ();
	Данные["ИмяСхемы"] = ИмяФайлаСхемыНБКИ();
	
	Возврат Данные;

КонецФункции // ()

Функция ПроверкаСообщенийФедресурс() Экспорт

	Данные = ДанныеДляПроверки();
	
	Данные["Схема"] = СхемаСообщенийФедресурс();
	
	Возврат Данные;

КонецФункции // ()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КонфигурацияДляПроверки

Функция ДанныеДляПроверки()

	Описание = Новый Структура;
	Описание.Вставить("Схема", Неопределено);
	Описание.Вставить("ИмяСхемы", Неопределено);
	Описание.Вставить("Валидатор", Валидатор());
	Описание.Вставить("ПутьJAVA", АдресИсполняемогоФайла());
	
	Возврат Описание;

КонецФункции // ()

Функция Валидатор()

	Возврат ПолучитьОбщийМакет("ВалидаторНБКИ");

КонецФункции // ()

Функция АдресИсполняемогоФайла()

	Возврат Константы.АдресИсполняемогоФайлаJava.Получить();

КонецФункции // ()

/// Схемы ///
Функция СхемаНБКИ()

	Возврат ПолучитьОбщийМакет("СхемаПроверкиНБКИ");

КонецФункции // ()

Функция СхемаСообщенийФедресурс()

	Возврат ПолучитьОбщийМакет("СхемаПроверкиСообщенийФедресурс");

КонецФункции // ()

/// ИменаСхемы ///
Функция ИмяФайлаСхемыНБКИ()

	Возврат "Main.xsd";

КонецФункции // ()

#КонецОбласти

#КонецОбласти