
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Отбор = Новый Структура("Объект", ПараметрКоманды);
	Структура = Новый Структура("Отбор", Отбор);
	Если ОбъектыСервер.ПолучитьЗначениеКонстанты("ИспользоватьСудебныйБлок") Тогда
		ОткрытьФорму("РегистрНакопления.ЗадолженностьПоОбъектамВнесудебная.ФормаСписка", 
		Структура, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);		
	Иначе
		ОткрытьФорму("РегистрНакопления.ЗадолженностьПоОбъектам.ФормаСписка", 
		Структура, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;
КонецПроцедуры
