///////////////////////////////////////////////////////////////////////////////
// Общий клиентский модуль отправки SMS из БИТ.Phone
///////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Открывает форму настроек для текущего пользователя.
//
Процедура ОткрытьФормуНастроек() ЭКСПОРТ
	СтарыеНастройки = Новый Структура();
	СтарыеНастройки.Вставить("ШаблонСообщения", бит_ОтправкаSMSСервер.ПолучитьШаблонСообщения());
	ПараметрыФормыНастроек = бит_ОтправкаSMSСервер.ПолучитьПараметрыОткрытияФормыНастроек();
	фрмНастройки = ПолучитьФорму("РегистрСведений.бит_ОтправкаSMSНастройки.Форма.ФормаЗаписи", ПараметрыФормыНастроек);
	фрмНастройки.Элементы.Пользователь.ТолькоПросмотр = Истина;
	бит_ТелефонияКлиентПереопределяемый.ОткрытьФормуСБлокировкойВладельца(фрмНастройки, "БитФон_НастройкиSMS", СтарыеНастройки);
КонецПроцедуры

#КонецОбласти
