&НаКлиенте
Процедура ДобавитьМассово(Команда)

	Назначение = ПредопределенноеЗначение("Перечисление.ВидыНазначенийСвойств.Контрагенты");
	ДополнительныеРеквизитыИСведения.ДобавитьМассово(ЭтаФорма, Назначение);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДобавитьРеквизит" И Источник = ЭтаФорма Тогда
	
		ДобавитьРеквизит(Параметр["Результат"]);
	
	КонецЕсли;
	
	Если ИмяСобытия = "ДобавитьРеквизиты" И Источник = ЭтаФорма Тогда
	
		Результаты = Параметр["Результат"];
		Для каждого Результат Из Результаты Цикл
		
			ДобавитьРеквизит(Результат);
		
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеквизит(Результат)

	ТаблицаДобавления = "ДополнительныеРеквизиты";
	ТипЭлемента = ОбъектыСервер.РазыменоватьСсылку(Результат, "ТипЭлемента");
	Если ТипЭлемента = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеСведения_Контрагенты") Тогда
	
		ТаблицаДобавления = "ДополнительныеСведения";
	
	КонецЕсли;
	
	НовыйРеквизит = Объект[ТаблицаДобавления].Добавить();
	НовыйРеквизит.Свойство = Результат;

КонецПроцедуры