
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Варианты = Обработки.СохранениеИсторииЧатов
		.ДоступныеВариантыХраненияИстории();
	
	СписокВариантовХранения = Элементы.ХранилищеИстории.СписокВыбора;
	Для каждого Вариант Из Варианты Цикл
	
		СписокВариантовХранения.Добавить(Вариант.Ключ, Вариант.Ключ);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСообщение(Команда)
	
	СохранитьНаСервере(Объект.ХранилищеИстории);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СохранитьНаСервере(ХранилищеИстории)

	Хранитель = Обработки.СохранениеИсторииЧатов
		.ХранительВФайловойСистеме(ХранилищеИстории);
	
	Сообщение = СообщениеИзЧата.НовоеСообщение();
	Сообщение["Дата"] = ТекущаяДатаСеанса();
	Сообщение["Текст"] = Текст;
	Сообщение["Отправитель"] = Отправитель;
	Сообщение["Клиент"] = Клиент;
	Сообщение["Сотрудник"] = Сотрудник;
	
	Сообщение["Мессенджер"] = Мессенджер;
	
	Хранитель
		.Сообщение(Сообщение)
		.Отправить();

КонецФункции // ()





#КонецОбласти