
&НаКлиенте
Процедура ЗавершитьРаботу(Команда) 
	ЗавершитьРаботуСервер();
КонецПроцедуры 

&НаСервере
Процедура ЗавершитьРаботуСервер()
	
	Если Не РольДоступна("тсАдминистрирование") ИЛИ Не РольДоступна("ПолныеПрава") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У Вас нет прав для совершения этой операции!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыВРаботеОстатки.Объект КАК Объект
		|ИЗ
		|	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
		|ГДЕ
		|	ОбъектыВРаботеОстатки.Объект.Ссылка ЕСТЬ NULL";
	
	Рез = Запрос.Выполнить(); 
	
	Если Рез.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В базе нет битых ссылок, операция прервана!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ДокЗавершение = Документы.ЗавершениеРаботыОрганизации.СоздатьДокумент();
	ДокЗавершение.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДокЗавершение.Дата = ТекущаяДатаСеанса();
	ДокЗавершение.Комментарий = "Вывод битых ссылок ПРОГРАММНО";
	ДокЗавершение.Организация = ПараметрыСеанса.ТекущийПользователь.Организация;
	ДокЗавершение.ОбнулитьЗадолженность = Истина;
	ДокЗавершение.ОбнулитьКатегории = Истина;
	
	ДокЗавершение.Объекты.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ДокЗавершение.Записать(РежимЗаписиДокумента.Проведение);              
	
КонецПроцедуры 

