
&НаСервере
Функция ВозвратКоллекцииРеквизитовСправочника(ТипДанных) Экспорт
	ТипРеквизитаСтр = СтрЗаменить(ТипДанных," ","");
		
	СписокВсехПараметров = Новый СписокЗначений;
	Если Лев(ТипРеквизитаСтр,10) = "Справочник" Тогда
		СправочникРеквизита = Сред(ТипРеквизитаСтр,18);
		РеквизитОбъект = Метаданные.Справочники.Найти(СправочникРеквизита).Реквизиты;
		СписокВсехПараметров.Добавить("Код");
		СписокВсехПараметров.Добавить("Наименование");
		Если Метаданные.Справочники.Найти(СправочникРеквизита).Владельцы.Количество() > 0 Тогда
			СписокВсехПараметров.Добавить("Владелец");
		КонецЕсли;
	ИначеЕсли Лев(ТипРеквизитаСтр,8) = "Документ" Тогда
		СписокВсехПараметров.Добавить("Номер");
		СписокВсехПараметров.Добавить("Дата");
	КонецЕсли;

	Если Не РеквизитОбъект = Неопределено Тогда	
		Для Каждого СвойствоРеквизит ИЗ РеквизитОбъект Цикл
			НовСтрока = СписокВсехПараметров.Добавить();
			НовСтрока.Значение = СвойствоРеквизит.Имя;
		КонецЦикла;
	КонецЕсли;

	Возврат СписокВсехПараметров;	
КонецФункции

&НаСервере
Функция РасширитьСписокВыбора(СписокВыбора,СписокРеквизитов) экспорт
	РасширенныйСписок = Новый СписокЗначений;	
	РасширенныйСписок.ЗагрузитьЗначения(СписокВыбора.ВыгрузитьЗначения());
	
	Для Каждого Элемент ИЗ СписокРеквизитов Цикл
		НовСтрока = РасширенныйСписок.Добавить();
		НовСтрока.Значение = Элемент.Значение + "_";
		НовСтрока.Картинка = БиблиотекаКартинок.Справочник; 
	КонецЦикла;
	
	Возврат РасширенныйСписок;
КонецФункции 

&НаСервере
Функция ПроверкаВозможностиКорректировкиВнесудебнойЗадолженности(ДокументОбъект) экспорт 
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадолженностьПоСудебнымРешениямОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПоСудебнымРешениям.Остатки(, Займ В (&ОбъектыУчета)) КАК ЗадолженностьПоСудебнымРешениямОстатки";
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПоступлениеПлатежа") Тогда  
		Запрос.УстановитьПараметр("ОбъектыУчета", ДокументОбъект.Займ)
	Иначе
		Запрос.УстановитьПараметр("ОбъектыУчета", ДокументОбъект.Объекты.ВыгрузитьКолонку("Объект"));
	КонецЕсли;
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если Результат.СуммаОстаток > 0 Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	//Истина - есть СудебнаяЗадолженность - отказ в корректировке Внесудебки
	//Ложь - нет судебки, Отказ ложь, корректурем / начисляем
	
	// Отказ = НЕ Запрос.Выполнить().Пустой();	
	Возврат Отказ;
	
КонецФункции




