
Процедура ПриЗаписи(Отказ, Замещение)
	//КазанцевЯА , в документе Корректировка регистров он там отсутствует реквизит на который идет проверка
	//Документ Корректировка регистров является также регистратором данного регистра, но не должен подстраиваться под логику,а вносить коррективы из ТЧ 
	МетаданныеОбъекта = ЭтотОбъект.Отбор.Регистратор.Значение.Метаданные();
	Если ЭтотОбъект.Количество() > 0 Тогда
		Для Каждого стр Из ЭтотОбъект Цикл
			ЗаписатьХарактеристикиИП(стр);
			ЗаписатьХарактеристикиИД(стр);
		КонецЦикла;
	ИначеЕсли МетаданныеОбъекта.Реквизиты.Найти("Займ") <> Неопределено Тогда
			ДолжникИП = ЭтотОбъект.Отбор.Регистратор.Значение.Должник;
			ОбновитьХарактеристикиИП_Должник(ДолжникИП);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьХарактеристикиИП(стр)
	Набор = РегистрыСведений.ХарактеристикиИП.СоздатьНаборЗаписей();
	Набор.Отбор.ИсполнительноеПроизводство.Установить(стр.ИП);
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.ДатаОкончания;
	Запись.Значение = стр.ДатаОкончания;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.НомерСводногоДела;
	Запись.Значение = стр.НомерСД;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.ОтделСудебныхПриставов;
	Запись.Значение = стр.ОтделСудебныхПриставов;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.СудебныйПристав;
	Запись.Значение = стр.СудебныйПриставИсполнитель;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.ПричинаОкончания;
	Запись.Значение = стр.ПричинаОкончания;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.Предмет1;
	Запись.Значение = стр.Предмет1;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.Сумма1;
	Запись.Значение = стр.Сумма1;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.Предмет2;
	Запись.Значение = стр.Предмет2;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.Сумма2;
	Запись.Значение = стр.Сумма2;	
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.Статус;
	Запись.Значение = стр.СтатусИП;
	
	Набор.Записать();	
КонецПроцедуры

Процедура ЗаписатьХарактеристикиИД(стр)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФССП_СостояниеИПСрезПоследних.ИП КАК ИП
	                      |ПОМЕСТИТЬ вт
	                      |ИЗ
	                      |	РегистрСведений.ФССП_СостояниеИП.СрезПоследних(&ТекущаяДата) КАК ФССП_СостояниеИПСрезПоследних
	                      |ГДЕ
	                      |	ФССП_СостояниеИПСрезПоследних.НомерИД = &НомерИД
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	вт.ИП.Ссылка КАК ИПСсылка
	                      |ИЗ
	                      |	вт КАК вт
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	вт.ИП.ДатаВозбуждения УБЫВ");
	Запрос.УстановитьПараметр("НомерИД", стр.НомерИД);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ПоследнееИП = Результат.ИПСсылка;
	Иначе
		ПоследнееИП = Справочники.ФССП_ИсполнительноеПроизводство.ПустаяСсылка();
	КонецЕсли;
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФССП_СостояниеИПСрезПоследних.ИП КАК ИП
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	РегистрСведений.ФССП_СостояниеИП.СрезПоследних(&ТекущаяДата) КАК ФССП_СостояниеИПСрезПоследних
	               |ГДЕ
	               |	ФССП_СостояниеИПСрезПоследних.НомерИД = &НомерИД
	               |	И ФССП_СостояниеИПСрезПоследних.СтатусИП = &СтатусИП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	вт.ИП.Ссылка КАК ИПСсылка
	               |ИЗ
	               |	вт КАК вт
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	вт.ИП.ДатаВозбуждения УБЫВ";
	Запрос.УстановитьПараметр("СтатусИП", Перечисления.ФССП_СтатусыИП.Действующее);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ПоследнееДействующееИП = Результат.ИПСсылка;
	Иначе
		ПоследнееДействующееИП = Справочники.ФССП_ИсполнительноеПроизводство.ПустаяСсылка();
	КонецЕсли;
	
	Набор = РегистрыСведений.ХарактеристикиИД.СоздатьНаборЗаписей();
	Набор.Отбор.ИсполнительныйДокумент.Установить(стр.НомерИД);
	Набор.Отбор.Свойство.Установить(ПланыВидовХарактеристик.ХарактеристикиИД.ПоследнееИП);	
	Запись = Набор.Добавить();
	Запись.ИсполнительныйДокумент = стр.НомерИД;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИД.ПоследнееИП;
	Запись.Значение = ПоследнееИП;	
	Набор.Записать();
	
	
	Набор = РегистрыСведений.ХарактеристикиИД.СоздатьНаборЗаписей();
	Набор.Отбор.ИсполнительныйДокумент.Установить(стр.НомерИД);
	Набор.Отбор.Свойство.Установить(ПланыВидовХарактеристик.ХарактеристикиИД.ПоследнееДействующееИП);	
	Запись = Набор.Добавить();
	Запись.ИсполнительныйДокумент = стр.НомерИД;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИД.ПоследнееДействующееИП;
	Запись.Значение = ПоследнееДействующееИП;	
	Набор.Записать();	

КонецПроцедуры

Процедура ОбновитьХарактеристикиИП_Должник(ДолжникИП)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФССП_ИсполнительноеПроизводство.Ссылка КАК ИП,
	                      |	ФССП_СостояниеИПСрезПоследних.Период КАК Период,
	                      |	ФССП_СостояниеИПСрезПоследних.Регистратор КАК Регистратор,
	                      |	ФССП_СостояниеИПСрезПоследних.НомерСтроки КАК НомерСтроки,
	                      |	ФССП_СостояниеИПСрезПоследних.Активность КАК Активность,
	                      |	ФССП_СостояниеИПСрезПоследних.СтатусИП КАК СтатусИП,
	                      |	ФССП_СостояниеИПСрезПоследних.Завершено КАК Завершено,
	                      |	ФССП_СостояниеИПСрезПоследних.ОтделСудебныхПриставов КАК ОтделСудебныхПриставов,
	                      |	ФССП_СостояниеИПСрезПоследних.СудебныйПриставИсполнитель КАК СудебныйПриставИсполнитель,
	                      |	ФССП_СостояниеИПСрезПоследних.ПричинаОкончания КАК ПричинаОкончания,
	                      |	ФССП_СостояниеИПСрезПоследних.ДатаОкончания КАК ДатаОкончания,
	                      |	ФССП_СостояниеИПСрезПоследних.Предмет1 КАК Предмет1,
	                      |	ФССП_СостояниеИПСрезПоследних.Сумма1 КАК Сумма1,
	                      |	ФССП_СостояниеИПСрезПоследних.Предмет2 КАК Предмет2,
	                      |	ФССП_СостояниеИПСрезПоследних.Сумма2 КАК Сумма2,
	                      |	ФССП_СостояниеИПСрезПоследних.Предмет3 КАК Предмет3,
	                      |	ФССП_СостояниеИПСрезПоследних.Сумма3 КАК Сумма3,
	                      |	ФССП_СостояниеИПСрезПоследних.НомерИД КАК НомерИД,
	                      |	ФССП_СостояниеИПСрезПоследних.НомерСД КАК НомерСД,
	                      |	ФССП_СостояниеИПСрезПоследних.ДатаВозбуждения КАК ДатаВозбуждения
	                      |ИЗ
	                      |	Справочник.ФССП_ИсполнительноеПроизводство КАК ФССП_ИсполнительноеПроизводство
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФССП_СостояниеИП.СрезПоследних(&ТекущаяДата) КАК ФССП_СостояниеИПСрезПоследних
	                      |		ПО (ФССП_СостояниеИПСрезПоследних.ИП = ФССП_ИсполнительноеПроизводство.Ссылка)
	                      |ГДЕ
	                      |	ФССП_ИсполнительноеПроизводство.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", ДолжникИП);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ЗаписатьХарактеристикиИП(Результат);
		ЗаписатьХарактеристикиИД(Результат);
	КонецЦикла;
КонецПроцедуры
