
&НаСервере
Процедура ПриОткрытииНаСервере()
	ЭтаФорма.РольАБД = РольДоступна("АБД");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Получим непредопредленное значение с сервера
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокДОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.СписокДО.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.СписокДО.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДолжникМероприятия(Команда)
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.СписокДО И Элементы.СписокДО.ТекущиеДанные <> Неопределено Тогда
		// Передать с ключом
		К = Элементы.СписокДО.ТекущиеДанные.Ссылка;
		ФормаМероприятия = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаСписка",,,Новый УникальныйИдентификатор());
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаМероприятия.Список, "Объект", К, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
		ФормаМероприятия.Открыть();
	Иначе
		Предупреждение("Не найден объект отбора!",,"Блокировщик неконтактных дел");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокНаСервере()
	ФоновыеЗадания.Выполнить("ФоновыеЗаданияМодуль.БлокировкаНеконтактныхДелДляАвтообзвона",,,"Блокировка дел для автообзвона");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписок(Команда)
	// Проверить доступность служебных функций
	Если ЭтаФорма.РольАБД = Истина Тогда
		ПоказатьОповещениеПользователя("Блокировка неконтактных дел",,"Задание запущено в фоновом режиме",БиблиотекаКартинок.NC_Подсистема_тсАдминистрирование);
		СформироватьСписокНаСервере();
	Иначе
		Предупреждение("Нарушение прав доступа!",,"Предупреждение");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РазблокироватьНаСервере()
	ДО = ЭтаФорма.СкрытоеПолеНомерДО.ПолучитьОбъект();
	ДО.ЗапретАвтообзвона = Ложь;
	ДО.НеконтактныеНомера = Ложь;
	ДО.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Разблокировать(Команда)
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.СписокДО И Элементы.СписокДО.ТекущиеДанные <> Неопределено Тогда
		ЭтаФорма.СкрытоеПолеНомерДО = Элементы.СписокДО.ТекущиеДанные.Ссылка;
		РазблокироватьНаСервере();
		Для Счетчик = 1 По 100 Цикл
			Состояние("Разблокировка дела", Счетчик, "Пожалуйста, подождите...", БиблиотекаКартинок.NC_Разблокировано);
		КонецЦикла;
		ПоказатьОповещениеПользователя("Блокировка неконтактных дел",,"Дело разблокировано",БиблиотекаКартинок.NC_Разблокировано);
		ЭтаФорма.Элементы.СписокДО.Обновить();
	Иначе
		Предупреждение("Не выбран объект разблокировки!",,"Блокировщик неконтактных дел");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РазблокироватьВсеНаСервере()
   	ФоновыеЗадания.Выполнить("ФоновыеЗаданияМодуль.РазблокировкаНеконтактныхДелДляАвтообзвона",,,"Разблокировка неконтактных дел для автообзвона");
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьВсе(Команда)
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.СписокДО И Элементы.СписокДО.ТекущиеДанные <> Неопределено Тогда
		РазблокироватьВсеНаСервере();
		Для Счетчик = 1 По 100 Цикл
			Состояние("Разблокировка дел", Счетчик, "Пожалуйста, подождите...", БиблиотекаКартинок.NC_Разблокировано);
			Пока Элементы.СписокДО.ТекущиеДанные <> Неопределено Цикл
				Элементы.СписокДО.Обновить();
			КонецЦикла;
		КонецЦикла;
		ПоказатьОповещениеПользователя("Блокировка неконтактных дел",,"Все дела разблокированы",БиблиотекаКартинок.NC_Разблокировано);
	Иначе
		Предупреждение("Не выбраны объекты разблокировки!",,"Блокировщик неконтактных дел");
	КонецЕсли;
КонецПроцедуры