
&НаСервере
Процедура ЗапуститьНормализациюНаСервере()  
	Если Объект.Объекты.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нужно выбрать хотя бы один объект для  нормализации!"; 
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;    
	
	
	
	ТаблицаПодготовкаДанных = Обработки.УЗ_НормализацияАдресов.ВернутьДанныеДляНормализацииПоОбъектам(Объект.Объекты.Выгрузить().ВыгрузитьКолонку("Объект"), Объект.РеквизитХраненияАдреса);
	
	Если Объект.СервисНормализации = "ПочтаРФ" Тогда 
		Объект.РезультатПочтаРФ.Загрузить(ТаблицаПодготовкаДанных);
		Для Каждого стр Из Объект.РезультатПочтаРФ Цикл   
			стрИдентификатор = ?(ЗначениеЗаполнено(стр.КодДО), стр.КодДО, стр.КодКонтрагента);
			стр.ИдентификаторЗапроса = МодульНормализацияПочтаРФ.ВернутьИдентификаторЗапроса(стрИдентификатор);
		КонецЦикла;
		мТелоЗапроса = МодульНормализацияПочтаРФ.СформироватьМассивАдресовНормализация(Объект.РезультатПочтаРФ.Выгрузить(, "ИдентификаторЗапроса, АдресДляНормализации"));
		JSРезультатНормализацииПочтаРФ = МодульНормализацияПочтаРФ.ГлавнаяНормализоватьАдресаПочтаРФ(мТелоЗапроса);
		тзОбъединение = Объект.РезультатПочтаРФ.Выгрузить();  
		тзОбъединение.Индексы.Добавить("ИдентификаторЗапроса");
		МодульНормализацияПочтаРФ.ЗаполнитьПользовательскуюТаблицуРезультатов(тзОбъединение, JSРезультатНормализацииПочтаРФ);
		Объект.РезультатПочтаРФ.Загрузить(тзОбъединение);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Операция завершена";
		Сообщение.Сообщить();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьНормализацию(Команда)
	ЗапуститьНормализациюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда) 
	Если Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаСервис Тогда
		Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаПодбор;
	ИначеЕсли Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаЗапускИРезультаты Тогда
		Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаСервис;  
	Иначе
		Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаПодбор;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаДалее(Команда) 
	Если Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаПодбор Тогда
		Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаСервис;
	ИначеЕсли Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаСервис Тогда
		Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаЗапускИРезультаты;
	Иначе
		Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаПодбор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	Объект.Объекты.Очистить();
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоНастройкам(Команда)
	Объект.Объекты.Очистить();
	ФормаПодбор = ПолучитьФорму("Обработка.ПодборДО.Форма.Форма",, ЭтаФорма); 
	ФормаПодбор.Объект.ТипИсточника = Неопределено;
	ОткрытьФорму(ФормаПодбор); 
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	Объект.Объекты.Очистить();
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКИСтруктураАдреса(Команда)  
	
	Если НЕ ЗначениеЗаполнено(Объект.АдресКИ) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нужно выбрать адрес КИ!"; 
		Сообщение.Поле = "Объект.АдресКИ";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	
	ТекстУведомления = "";
	ПараметрыЗапуска = Новый Структура();	
	СтруктураФоновогоЗадания  = ВыполнитьФоновоеЗаданиеЗаписатьКИСтруктураАдресаНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
	ИДЗадания = СтруктураФоновогоЗадания.ИдентификаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);     
	
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал 	= 2;	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьРезультатЗаписиКИСтруктураАдреса", ЭтотОбъект), ПараметрыОжидания); 
КонецПроцедуры    

&НаКлиенте
Процедура ОбработатьРезультатЗаписиКИСтруктураАдреса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выполнено!";
		Сообщение.Сообщить();
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Статус задачи неопределен!";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ВыполнитьФоновоеЗаданиеЗаписатьКИСтруктураАдресаНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	НаименованиеЗадания = "ЗаписатьКИСтруктураАдресаНаСервере";

	ВыполняемыйМетод = "КредитныеИстории.ЗаполнитьСтруктуруАдресаИзНормализации";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне 	= Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор);
	
	ПараметрыЗапуска = ОпределитьПараметрыЗапуска(ПараметрыЗапуска);
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;

КонецФункции  

&НаСервере
Функция ОпределитьПараметрыЗапуска(ПараметрыЗапуска) 
	Если Объект.СервисНормализации = "ПочтаРФ" Тогда
		ТаблицаРезультат = Объект.РезультатПочтаРФ.Выгрузить();
	Иначе
		ТаблицаРезультат = Неопределено;
	КонецЕсли;  
	
	МассивТаблица = УдалитьОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультат);		
	ПараметрыЗапуска.Вставить("МасстзДанныеНомализации", МассивТаблица);
	ПараметрыЗапуска.Вставить("ВидАдреса", Объект.АдресКИ); 
	ПараметрыЗапуска.Вставить("Перезаписывать", Объект.ПерезаписыватьСтруктуруАдресаКИ);
	Возврат ПараметрыЗапуска;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.СервисНормализации = "ПочтаРФ"; 
	Элементы.ДекорацияПочтаРФ.Видимость = (Объект.СервисНормализации = "ПочтаРФ");
КонецПроцедуры

&НаКлиенте
Процедура СервисНормализацииПриИзменении(Элемент)
	Элементы.ДекорацияПочтаРФ.Видимость = (Объект.СервисНормализации = "ПочтаРФ");
КонецПроцедуры
