#Область Интерфейс

Процедура ЗафиксироватьСведенияПисьма(СтруктураПисьма) Экспорт

	Для каждого Контакт Из СтруктураПисьма["ПочтаПолучателя"] Цикл
	
		ЗафиксироватьСведенияПолучателя(СтруктураПисьма, Контакт);
	
	КонецЦикла;

КонецПроцедуры



#КонецОбласти

Процедура ЗафиксироватьСведенияПолучателя(СтруктураПисьма, ПочтаПолучателя)

	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.GUID = СтруктураПисьма.GUID;
	МенеджерЗаписи.Объект = СтруктураПисьма.Объект ;
	МенеджерЗаписи.ПочтаПолучателя = ПочтаПолучателя;
	МенеджерЗаписи.ПочтаОтправителя = СтруктураПисьма.ПочтаОтправителя;
	МенеджерЗаписи.ТекстПисьма = СтруктураПисьма.ТекстПисьма;
	МенеджерЗаписи.ДатаОтправки = СтруктураПисьма.ДатаОтправки;

	МенеджерЗаписи.Записать();

КонецПроцедуры
