
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПоступлениеПлатежа.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ПоступлениеПлатежа КАК ПоступлениеПлатежа
	                      |ГДЕ
	                      |	ПоступлениеПлатежа.Автор = &Автор
	                      |	И ПоступлениеПлатежа.Проведен = ИСТИНА
	                      |	И ПоступлениеПлатежа.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("Автор", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат;		
	КонецЕсли;
	
	//ОпределитьВариантУчетаЗадолженности(ЭтотОбъект.ЗагруженныеДанные);
	
	
	Для Каждого стр из ЭтотОбъект.ЗагруженныеДанные Цикл
		Если Не ЗначениеЗаполнено(стр.ДолговоеОбязательство) ИЛИ Не ЗначениеЗаполнено(стр.Дата) Или Не ЗначениеЗаполнено(стр.Сумма) Тогда
			Продолжить;
		КонецЕсли;
		ДокументПлатеж = Документы.ПоступлениеПлатежа.СоздатьДокумент();
		ДокументПлатеж.Дата = ТекущаяДата();
		ДокументПлатеж.Автор = ЭтотОбъект.Ссылка;
		ДокументПлатеж.Займ = стр.ДолговоеОбязательство;
		ДокументПлатеж.ИсполнительныйДокумент = стр.ИсполнительныйДокумент;
		ДокументПлатеж.ВидПлательщика = стр.ВидПлательщика;
		ДокументПлатеж.СуммаПлатежа = стр.Сумма;
		ДокументПлатеж.ДатаПлатежа = стр.Дата;
		ДокументПлатеж.НазначениеПлатежа = стр.НазначениеПлатежа;
		ДокументПлатеж.НеразнесеннаяСумма = стр.Сумма;
		ДокументПлатеж.Сотрудник = стр.Сотрудник;
		// ДокументПлатеж.стрПлательщик = стр.Плательщик;
		// ДокументПлатеж.ВидПоступления = Справочники.ВидыПоступленийПлатежа.БанковскаяВыписка;
		

		//Если стр.СтадияДО = "Судебная" Тогда 
		//	ДокументПлатеж.РаспределитьПоСудебнымРешениям();
		//ИначеЕсли стр.СтадияДО = "Внесудебная" Тогда
		//	ДокументПлатеж.РаспределитьПоВнесудебке();
		//КонецЕсли;
		
		
		// ДокументПлатеж.РаспределитьПоСудебнымРешениям();
		// ДокументПлатеж.РаспределитьПоВнесудебке();
		
		// Проводить документы в отдельной транзакции
		НачатьТранзакцию();
		//ДокументПлатеж.Записать(РежимЗаписиДокумента.Проведение);
		ДокументПлатеж.Записать(РежимЗаписиДокумента.Запись);
		ЗафиксироватьТранзакцию();
	КонецЦикла;
КонецПроцедуры

Процедура ОпределитьВариантУчетаЗадолженности(ТЧ);
	// Объявить переменную ЮД
	ЮД = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Передано в ЮД");
	Для Каждого стр из ТЧ Цикл
		// Проверить на передачу в ЮД и определить стадию 
		Если ОбъектыСервер.ПолучитьЗначениеСвойства(стр.ДолговоеОбязательство, "0182") = ЮД Тогда
			стр.СтадияДО = "Судебная";
		Иначе
			стр.СтадияДО = "Внесудебная"	
		КонецЕсли;		
		// На данный момент этот реквизит не используется
		// стр.СтадияДО = Строка(ОбъектыСервер.ОпределитьВариантУчетаЗадолженности2(стр.ДолговоеОбязательство,стр.Дата));
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПоступлениеПлатежа.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеПлатежа КАК ПоступлениеПлатежа
	|ГДЕ
	|	ПоступлениеПлатежа.Автор = &Автор
	|	И ПоступлениеПлатежа.Проведен = ИСТИНА
	|	И ПоступлениеПлатежа.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("Автор", ЭтотОбъект.Ссылка);  
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Док = Результат.Ссылка.ПолучитьОбъект();
			Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЦикла;   
	КонецЕсли;	
	
КонецПроцедуры
