
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Проведен Тогда
		Элементы.Автор.Доступность = Ложь;
		Элементы.Организация.Доступность = Ложь;
		Элементы.Дата.Доступность = Ложь;
		Элементы.ШПИ.Доступность = Ложь;
		Элементы.ШПИКоманднаяПанель.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ШПИШПИПриИзменении(Элемент)
	ТекДанные = Элементы.ШПИ.ТекущиеДанные;
	ТекДанные.Корреспонденция = ПолучитьВладельцаШПИ(ТекДанные.ШПИ);
КонецПроцедуры

&НаСервере
Функция ПолучитьВладельцаШПИ(ШПИ)
	Возврат ШПИ.Владелец;
КонецФункции
