
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Наименование = "№";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);	
		Если Параметры.ЗначенияЗаполнения.Свойство("Объект") Тогда
			Объект.Объект = Параметры.ЗначенияЗаполнения.Объект;
		КонецЕсли;
	КонецЕсли;	
	
	ДополнительныеРеквизиты.Загрузить(Объект.ДополнительныеРеквизиты.Выгрузить());
	УправлениеЗаполнением.ДобавитьДополнительныеРеквизиты(ЭтаФорма);	
	
	ОграничитьРедактирование();
КонецПроцедуры

&НаСервере
Процедура ОграничитьРедактирование()
	Если ЗначениеЗаполнено(Объект.РегистрационныйНомер) Тогда
		Элементы.ТипПисьма.ТолькоПросмотр = Истина;
		Элементы.Объект.ТолькоПросмотр = Истина;
		Элементы.ГруппаДополнительныеРеквизиты.ТолькоПросмотр = Истина;
		Элементы.ПрикрепитьФайлы.Доступность = Ложь;
		Элементы.ПрикрепленныеФайлы1.Доступность = Ложь;
		Элементы.Организация.ТолькоПросмотр = Истина;
		Элементы.Подписант.ТолькоПросмотр = Истина;
		Элементы.ИсходящаяДатаОтправителя.ТолькоПросмотр = Истина;
		Элементы.ИсходящийНомерОтправителя.ТолькоПросмотр = Истина;
		Элементы.Наименование.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ТипПисьма.ТолькоПросмотр = Ложь;
		Элементы.Объект.ТолькоПросмотр = Ложь;
		Элементы.ГруппаДополнительныеРеквизиты.ТолькоПросмотр = Ложь;
		Элементы.ПрикрепитьФайлы.Доступность = Истина;
		Элементы.ПрикрепленныеФайлы1.Доступность = Истина;
		Элементы.Организация.ТолькоПросмотр = Ложь;
		Элементы.Подписант.ТолькоПросмотр = Ложь;
		Элементы.ИсходящаяДатаОтправителя.ТолькоПросмотр = Ложь;
		Элементы.ИсходящийНомерОтправителя.ТолькоПросмотр = Ложь;
		Элементы.Наименование.ТолькоПросмотр = Ложь;
		Элементы.ЗакрепитьНомер.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.НомерЗакреплен Тогда
		Элементы.ЗакрепитьНомер.Доступность = Ложь;
	Иначе 
		Если ЗначениеЗаполнено(Объект.РегистрационныйНомер) Тогда
			Элементы.ЗакрепитьНомер.Доступность = Истина;
		Иначе
			Элементы.ЗакрепитьНомер.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РегистрационныйНомер) Тогда
		Элементы.ПрисвоитьНомер.Доступность = Ложь;
	Иначе
		Элементы.ПрисвоитьНомер.Доступность = Истина;
	КонецЕсли;
	
	Элементы.ПрикрепленныеФайлы.Видимость = Ложь;
	Элементы.ПрикрепленныеФайлы1.Видимость = Ложь;
	
	ОбъектыСПрикреплением = Справочники.ВходящаяКорреспонденция.ОбъектыПоКоторымПрикрепляютсяФайлы();
	Если ОбъектыСПрикреплением.Получить(ТипЗнч(Объект.Объект)) = Неопределено Тогда
	
		Возврат;
	
	КонецЕсли;
	
	ПрикрепленныеФайлы.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = Объект.Ссылка;
	ПрикрепленныеФайлы.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ПравоеЗначение = Объект.Ссылка;
	Элементы.ПрикрепленныеФайлы.Видимость = Истина;
	Элементы.ПрикрепленныеФайлы1.Видимость = Ложь;
	
	Если ТипЗнч(Объект.Объект) <> Тип("СправочникСсылка.Пользователи") Тогда
		
		ПрикрепленныеФайлы.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = Объект.Объект;
		
		Если Не ЗначениеЗаполнено(Объект.РегистрационныйНомер) Тогда

			Элементы.ПрикрепленныеФайлы.Видимость = Ложь;
			Элементы.ПрикрепленныеФайлы1.Видимость = Истина;
			
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлы(Команда)

	ЭтаФорма.Записать();
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Объект", Объект.Ссылка);
	ПараметрыЗаполнения.Вставить("РегистраторКорреспонденции", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);
	ОткрытьФорму("Документ.ПрикрепитьФайлы.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлы(Команда)
//	Сообщить(СтрЗаменить(Команда.Имя, "ОткрытьФайлы_", ""));
	
	Эл = Элементы.ПрикрепленныеФайлы;
	
	Если Эл.ВыделенныеСтроки.Количество() = 0 Тогда 		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной строки, или список пуст!";
		Сообщение.Сообщить();	
		Возврат;
	КонецЕсли;
	
	
	Если Не РазыменоватьСсылку("Константы.ХранитьПрикрепляемыеФайлыНаСервере.Получить()") Тогда	
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	    Диалог.Заголовок = "Выберите каталог";
		Диалог.МножественныйВыбор = Ложь;
	    Если Диалог.Выбрать() Тогда
			Для Каждого ВыделСтрока Из Эл.ВыделенныеСтроки Цикл
			    Данные = СписокВыборНаСервере(ВыделСтрока);
		        ИмяФайла = Эл.ДанныеСтроки(ВыделСтрока).ИмяФайла;
			    Файл = Новый Файл(Диалог.Каталог + "\" + ИмяФайла);
			    Если Файл.Существует() Тогда 
				    КнопкиДиалога = Новый СписокЗначений;
				    КнопкиДиалога.Добавить(1, "Перезаписать");
				    КнопкиДиалога.Добавить(2, "Переименовать");
				    Ответ = Вопрос("Файл " + Файл.Имя + " уже существует", КнопкиДиалога,,, "Файл существует");
					Если Ответ = 1 Тогда
					  	Данные.Записать(Диалог.Каталог + "\" + Файл.Имя);
						ЗапуститьПриложение(Диалог.Каталог + "\" + Файл.Имя);
					Иначе
						НовоеИмяФайла = ОткрытьФормуМодально("РегистрСведений.ПрикрепляемыеФайлы.Форма.ФормаПереименования");
						Данные.Записать(Диалог.Каталог + "\" + НовоеИмяФайла + Файл.Расширение);
						ЗапуститьПриложение(Диалог.Каталог + "\" + НовоеИмяФайла + Файл.Расширение);
					КонецЕсли;
				Иначе
					Данные.Записать(Диалог.Каталог + "\" + Файл.Имя);
					ЗапуститьПриложение(Диалог.Каталог + "\" + Файл.Имя);
				КонецЕсли;
		    КонецЦикла;
		КонецЕсли;
		
	Иначе
		Для Каждого ВыделСтрока Из Эл.ВыделенныеСтроки Цикл
		    Данные = СписокВыборНаСервере(ВыделСтрока, Истина);		
			Файл = Новый Файл(Элементы.Список.ДанныеСтроки(ВыделСтрока).ИмяФайла);
			Каталог = РазыменоватьСсылку("Константы.КаталогХраненияПрикрепляемыхФайловНаСервере.Получить()");
			Если Прав(Каталог, 1) <> "\" Тогда
				Каталог = Каталог + "\";
			КонецЕсли;
		    ЗапуститьПриложение(Каталог + Данные + Файл.Расширение);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазыменоватьСсылку(Стр)
	Возврат Вычислить(Стр);
КонецФункции

&НаСервере
Функция СписокВыборНаСервере(ВыбраннаяСтрока, ПолучитьУИД = Ложь)
    Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                          |	ПрикрепитьФайлыФайлы.Хранилище,
                          |	ПрикрепитьФайлыФайлы.УИД
                          |ИЗ
                          |	Документ.ПрикрепитьФайлы.Файлы КАК ПрикрепитьФайлыФайлы
                          |ГДЕ
                          |	ПрикрепитьФайлыФайлы.Ссылка = &Ссылка
                          |	И ПрикрепитьФайлыФайлы.НомерСтроки = &НомерСтроки");
	Запрос.УстановитьПараметр("Ссылка", ВыбраннаяСтрока.Регистратор);
	Запрос.УстановитьПараметр("НомерСтроки", ВыбраннаяСтрока.НомерСтроки_);
	Результат = Запрос.Выполнить().Выгрузить();
	Если ПолучитьУИД Тогда
		Возврат Результат[0].УИД;
	Иначе
		Возврат Результат[0].Хранилище.Получить();
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура ДополнительныеРеквизитыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Свойство = Неопределено;
	СвойствоВидСтроки = Неопределено;
	Код = Сред(Элемент.Имя, Найти(Элемент.Имя, "_") + 1);
	УправлениеСвойствами.ПолучитьСвойствоПоКоду(СтрЗаменить(Код, "_", " "), Свойство, СвойствоВидСтроки);
	
	Если СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Адрес") ИЛИ
			СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Телефон") Тогда
	    Строки = ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Свойство));
		ТекСтрокаПараметры = Строки[0].Параметры;
						
		СписокСтрок = СтрЗаменить(ТекСтрокаПараметры, ";", Символы.ПС);
		ЗначенияПолей = Новый СписокЗначений();
		Если СтрЧислоСтрок(СписокСтрок) > 1 Тогда
			Для Индекс = 1 По СтрЧислоСтрок(СписокСтрок) Цикл
				Стр = СтрПолучитьСтроку(СписокСтрок, Индекс);
				Если Стр <> "" Тогда 
					СписокПодстрок = СтрЗаменить(Стр, "=", Символы.ПС);
					ЗначенияПолей.Добавить(СтрПолучитьСтроку(СписокПодстрок, 2), СтрПолучитьСтроку(СписокПодстрок, 1));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;			
		Если СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Адрес") Тогда
			ИмяФормыРедактирования = "ОбщаяФорма.ВводАдреса";
		ИначеЕсли СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Телефон") Тогда
			ИмяФормыРедактирования = "ОбщаяФорма.ВводТелефона";
		КонецЕсли;
			
		Пар = Новый Структура;
		Пар.Вставить("ЗначенияПолей",                ЗначенияПолей);
		Пар.Вставить("Вид",                          ""); //"Адрес");
		Пар.Вставить("БылиВнесеныИзменения",         Ложь);
		Пар.Вставить("Представление",                Элемент.ТекстРедактирования);
		Пар.Вставить("РедактированиеТолькоВДиалоге", Не Элемент.РедактированиеТекста);
		Пар.Вставить("АдресТолькоРоссийский",        Ложь);
			
		Результат = ОткрытьФормуМодально(ИмяФормыРедактирования, Пар);	
		Если ТипЗнч(Результат) = Тип("Структура") Тогда
			Строки[0].Значение = Результат.Представление;
			ЭтаФорма[Элемент.Имя] = Результат.Представление;
			ЗначенияПолей = Результат.ЗначенияПолей;
			Модифицированность = Истина;
			
			РезультатЗначение = "";
			Для Каждого Элемент Из ЗначенияПолей Цикл
				РезультатЗначение = РезультатЗначение + Элемент.Представление + "=" + Элемент.Значение + ";"; 
			КонецЦикла;
			
			Строки[0].Параметры = РезультатЗначение;
		КонецЕсли;
		
	ИначеЕсли СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.АдресФИАС") Тогда 
		
		Строки = ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Свойство)); 
		ТекСтрока = Строки[0]; 
		
		ИмяФормыРедактирования = "Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса"; 
		Если ТекСтрока.Параметры = "" Тогда 
			ЗнПолей = ""; 
		Иначе 
			ЗнПолей = бит_АдресныйКлассификатор.ПолучитьJSONИзXML(ТекСтрока.Параметры); 
		КонецЕсли; 
		Пар = Новый Структура; 
		Пар.Вставить("ЗначенияПолей", ЗнПолей); 
		Пар.Вставить("Вид", ""); //"Адрес"); 
		Пар.Вставить("БылиВнесеныИзменения", Ложь); 
		Пар.Вставить("Представление", Элемент.ТекстРедактирования); 
		Пар.Вставить("РедактированиеТолькоВДиалоге", Не Элемент.РедактированиеТекста); 
		Пар.Вставить("АдресТолькоРоссийский", Ложь); 
		
		Результат = ОткрытьФормуМодально(ИмяФормыРедактирования, Пар); 
		
		Если ТипЗнч(Результат) = Тип("Структура") Тогда 
			Строки[0].Значение = Результат.Представление; 
			ЭтаФорма[Элемент.Имя] = Результат.Представление; 
			Модифицированность = Истина; 
			СтрокаJSON = Результат.Значение; 
			
			Если СтрокаJSON = "" Тогда 
				СтрокаJSON = бит_АдресныйКлассификатор.ПолучитьJSONИзXML(СтрокаJSON); 
			КонецЕсли; 
			
			Строки[0].Параметры = бит_АдресныйКлассификатор.ПолучитьСтрокуXML(СтрокаJSON); 
		КонецЕсли;
		
	ИначеЕсли СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.ПутьКФайлу") Тогда	
		#Если Не ВебКлиент Тогда
			СтандартнаяОбработка = Ложь;
			Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
			Диалог.Заголовок = "Выберите файл";
			Диалог.ПолноеИмяФайла = ЭтаФорма[Элемент.Имя];
			Диалог.МножественныйВыбор = Ложь;
			Если Диалог.Выбрать() Тогда
				ЭтаФорма[Элемент.Имя] = Диалог.ПолноеИмяФайла;
			КонецЕсли;	
		#Иначе
			СтандартнаяОбработка = Ложь;
			Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
			Диалог.Заголовок = "Выберите файл";
			Диалог.ПолноеИмяФайла = ЭтаФорма[Элемент.Имя];
			//Фильтр = "EXE (*.exe)|*.exe"; 
			//Диалог.Фильтр = Фильтр; 
			Диалог.МножественныйВыбор = Ложь;
			//Диалог.Каталог = "F:\";
			Диалог.Показать(Новый ОписаниеОповещения("ДополнительныеРеквизитыНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Диалог, Элемент", Диалог, Элемент)));
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	Элемент = ДополнительныеПараметры.Элемент;
	
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ЭтаФорма[Элемент.Имя] = Диалог.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ДополнительныеРеквизитыОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаЗапуска = "";
	Попытка
		Стр = СтрЗаменить(Элемент.Имя, "Реквизит_", "РеквизитСвойство_");
		Строки = ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Вычислить(Стр)));	
	Исключение		
		Стр = СтрЗаменить(Элемент.Имя, "Реквизит_", "РеквизитСвойство_");
		Строки = ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ОбъектыСервер.ПолучитьДопРиСПоКоду(
				СтрЗаменить(Сред(Элемент.Имя, 10), "_", " "))));
	КонецПопытки;
	Если Строки.Количество() > 0 Тогда
		СтрокаЗапуска = Строки[0].Значение;
	КонецЕсли;
		
	Попытка
		ЗапуститьПриложение(СтрокаЗапуска);
	Исключение
		//Чуров
		//ПоказатьЗначение(,СтрокаЗапуска);
		ОткрытьЗначение(СтрокаЗапуска);
	КонецПопытки;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	УправлениеСвойствами.ПередЗаписьюНаСервере2(ЭтаФорма, ТекущийОбъект, Отказ);
КонецПроцедуры


&НаКлиенте
Процедура ТипПисьмаПриИзменении(Элемент)
	ДобавитьДополнительныеРеквизиты(); 
	СформироватьНаименование();
КонецПроцедуры

&НаСервере
Процедура ДобавитьДополнительныеРеквизиты()
	УправлениеЗаполнением.ДобавитьДополнительныеРеквизиты(ЭтаФорма);	
КонецПроцедуры

&НаСервере
Процедура ПрисвоитьНомерНаСервере()
	Объект.РегистрационныйНомер = РегистрацияКорреспонденции.ПолучитьНомер(
		Объект.ТипПисьма,
		Объект.Организация,
		Объект.Ссылка);
	Объект.ДатаРегистрации = ТекущаяДатаСеанса();
	ОграничитьРедактирование();
КонецПроцедуры

&НаКлиенте
Процедура ПрисвоитьНомер(Команда) 
	Записано = ЗначениеЗаполнено(Объект.Наименование)  
		И ЗначениеЗаполнено(Объект.ТипПисьма) 
		И ЗначениеЗаполнено(Объект.Организация) 
		И ЗначениеЗаполнено(Объект.Объект);
		
		Если ОбъектыСервер.РазыменоватьСсылку(Объект.ТипПисьма, "КонтролироватьПрикрепление") Тогда
			Если ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") ИЛИ ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
				Если Объект.ПрикрепленныеФайлы.Количество() = 0 Тогда
					Сообщить("Необходимо прикрепить файлы!");
					Записано = Ложь;
				КонецЕсли;
				Если ЕстьЗакрепленныеФайлы() Тогда
					Записано = Ложь;
				КонецЕсли;			
			ИначеЕсли ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Пользователи") Тогда
				Если Не ЗапросСвязанныхДокументов() Тогда
					Записано = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ВыполнитьПрисвоение();
		
		Объект.ДополнительныеРеквизиты.Очистить();
		
		Для Каждого Элемент Из ЭтаФорма.ДополнительныеРеквизиты Цикл
			Если Не ЗначениеЗаполнено(Элемент.Значение) И Элемент.Обязательное Тогда
			Записано = Ложь;		
			Сообщить("Не заполнены обязательные реквизиты!");
		КонецЕсли;
	КонецЦикла;
		
	Если Записано Тогда
		ПрисвоитьНомерНаСервере();  
		СформироватьНаименование();
		ЭтаФорма.Записать();
		ЗаписатьРегистраторы();
		ОграничитьРедактирование();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПрисвоение()
	Для Каждого Элемент Из ЭтаФорма.ДополнительныеРеквизиты Цикл
		Выполнить("Элемент.Значение = ЭтаФорма.Реквизит_" + СтрЗаменить(Элемент.Свойство.Код, " ", "_") + ";");
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЕстьЗакрепленныеФайлы()
	Если Объект.ТипПисьма.КонтролироватьПрикрепление Тогда
		Для Каждого Элемент Из Объект.ПрикрепленныеФайлы Цикл
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	РегистрацияКорреспонденцииПрикрепленныеФайлы.Ссылка
			|ИЗ
			|	Справочник.ВходящаяКорреспонденция.ПрикрепленныеФайлы КАК РегистрацияКорреспонденцииПрикрепленныеФайлы
			|ГДЕ
			|	РегистрацияКорреспонденцииПрикрепленныеФайлы.Ссылка <> &Ссылка
			|	И РегистрацияКорреспонденцииПрикрепленныеФайлы.ПрикрепленныйФайл = &ПрикрепленныйФайл");
			Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
			Запрос.УстановитьПараметр("ПрикрепленныйФайл", Элемент.ПрикрепленныйФайл);
			Результат = Запрос.Выполнить().Выбрать();
			Если Результат.Следующий() Тогда
				Сообщить("Прикрепленный файл в табличной части уже фигурирует в других регистраторах!");
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		Возврат Ложь;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ЗапросСвязанныхДокументов()
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Необходимо прикрепить файлы!");
		Возврат Ложь;
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ПрикрепляемыеФайлы.Период,
		                      |	ПрикрепляемыеФайлы.Регистратор
		                      |ИЗ
		                      |	РегистрСведений.ПрикрепляемыеФайлы КАК ПрикрепляемыеФайлы
		                      |ГДЕ
		                      |	ПрикрепляемыеФайлы.Объект = &Объект");
		Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОграничитьРедактирование();
КонецПроцедуры


&НаКлиенте
Процедура ВидПисьмаПриИзменении(Элемент)
	ДобавитьДополнительныеРеквизиты();
КонецПроцедуры


&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	ОграничитьРедактирование();
	Объект.ПрикрепленныеФайлы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрепитьНомер(Команда)
	Объект.НомерЗакреплен = Истина;
	ЭтаФорма.Записать();
	ОграничитьРедактирование();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРегистраторы()
	Для Каждого Эл Из Объект.ПрикрепленныеФайлы Цикл
		ДокументОбъект = Эл.ПрикрепленныйФайл.ПолучитьОбъект();
		ДокументОбъект.РегистраторКорреспонденции = Объект.Ссылка;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаименование()
	Объект.Наименование = Объект.ТипПисьма.Наименование + " № " + Объект.РегистрационныйНомер + " от " + Формат(Объект.ДатаРегистрации, "ДЛФ='DD'");
КонецПроцедуры
