
&НаСервере
Процедура ПолучитьРеестры()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДолговыеОбязательства.Кредитор.Наименование КАК Кредитор,
	|	ДолговыеОбязательстваДополнительныеРеквизиты.Значение КАК Значение
	|ИЗ
	|	Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДолговыеОбязательстваДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ПО ДолговыеОбязательстваДополнительныеРеквизиты.Ссылка = ДолговыеОбязательства.Ссылка
	|			И (ДолговыеОбязательстваДополнительныеРеквизиты.Свойство.Код = ""0094"")
	|			И (ДолговыеОбязательстваДополнительныеРеквизиты.Значение <> """")";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.Элементы.Реестр.СписокВыбора.Добавить(Выборка.Кредитор + " - " + Выборка.Значение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьРеестры();
КонецПроцедуры

&НаСервере
Процедура ВвестиНачальныеОстаткиНаСервере()
	МассивПараметров = Новый Массив;
	ПозицияРазделителя = Найти(ЭтаФорма.Реестр, " - ");
	МассивПараметров.Добавить(Лев(ЭтаФорма.Реестр, ПозицияРазделителя - 1));
	МассивПараметров.Добавить(Сред(ЭтаФорма.Реестр, ПозицияРазделителя + 3, СтрДлина(ЭтаФорма.Реестр)));
	ФоновыеЗадания.Выполнить("УправлениеОстаткамиСлужебный.ВводНачальныхОстатковИзРеестра",МассивПараметров,,"Ввод начальных остатков из реестра");
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНачальныеОстатки(Команда)
	ПоказатьОповещениеПользователя("Ввод начальных остатков из реестра",,"Задание запущено в фоновом режиме",БиблиотекаКартинок.NC_Подсистема_тсАдминистрирование);
	ВвестиНачальныеОстаткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОстаткиНаСервере()
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ЭтаФорма.ДатаЗагрузкиСумм);
	ФоновыеЗадания.Выполнить("УправлениеОстаткамиСлужебный.ОбновлениеОстатковИзРеестров",МассивПараметров,,"Обновление остатков из реестров");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстатки(Команда)
	ПоказатьОповещениеПользователя("Обновление остатков из реестров",,"Задание запущено в фоновом режиме",БиблиотекаКартинок.NC_Подсистема_тсАдминистрирование);
	ОбновитьОстаткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммыКЦНаСервере()
	ФоновыеЗадания.Выполнить("ФоновыеЗаданияМодуль.ОбновлениеОстатковКЦ",,,"Обновление сумм КЦ");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммыКЦ(Команда)
	ПоказатьОповещениеПользователя("Обновление сумм КЦ",,"Задание запущено в фоновом режиме",БиблиотекаКартинок.NC_Подсистема_тсАдминистрирование);
	ОбновитьСуммыКЦНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммыЮДНаСервере()
	ФоновыеЗадания.Выполнить("ФоновыеЗаданияМодуль.ОбновлениеОстатковЮД",,,"Обновление сумм ЮД");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммыЮД(Команда)
	ПоказатьОповещениеПользователя("Обновление сумм ЮД",,"Задание запущено в фоновом режиме",БиблиотекаКартинок.NC_Подсистема_тсАдминистрирование);
	ОбновитьСуммыЮДНаСервере();
КонецПроцедуры
