
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	

	// регистр СтатусыШПИРегистрация
	Движения.СтатусыШПИРегистрация.Записывать = Истина;
	Для Каждого ТекСтрокаСписокИсходящейКорреспонденции Из СписокИсходящейКорреспонденции Цикл
		Движение = Движения.СтатусыШПИРегистрация.Добавить();
		Движение.Период = Дата;
		Движение.ШПИ = ТекСтрокаСписокИсходящейКорреспонденции.ШПИ;
		Движение.Корреспонденция = ТекСтрокаСписокИсходящейКорреспонденции.ИсходящаяКорреспонденция;
		Движение.ИдентификаторПочты = ТекСтрокаСписокИсходящейКорреспонденции.ИдентификаторПочты; 
		Движение.Статус = Перечисления.СтатусыШПИРегистрация.Закреплен;
	КонецЦикла;
КонецПроцедуры
