
// Для тонкого клиента
&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитаНаСервере(ИмяОбъекта, ИмяРеквизита)
Возврат ИмяОбъекта[ИмяРеквизита];
КонецФункции
//

&НаСервере
Процедура ПриОткрытииНаСервере()
	ЭтаФорма.Авторизованный = ПользователиКлиентСервер.АвторизованныйПользователь();
	ЭтаФорма.Дисконт = Перечисления.ТипыУсловийПоДоговору.Дисконт;
	ЭтаФорма.ДисконтИРеструктуризация = Перечисления.ТипыУсловийПоДоговору.ДисконтИРеструктуризация;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Получить непредопредленное значение с сервера
	ПриОткрытииНаСервере();
	// Получить код кредитора
	ЭтаФорма.СкрытоеПолеКодКредитора = ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Кредитор, "Код");
	// Установить доступность элементов
	ЭтаФорма.Элементы.ГруппаДисконт.Доступность = Ложь;
	ЭтаФорма.Элементы.ГруппаРеструктуризация.Доступность = Ложь;
	ЭтаФорма.Элементы.ФормаСоздатьДокумент.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	// Проверить правильность заполнения и произвести расчет
	Если СрокПогашения = 0 Тогда
		Предупреждение("Не задан срок погашения!",,"Расчет условий");
		Возврат;
	ИначеЕсли СрокПогашения = 1 Тогда
		ЭтаФорма.Элементы.ГруппаРеструктуризация.Доступность = Ложь;
		ЭтаФорма.Элементы.ГруппаДисконт.Доступность = Истина;
		ЭтаФорма.Элементы.ФормаСоздатьДокумент.Видимость = Истина;
	ИначеЕсли СрокПогашения > 1 Тогда
		ЭтаФорма.Элементы.ГруппаДисконт.Доступность = Ложь;
		ЭтаФорма.Элементы.ГруппаРеструктуризация.Доступность = Истина;
		ЭтаФорма.Элементы.ФормаСоздатьДокумент.Видимость = Истина;
	КонецЕсли;
	
	Если ЭтаФорма.СкрытоеПолеКодКредитора = "F00079066" Тогда
		СуммаКЗакрытиюДисконт = СуммаОстатка - (СуммаОстатка * 0.25);
		СуммаКЗакрытиюРеструктуризация = СуммаОстатка - (СуммаОстатка * 0.20);
		ЕжемесячныйПлатеж = (СуммаОстатка - (СуммаОстатка * 0.20)) / СрокПогашения;
		СуммаДисконта = СуммаОстатка - СуммаКЗакрытиюДисконт;
		СуммаДисконтаРеструктуризация = СуммаОстатка - СуммаКЗакрытиюРеструктуризация;
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00099453" Тогда
		СуммаКЗакрытиюДисконт = СуммаОстатка - (СуммаОстатка * 0.40);
		СуммаКЗакрытиюРеструктуризация = СуммаОстатка - (СуммаОстатка * 0.15);
		ЕжемесячныйПлатеж = (СуммаОстатка - (СуммаОстатка * 0.15)) / СрокПогашения;
		СуммаДисконта = СуммаОстатка - СуммаКЗакрытиюДисконт;
		СуммаДисконтаРеструктуризация = СуммаОстатка - СуммаКЗакрытиюРеструктуризация;
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00108622" Тогда
		СуммаКЗакрытиюДисконт = СуммаОстатка - (СуммаОстатка * 0.40);
		СуммаКЗакрытиюРеструктуризация = СуммаОстатка - (СуммаОстатка * 0.30);
		ЕжемесячныйПлатеж = (СуммаОстатка - (СуммаОстатка * 0.30)) / СрокПогашения;
		СуммаДисконта = СуммаОстатка - СуммаКЗакрытиюДисконт;
		СуммаДисконтаРеструктуризация = СуммаОстатка - СуммаКЗакрытиюРеструктуризация;
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00000172" Тогда
		СуммаКЗакрытиюДисконт = СуммаОстатка - (СуммаОстатка * 0.40);
		СуммаКЗакрытиюРеструктуризация = СуммаОстатка - (СуммаОстатка * 0.30);
		ЕжемесячныйПлатеж = (СуммаОстатка - (СуммаОстатка * 0.30)) / СрокПогашения;
		СуммаДисконта = СуммаОстатка - СуммаКЗакрытиюДисконт;
		СуммаДисконтаРеструктуризация = СуммаОстатка - СуммаКЗакрытиюРеструктуризация;
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00109962" Тогда
		СуммаКЗакрытиюДисконт = СуммаОстатка - (СуммаОстатка * 0.50);
		СуммаКЗакрытиюРеструктуризация = СуммаОстатка - (СуммаОстатка * 0.40);
		ЕжемесячныйПлатеж = (СуммаОстатка - (СуммаОстатка * 0.40)) / СрокПогашения;
		СуммаДисконта = СуммаОстатка - СуммаКЗакрытиюДисконт;
		СуммаДисконтаРеструктуризация = СуммаОстатка - СуммаКЗакрытиюРеструктуризация;
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00000206" Тогда
		СуммаКЗакрытиюДисконт = СуммаОстатка - (СуммаОстатка * 0.35);
		СуммаКЗакрытиюРеструктуризация = СуммаОстатка - (СуммаОстатка * 0.20);
		ЕжемесячныйПлатеж = (СуммаОстатка - (СуммаОстатка * 0.20)) / СрокПогашения;
		СуммаДисконта = СуммаОстатка - СуммаКЗакрытиюДисконт;
		СуммаДисконтаРеструктуризация = СуммаОстатка - СуммаКЗакрытиюРеструктуризация;
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00107981" Тогда
		СуммаКЗакрытиюДисконт = СуммаОстатка - (СуммаОстатка * 0.40);
		СуммаКЗакрытиюРеструктуризация = СуммаОстатка - (СуммаОстатка * 0.30);
		ЕжемесячныйПлатеж = (СуммаОстатка - (СуммаОстатка * 0.30)) / СрокПогашения;
		СуммаДисконта = СуммаОстатка - СуммаКЗакрытиюДисконт;
		СуммаДисконтаРеструктуризация = СуммаОстатка - СуммаКЗакрытиюРеструктуризация;
		
	Иначе
		ЭтаФорма.Элементы.ГруппаДисконт.Доступность = Ложь;
		ЭтаФорма.Элементы.ГруппаРеструктуризация.Доступность = Ложь;
		ЭтаФорма.Элементы.ФормаСоздатьДокумент.Видимость = Ложь;
		Предупреждение("Выбран неверный объект расчета!",,"Расчет условий");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	// Заполнить документ
	ФормаДок = ПолучитьФорму("Документ.ДисконтИРеструктуризация.Форма.ФормаДокумента",,,Новый УникальныйИдентификатор());
	Если СрокПогашения = 1 Тогда
		ФормаДок.Объект.Тип = ЭтаФорма.Дисконт;
		ФормаДок.Объект.СуммаКЗакрытию = ЭтаФорма.СуммаКЗакрытиюДисконт;
		ФормаДок.Объект.СуммаДисконта = ЭтаФорма.СуммаДисконта;
		ФормаДок.Объект.СрокПогашения = ЭтаФорма.СрокПогашения;
		ФормаДок.Объект.ЕжемесячныйПлатеж = ЭтаФорма.СуммаКЗакрытиюДисконт;
	ИначеЕсли СрокПогашения > 1 Тогда
		ФормаДок.Объект.Тип = ЭтаФорма.ДисконтИРеструктуризация;
		ФормаДок.Объект.СуммаКЗакрытию = ЭтаФорма.СуммаКЗакрытиюРеструктуризация;
		ФормаДок.Объект.СуммаДисконта = ЭтаФорма.СуммаДисконтаРеструктуризация;
		ФормаДок.Объект.СрокПогашения = ЭтаФорма.СрокПогашения;
		ФормаДок.Объект.ЕжемесячныйПлатеж = ЭтаФорма.ЕжемесячныйПлатеж;
	КонецЕсли;
	ФормаДок.Объект.Договор = ЭтаФорма.СкрытоеПолеНомерДО;
	ФормаДок.Объект.Ответственный = ЭтаФорма.Авторизованный;
	ЭтаФорма.Закрыть();
	ФормаДок.Открыть();
КонецПроцедуры
