
&НаСервере
Процедура ПриОткрытииНаСервере()
	ЭтаФорма.Авторизованный = ПользователиКлиентСервер.АвторизованныйПользователь();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Получим непредопредленное значение с сервера
	ПриОткрытииНаСервере();
	// Скрыть данные до конца расчетов
	ЭтаФорма.Элементы.Дисконт.Видимость = Ложь;
	ЭтаФорма.Элементы.Реструктуризация.Видимость = Ложь;
	ЭтаФорма.Элементы.СоздатьДокумент.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	// Проверить правильность заполнения и произвести расчет
	Если СрокПогашения = 0 Тогда
		Предупреждение("Не задан срок погашения!");
		Возврат;
	ИначеЕсли Быстроденьги = Ложь
		И ДжетМани = Ложь
		И ЛигаДенег = Ложь
		И Турбозайм = Ложь
		И ФинКоллект = Ложь
		И Мили = Ложь
		И ГлавныйЗайм = Ложь Тогда
		Предупреждение("Не выбран кредитор!");
	ИначеЕсли СрокПогашения = 1 Тогда
		ЭтаФорма.Элементы.Дисконт.Видимость = Истина;
		ЭтаФорма.Элементы.Реструктуризация.Видимость = Ложь;
		ЭтаФорма.Элементы.СоздатьДокумент.Видимость = Истина;
	ИначеЕсли СрокПогашения > 1 Тогда
		ЭтаФорма.Элементы.Дисконт.Видимость = Ложь;
		ЭтаФорма.Элементы.Реструктуризация.Видимость = Истина;
		ЭтаФорма.Элементы.СоздатьДокумент.Видимость = Истина;
	КонецЕсли;
	
	Если Быстроденьги = Истина Тогда
		СуммаКЗакрытиюДисконт = СуммаЗадолженности - (СуммаЗадолженности * 0.25);
		СуммаКЗакрытиюРеструктуризация = СуммаЗадолженности - (СуммаЗадолженности * 0.20);
		ЕжемесячныйПлатеж = (СуммаЗадолженности - (СуммаЗадолженности * 0.20)) / СрокПогашения;
		СуммаДисконта = СуммаЗадолженности - СуммаКЗакрытиюДисконт;
		СуммаДисконтаРеструктуризация = СуммаЗадолженности - СуммаКЗакрытиюРеструктуризация;
	КонецЕсли;
	
	Если ДжетМани = Истина Тогда
		СуммаКЗакрытиюДисконт = СуммаЗадолженности - (СуммаЗадолженности * 0.35);
		СуммаКЗакрытиюРеструктуризация = СуммаЗадолженности - (СуммаЗадолженности * 0.20);
		ЕжемесячныйПлатеж = (СуммаЗадолженности - (СуммаЗадолженности * 0.20)) / СрокПогашения;
		СуммаДисконта = СуммаЗадолженности - СуммаКЗакрытиюДисконт;
		СуммаДисконтаРеструктуризация = СуммаЗадолженности - СуммаКЗакрытиюРеструктуризация;
	КонецЕсли;
	
	Если ЛигаДенег = Истина Тогда
		СуммаКЗакрытиюДисконт = СуммаЗадолженности - (СуммаЗадолженности * 0.40);
		СуммаКЗакрытиюРеструктуризация = СуммаЗадолженности - (СуммаЗадолженности * 0.30);
		ЕжемесячныйПлатеж = (СуммаЗадолженности - (СуммаЗадолженности * 0.30)) / СрокПогашения;
		СуммаДисконта = СуммаЗадолженности - СуммаКЗакрытиюДисконт;
		СуммаДисконтаРеструктуризация = СуммаЗадолженности - СуммаКЗакрытиюРеструктуризация;
	КонецЕсли;
	
	Если Турбозайм = Истина Тогда
		СуммаКЗакрытиюДисконт = СуммаЗадолженности - (СуммаЗадолженности * 0.40);
		СуммаКЗакрытиюРеструктуризация = СуммаЗадолженности - (СуммаЗадолженности * 0.30);
		ЕжемесячныйПлатеж = (СуммаЗадолженности - (СуммаЗадолженности * 0.30)) / СрокПогашения;
		СуммаДисконта = СуммаЗадолженности - СуммаКЗакрытиюДисконт;
		СуммаДисконтаРеструктуризация = СуммаЗадолженности - СуммаКЗакрытиюРеструктуризация;
	КонецЕсли;
	
	Если ФинКоллект = Истина Тогда
		СуммаКЗакрытиюДисконт = СуммаЗадолженности - (СуммаЗадолженности * 0.40);
		СуммаКЗакрытиюРеструктуризация = СуммаЗадолженности - (СуммаЗадолженности * 0.15);
		ЕжемесячныйПлатеж = (СуммаЗадолженности - (СуммаЗадолженности * 0.15)) / СрокПогашения;
		СуммаДисконта = СуммаЗадолженности - СуммаКЗакрытиюДисконт;
		СуммаДисконтаРеструктуризация = СуммаЗадолженности - СуммаКЗакрытиюРеструктуризация;
	КонецЕсли;
	
	Если Мили = Истина Тогда
		СуммаКЗакрытиюДисконт = СуммаЗадолженности - (СуммаЗадолженности * 0.40);
		СуммаКЗакрытиюРеструктуризация = СуммаЗадолженности - (СуммаЗадолженности * 0.30);
		ЕжемесячныйПлатеж = (СуммаЗадолженности - (СуммаЗадолженности * 0.30)) / СрокПогашения;
		СуммаДисконта = СуммаЗадолженности - СуммаКЗакрытиюДисконт;
		СуммаДисконтаРеструктуризация = СуммаЗадолженности - СуммаКЗакрытиюРеструктуризация;
	КонецЕсли;
	
	Если ГлавныйЗайм = Истина Тогда
		СуммаКЗакрытиюДисконт = СуммаЗадолженности - (СуммаЗадолженности * 0.50);
		СуммаКЗакрытиюРеструктуризация = СуммаЗадолженности - (СуммаЗадолженности * 0.40);
		ЕжемесячныйПлатеж = (СуммаЗадолженности - (СуммаЗадолженности * 0.40)) / СрокПогашения;
		СуммаДисконта = СуммаЗадолженности - СуммаКЗакрытиюДисконт;
		СуммаДисконтаРеструктуризация = СуммаЗадолженности - СуммаКЗакрытиюРеструктуризация;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	// Заполнить документ
	ФормаДок = ПолучитьФорму("Документ.ДисконтИРеструктуризация.Форма.ФормаДокумента");
	Если СрокПогашения = 1 Тогда
		ФормаДок.Объект.СуммаКЗакрытию = ЭтаФорма.СуммаКЗакрытиюДисконт;
		ФормаДок.Объект.СуммаДисконта = ЭтаФорма.СуммаДисконта;
		ФормаДок.Объект.СрокПогашения = ЭтаФорма.СрокПогашения;
		ФормаДок.Объект.ЕжемесячныйПлатеж = ЭтаФорма.СуммаКЗакрытиюДисконт;
	ИначеЕсли СрокПогашения > 1 Тогда
		ФормаДок.Объект.СуммаКЗакрытию = ЭтаФорма.СуммаКЗакрытиюРеструктуризация;
		ФормаДок.Объект.СуммаДисконта = ЭтаФорма.СуммаДисконтаРеструктуризация;
		ФормаДок.Объект.СрокПогашения = ЭтаФорма.СрокПогашения;
		ФормаДок.Объект.ЕжемесячныйПлатеж = ЭтаФорма.ЕжемесячныйПлатеж;
	КонецЕсли;
	ФормаДок.Объект.Договор = ЭтаФорма.СкрытоеПолеНомерДО;
	ФормаДок.Объект.Ответственный = ЭтаФорма.Авторизованный;
	ЭтаФорма.Закрыть();
	ФормаДок.Открыть();
КонецПроцедуры
