
&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	////Если ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы") Тогда
	////	Если ВладелецФормы.ТекущаяСтрока.ЭтоГруппа Тогда
	////		Если Не (Значение = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеСведения_ДолговыеОбязательства") ИЛИ 
	////				Значение = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеСведения_Контрагенты")) Тогда
	////			СтандартнаяОбработка = Ложь;
	////			Сообщить("Перемещение недопустимо!");
	////		КонецЕсли;
	////	ИначеЕсли Не (Не Значение.Предопределенный ИЛИ 
	////			Значение = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеРеквизиты_ДолговыеОбязательства") ИЛИ 
	////			Значение = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеРеквизиты_Контрагенты")) Тогда		
	////		СтандартнаяОбработка = Ложь;
	////		Сообщить("Нельзя перемещать элементы в предопределенные группы!");
	////	КонецЕсли;	
	////КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	////Попытка
	////	Если ВладелецФормы.Родитель.ИмяФормы = "ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Форма.ФормаЭлемента" Тогда
	////		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	////		УстановитьОтбор("Родитель", ВладелецФормы.Родитель.ТипЭлемента);
	////	КонецЕсли;
	////Исключение
	////КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор(Поле, Значение)
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(Поле);	
	Для Каждого ЭлементОтбораСобытий Из Список.Отбор.Элементы Цикл		
		Если ЭлементОтбораСобытий.ЛевоеЗначение = ПолеКомпоновки Тогда
			ЭлементОтбораСобытий.ПравоеЗначение = Значение;
			ЭлементОтбораСобытий.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВниз(Команда)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ПереместитьКатегориюВверхВниз(Элементы.Список.ТекущаяСтрока, Ложь);
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВверх(Команда)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ПереместитьКатегориюВверхВниз(Элементы.Список.ТекущаяСтрока, Истина);
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПереместитьКатегориюВверхВниз(ТекущаяСтрока, ПереместитьВверх)
	ПорядковыйНомер = ТекущаяСтрока.ПорядковыйНомер;	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ДополнительныеРеквизитыИСведения.ПорядковыйНомер КАК ПорядковыйНомер
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	                      |ГДЕ
	                      |	ДополнительныеРеквизитыИСведения.Родитель = &Родитель
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПорядковыйНомер УБЫВ");
	Запрос.УстановитьПараметр("Родитель", ТекущаяСтрока.Родитель);
	Результат = Запрос.Выполнить().Выбрать();
	Если Не Результат.Следующий() Тогда
		Возврат;
	КонецЕсли;
	МаксимальныйНомер = Результат.ПорядковыйНомер;
	
	Если Не ((ПереместитьВверх И ПорядковыйНомер > 1) ИЛИ (Не ПереместитьВверх И ПорядковыйНомер < МаксимальныйНомер)) Тогда	
		Возврат;
	КонецЕсли;
		
	Если ПереместитьВверх Тогда	
	    ПорядковыйНомер2 = ПорядковыйНомер - 1;
	Иначе
		ПорядковыйНомер2 = ПорядковыйНомер + 1;
	КонецЕсли;	
	Запрос.УстановитьПараметр("ПорядковыйНомер", ПорядковыйНомер);
	Запрос.УстановитьПараметр("ПорядковыйНомер2", ПорядковыйНомер2);		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеРеквизитыИСведения.ПорядковыйНомер КАК ПорядковыйНомер,
	               |	ДополнительныеРеквизитыИСведения.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ДополнительныеРеквизитыИСведения.ПорядковыйНомер = &ПорядковыйНомер
	               |			ТОГДА &ПорядковыйНомер2
	               |		ИНАЧЕ &ПорядковыйНомер
	               |	КОНЕЦ КАК ПорядковыйНомерНовый
	               |ИЗ
	               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	               |ГДЕ
	               |	ДополнительныеРеквизитыИСведения.Родитель = &Родитель
	               |	И (ДополнительныеРеквизитыИСведения.ПорядковыйНомер = &ПорядковыйНомер
	               |			ИЛИ ДополнительныеРеквизитыИСведения.ПорядковыйНомер = &ПорядковыйНомер2)";
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл;
		ЭлементОбъект = Результат.Ссылка.ПолучитьОбъект();
		ЭлементОбъект.ПорядковыйНомер = Результат.ПорядковыйНомерНовый;
		ЭлементОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
