// В получаемой Строке раставляет пробелы
//   Пример - Тестовый_ПримерПример -> Тестовый Пример Пример
Функция РаставитьПробелы(Знач ПолучаемаяСтрока) Экспорт

	Текст = ПолучаемаяСтрока;
	
	ПервыйСимвол = "А";
	ПоследнийСимвол = "Я";
	Разница = КодСимвола("а") - КодСимвола("А");
	
	Номер = КодСимвола(ПервыйСимвол);
	Пока Номер <= КодСимвола(ПоследнийСимвол) Цикл
	
		ТекущийСимвол = Символ(Номер);
		НовыйСимвол = Символ(Номер + Разница);

		Текст = СтрЗаменить(Текст, ТекущийСимвол, " " + НовыйСимвол);
	
		Номер = Номер + 1;
	
	КонецЦикла;
	
	Текст = СтрЗаменить(Текст, "_", " ");
	Текст = СокрЛП(Текст);
	Текст = ВРег(Лев(Текст, 1)) + Сред(Текст, 2);
	
	Возврат Текст;

КонецФункции // ()
