
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборЗаписей = РегистрыСведений.ЗаданияДляРассылки.СоздатьНаборЗаписей();
	Для Каждого Элемент ИЗ ЭтотОбъект.Объекты Цикл	
		Если ЗначениеЗаполнено(Элемент.Контакт) И ЗначениеЗаполнено(Элемент.Текст) Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Автор = ЭтотОбъект.Ссылка;
			Запись.Номер = Элемент.НомерСтроки;
			Запись.Объект = Элемент.Объект;
			Запись.Действие = ЭтотОбъект.Действие;
			Запись.Контакт = Элемент.Контакт;
			Запись.Текст = Элемент.Текст;
			Запись.Статус = Перечисления.СтатусыРассылки.НеОпределен;
			//		Запись.ТекстовыйСтатус = "Не отправлено";
			Запись.Шаблон = ЭтотОбъект.Шаблон;
			Запись.Дата = ЭтотОбъект.Дата + ЭтотОбъект.ДнейНаВыполнение * 3600 * 24;
			Запись.GUID = Строка(Новый УникальныйИдентификатор);
			Если ЭтотОбъект.УчетнаяЗаписьОтправителя = Справочники.УчетныеЗаписиSMS4B.ПустаяСсылка() ИЛИ ЭтотОбъект.УчетнаяЗаписьОтправителя = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка() Тогда
				Если ЭтотОбъект.Действие = Перечисления.ВариантыДействийДляСкоринга.SMSОповещение Тогда
					Запись.Отправитель = Константы.УчеткаSMSРассылок.Получить();
				ИначеЕсли ЭтотОбъект.Действие = Перечисления.ВариантыДействийДляСкоринга.EMailРассылка Тогда
					Запись.Отправитель = Константы.УчеткаEMailРассылок.Получить();
				КонецЕсли;
			Иначе
				Запись.Отправитель = ЭтотОбъект.УчетнаяЗаписьОтправителя;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	НаборЗаписей.Записать(Ложь);

КонецПроцедуры

Процедура ОтправитьEMailСообщение(Почта, УчеткаEmail, ТекстСообщения)
	Письмо = Новый ИнтернетПочтовоеСообщение();
	Письмо.Тема = "ЖЖЖ"; 
	Текст = Письмо.Тексты.Добавить(ТекстСообщения);
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Письмо.ИмяОтправителя = "ППП";
	Письмо.Отправитель.ОтображаемоеИмя = "ФФФ"; 
	Письмо.Получатели.Добавить("san_pancho@mail.ru");
	
	Почта.Послать(Письмо);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//Если Не Действие.Пустая() ИЛИ Не ВидКИ.Пустая() ИЛИ Не Шаблон.Пустая() Тогда
	//	ТЗ = Объекты.Выгрузить();
	//	Если Не Действие.Пустая() Тогда
	//		ТЗ.ЗаполнитьЗначения(Действие, "Действие");		
	//	КонецЕсли;	
	//	Если Не ЭтотОбъект.ВидКИ.Пустая() Тогда
	//		ТЗ.ЗаполнитьЗначения(ВидКИ, "ВидКИ");
	//	КонецЕсли;	
	//	Если Не ЭтотОбъект.Шаблон.Пустая() Тогда
	//		ТЗ.ЗаполнитьЗначения(Шаблон, "Шаблон");
	//	КонецЕсли;	
	//	Объекты.Загрузить(ТЗ);
	//КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)	
	ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтотОбъект.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Отказ = Истина; 
	КонецЕсли;
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		НаборЗаписей = РегистрыСведений.ЗаданияДляРассылки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Автор.Установить(ЭтотОбъект.Ссылка);
		НаборЗаписей.Прочитать();
		ЧислоЗаписей = НаборЗаписей.Количество();
		НаборЗаписей.Отбор.Статус.Установить(Перечисления.СтатусыРассылки.НеОпределен);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > ЧислоЗаписей Тогда
			Сообщить("По данному документу уже началась рассылка");
			Отказ = Истина;
		Иначе
			НаборЗаписей = РегистрыСведений.ЗаданияДляРассылки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Автор.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
	КонецЕсли;
	ЭтотОбъект.ВсеДанныеЗаполнены = Истина;
	Для Каждого Элемент из ЭтотОбъект.Объекты Цикл
		Если Не ЗначениеЗаполнено(Элемент.Текст) ИЛИ Не ЗначениеЗаполнено(Элемент.Контакт) Тогда
			ЭтотОбъект.ВсеДанныеЗаполнены = Ложь;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

