
Перем ТекстИзменений;

Процедура ПередЗаписью(Отказ, Замещение)
	ТекстИзменений = "";
	Если Константы.КонтрольИзмененийОбъектов.Получить() И ЭтотОбъект.Отбор.Объект.Использование Тогда
	    Запрос = Новый Запрос("ВЫБРАТЬ
	                          |	ДополнительныеСведения.Свойство,
	                          |	ДополнительныеСведения.Значение
	                          |ПОМЕСТИТЬ Т_До
	                          |ИЗ
	                          |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                          |ГДЕ
	                          |	ДополнительныеСведения.Объект = &Объект
	                          |;
	                          |
	                          |////////////////////////////////////////////////////////////////////////////////
	                          |ВЫБРАТЬ
	                          |	Т.Свойство,
	                          |	Т.Значение
	                          |ПОМЕСТИТЬ Т_После
	                          |ИЗ
	                          |	&Т_После КАК Т
	                          |;
	                          |
	                          |////////////////////////////////////////////////////////////////////////////////
	                          |ВЫБРАТЬ
	                          |	Т_До.Свойство,
	                          |	Т_До.Значение
	                          |ИЗ
	                          |	Т_До КАК Т_До
	                          |		ПОЛНОЕ СОЕДИНЕНИЕ Т_После КАК Т_После
	                          |		ПО Т_До.Свойство = Т_После.Свойство
	                          |ГДЕ
	                          |	Т_До.Значение <> Т_После.Значение");
		Запрос.УстановитьПараметр("Объект", ЭтотОбъект.Отбор.Объект.Значение);					  
		Запрос.УстановитьПараметр("Т_После", ЭтотОбъект.Выгрузить());
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл 
			Если Результат.Свойство = Null Тогда
				ТекстИзменений = ТекстИзменений + Строка(Результат.Свойство) + "=|";
			Иначе
				ТекстИзменений = ТекстИзменений + Строка(Результат.Свойство) + "=" + Строка(Результат.Значение) + "|";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если ЭтотОбъект.Отбор.Объект.Использование Тогда
		Справочники.Пользователи.ОтслеживаниеИзменений(Отказ, ЭтотОбъект.Отбор.Объект.Значение, ТекстИзменений);
	КонецЕсли;
КонецПроцедуры
