
&НаКлиенте
Процедура СпособРаспределенияПриИзменении(Элемент)    
	ОграничитьВидимость();
КонецПроцедуры                                      

&НаСервере
Процедура ОграничитьВидимость()
	Если Объект.СпособРаспределения = ПредопределенноеЗначение("Перечисление.СпособыРаспределения.ПоровнуПоКоличествуИУбратьИзРаботы")
		ИЛИ Объект.СпособРаспределения = ПредопределенноеЗначение("Перечисление.СпособыРаспределения.ПоровнуПоКоличеству")
		ИЛИ Объект.СпособРаспределения = ПредопределенноеЗначение("Перечисление.СпособыРаспределения.ПоровнуПоСуммеДолга")
		ИЛИ Объект.СпособРаспределения = ПредопределенноеЗначение("Перечисление.СпособыРаспределения.ПоровнуПоСуммеДолгаИУбратьИзРаботы") Тогда
		Элементы.Сотрудники.Видимость = Истина;
		Элементы.СотрудникиТипСотрудника.Видимость = Ложь;
		Элементы.ГруппаАктПередачи.Видимость = Ложь;
		Элементы.РаспределятьПоДолям.Видимость = Истина;
	ИначеЕсли Объект.СпособРаспределения = ПредопределенноеЗначение("Перечисление.СпособыРаспределения.ПередатьВсемВРаботу") Тогда
		Элементы.Сотрудники.Видимость = Истина;
		Элементы.СотрудникиТипСотрудника.Видимость = Истина;
		Элементы.ГруппаАктПередачи.Видимость = Ложь;
		Элементы.РаспределятьПоДолям.Видимость = Ложь;
		Объект.РаспределятьПоДолям = Ложь;
	ИначеЕсли Объект.СпособРаспределения = ПредопределенноеЗначение("Перечисление.СпособыРаспределения.АктПередачи") Тогда
		Элементы.ГруппаАктПередачи.Видимость = Истина;
		Элементы.Сотрудники.Видимость = Ложь;
		Элементы.РаспределятьПоДолям.Видимость = Ложь;
		Объект.РаспределятьПоДолям = Ложь;
	КонецЕсли;	
	Элементы.СотрудникиДоля.Видимость = Объект.РаспределятьПоДолям;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОграничитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура РаспределятьПоДолямПриИзменении(Элемент)
	Элементы.СотрудникиДоля.Видимость = Объект.РаспределятьПоДолям;
КонецПроцедуры
