
Процедура ОбработкаПроведенияОбщая(Отказ, Проведение, ЭтотОбъект) Экспорт	
	Если ЭтотОбъект.Схема.Пустая() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//
	
	Если Не Проведение Тогда
		ОбработкаУдаленияПроведения(Отказ, ЭтотОбъект);
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗапускБПОбъекты.Объект
	                      |ПОМЕСТИТЬ ТаблицаЗапускБП
	                      |ИЗ
	                      |	Документ.ЗапускБП.Объекты КАК ЗапускБПОбъекты
	                      |ГДЕ
	                      |	ЗапускБПОбъекты.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	БизнесПроцессы.Ссылка,
	                      |	БизнесПроцессы.Объект,
	                      |	БизнесПроцессы.ПометкаУдаления
	                      |ПОМЕСТИТЬ ТаблицаБП
	                      |ИЗ
	                      |	БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	                      |ГДЕ
	                      |	БизнесПроцессы.Автор = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаБП.Ссылка КАК БПСсылка,
	                      |	ТаблицаЗапускБП.Объект,
	                      |	ТаблицаБП.ПометкаУдаления
	                      |ИЗ
	                      |	ТаблицаБП КАК ТаблицаБП
	                      |		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаЗапускБП КАК ТаблицаЗапускБП
	                      |		ПО ТаблицаБП.Объект = ТаблицаЗапускБП.Объект");
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	МассивДанных = ЭтотОбъект.ТочкаСтарта.Получить();
	Пока Результат.Следующий() Цикл
	    Если Результат.БПСсылка = NULL Тогда
	 		НовыйБП = БизнесПроцессы.БизнесПроцессы.СоздатьБизнесПроцесс();
			НовыйБП.Дата = ТекущаяДатаСеанса();
			НовыйБП.Организация = ЭтотОбъект.Организация;
			НовыйБП.Подразделение = ЭтотОбъект.Подразделение;
			НовыйБП.Схема = ЭтотОбъект.Схема;
			НовыйБП.Операция = ЭтотОбъект.Операция;
			НовыйБП.Автор = ЭтотОбъект.Ссылка;
			НовыйБП.Комментарий = "Документ ""Запуск БП""";
			НовыйБП.Объект = Результат.Объект;
			НовыйБП.БПРодитель = ЭтотОбъект.Ссылка;
			Попытка
				НовыйБП.Записать();
			Исключение
				Отказ = Истина;
				Возврат;
			КонецПопытки;
		
			Если Не ЭтотОбъект.ТССтартоватьСВыбраннойСтадии Тогда
				НовыйБП.ЗапуститьБизнесПроцесс(Отказ);
			Иначе
 				НовыйБП.ЗапуститьБизнесПроцессСТочки(Отказ, МассивДанных.ТСТочка, МассивДанных.ТСОбъектРодитель, МассивДанных.ТССхема, 
						МассивДанных.ТСТипМероприятия, МассивДанных.ТСМассив, МассивДанных.ТСИсполнитель);
			КонецЕсли;
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			
		ИначеЕсли Результат.Объект = NULL Тогда
			//Завершить БП !!!
			БПОбъект = Результат.БПСсылка.ПолучитьОбъект();
			//...
		// При проведении документа необходимо убирать пометку удаления 
		// у существующего документа "БизнесПроцессы" если она есть.
		ИначеЕсли Не Результат.БПСсылка = NULL И Не Результат.Объект = NULL И Результат.ПометкаУдаления Тогда	
			Результат.БПСсылка.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь); 	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ, ЭтотОбъект) Экспорт

	// Запрос проверяет, созданы ли БизнесПроцессы для каждого ДО, которые есть в табличной части документа "ЗапускБП".
	// Полное соед. даёт возможность отследить:
	// 1) какие БизнесПроцессы были удалены для ДО, а в документе "ЗапускБП" они есть,
	// 2) какие строки ДО из ТЧ "ЗапускБП" были удалены, а БизнесПроцессы не удалены.
	
	Запрос = Новый Запрос("ВЫБРАТЬ
			|	ЗапускБПОбъекты.Объект
			|ПОМЕСТИТЬ ТаблицаЗапускБП
			|ИЗ
			|	Документ.ЗапускБП.Объекты КАК ЗапускБПОбъекты
			|ГДЕ
			|	ЗапускБПОбъекты.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	БизнесПроцессы.Ссылка,
			|	БизнесПроцессы.Объект,
			|	БизнесПроцессы.ПометкаУдаления
			|ПОМЕСТИТЬ ТаблицаБП
			|ИЗ
			|	БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
			|ГДЕ
			|	БизнесПроцессы.Автор = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаБП.Ссылка КАК БПСсылка,
			|	ТаблицаЗапускБП.Объект,
			|	ТаблицаБП.ПометкаУдаления
			|ИЗ
			|	ТаблицаБП КАК ТаблицаБП
			|		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаЗапускБП КАК ТаблицаЗапускБП
			|		ПО ТаблицаБП.Объект = ТаблицаЗапускБП.Объект");

		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			// Если Результат.Объект = Null, значит строка из ТЧ документа "ЗапускБП"" была удалена или
			// Если Результат.БПСсылка = Null, значит документ "БизнесПроцессы" был удален, т.е выполнять
			// выполнять отмену проведения у документа "БизнесПроцессы" не требуется.
			Если Результат.Объект = Null Или Результат.БПСсылка = Null Тогда    
				Продолжить;				
			ИначеЕсли Не Результат.ПометкаУдаления Тогда
				Результат.БПСсылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
			КонецЕсли;
		КонецЦикла;
КонецПроцедуры
