
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ПровестиВФоновомРежиме Тогда 	
		РегистрыСведений.ОчередьЗаданий.ПоставитьВОчередь(Отказ, Ссылка, Истина);
	Иначе
		Документы.ЗапускБП.ОбработкаПроведенияОбщая(Отказ, Истина, ЭтотОбъект);
	КонецЕсли;	
КонецПроцедуры

Процедура ПоместитьВХранилище(МассивДанных) Экспорт
	ЭтотОбъект.ТочкаСтарта = Новый ХранилищеЗначения(МассивДанных);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если ПровестиВФоновомРежиме Тогда 		
		РегистрыСведений.ОчередьЗаданий.ПоставитьВОчередь(Отказ, Ссылка, Ложь);	
	Иначе
		Документы.ЗапускБП.ОбработкаУдаленияПроведения(Отказ, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

