
&НаСервере
Функция СписокВТЗ()
    // Получаем СКД с текстом запроса
    СКД_запрос = Элементы.СписокДО.ПолучитьИсполняемуюСхемуКомпоновкиДанных();

    // Получаем настройки пользователя (отборы, сортировки и т.п.)
    Настройки = Элементы.СписокДО.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();

    // Переводим динамический список в таблицу значений
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД_запрос, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

    ПроцессорВыводаРезультата = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ТЗ = ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновкиДанных);// Таблица значений

    Возврат ТЗ;
КонецФункции

&НаСервере
Процедура ПолучитьКоличествоСтрокВДинамическомСпискеНаСервере() Экспорт
	ТЗ_ДС = СписокВТЗ();
	КолСтрокДС = ТЗ_ДС.Количество();
	Если КолСтрокДС > 1 Тогда
		ЭтаФорма.ЕстьСовпадения = Истина;
	Иначе
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Искать(Команда)
	// Обратимся к выгрузке через БСП
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.СписокДО, "Ссылка.Должник.Телефоны.Номер", ЭтаФорма.Номер, ВидСравненияКомпоновкиДанных.Содержит, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	// Обновить результат отбора 
	ЭтаФорма.Элементы.СписокДО.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДолжникМероприятия(Команда)
	// Передать с ключом
	К = Элементы.СписокДО.ТекущиеДанные.Ссылка;
	ФормаМероприятия = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаСписка",,,Новый УникальныйИдентификатор());
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаМероприятия.Список, "Объект", К, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	ФормаМероприятия.КоманднаяПанель.Видимость = Ложь;
	ФормаМероприятия.ОткрытьМодально();
КонецПроцедуры

&НаКлиенте
Процедура ПозвонитьДолжнику(Команда)
	// Получить объект мероприятия
	К = Элементы.СписокДО.ТекущиеДанные.Ссылка;
	НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К));
	НоваяЗадача.Объект.Объект = К;
	НоваяЗадача.Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокИсходящий");
	// НоваяЗадача.Объект.Контакт = РезультатНомер;
	//НоваяЗадача.КонтрагентКЛ = К;
	НоваяЗадача.Открыть();
КонецПроцедуры
