
&НаСервере
Функция СформироватьСписокНомеров()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СписокСвойств.Свойство,
	                      |	ДополнительныеСведения.Значение
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		&Контрагент КАК Контрагент,
	                      |		ЮрФизЛицоДополнительныеСведения.Свойство КАК Свойство
	                      |	ИЗ
	                      |		Справочник.ЮрФизЛицо.ДополнительныеСведения КАК ЮрФизЛицоДополнительныеСведения
	                      |	ГДЕ
	                      |		ЮрФизЛицоДополнительныеСведения.Ссылка = &ТипКонтрагента
	                      |		И ЮрФизЛицоДополнительныеСведения.Свойство.ВидКИ = &ВидКИ) КАК СписокСвойств
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |		ПО СписокСвойств.Контрагент = ДополнительныеСведения.Объект
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	СписокРеквизитов.Свойство,
	                      |	КонтрагентыДополнительныеРеквизиты.Значение
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ЮрФизЛицоДополнительныеРеквизиты.Свойство КАК Свойство,
	                      |		&Контрагент КАК Контрагент
	                      |	ИЗ
	                      |		Справочник.ЮрФизЛицо.ДополнительныеРеквизиты КАК ЮрФизЛицоДополнительныеРеквизиты
	                      |	ГДЕ
	                      |		ЮрФизЛицоДополнительныеРеквизиты.Ссылка = &ТипКонтрагента
	                      |		И ЮрФизЛицоДополнительныеРеквизиты.Свойство.ВидКИ = &ВидКИ) КАК СписокРеквизитов
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	                      |		ПО СписокРеквизитов.Свойство = КонтрагентыДополнительныеРеквизиты.Свойство
	                      |			И СписокРеквизитов.Контрагент = КонтрагентыДополнительныеРеквизиты.Ссылка");
	Запрос.УстановитьПараметр("ВидКИ", Справочники.ВидыКИ.Телефон);
	Запрос.УстановитьПараметр("ТипКонтрагента", Контрагент.ЮрФизЛицо);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	СписокНомеров.Загрузить(Запрос.Выполнить().Выгрузить());		
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьСписокНомеров();
	Элементы.ДекорацияКонтрагент.Заголовок = Контрагент;
КонецПроцедуры

&НаКлиенте
Процедура СписокНомеровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ЭтаФорма.Закрыть(Элемент.ТекущиеДанные.Значение);
	Иначе
		ЭтаФорма.Закрыть(Неопределено);
	КонецЕсли;	
КонецПроцедуры
	