
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ПодключитьОбработчикОжидания("ОбработкаЗаданийТонкийКлиент", 30);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаданийТонкийКлиент()
	Попытка
		Если АктивноеОкно().Основное Тогда;
		    Элементы.Список.Обновить();
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОтключитьОбработчикОжидания("ОбработкаЗаданийТонкийКлиент");
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Копирование;
КонецПроцедуры
