
&НаКлиенте
Процедура Сохранить(Команда)
	Закрыть(ПреобразоватьТЗ());
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Элем Из Параметры.Таблица Цикл
		Таблица.Добавить().Значение = Элем;
	КонецЦикла;
		
	//Таблица.Загрузить(Параметры.Таблица);
	Элементы.ТаблицаЗначение.Заголовок = Параметры.Имя;
	Элементы.ТаблицаЗначение.ОграничениеТипа = Новый ОписаниеТипов(Параметры.ИмяТипа);
КонецПроцедуры

&НаСервере
Функция ПреобразоватьТЗ()
	Массив = Таблица.Выгрузить().ВыгрузитьКолонку("Значение");
	Стр = Новый Структура("Значение", Неопределено);
	Результат = Новый Массив();
	
	Для Каждого Элемент Из Массив Цикл                  
		Если ЗначениеЗаполнено(Элемент) И Результат.Найти(Элемент) = Неопределено Тогда
			Результат.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	   
	Возврат Результат;	
КонецФункции
