
Процедура ИнициализироватьДанныеЗадачи(ЗадачаСсылка, ДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
			|	Мероприятие.Ссылка КАК ИсточникСобытия,
			|	Мероприятие.Объект,
			|	Мероприятие.ТипМероприятия КАК ВидСобытия,
			|	Мероприятие.Исполнитель,
			|	ВЫБОР
			|		КОГДА (НЕ Мероприятие.Выполнена)
			|			ТОГДА Мероприятие.ПланируемаяДата
			|		ИНАЧЕ Мероприятие.ФактическаяДата
			|	КОНЕЦ КАК Дата,
			|	Мероприятие.Результат
			|ИЗ
			|	Задача.Мероприятие КАК Мероприятие
			|ГДЕ
			|	Мероприятие.Ссылка = &Ссылка");	
	Запрос.УстановитьПараметр("Ссылка", ЗадачаСсылка);
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаСобытий", Запрос.Выполнить().Выгрузить());
КонецПроцедуры

Функция ПолучитьМоментВремени(ДатаВыполнения) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(МАКСИМУМ(Мероприятие.МоментВремени), -1) + 1 КАК МоментВремени
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |ГДЕ
	                      |	Мероприятие.ДатаВыполнения = &ДатаВыполнения
	                      |	И Мероприятие.Выполнена");
	Запрос.УстановитьПараметр("ДатаВыполнения", ДатаВыполнения);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.МоментВремени;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции
