
&НаКлиенте
Процедура ОК(Команда)
	Результат = "";
	Для Каждого Поле Из ПолеПараметров Цикл
		Если Поле.ИмяПараметра <> "" Тогда
			Результат = Результат + Поле.Свойство + "=" + Поле.ИмяПараметра + ";";
		КонецЕсли;
	КонецЦикла;
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ТипСтроки = "Строка: Адрес" Тогда
		ЭтаФорма.ПодчиненныеЭлементы.ПолеПараметров.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ЭтаФорма.ПодчиненныеЭлементы.ПолеПараметров.КонтекстноеМеню.Доступность = Ложь;
		Элементы.Свойство.ТолькоПросмотр = Истина;
		
		ПолеПараметров.Добавить().Свойство = "Страна";
		ПолеПараметров.Добавить().Свойство = "Индекс";
		ПолеПараметров.Добавить().Свойство = "Регион";
		ПолеПараметров.Добавить().Свойство = "Район";
		ПолеПараметров.Добавить().Свойство = "Город";
		ПолеПараметров.Добавить().Свойство = "Населенный пункт";
		ПолеПараметров.Добавить().Свойство = "Улица";
		
		ПолеПараметров.Добавить().Свойство = "Дом";
		ПолеПараметров.Добавить().Свойство = "Владение";
		ПолеПараметров.Добавить().Свойство = "Корпус";
		ПолеПараметров.Добавить().Свойство = "Строение";
		ПолеПараметров.Добавить().Свойство = "Квартира";	
		ПолеПараметров.Добавить().Свойство = "Офис";
		
	ИначеЕсли  ТипСтроки = "Строка: Телефон" Тогда
		ЭтаФорма.ПодчиненныеЭлементы.ПолеПараметров.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ЭтаФорма.ПодчиненныеЭлементы.ПолеПараметров.КонтекстноеМеню.Доступность = Ложь;
		Элементы.Свойство.ТолькоПросмотр = Истина;
		
		ПолеПараметров.Добавить().Свойство = "Код страны";
		ПолеПараметров.Добавить().Свойство = "Код города";
		ПолеПараметров.Добавить().Свойство = "Номер телефона";
		ПолеПараметров.Добавить().Свойство = "Добавочный номер";
		ПолеПараметров.Добавить().Свойство = "Комментарий";
		
    КонецЕсли;
	
	Результат = ИзменяемыйЭлемент;	
	СтрокаПараметров = ИзменяемыйЭлемент;
	
	НачПараметра = 1;
	Для НомерСимв = 1 По СтрДлина(СтрокаПараметров) Цикл //цикл надо переписать, слишком долгий в плане поиска символа
		Если Сред(СтрокаПараметров, НомерСимв, 1) = "=" ИЛИ Сред(СтрокаПараметров, НомерСимв, 1) = ";" Тогда
			ДлинаПараметра = НомерСимв - НачПараметра;
			СтрПараметр = Сред(СтрокаПараметров, НачПараметра, ДлинаПараметра);
			НачПараметра = НомерСимв + 1;
						
			Если Сред(СтрокаПараметров, НомерСимв, 1) = "=" Тогда
				Строки = ПолеПараметров.НайтиСтроки(Новый Структура("Свойство", СтрПараметр));
				Если Строки.Количество() = 0 Тогда
			        НоваяСтрока = ПолеПараметров.Добавить();
					НоваяСтрока.Свойство = СтрПараметр;
				Иначе
					НоваяСтрока = Строки[0];
				КонецЕсли;	
			Иначе
				НоваяСтрока.ИмяПараметра = СтрПараметр;				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	Элементы.Свойство.СписокВыбора.ЗагрузитьЗначения(СписокКолонок.ВыгрузитьЗначения());
	Элементы.ИмяПараметра.СписокВыбора.ЗагрузитьЗначения(СписокПараметров.ВыгрузитьЗначения());		
КонецПроцедуры

&НаКлиенте
Процедура ИмяПараметраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокПараметров",СписокВыбора);
	ПараметрыФормы.Вставить("ИзменяемыйЭлемент",Элемент.ТекстРедактирования);

	ФормаПараметров = ПолучитьФорму("Обработка.УстановкаПараметровСвязи.Форма.ФормаВыбораКолонок",ПараметрыФормы,ЭтаФорма);
	//ФормаПараметров.ИзменяемыйЭлемент = Элемент.ТекстРедактирования;
	//ФормаПараметров.СписокПараметров = СписокВыбора;
	//ФормаПараметров.ОткрытьМодально();
	//Элементы.ПолеПараметров.ТекущиеДанные.ИмяПараметра = ФормаПараметров.Результат;	

	ПараметрыДляОповещения = Новый Структура;
	ПараметрыДляОповещения.Вставить("ИмяПараметра",Элементы.ПолеПараметров.ТекущиеДанные);
	ОповещениеОЗакрытииФормы = Новый ОписаниеОповещения("ЗакрытиеОбработкиУстановкиПараметровСвязи",ЭтаФорма,ПараметрыДляОповещения);
	ОткрытьФорму(ФормаПараметров.ИмяФормы,ПараметрыФормы,ЭтаФорма,,,,ОповещениеОЗакрытииФормы);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеОбработкиУстановкиПараметровСвязи(РезультатЗакрытия, ПараметрыДляОповещения) Экспорт
	ИмяПараметра = ПараметрыДляОповещения.ИмяПараметра;
	ИмяПараметра.ИмяПараметра = РезультатЗакрытия;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИзменяемыйЭлемент = Параметры.ИзменяемыйЭлемент;
	ТипСтроки = Параметры.ТипСтроки;
	СписокКолонок = Параметры.СписокКолонок;
	СписокПараметров =Параметры.СписокПараметров;
	СписокВыбора = Параметры.СписокВыбора;
КонецПроцедуры
