#Область ПрограммныйИнтерфейс

Функция ХранительВФайловойСистеме(ИмяВарианта) Экспорт

	Возврат МодульХраненияВФайловойСистеме(ИмяВарианта).Создать();

КонецФункции // ()

Функция ХранительИсторииЧатов() Экспорт

	ИмяВарианта = ИмяВариантаПоТипу(
		ТипЗнч(Документы.ХранилищеИсторииЧатов));
	
	Возврат ХранительВФайловойСистеме(ИмяВарианта);

КонецФункции // ()

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДоступныеВариантыХраненияИстории() Экспорт

	ВариантыХранилища = Метаданные.ОпределяемыеТипы.ХранилищаИстории.Тип.Типы();
	
	ИменаВариантов = Новый Соответствие;

	Для каждого Вариант Из ВариантыХранилища Цикл
	
		Имя = ИмяВариантаПоТипу(Вариант);
		ИменаВариантов.Вставить(Имя, Вариант);
	
	КонецЦикла;
	
	Возврат ИменаВариантов;

КонецФункции // ()

Процедура ПолучитьНовыеСообщения(Мессенджер, ИмяХранилища = Неопределено) Экспорт

	НастройщикОбщения = УправлениеМетаданными
		.МенеджерОбъектаПоСсылке(Мессенджер);
	
	СообщенияТелеграмма = НастройщикОбщения
		.ПолучитьНовыеСообщения(Мессенджер);

	Если Не СообщенияТелеграмма["Результат"] Тогда
	
		Возврат;
	
	КонецЕсли;
	
	МодульХранения = КонфигурацияИсторияЧатов.МодульХраненияИсторииЧатовПоУмолчанию();
	Если ИмяХранилища <> Неопределено Тогда
	
		МодульХранения = МодульХраненияВФайловойСистеме(ИмяХранилища);
	
	КонецЕсли;
	
	ОбработкаПолученияРезультата(СообщенияТелеграмма, Мессенджер, МодульХранения);

КонецПРоцедуры

Процедура ОбработкаПолученияРезультата(СообщенияТелеграмма, Мессенджер, МодульХранения) Экспорт

	НастройщикОбщения = УправлениеМетаданными
		.МенеджерОбъектаПоСсылке(Мессенджер);
	
	Сообщения = НастройщикОбщения
		.ПолучитьСообщения(Мессенджер, СообщенияТелеграмма["Ответ"]);
	
	СобытияВЖурнал = Новый СписокЗначений;
	Пока СообщениеИзЧата.ЕстьСообщения(Сообщения) Цикл
	
		Сообщение = СообщениеИзЧата.СледующееСообщение(Сообщения);

		Попытка
		
			МодульХранения.Сохранить(Сообщение);
		
		Исключение
		
			Описание = Новый Структура;
			Описание.Вставить("ИмяСобытия", "Сохранение сообщения в историю чата");
			Описание.Вставить("ПредставлениеУровня",  "Ошибка");
			Описание.Вставить("Комментарий",  ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			Описание.Вставить("ДатаСобытия",  ТекущаяДатаСеанса());

			СобытияВЖурнал.Добавить(Описание, "Сообщение");
			
		КонецПопытки;
	
	КонецЦикла;
	
	Если СобытияВЖурнал.Количество() > 0 Тогда
	
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияВЖурнал);
		
		ВызватьИсключение
			"Ошибка записи сообщения
			|Информация в Журнале регистрации";
		
		Возврат;
	
	КонецЕсли;
	
	Справочники.НастройкиЧатовТелеграм
		.ОтметитьПрочитанными(Мессенджер, СообщенияТелеграмма["Отметка"]);

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяВариантаПоТипу(Вариант)

	СоставИмени = СтрРазделить(Строка(Вариант), ":");
	Возврат СокрЛП(СоставИмени[1]);

КонецФункции // ()

Функция МодульХраненияВФайловойСистеме(ИмяВарианта)

	Варианты = ДоступныеВариантыХраненияИстории();
	
	ТипВарианта = Варианты.Получить(ИмяВарианта);
	
	Возврат Новый (ТипВарианта);

КонецФункции // ()


#КонецОбласти