#Область ПрограммныйИнтерфейс

Функция СохранитьИзображение() Экспорт

	

КонецФункции // ()

Функция СохранитьМедиа() Экспорт

	

КонецФункции // ()

Функция СохранитьДокумент(Сообщение, ТипФайла) Экспорт



КонецФункции // ()

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СохранитьФайл(Клиент, ПрисланыеФайлы) Экспорт

	
	
	КонфигурацияИсторияЧатов.МодульПрикрепленияФайлов()
		.ПрикрепитьПрисланыеФайлы(Клиент, ПрисланыеФайлы);
	
	


КонецФункции // ()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти