
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДействиеПриИзменении(Неопределено);
	//ВидКИПриИзменении(Неопределено);
	//ШаблонПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПриИзменении(Элемент)
//	Элементы.ОбъектыДействие.Видимость = Объект.Действие.Пустая();
	Если Объект.Действие = ПредопределенноеЗначение("Перечисление.ВариантыДействийДляСкоринга.SMSОповещение") Тогда
		Элементы.УчетнаяЗаписьОтправителя.Доступность = Истина;
		Элементы.УчетнаяЗаписьОтправителя.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.УчетныеЗаписиSMS4B");
	ИначеЕсли Объект.Действие = ПредопределенноеЗначение("Перечисление.ВариантыДействийДляСкоринга.EMailРассылка") Тогда
		Элементы.УчетнаяЗаписьОтправителя.Доступность = Истина;
		Элементы.УчетнаяЗаписьОтправителя.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты");
	ИначеЕсли Объект.Действие = ПредопределенноеЗначение("Перечисление.ВариантыДействийДляСкоринга.ПустаяСсылка") Тогда
		Объект.УчетнаяЗаписьОтправителя = ПредопределенноеЗначение("Справочник.УчетныеЗаписиSMS4B.ПустаяСсылка");
		Элементы.УчетнаяЗаписьОтправителя.Доступность = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидКИПриИзменении(Элемент)
	ИзменитьВидКИ();
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидКИ()
	Для Каждого Элемент ИЗ Объект.Объекты Цикл
		Элемент.Контакт = Автоинформирование.ПолучитьКонтакт(Элемент.Объект, Объект.ВидКИ);		 
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ИзменитьШаблон()
	Для Каждого Элемент ИЗ Объект.Объекты Цикл
		Элемент.Текст = Автоинформирование.ПолучитьПодсказку(Элемент.Объект, Объект.Шаблон);		 
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	ИзменитьШаблон();
КонецПроцедуры

&НаСервере
Процедура ПодборВтаблЧасть(Результат)
	Об = РеквизитФормыВЗначение("Объект");		
	РаботаСДокументами.ЗанестиРезультатПодбораВТабличнуюЧасть(Об.Объекты, Результат);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектыСервер.ОграничитьТипОбъекта(Элементы.ОбъектыОбъект);
	
	//
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
	
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПолеПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтрокуОбъект(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПриИзменении(Элемент)
	//Если Не Элемент.ТекущиеДанные = Неопределено И Не Элемент.ТекущиеДанные.Объект = Неопределено Тогда
	//	Элемент.ТекущиеДанные.Контакт = ПолучитьКонтактСервер(Элемент.ТекущиеДанные.Объект, Объект.ВидКИ);
	//	Элемент.ТекущиеДанные.Текст = ПолучитьПодсказкуСервер(Элемент.ТекущиеДанные.Объект, Объект.Шаблон);
	//КонецЕсли;
КонецПроцедуры

&НаСервере 
Функция ПолучитьКонтактСервер(ДО, ВидКИ)
	Возврат Автоинформирование.ПолучитьКонтакт(ДО, ВидКИ);
КонецФункции

&НаСервере 
Функция ПолучитьПодсказкуСервер(ДО, ВидКИ)
	Возврат Автоинформирование.ПолучитьПодсказку(ДО, ВидКИ);
КонецФункции


&НаКлиенте
Процедура ЗаполнитьДанные(Команда)
	Для Каждого Элемент ИЗ Объект.Объекты Цикл
		Элемент.Контакт = ПолучитьКонтактСервер(Элемент.Объект, Объект.ВидКИ);
		Элемент.Текст = ПолучитьПодсказкуСервер(Элемент.Объект, Объект.Шаблон);		 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры
