
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Замена типов в регистре
	Для Каждого Элемент Из ЭтотОбъект.Объекты Цикл
		Набор = РегистрыСведений.ОтветственныеСотрудники.СоздатьМенеджерЗаписи();
		Набор.Объект = Элемент.Объект;
		Набор.ТипСотрудника = Элемент.ТипСотрудника;
		Набор.Пользователь = ЭтотОбъект.Ответственный;
		Попытка
			Набор.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
			Отказ = Истина;
			Возврат;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//Восстановление типов в регистре
	Для Каждого Элемент Из ЭтотОбъект.Объекты Цикл
		Набор = РегистрыСведений.ОтветственныеСотрудники.СоздатьМенеджерЗаписи();
		Набор.Объект = Элемент.Объект;
		Набор.ТипСотрудника = Элемент.ТипСотрудника;
		Набор.Пользователь = Элемент.Сотрудник;
		Попытка
			Набор.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
			Отказ = Истина;
			Возврат;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)	
	ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
