
&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Для Каждого Колонка Из СписокКолонок Цикл		
		Элементы.СоответствияИмяПараметра.СписокВыбора.Добавить(Колонка);  	
	КонецЦикла; 
		
	Для Каждого Поле Из ПолеПараметров Цикл	
		Элементы.СоответствияСвойство.СписокВыбора.Добавить(Поле);                       
	КонецЦикла; 
КонецПроцедуры

//&НаКлиенте
//Процедура ПриЗакрытии()
//	//СписокВыбранныхПараметров = Новый СписокЗначений;
//	//Для Каждого ТекСоответствие Из Соответствия Цикл
//	//	СписокВыбранныхПараметров.Добавить(ТекСоответствие.ИмяПараметра);
//	//КонецЦикла;
//	
//	СтрокаПараметров = "";
//	Для Каждого ТекСоответствие Из Соответствия Цикл
//		СтрокаПараметров = СтрокаПараметров + ТекСоответствие.Свойство + "=" + ТекСоответствие.ИмяПараметра + ";";
//	КонецЦикла;
//		
//	Закрыть(СтрокаПараметров);
//КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	СтрокаПараметров = "";
	Для Каждого ТекСоответствие Из Соответствия Цикл
		СтрокаПараметров = СтрокаПараметров + ТекСоответствие.Свойство + "=" + ТекСоответствие.ИмяПараметра + ";";
	КонецЦикла;
		
	ЭтаФорма.Закрыть(СтрокаПараметров);
КонецПроцедуры
