
Функция ПеревестиВВалюту(ВалютаСуммы, ВалютаРезультата, Сумма, Период) Экспорт
	Если ВалютаСуммы = ВалютаРезультата Тогда
		Возврат Сумма;
	Иначе
	    КурсСуммы = РегистрыСведений.КурсыВалют.СрезПоследних(Период, Новый Структура("Валюта", ВалютаСуммы));
	    КурсРезультата = РегистрыСведений.КурсыВалют.СрезПоследних(Период, Новый Структура("Валюта", ВалютаРезультата));
		Возврат Сумма * КурсСуммы.Курс * КурсРезультата.Кратность / (КурсРезультата.Курс * КурсСуммы.Кратность);
	КонецЕсли;
КонецФункции
