
&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	ВыполнитьЗамену_НаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗамену_НаСервере()
	
	ВыборкаСправочников = Справочники.тсШаблоныПечатныхДокументов.Выбрать();
	Пока ВыборкаСправочников.Следующий() Цикл
		Справочник = ВыборкаСправочников.ПолучитьОбъект();
		Для Каждого Стр ИЗ Справочник.РеквизитыИСвойства Цикл
			МассивДанных = Стр.Хранилище.Получить();
			Стр.СтрокаХранилище = "";
			Для Каждого СтрМ Из МассивДанных Цикл
				Стр.СтрокаХранилище = Стр.СтрокаХранилище + "[" + СтрМ + "]";
			КонецЦикла;
		КонецЦикла;
		Попытка
			Справочник.Записать();
			Сообщить("Операция замены хранилища значений в справочнике " + Справочник.Наименование + " прошла успешно!");
		Исключение
			Сообщить("Операция замены хранилища значений в справочнике " + Справочник.Наименование + " прошла с ошибкой!");
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

