
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект = Параметры.Объект;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИзмененныеОбъекты.Сообщение
	                      |ИЗ
	                      |	РегистрСведений.ИзмененныеОбъекты КАК ИзмененныеОбъекты
	                      |ГДЕ
	                      |	ИзмененныеОбъекты.Объект = &Объект
	                      |	И ИзмененныеОбъекты.Сотрудник = &Сотрудник");
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Сотрудник", УдалитьОбщегоНазначения.ТекущийПользователь());	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Нов = Таблица.Добавить();
		Нов.Дата = Дата(Лев(Результат.Сообщение, 14));
		
		Стр = Сред(Результат.Сообщение, 9);
		Ном = Найти(Стр, ";");
		Нов.Изменил = Лев(Стр, Ном - 1);
		
		Стр = Сред(Стр, Ном + 1);
		Стр = СокрП(СтрЗаменить(Стр, "|", Символы.ПС));
		Нов.Описание = Стр;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Отказ = Ложь;
	ОбъектыСервер.УдалитьПометкуОбИзменении(Отказ, Объект);
	Если Не Отказ Тогда
		Таблица.Очистить();
	КонецЕсли;
КонецПроцедуры
