
&НаСервере
Процедура ПриОткрытииНаСервере(Отказ)
	ЭтаФорма.РольАБД = РольДоступна("АБД");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Получить непредопредленное значение с сервера
	ПриОткрытииНаСервере(Отказ);
	// Проверить права доступа
	Если ЭтаФорма.РольАБД = Ложь Тогда
		Предупреждение("Нарушение прав доступа",,"Предупреждение");
		Отказ = Истина;
	КонецЕсли;
	ПодключитьАхантер(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Ахантер = "https://www.ahunter.ru/site/demo/address";  
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьАхантер(Команда)
	ПодключитьОбработчикОжидания("ВыполнитьЗапросАхантер", 3, Истина);  
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапросАхантер() 
	document = ЭтаФорма.Элементы.Ахантер.Документ;
	adress = document.querySelector("#js-AddressField");
	adress.value = ЭтаФорма.Адрес;
	searchbutton = document.querySelector(".u-ButtonGrey");
	searchbutton.click();
	ПодключитьОбработчикОжидания("ПолучитьОКАТО", 1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОКАТО()
	document = ЭтаФорма.Элементы.Ахантер.Документ;
	Попытка
		okato = document.querySelector(".b-Table:nth-child(6) > .b-Row:nth-child(1) > .b-LPaddingStd").firstChild.nodeValue;
	Исключение
		okato = "99 999 999 999";
	КонецПопытки;
	ЭтаФорма.Результат = okato;
	РезультатВКонстанту();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура РезультатВКонстанту()
	Константы.АхантерОКАТО.Установить(ЭтаФорма.Результат);
КонецПроцедуры
