
&НаКлиенте
Процедура СоздатьUIDСделки(Команда)
	СоздатьUIDСделкиАсинх();
КонецПроцедуры

&НаКлиенте
Асинх Процедура СоздатьUIDСделкиАсинх()  
	ОбещаниеАдаптеры  = ПолучитьИнформациюОСетевыхАдаптерахАсинх();
	РезАдаптеры = Ждать ОбещаниеАдаптеры;
	Адаптер = РезАдаптеры[0];	
	АдресСетевойКарты = Адаптер.MACАдрес;
	УУИД = ОбъектыСервер.СформироватьUUIDver1(ОбщегоНазначенияКлиент.ДатаСеанса(), АдресСетевойКарты);
	Объект.UIDНБКИ = УУИД + "-"  + ОбъектыСервер.СгенерироватьКонтрольныйСимвол(УУИД); 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.UIDНБКИ.ТолькоПросмотр = ЗначениеЗаполнено(Объект.UIDНБКИ);
	Элементы.СоздатьUIDСделки.Доступность = Не ЗначениеЗаполнено(Объект.UIDНБКИ);
	Если ЗначениеЗаполнено(Объект.ДатаФиксированияИзмений) Тогда
		Объект.ДатаФиксированияИзмений = Дата(1,1,1);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Текст = "Введите сюда вместо этого текста:" + Символы.ПС +  
		"а) кадастровый номер – для имеющей такой номер недвижимости;" + Символы.ПС +
		"б) идентификационный номер транспортного средства (VIN) – для имеющего такой номер транспортного средства;" + Символы.ПС +
		"в)код по Общероссийскому классификатору основных фондов (далее – ОКОФ) или заводской номер – для промышленных машин и оборудования;" + Символы.ПС + 
		"г) штриховой код – для имеющего такой код товара;" + Символы.ПС + 
		"д) уникальный идентификатор финансового инструмента в торговой системе (тикер) – для имеющих такой идентификатор ценной бумаги или иного финансового инструмента." + Символы.ПС +
		"е) Для предметов залога, не поименованных выше, указывается предусмотренное договором обозначение.";
		Объект.Описание = Текст;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УсловияИсполненияОбязательстваПриИзменении(Элемент)
	Сообщить("Все изменения будут зафиксированы в отчет НБКИ");
	Объект.ДатаФиксированияИзмений = ОбщегоНазначенияКлиент.ДатаСеанса();
КонецПроцедуры
