
&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыбратьНаСервере()
	Объект.Объекты.Очистить();
	ТабДок = ПолеИсходнойТаблицы;
	Для нн = 1 По ТабДок.ШиринаТаблицы Цикл
		Для кк = 1 По ТабДок.ВысотаТаблицы Цикл
			Текст = ТабДок.Область("R" + СтрЗаменить(Строка(кк),Символы.НПП,"") + "C" + СтрЗаменить(Строка(нн),Символы.НПП,"")).Текст;
			Если ЗначениеЗаполнено(Текст) Тогда
				ДОСсылка = Справочники.ДолговыеОбязательства.НайтиПоРеквизиту("КодДО", Текст);
				Если НЕ ДОСсылка.Пустая() Тогда
					НоваяСтрока = Объект.Объекты.Добавить();
					НоваяСтрока.Объект = ДОСсылка;
					НоваяСтрока.Пометка = Истина;
				Иначе
					ДОСсылка = Справочники.ДолговыеОбязательства.НайтиПоНаименованию(Текст,Истина,,);
					Если НЕ ДОСсылка.Пустая() Тогда
						НоваяСтрока = Объект.Объекты.Добавить();
						НоваяСтрока.Объект = ДОСсылка;
						НоваяСтрока.Пометка = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого Элемент Из Объект.Объекты Цикл
		Элемент.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого Элемент Из Объект.Объекты Цикл
		Элемент.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНаДругуюФорму(Команда)
	ПомеченныеСтроки = Объект.Объекты.НайтиСтроки(Новый Структура("Пометка", Истина));
		
	Если ПомеченныеСтроки.Количество() = 0 Тогда
		Сообщить("Ничего не отмечено!");
	Иначе			
		Для Каждого Элемент Из ПомеченныеСтроки Цикл
			Нов = ВладелецФормы.Объект.Объекты.Добавить();
			Нов.Объект = Элемент.Объект;	
			Попытка
				Нов.Контрагент = Элемент.Объект;
				Нов.ДоговорКонтрагента = Элемент.Объект;	
				Нов.УслугаПоДоговору = Элемент.Объект;
				Нов.ДолговоеОбязательство = Элемент.Объект;
				Нов.ИсполнительныйДокумент = Элемент.Объект;
			Исключение
			КонецПопытки;
		КонецЦикла;
		ЭтаФорма.Закрыть();
	КонецЕсли;  	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ВладелецФормы = Неопределено Тогда
		Элементы.ОбъектыДобавитьНаДругуюФорму.Видимость = Ложь;
	КонецЕсли;
	Элементы.ПолеИсходнойТаблицы.ОтображатьСетку = Истина;
	Элементы.ПолеИсходнойТаблицы.ОтображатьЗаголовки = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ФайлExcelНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл платежей...";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Табличный документ(*.xls, *.xlsx, *.ods)|*.xls?;*.ods|";
	Если Диалог.Выбрать() Тогда
		ФайлИмпорта = Диалог.ПолноеИмяФайла;
		ФайлExcel = ФайлИмпорта;
		ДД = Новый ДвоичныеДанные(ФайлИмпорта);
		Попытка
			ПолеИсходнойТаблицы.Прочитать(ФайлИмпорта);
		Исключение
			//Загружено = РаботаСДокументами.мПрочитатьТабличныйДокументИзExcel(ПолеИсходнойТаблицы, ФайлИмпорта, 1);
			Загружено = РаботаСДокументами.ПрочитатьТабличныйДокументExcelизДвоичныхДанных(ПолеИсходнойТаблицы,ДД,1);
		КонецПопытки
	КонецЕсли;		
КонецПроцедуры


