
Процедура ПередЗаписью(Отказ, Замещение)
	Кодировка = Константы.КодировкаДляКЛАДР.Получить();	
	Если ЭтотОбъект.Количество() > 0 И Кодировка <> "" И Кодировка <> "ANSI" И Кодировка <> "OEM"
			И Не (ЭтотОбъект.Отбор[0].Использование И ЭтотОбъект.Отбор[1].Использование) Тогда
		Путь = ПолучитьИмяВременногоФайла();	
		ТД = Новый ТекстовыйДокумент();
		Для Каждого Стр Из ЭтотОбъект Цикл
			ТД.ДобавитьСтроку(Стр.Наименование);
			ТД.ДобавитьСтроку(Стр.Сокращение);
		КонецЦикла;
		ТД.Записать(Путь, КодировкаТекста.OEM, Символы.ВК);
		ТД.Прочитать(Путь, Кодировка, Символы.ВК);
		
		й = 1;
		Для Каждого Стр Из ЭтотОбъект Цикл
			Стр.Наименование = ТД.ПолучитьСтроку(й);
			Стр.Сокращение = ТД.ПолучитьСтроку(й + 1);
			й = й + 2;			
		КонецЦикла;
		
		Файл = Новый Файл(Путь);
		Если Файл.Существует() Тогда
			УдалитьФайлы(Файл.ПолноеИмя, Файл.Имя);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
