
//{{MRG[ <-> ]
Процедура ПриНачалеРаботыСистемы()	
	Если Не бит_сл_сервер.НетОшибок(бит_сл_сервер.ПолучитьЛицензиюДляТекущегоПродукта()) Тогда			
		// Произвольный код обработки ошибки получения лицензии	
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//Процедура ПриНачалеРаботыСистемы()
//	// Пропустить инициализацию, если обновление информационной базы еще не завершено.
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	Если ОбновлениеИнформационнойБазы.НеобходимоОбновлениеИнформационнойБазы() Тогда
//		Возврат;
//}}MRG[ <-> ]
	КонецЕсли;
//{{MRG[ <-> ]
//	ЗаписатьИнформацию(НСтр("ru = 'Демо: Начат сеанс внешнего соединения'"));
//}}MRG[ <-> ]
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()
//{{MRG[ <-> ]
	// Процедура для штатного отсоединения от сервера лицензий
	бит_сл_сервер.ОтключитьсяОтСервера();	
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	// Пропустить обработку, если обновление информационной базы еще не завершено.
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	Если ОбновлениеИнформационнойБазы.НеобходимоОбновлениеИнформационнойБазы() Тогда
//		Возврат;
//	КонецЕсли;
//	ЗаписатьИнформацию(НСтр("ru = 'Демо: Завершен сеанс внешнего соединения'"));
//}}MRG[ <-> ]
КонецПроцедуры
// _Демо начало примера

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьИнформацию(Знач Текст)
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Внешнее соединение'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация,,, Текст);
	
КонецПроцедуры

#КонецОбласти

// _Демо конец примера
