
Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
//{{MRG[ <-> ]
	Если ИменаПараметровСеанса = Неопределено Тогда
		// Раздел установки параметров сеанса при начале сеанса (ИменаПараметровСеанса = Неопределено)
		// Выполняется установка параметров сеанса, которые можно инициализировать 
		// при начале работы системы
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	// СтандартныеПодсистемы
	
//	// Конец СтандартныеПодсистемы
//}}MRG[ <-> ]
		// Инициализация параметров сеанса Системы Лицензирования
//{{MRG[ <-> ]
		//ПараметрыСеанса.бит_сл_ОбработкаЛицензирования = "";
		//ПараметрыСеанса.бит_сл_БуферЛицензирования = "";
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	// ТехнологияСервиса
//	ТехнологияСервиса.ВыполнитьДействияПриУстановкеПараметровСеанса(ИменаПараметровСеанса);
//	// Конец ТехнологияСервиса
//}}MRG[ <-> ]
		//ПараметрыСеанса.бит_сл_БуферЛицензированияВторой = "";
		//ПараметрыСеанса.АдресОбъектаУЭД = "";
		
	Иначе
		// Инициализация параметров сеанса системы лицензирования
		бит_сл_сервер.ИнициализацияПараметровСеанса(ИменаПараметровСеанса);
		
		
		// Установка параметров сеанса "по требованию"
		
		// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
		// следует инициализировать сразу группой. Для того, чтобы избежать их повторной инициализации,
		// имена уже установленных параметров сеанса сохраняются в массиве УстановленныеПараметры
		УстановленныеПараметры = Новый Массив;
		Для Каждого ИмяПараметра Из ИменаПараметровСеанса Цикл
			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
	КонецЕсли;
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
КонецПроцедуры


// Установить значения параметров сеанса и возвратить имена установленных параметров сеанса
// в параметре УстановленныеПараметры.
//
// Параметры
//  ИмяПараметра  - Строка - имя параметра сеанса, который требуется установить (проинициализировать).
//  УстановленныеПараметры  - Массив - массив, в который добавляются имена
//                                     установленных (проинициализированных) параметров.
//
Процедура УстановитьЗначениеПараметраСеанса(Знач ИмяПараметра, УстановленныеПараметры)
	
	// Если в данном вызове УстановкаПараметровСеанса параметр ИмяПараметра уже установлен - возврат.
	Если УстановленныеПараметры.Найти(ИмяПараметра) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	// Пользователи
	Пользователи.ОпределитьТекущегоПользователя(ИмяПараметра, УстановленныеПараметры);
		
	// Базовая функциональность
	УдалитьОбщегоНазначения.НачальнаяУстановкаПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
	
КонецПроцедуры
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#КонецЕсли