
Процедура ОбработкаПроведения(Отказ, Режим)
	ДатаСобытия = ?(ЗначениеЗаполнено(ДатаИзмененияДоговора), ДатаИзмененияДоговора, Дата);
	Часы = 12;
	Секунды = 3600;
	НастройкаФормироватьСписание = КредитныеИстории.ФиксироватьИзмененияПриСписаниях();
	ПисатьСобытие = Истина;
	ПисатьСобытие = НастройкаФормироватьСписание И ЭтотОбъект.ПричиныПрекращенияОбязательства <> 2; 
	Если ПисатьСобытие Тогда  
		ДатаЗаписи =?(ЗначениеЗаполнено(ДатаФактическогоПрекращенияИзменения), ДатаФактическогоПрекращенияИзменения, ДатаСобытия); 
		КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектУчета, ДатаЗаписи + (Часы * Секунды), ЭтотОбъект.Ссылка, "2.1");
	КонецЕсли;    
	
	 
	Если НастройкаФормироватьСписание И ЭтотОбъект.ПричиныПрекращенияОбязательства = 2 Тогда
		КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектУчета, ДатаПрекращенияОбязательства , ЭтотОбъект.Ссылка, "2.3");
	КонецЕсли;
	
	Если ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.НаследованиеДоговора И ЗначениеЗаполнено(Наследник) Тогда
		ЗаписьНаследование = РегистрыСведений.Наследники.СоздатьМенеджерЗаписи();
		ЗаписьНаследование.ДолговоеОбязательство = ОбъектУчета;
		ЗаписьНаследование.Наследник = Наследник;
		ЗаписьНаследование.Записать();
	КонецЕсли;
	
	Если СписыватьЗадолженностьВПрограмме Тогда
		Если ПолноеПрощение Тогда
			ПолноеПрощение(Отказ, Режим);
		Иначе
			ЧастичноеПрощение(Отказ, Режим);
		КонецЕсли;  
	КонецЕсли;	
КонецПроцедуры

Процедура ПолноеПрощение(Отказ, Режим) 
	
	Если СписыватьЗадолженностьВПрограмме Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадолженностьПоОбъектамОстатки.Объект КАК Объект,
		|	ЗадолженностьПоОбъектамОстатки.СуммаДООстаток КАК СуммаДО,
		|	ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток КАК СуммаРегл,
		|	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгДООстаток КАК ОсновнойДолгДО,
		|	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток КАК ОсновнойДолгРегл,
		|	ЗадолженностьПоОбъектамОстатки.ПроцентыДООстаток КАК ПроцентыДО,
		|	ЗадолженностьПоОбъектамОстатки.ПроцентыРеглОстаток КАК ПроцентыРегл,
		|	ЗадолженностьПоОбъектамОстатки.ШтрафыДООстаток КАК ШтрафыДО,
		|	ЗадолженностьПоОбъектамОстатки.ШтрафыРеглОстаток КАК ШтрафыРегл,
		|	ЗадолженностьПоОбъектамОстатки.ПениДООстаток КАК ПениДО,
		|	ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток КАК ПениРегл,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая1ДООстаток КАК Составляющая1ДО,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая1РеглОстаток КАК Составляющая1Регл,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая2ДООстаток КАК Составляющая2ДО,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая2РеглОстаток КАК Составляющая2Регл,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая3ДООстаток КАК Составляющая3ДО,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая3РеглОстаток КАК Составляющая3Регл,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая4ДООстаток КАК Составляющая4ДО,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая4РеглОстаток КАК Составляющая4Регл,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая5ДООстаток КАК Составляющая5ДО,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая5РеглОстаток КАК Составляющая5Регл,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая6ДООстаток КАК Составляющая6ДО,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая6РеглОстаток КАК Составляющая6Регл,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая7ДООстаток КАК Составляющая7ДО,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая7РеглОстаток КАК Составляющая7Регл,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая8ДООстаток КАК Составляющая8ДО,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая8РеглОстаток КАК Составляющая8Регл
		|ПОМЕСТИТЬ СтарыйУчет
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&ТекДата, Объект = &ОбъектУчета) КАК ЗадолженностьПоОбъектамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Объект КАК Объект,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.СуммаДООстаток КАК СуммаДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.СуммаРеглОстаток КАК СуммаРегл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ОсновнойДолгДООстаток КАК ОсновнойДолгДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ОсновнойДолгРеглОстаток КАК ОсновнойДолгРегл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПроцентыДООстаток КАК ПроцентыДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПроцентыРеглОстаток КАК ПроцентыРегл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ШтрафыДООстаток КАК ШтрафыДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ШтрафыРеглОстаток КАК ШтрафыРегл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПениДООстаток КАК ПениДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПениРеглОстаток КАК ПениРегл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая1ДООстаток КАК Составляющая1ДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая1РеглОстаток КАК Составляющая1Регл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая2ДООстаток КАК Составляющая2ДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая2РеглОстаток КАК Составляющая2Регл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая3ДООстаток КАК Составляющая3ДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая3РеглОстаток КАК Составляющая3Регл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая4ДООстаток КАК Составляющая4ДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая4РеглОстаток КАК Составляющая4Регл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая5ДООстаток КАК Составляющая5ДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая5РеглОстаток КАК Составляющая5Регл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая6ДООстаток КАК Составляющая6ДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая6РеглОстаток КАК Составляющая6Регл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая7ДООстаток КАК Составляющая7ДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая7РеглОстаток КАК Составляющая7Регл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая8ДООстаток КАК Составляющая8ДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая8РеглОстаток КАК Составляющая8Регл
		|ПОМЕСТИТЬ Внесудебка
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПоОбъектамВнесудебная.Остатки(&ТекДата, Объект = &ОбъектУчета) КАК ЗадолженностьПоОбъектамВнесудебнаяОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗадолженностьПоСудебнымРешениямОстатки.Займ КАК Займ,
		|	ЗадолженностьПоСудебнымРешениямОстатки.Решение КАК Решение,
		|	ЗадолженностьПоСудебнымРешениямОстатки.ЧастьРешения КАК ЧастьРешения,
		|	ЗадолженностьПоСудебнымРешениямОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностьПоСудебнымРешениямОстатки.СуммаОстаток КАК Сумма
		|ПОМЕСТИТЬ Судебка
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПоСудебнымРешениям.Остатки(&ТекДата, Займ = &ОбъектУчета) КАК ЗадолженностьПоСудебнымРешениямОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоДоговорамОстатки.Займ КАК Займ,
		|	РасчетыПоДоговорамОстатки.ОсновнойДолгОстаток КАК ОсновнойДолг,
		|	РасчетыПоДоговорамОстатки.ПроцентыОстаток КАК Проценты,
		|	РасчетыПоДоговорамОстатки.ПроцентыНачисленныеВПериодПросрочкиОстаток КАК ПроцентыНачисленныеВПериодПросрочки,
		|	РасчетыПоДоговорамОстатки.ШтрафыОстаток КАК Штрафы,
		|	РасчетыПоДоговорамОстатки.ПениОстаток КАК Пени,
		|	РасчетыПоДоговорамОстатки.ОсновнойДолгГрафикОстаток КАК ОсновнойДолгГрафик,
		|	РасчетыПоДоговорамОстатки.ПроцентыГрафикОстаток КАК ПроцентыГрафик,
		|	РасчетыПоДоговорамОстатки.РасчетныйСчетОстаток КАК РасчетныйСчет,
		|	РасчетыПоДоговорамОстатки.ПроцентыНачисленияОстаток КАК ПроцентыНачисления,
		|	РасчетыПоДоговорамОстатки.ШтрафыНачисленияОстаток КАК ШтрафыНачисления,
		|	РасчетыПоДоговорамОстатки.ПениНачисленияОстаток КАК ПениНачисления
		|ПОМЕСТИТЬ Расчеты
		|ИЗ
		|	РегистрНакопления.РасчетыПоДоговорам.Остатки КАК РасчетыПоДоговорамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсковыеТребованияОстатки.Займ КАК Займ,
		|	ИсковыеТребованияОстатки.СуммаОсновнойДолгОстаток КАК СуммаОсновнойДолг,
		|	ИсковыеТребованияОстатки.СуммаПроцентыОстаток КАК СуммаПроценты,
		|	ИсковыеТребованияОстатки.СуммаШтрафыОстаток КАК СуммаШтрафы,
		|	ИсковыеТребованияОстатки.СуммаПениОстаток КАК СуммаПени,
		|	ИсковыеТребованияОстатки.ЦенаИскаОстаток КАК ЦенаИска,
		|	ИсковыеТребованияОстатки.СуммаГоспошлинаОстаток КАК СуммаГоспошлина
		|ПОМЕСТИТЬ ИсковыеТребования
		|ИЗ
		|	РегистрНакопления.ИсковыеТребования.Остатки(&ТекДата, Займ = &ОбъектУчета) КАК ИсковыеТребованияОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияПоГоспошлинеОстатки.Объект КАК Объект,
		|	НачисленияПоГоспошлинеОстатки.СуммаОстаток КАК Сумма
		|ПОМЕСТИТЬ ГП
		|ИЗ
		|	РегистрНакопления.НачисленияПоГоспошлине.Остатки(&ТекДата, Объект = &ОбъектУчета) КАК НачисленияПоГоспошлинеОстатки";
		
		Запрос.УстановитьПараметр("ОбъектУчета", ОбъектУчета);
		Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса()); 
		
		МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();   
		
		ВыборкаСтарыйУчет = МассивРезультатов[0].Выбрать();
		
		Если ВыборкаСтарыйУчет.Следующий() Тогда	
			// регистр ЗадолженностьПоОбъектам Расход 
			Движения.ЗадолженностьПоОбъектам.Записывать = Истина;
			Движение = Движения.ЗадолженностьПоОбъектам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ДатаПрекращенияОбязательства;
			Движение.Регистратор = Ссылка;
			ЗаполнитьЗначенияСвойств(Движение,ВыборкаСтарыйУчет);	
		КонецЕсли; 
		
		ВыборкаВнесудебка = МассивРезультатов[1].Выбрать();
		
		Если ВыборкаВнесудебка.Следующий() Тогда
			// регистр ЗадолженностьПоОбъектамВнесудебная Расход
			Движения.ЗадолженностьПоОбъектамВнесудебная.Записывать = Истина;
			Движение = Движения.ЗадолженностьПоОбъектамВнесудебная.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ДатаПрекращенияОбязательства;      
			Движение.Регистратор = Ссылка;
			ЗаполнитьЗначенияСвойств(Движение,ВыборкаВнесудебка);	
		КонецЕсли; 
		
		ВыборкаСудебка = МассивРезультатов[2].Выбрать();
		
		Если ВыборкаСудебка.Количество() > 0 Тогда
			
			Пока ВыборкаСудебка.Следующий() Цикл
				// регистр ЗадолженностьПоСудебнымРешениям Расход
				Движения.ЗадолженностьПоСудебнымРешениям.Записывать = Истина;
				Движение = Движения.ЗадолженностьПоСудебнымРешениям.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = ДатаПрекращенияОбязательства;   
				Движение.Регистратор = Ссылка;
				ЗаполнитьЗначенияСвойств(Движение,ВыборкаСудебка);
			КонецЦикла;	
		КонецЕсли;  
		
		ВыборкаРасчеты = МассивРезультатов[3].Выбрать();
		
		Если ВыборкаРасчеты.Следующий() Тогда   
			// регистр РасчетыПоДоговорам Расход 
			// ТЗЗадолженности = ОбъектыСервер.
			// Движения.РасчетыПоДоговорам.Записывать = Истина;
			// Движение = Движения.РасчетыПоДоговорам.Добавить();
			// Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			// Движение.Период = Дата;
			// Движение.Займ = ОбъектУчета;  
			
			
			// МБ нужна реструктуризация с типом прощение
			
		КонецЕсли; 
		
		
		ВыборкаИск = МассивРезультатов[4].Выбрать();
		
		Если ВыборкаИск.Следующий() Тогда    
			// регистр ИсковыеТребования Расход
			Движения.ИсковыеТребования.Записывать = Истина;
			Движение = Движения.ИсковыеТребования.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ДатаПрекращенияОбязательства;  
			Движение.Регистратор = Ссылка;
			ЗаполнитьЗначенияСвойств(Движение,ВыборкаИск);	
		КонецЕсли;  
		
		
		ВыборкаГП = МассивРезультатов[5].Выбрать();
		
		Если ВыборкаГП.Следующий() Тогда    
			// регистр НачисленияПоГоспошлине Расход
			Движения.НачисленияПоГоспошлине.Записывать = Истина;
			Движение = Движения.НачисленияПоГоспошлине.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ДатаПрекращенияОбязательства;   
			Движение.Регистратор = Ссылка;
			ЗаполнитьЗначенияСвойств(Движение,ВыборкаГП);	
		КонецЕсли;    
		
		
		
		Движения.Записать(); 
		
	КонецЕсли;
	
	СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектУчета, Ссылка, "2.5"); 
	
	Если Не СобытиеЗафиксировано Тогда 
		КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектУчета, ДатаПрекращенияОбязательства, ЭтотОбъект.Ссылка, "2.5"); 
	КонецЕсли;
КонецПроцедуры


Процедура ЧастичноеПрощение(Отказ, Режим)
	
	Если СписыватьЗадолженностьВПрограмме Тогда
		
		Если НЕ  ЗначениеЗаполнено(ЭтотОбъект.ДокументКорректировка) Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если Отказ Тогда
			Сообщить("Выполните корректировку задолженности для частичного прощения!");
		КонецЕсли; 
		
	КонецЕсли;
	
	//СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектУчета, Ссылка, "2.1"); 
	//Если Не СобытиеЗафиксировано Тогда
	//	КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектУчета, Дата, ЭтотОбъект.Ссылка, "2.1");
	//КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		ОбъектУчета = ДанныеЗаполнения.Ссылка;
		ПолноеПрощение = Ложь;
		СписыватьЗадолженностьВпрограмме = Ложь;
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	Если ЗначениеЗаполнено(ЭтотОбъект.ДокументКорректировка) Тогда
		ДокументКорректировка.ПолучитьОбъект().Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;	 
	КредитныеИстории.УдалитьСобытиеСделки(ОбъектУчета, Ссылка, "2.1");
	КредитныеИстории.УдалитьСобытиеСделки(ОбъектУчета, Ссылка, "2.3");
	КредитныеИстории.УдалитьСобытиеСделки(ОбъектУчета, Ссылка, "2.5");
КонецПроцедуры

