Функция СтатусУчета(ДанныеУчета) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СУММА(ОбъектыВРаботеОстатки.КоличествоОстаток) КАК КоличествоОстаток
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	                      |			,
	                      |			Организация = &Организация
	                      |				И (Подразделение = &Подразделение
	                      |					ИЛИ Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))
	                      |				И Объект = &Объект
	                      |				И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки");
	Запрос.УстановитьПараметр("Организация", ДанныеУчета.Организация);
	Запрос.УстановитьПараметр("Подразделение", ДанныеУчета.Подразделение);
	Запрос.УстановитьПараметр("Объект", ДанныеУчета.Объект);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	
	Если Результат.КоличествоОстаток = 0 Тогда
	
		Возврат "НеВРаботе";
	
	КонецЕсли;
	
	Если Результат.КоличествоОстаток = 1 Тогда
	
		Возврат "НаОрганизации";
	
	КонецЕсли;
	
	Возврат "НаПодразделении";

КонецФункции // ()
