
Процедура ПриЗаписи(Отказ, Замещение)
	
	//Блокировка = Новый БлокировкаДанных();
	//ЭлементБлокировки_РН = Блокировка.Добавить("РегистрНакопления.ОбъектыВРаботе");
	//ЭлементБлокировки_РН.Режим = РежимБлокировкиДанных.Исключительный;
	//ЭлементБлокировки_РН.УстановитьЗначение("Подразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	//ЭлементБлокировки_РН.УстановитьЗначение("Сотрудник", Справочники.Пользователи.ПустаяСсылка());
	//
	//ЭлементБлокировки_РС = Блокировка.Добавить("РегистрСведений.ОбъектыВРаботеОрганизации");
	//ЭлементБлокировки_РС.Режим = РежимБлокировкиДанных.Исключительный;
	////ЭлементБлокировки_РС.УстановитьЗначение("Объект", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	////ЭлементБлокировки_РС.УстановитьЗначение("Сотрудник", Справочники.Пользователи.ПустаяСсылка());

	//Блокировка.Заблокировать();
	
	////Организации
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//					  |	ОбъектыВРаботеОстатки.Объект,
	//					  |	ОбъектыВРаботеОстатки.Организация,
	//					  |	ОбъектыВРаботеОрганизации.Объект КАК ОбъектРС,
	//					  |	ОбъектыВРаботеОрганизации.Организация КАК ОрганизацияРС
	//					  |ИЗ
	//					  |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	//					  |			,
	//					  |			Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	//					  |				И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	//					  |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыВРаботеОрганизации КАК ОбъектыВРаботеОрганизации
	//					  |		ПО ОбъектыВРаботеОстатки.Объект = ОбъектыВРаботеОрганизации.Объект
	//					  |			И ОбъектыВРаботеОстатки.Организация = ОбъектыВРаботеОрганизации.Организация
	//					  |ГДЕ
	//					  |	(ОбъектыВРаботеОрганизации.Объект ЕСТЬ NULL 
	//					  |			ИЛИ ОбъектыВРаботеОстатки.Объект ЕСТЬ NULL )"); 
	//Результат = Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() Цикл
	//	Если Не ЗначениеЗаполнено(Результат.Объект) Тогда // = Null Тогда //Надо удалить из РС
	//		Набор = РегистрыСведений.ОбъектыВРаботеОрганизации.СоздатьМенеджерЗаписи();
	//		Набор.Объект = Результат.ОбъектРС;
	//		Набор.Организация = Результат.ОрганизацияРС;
	//		Набор.Прочитать();
	//		Попытка
	//			Набор.Удалить();
	//		Исключение
	//			Отказ = Истина;
	//			Возврат;
	//		КонецПопытки;	
	//			
	//	Иначе //Надо добавить в РС
	//		Набор = РегистрыСведений.ОбъектыВРаботеОрганизации.СоздатьМенеджерЗаписи();
	//		Набор.Объект = Результат.Объект;
	//		Набор.Организация = Результат.Организация;
	//		Попытка 
	//			Набор.Записать();
	//		Исключение
	//			Отказ = Истина;
	//			Возврат;
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЦикла;
	//
	////Подразделение
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ОбъектыВРаботеОстатки.Объект,
	//			   |	ОбъектыВРаботеОстатки.Подразделение,
	//			   |	ОбъектыВРаботеПодразделения.Объект КАК ОбъектРС,               
	//			   |	ОбъектыВРаботеПодразделения.Подразделение КАК ПодразделениеРС
	//			   |ИЗ
	//			   |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	//			   |			,
	//			   |			Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	//			   |				И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	//			   |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыВРаботеПодразделения КАК ОбъектыВРаботеПодразделения
	//			   |		ПО ОбъектыВРаботеОстатки.Объект = ОбъектыВРаботеПодразделения.Объект
	//			   |			И ОбъектыВРаботеОстатки.Подразделение = ОбъектыВРаботеПодразделения.Подразделение
	//			   |ГДЕ
	//			   |	(ОбъектыВРаботеПодразделения.Объект ЕСТЬ NULL 
	//			   |			ИЛИ ОбъектыВРаботеОстатки.Объект ЕСТЬ NULL )"; 
	//Результат = Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() Цикл
	//	Если Не ЗначениеЗаполнено(Результат.Объект) Тогда // = Null Тогда //Надо удалить из РС
	//		Набор = РегистрыСведений.ОбъектыВРаботеПодразделения.СоздатьМенеджерЗаписи();
	//		Набор.Объект = Результат.ОбъектРС;
	//		Набор.Подразделение = Результат.ПодразделениеРС;
	//		Набор.Прочитать();
	//		Попытка
	//			Набор.Удалить();
	//		Исключение
	//			Отказ = Истина;
	//			Возврат;
	//		КонецПопытки;	
	//			
	//	Иначе //Надо добавить в РС
	//		Набор = РегистрыСведений.ОбъектыВРаботеПодразделения.СоздатьМенеджерЗаписи();
	//		Набор.Объект = Результат.Объект;
	//		Набор.Подразделение = Результат.Подразделение;
	//		Попытка 
	//			Набор.Записать();
	//		Исключение
	//			Отказ = Истина;
	//			Возврат;
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЦикла;
	//
	////Сотрудник
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ОбъектыВРаботеОстатки.Объект,
	//			   |	ОбъектыВРаботеОстатки.Сотрудник,
	//			   |	ОбъектыВРаботеСотрудника.Объект КАК ОбъектРС,
	//			   |	ОбъектыВРаботеСотрудника.Сотрудник КАК СотрудникРС
	//			   |ИЗ
	//			   |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	//			   |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыВРаботеСотрудника КАК ОбъектыВРаботеСотрудника
	//			   |		ПО ОбъектыВРаботеОстатки.Объект = ОбъектыВРаботеСотрудника.Объект
	//			   |			И ОбъектыВРаботеОстатки.Сотрудник = ОбъектыВРаботеСотрудника.Сотрудник
	//			   |ГДЕ
	//			   |	(ОбъектыВРаботеСотрудника.Объект ЕСТЬ NULL 
	//			   |			ИЛИ ОбъектыВРаботеОстатки.Объект ЕСТЬ NULL )"; 
	//Результат = Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() Цикл
	//	Если Не ЗначениеЗаполнено(Результат.Объект) Тогда // = Null Тогда //Надо удалить из РС
	//		Набор = РегистрыСведений.ОбъектыВРаботеСотрудника.СоздатьМенеджерЗаписи();
	//		Набор.Объект = Результат.ОбъектРС;
	//		Набор.Сотрудник = Результат.СотрудникРС;
	//		Набор.Прочитать();
	//		Попытка
	//			Набор.Удалить();
	//		Исключение
	//			Отказ = Истина;
	//			Возврат;
	//		КонецПопытки;	
	//			
	//	Иначе //Надо добавить в РС
	//		Набор = РегистрыСведений.ОбъектыВРаботеСотрудника.СоздатьМенеджерЗаписи();
	//		Набор.Объект = Результат.Объект;
	//		Набор.Сотрудник = Результат.Сотрудник;
	//		Попытка 
	//			Набор.Записать();
	//		Исключение
	//			Отказ = Истина;
	//			Возврат;
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЦикла;
	
	//КазанцевЯА , в документе Корректировка регистров он там отсутствует реквизит на который идет проверка
	//Документ Корректировка регистров является также регистратором данного регистра, но не должен подстраиваться под логику,а вносить коррективы из ТЧ 
	МетаданныеОбъекта = ЭтотОбъект.Отбор.Регистратор.Значение.Метаданные();
	Если МетаданныеОбъекта.Реквизиты.Найти("Объекты") <> Неопределено Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ОбъектыВРаботеОстатки.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
		|ГДЕ
		|	ОбъектыВРаботеОстатки.Объект = &Объект
		|	И ОбъектыВРаботеОстатки.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)");
		Для Каждого Стр из ЭтотОбъект.Отбор.Регистратор.Значение.Объекты Цикл
			Запрос.УстановитьПараметр("Объект", Стр.Объект);
			Результат = Запрос.Выполнить().Выбрать();	
			НаборЗаписей = РегистрыСведений.ОбъектыВРаботеСотрудника.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Стр.Объект);
			Пока Результат.Следующий() Цикл
				Запись = НаборЗаписей.Добавить();
				Запись.Объект = Стр.Объект;
				Запись.Сотрудник = Результат.Сотрудник;
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли;
	//
	Справочники.ФункцииДополнительныхСвойств.ПроставитьЗначенияДопСвойств(ЭтотОбъект, 
			Перечисления.ИнициаторыСобытийДляДопСвойств.ОбъектыВРаботе);
КонецПроцедуры
