
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Объект") И Не Параметры.Объект.Пустая() Тогда
		ЭлементОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение = ПолучитьМассивОбъектов(Параметры.Объект);		
		
		//Список.Отбор.Элементы[0].ПравоеЗначение = ПолучитьМассивОбъектов(Параметры.Объект);
		//Список.Отбор.Элементы[0].Использование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивОбъектов(ДО)	
	Запрос = Новый Запрос("ВЫБРАТЬ
						|	ИсполнительныеДокументы.Ссылка
						|ИЗ
						|	Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
						|ГДЕ
						|	ИсполнительныеДокументы.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", ДО);
	Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Массив.Добавить(ДО);
	Возврат Массив;	
КонецФункции
