&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	Объект.ЧитаемыеСимволы = " абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ0123456789-/";
	Объект.ДлинаСловаВСимволах = 0;
	Объект.ДоСтраницы = 1;
	Если Объект.ВидНастройки = "1" Тогда
		Объект.ЗаглавныеБуквыЦифры = Истина;
	КонецЕсли;
	Объект.ИсключитьДО = Истина;
	Объект.ИсключитьКонтрагент = Истина;
	Если Объект.ВидНастройки = "2" Тогда
		Объект.ТипыПрикрепляемыхФайлов = ТипПрикрепляемыхФайловИсполнительныйДокумент();
		Объект.ИЛПерваяСтраница = 1;
		Объект.ИЛПятаяСтраница = 5;
	КонецЕсли;
	Объект.СжиматьИзображаниеДляПросмотра = Истина;
	Объект.Ширина = "827";
	Объект.Высота = "1169";
КонецПроцедуры

&НаСервере
Функция ТипПрикрепляемыхФайловИсполнительныйДокумент()

	Возврат Справочники.ТипыПрикрепляемыхФайлов.ИсполнительныйДокумент; 

КонецФункции // ТипФайла()

&НаКлиенте
Процедура ДОДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДОДата) Тогда
		Объект.ДОДатаДМ = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаДоговораМикрозаймаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДОДатаДМ) Тогда
		Объект.ДОДата = Неопределено;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогДокументовПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если Диалог.Выбрать() Тогда
		Объект.КаталогДокументовПоУмолчанию = Диалог.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ВидНастройки) Тогда
		Объект.ВидНастройки = "1";	
	КонецЕсли;
	
	Если Объект.Контрагенты Тогда
		Элементы.ИсполнительныеДокументы.Доступность = Истина;	
		Элементы.ИсполнительноеПроизводство.Доступность = Истина;
	КонецЕсли;

	Если Объект.ВидНастройки = "2" Тогда
		Элементы.ДлинаСловаВСимволах.Видимость = Ложь;	
		Элементы.ДоСтраницы.Видимость = Ложь;
		Элементы.ГруппаПоискВДолговыхОбязательствах.Видимость = Ложь;
		Элементы.ГруппаПоискВИсполнительныеДокументы.Видимость = Ложь;
		Элементы.ГруппаПоискВИсполнительноеПроизводство.Видимость = Ложь;
		Элементы.Контрагенты.Видимость = Ложь;
		Элементы.КАИЛИ.Видимость = Ложь;
		Элементы.КАИНН.Видимость = Ложь;
		Элементы.КАОдин.Видимость = Ложь;
		Элементы.ИсключитьКонтрагент.Видимость = Ложь;
		Элементы.ИсключитьДО.Видимость = Ложь;
		Элементы.НомерМожетСодержатьТочку.Видимость = Ложь;
		Элементы.ТипыЭлДок.Видимость = Ложь;
		Элементы.ГруппаИЛСтраницы.Видимость = Истина;
		Если Объект.ВсеСтраницы Тогда
			Элементы.ИЛПерваяСтраница.Доступность = Ложь;
			Элементы.ИЛПятаяСтраница.Доступность = Ложь;		
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВыполнятьНа) Тогда
		Объект.ВыполнятьНа = "1";	
	КонецЕсли;
	
	Если Объект.ВыполнятьНа = "2" Тогда
		Элементы.ImageMagickConvert.Видимость = Истина;	
		Элементы.Tesseract.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если Объект.Контрагенты Тогда
		Элементы.ИсполнительныеДокументы.Доступность = Истина;	
		Элементы.ИсполнительноеПроизводство.Доступность = Истина;
		Элементы.ДОЧерезКонтрагента.Доступность = Истина;
	Иначе
		Объект.ИсполнительныеДокументы = Ложь;
		Элементы.ИсполнительныеДокументы.Доступность = Ложь;	
		Объект.ИсполнительноеПроизводство = Ложь;
		Элементы.ИсполнительноеПроизводство.Доступность = Ложь;
		Объект.ДОЧерезКонтрагента = Ложь;
		Элементы.ДОЧерезКонтрагента.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Найти(Объект.ЧитаемыеСимволы,".") > 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Точку запрещенно добавлять в читаемые символы, добавьте точку проблел "". "" в ""Варианты исключения точки""";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура TesseractНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если Диалог.Выбрать() Тогда
		Объект.Tesseract = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ImageMagickConvertНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если Диалог.Выбрать() Тогда
		Объект.ImageMagickConvert = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнятьНаПриИзменении(Элемент)
	Если Объект.ВыполнятьНа = "2" Тогда
		Элементы.ImageMagickConvert.Видимость = Истина;	
		Элементы.Tesseract.Видимость = Истина;
	Иначе
		Элементы.ImageMagickConvert.Видимость = Ложь;	
		Элементы.Tesseract.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидНастройкиПриИзменении(Элемент)
	Если Объект.ВидНастройки = "2" Тогда
		Элементы.ДлинаСловаВСимволах.Видимость = Ложь;	
		Элементы.ДоСтраницы.Видимость = Ложь;
		Элементы.ГруппаПоискВДолговыхОбязательствах.Видимость = Ложь;
		Элементы.ГруппаПоискВИсполнительныеДокументы.Видимость = Ложь;
		Элементы.ГруппаПоискВИсполнительноеПроизводство.Видимость = Ложь;
		Элементы.Контрагенты.Видимость = Ложь;
		Элементы.КАИЛИ.Видимость = Ложь;
		Элементы.КАИНН.Видимость = Ложь;
		Элементы.КАОдин.Видимость = Ложь;
		Элементы.ИсключитьКонтрагент.Видимость = Ложь;
		Элементы.ИсключитьДО.Видимость = Ложь;
		Элементы.НомерМожетСодержатьТочку.Видимость = Ложь;
		Элементы.ТипыЭлДок.Видимость = Ложь;
		Элементы.ГруппаИЛСтраницы.Видимость = Истина;
		Если Объект.ВсеСтраницы Тогда
			Элементы.ИЛПерваяСтраница.Доступность = Ложь;
			Элементы.ИЛПятаяСтраница.Доступность = Ложь;		
		КонецЕсли;
	Иначе
		Элементы.ДлинаСловаВСимволах.Видимость = Истина;	
		Элементы.ДоСтраницы.Видимость = Истина;
		Элементы.ГруппаПоискВДолговыхОбязательствах.Видимость = Истина;
		Элементы.ГруппаПоискВИсполнительныеДокументы.Видимость = Истина;
		Элементы.ГруппаПоискВИсполнительноеПроизводство.Видимость = Истина;
		Элементы.Контрагенты.Видимость = Истина;
		Элементы.КАИЛИ.Видимость = Истина;
		Элементы.КАИНН.Видимость = Истина;
		Элементы.КАОдин.Видимость = Истина;
		Элементы.ИсключитьКонтрагент.Видимость = Истина;
		Элементы.ИсключитьДО.Видимость = Истина;
		Элементы.НомерМожетСодержатьТочку.Видимость = Истина;
		Элементы.ТипыЭлДок.Видимость = Истина;
		Элементы.ГруппаИЛСтраницы.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВсеСтраницыПриИзменении(Элемент)
	Если Объект.ВсеСтраницы Тогда
		Элементы.ИЛПерваяСтраница.Доступность = Ложь;
		Элементы.ИЛПятаяСтраница.Доступность = Ложь;
	Иначе
		Элементы.ИЛПерваяСтраница.Доступность = Истина;
		Элементы.ИЛПятаяСтраница.Доступность = Истина;	
	КонецЕсли;
КонецПроцедуры

