
#Область НастройкиПоУмолчанию

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ВидНастройки) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберете вид настройки";
		Сообщение.Сообщить();
		
		Возврат;
	
	КонецЕсли;
	
	ЗначенияПоУмолчаниюПоВиду(Объект.ВидНастройки);
	ФиксированыеНастройкиПоУмолчанию();
	
	Объект.МинимальнаяДлинаФамилии = РасчитатьДлинуФамилии();

КонецПроцедуры

&НаКлиенте
Процедура ФиксированыеНастройкиПоУмолчанию()

	Объект.ЧитаемыеСимволы = " абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ0123456789-/";
	Объект.ДлинаСловаВСимволах = 0;
	Объект.ДоСтраницы = 1;

	Объект.ИсключитьДО = Истина;
	Объект.ИсключитьКонтрагент = Истина;

	Объект.СжиматьИзображаниеДляПросмотра = Истина;
	Объект.Ширина = "827";
	Объект.Высота = "1169";
	
	Объект.ВыполнятьНа = "2";

КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПоУмолчаниюПоВиду(ВидНастройки)

	Если ВидНастройки = "1" Тогда
		Объект.ЗаглавныеБуквыЦифры = Истина;
	КонецЕсли;

	Если ВидНастройки = "2" Тогда
		Объект.ТипыПрикрепляемыхФайлов = ТипПрикрепляемыхФайловИсполнительныйДокумент();
		Объект.ИЛПерваяСтраница = 1;
		Объект.ИЛПятаяСтраница = 5;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция РасчитатьДлинуФамилии()

	Возврат Справочники.НастройкиПарсингаДокументов.МинимальнаяДлинаФамилии();

КонецФункции // ()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДОДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДОДата) Тогда
		Объект.ДОДатаДМ = Ложь;	
	КонецЕсли;
КонецПроцедуры

// Колбэк Команды ОбработатьРезультатИнициализацииКаталогов
&НаКлиенте
Процедура ОбработатьРезультатИнициализацииКаталогов(Результат, Текст) Экспорт

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ВидНастройки) Тогда
		Объект.ВидНастройки = "1";	
	КонецЕсли;
	
	Если Объект.Контрагенты Тогда
		Элементы.ИсполнительныеДокументы.Доступность = Истина;	
		Элементы.ИсполнительноеПроизводство.Доступность = Истина;
	КонецЕсли;

	Если Объект.ВидНастройки = "2" Тогда
		Элементы.ДлинаСловаВСимволах.Видимость = Ложь;	
		Элементы.ГруппаПоискВДолговыхОбязательствах.Видимость = Ложь;
		Элементы.ГруппаПоискВИсполнительныеДокументы.Видимость = Ложь;
		Элементы.ГруппаПоискВИсполнительноеПроизводство.Видимость = Ложь;
		Элементы.Контрагенты.Видимость = Ложь;
		Элементы.КАИЛИ.Видимость = Ложь;
		Элементы.КАИНН.Видимость = Ложь;
		Элементы.КАОдин.Видимость = Ложь;
		Элементы.ИсключитьКонтрагент.Видимость = Ложь;
		Элементы.ИсключитьДО.Видимость = Ложь;
		Элементы.НомерМожетСодержатьТочку.Видимость = Ложь;
		Элементы.ТипыЭлДок.Видимость = Ложь;
		//Элементы.ГруппаИЛСтраницы.Видимость = Истина;
		//Если Объект.ВсеСтраницы Тогда
		//	Элементы.ИЛПерваяСтраница.Доступность = Ложь;
		//	Элементы.ИЛПятаяСтраница.Доступность = Ложь;		
		//КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВыполнятьНа) Тогда
		Объект.ВыполнятьНа = "2";	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ТипПрикрепляемыхФайловИсполнительныйДокумент()

	Возврат Справочники.ТипыПрикрепляемыхФайлов.ИсполнительныйДокумент; 

КонецФункции // ТипФайла()

&НаКлиенте
Процедура ДатаДоговораМикрозаймаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДОДатаДМ) Тогда
		Объект.ДОДата = Неопределено;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогДокументовПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если Диалог.Выбрать() Тогда
		Объект.КаталогДокументовПоУмолчанию = Диалог.Каталог;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если Объект.Контрагенты Тогда
		Элементы.ИсполнительныеДокументы.Доступность = Истина;	
		Элементы.ИсполнительноеПроизводство.Доступность = Истина;
		Элементы.ДОЧерезКонтрагента.Доступность = Истина;
	Иначе
		Объект.ИсполнительныеДокументы = Ложь;
		Элементы.ИсполнительныеДокументы.Доступность = Ложь;	
		Объект.ИсполнительноеПроизводство = Ложь;
		Элементы.ИсполнительноеПроизводство.Доступность = Ложь;
		Объект.ДОЧерезКонтрагента = Ложь;
		Элементы.ДОЧерезКонтрагента.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Найти(Объект.ЧитаемыеСимволы,".") > 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Точку запрещенно добавлять в читаемые символы, добавьте точку проблел "". "" в ""Варианты исключения точки""";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидНастройкиПриИзменении(Элемент)
	Если Объект.ВидНастройки = "2" Тогда
		Элементы.ДлинаСловаВСимволах.Видимость = Ложь;	
		Элементы.ГруппаПоискВДолговыхОбязательствах.Видимость = Ложь;
		Элементы.ГруппаПоискВИсполнительныеДокументы.Видимость = Ложь;
		Элементы.ГруппаПоискВИсполнительноеПроизводство.Видимость = Ложь;
		Элементы.Контрагенты.Видимость = Ложь;
		Элементы.КАИЛИ.Видимость = Ложь;
		Элементы.КАИНН.Видимость = Ложь;
		Элементы.КАОдин.Видимость = Ложь;
		Элементы.ИсключитьКонтрагент.Видимость = Ложь;
		Элементы.ИсключитьДО.Видимость = Ложь;
		Элементы.НомерМожетСодержатьТочку.Видимость = Ложь;
		Элементы.ТипыЭлДок.Видимость = Ложь;
		//Элементы.ГруппаИЛСтраницы.Видимость = Истина;
		//Если Объект.ВсеСтраницы Тогда
		//	Элементы.ИЛПерваяСтраница.Доступность = Ложь;
		//	Элементы.ИЛПятаяСтраница.Доступность = Ложь;		
		//КонецЕсли;
	Иначе
		Элементы.ДлинаСловаВСимволах.Видимость = Истина;	
		Элементы.ГруппаПоискВДолговыхОбязательствах.Видимость = Истина;
		Элементы.ГруппаПоискВИсполнительныеДокументы.Видимость = Истина;
		Элементы.ГруппаПоискВИсполнительноеПроизводство.Видимость = Истина;
		Элементы.Контрагенты.Видимость = Истина;
		Элементы.КАИЛИ.Видимость = Истина;
		Элементы.КАИНН.Видимость = Истина;
		Элементы.КАОдин.Видимость = Истина;
		Элементы.ИсключитьКонтрагент.Видимость = Истина;
		Элементы.ИсключитьДО.Видимость = Истина;
		Элементы.НомерМожетСодержатьТочку.Видимость = Истина;
		Элементы.ТипыЭлДок.Видимость = Истина;
		//Элементы.ГруппаИЛСтраницы.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВсеСтраницыПриИзменении(Элемент)
	Если Объект.ВсеСтраницы Тогда
		Элементы.ИЛПерваяСтраница.Доступность = Ложь;
		Элементы.ИЛПятаяСтраница.Доступность = Ложь;
	Иначе
		Элементы.ИЛПерваяСтраница.Доступность = Истина;
		Элементы.ИЛПятаяСтраница.Доступность = Истина;	
	КонецЕсли;
КонецПроцедуры






