
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПлатежноеТребованиеЦессия.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлатежноеТребованиеЦессия.Ссылка КАК Ссылка,
	|	ПлатежноеТребованиеЦессия.ВерсияДанных КАК ВерсияДанных,
	|	ПлатежноеТребованиеЦессия.ПометкаУдаления КАК ПометкаУдаления,
	|	ПлатежноеТребованиеЦессия.Номер КАК Номер,
	|	ПлатежноеТребованиеЦессия.Дата КАК Дата,
	|	ПлатежноеТребованиеЦессия.Проведен КАК Проведен,
	|	ПлатежноеТребованиеЦессия.Договор КАК Договор,
	|	ПлатежноеТребованиеЦессия.Должник КАК Должник,
	|	ПлатежноеТребованиеЦессия.Цедент КАК Цедент,
	|	ПлатежноеТребованиеЦессия.Сумма КАК Сумма
	|ИЗ
	|	Документ.ПлатежноеТребованиеЦессия КАК ПлатежноеТребованиеЦессия
	|ГДЕ
	|	ПлатежноеТребованиеЦессия.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура СохранитьВPDF(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(СохранитьВPDF)
	Макет = Документы.ПлатежноеТребованиеЦессия.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|
	|ИЗ
	|	Документ.ПлатежноеТребованиеЦессия КАК ПлатежноеТребованиеЦессия
	|ГДЕ
	|	ПлатежноеТребованиеЦессия.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
