
Перем СтарыйСотрудник;
Перем Объект;

Процедура ПриЗаписи(Отказ, Замещение)
	Флаг = Ложь;
	Попытка
		Объект = ЭтотОбъект[0].Объект;
		Сотрудник = ЭтотОбъект[0].Пользователь;
		ТипСотрудника = ЭтотОбъект[0].ТипСотрудника;
	Исключение
		Флаг = Истина;
	КонецПопытки;
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.ИсполнительныеДокументы") ИЛИ
			ТипЗнч(Объект) = Тип("СправочникСсылка.УслугиПоДоговору") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Проверка на В РАБОТЕ ОРГАНИЗАЦИИ
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ОбъектыВРаботеОстатки.Объект
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Объект = &Объект) КАК ОбъектыВРаботеОстатки");
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Объект", Объект);
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
			
	//Передача в работу другого сотрудника	
	Если Не СтарыйСотрудник.Пустая() Тогда
		//Определяем, у старого сотрудника проходит ли это дело по каким-либо еще ролям
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ОтветственныеСотрудники.Объект
		               |ИЗ
		               |	РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
		               |ГДЕ
		               |	ОтветственныеСотрудники.Пользователь = &Пользователь
		               |	И ОтветственныеСотрудники.Объект = &Объект
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ ПЕРВЫЕ 1
		               |	СотрудникиВПомощь.Объект
		               |ИЗ
		               |	РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
		               |ГДЕ
		               |	СотрудникиВПомощь.Пользователь = &Пользователь
		               |	И СотрудникиВПомощь.Объект = &Объект";
		Запрос.УстановитьПараметр("Объект", Объект);			   
		Запрос.УстановитьПараметр("Пользователь", СтарыйСотрудник);		
		Если Запрос.Выполнить().Пустой() Тогда
			//убираем из работы старого сотрудника
			ОбъектДок = Документы.АктПередачи.СоздатьДокумент();
			ОбъектДок.Дата = ТекущаяДата() + 1;
			ОбъектДок.Автор = ПараметрыСеанса.ТекущийПользователь;
			ОбъектДок.СотрудникПередающий = СтарыйСотрудник;
			ОбъектДок.ПодразделениеПередающее = ОбъектДок.СотрудникПередающий.Подразделение;
			ОбъектДок.Организация = ОбъектДок.ПодразделениеПередающее.Владелец;
			ОбъектДок.НеНазначатьСотрудников = Истина;
			НоваяСтрока = ОбъектДок.Объекты.Добавить();
			НоваяСтрока.Объект = Объект;
							
			Попытка
				ОбъектДок.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ОписаниеОшибки());
				Отказ = Истина;
				Возврат;
			КонецПопытки;
			//
			СтарыйСотрудник = Справочники.Пользователи.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Если Флаг Тогда
		Возврат;
	КонецЕсли;
	
	//проверка на наличие в работе нового сотрудника
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбъектыВРаботеОстатки.Объект
	               |ИЗ
	               |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	               |			,
	               |			Объект = &Объект
	               |				И Сотрудник = &Сотрудник) КАК ОбъектыВРаботеОстатки";
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Если Запрос.Выполнить().Пустой() Тогда
		//в работе нового сотрудника его нет, создаем документ, вносим ему в работу
		ОбъектДок = Документы.АктПередачи.СоздатьДокумент();
		ОбъектДок.Дата = ТекущаяДата() + 1;
		ОбъектДок.Автор = ПараметрыСеанса.ТекущийПользователь;
		ОбъектДок.СотрудникПринимающий = Сотрудник;
		ОбъектДок.ПодразделениеПринимающее = ОбъектДок.СотрудникПринимающий.Подразделение;
		ОбъектДок.Организация = ОбъектДок.ПодразделениеПринимающее.Владелец;
		ОбъектДок.НеНазначатьСотрудников = Истина;
		НоваяСтрока = ОбъектДок.Объекты.Добавить();
		НоваяСтрока.Объект = Объект;
						
		Попытка
			ОбъектДок.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(ОписаниеОшибки());
			Отказ = Истина;
			Возврат;
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	СтарыйСотрудник = Справочники.Пользователи.ПустаяСсылка();
	
	Набор = РегистрыСведений.СотрудникиВПомощь.СоздатьМенеджерЗаписи();
	Попытка
		Набор.Объект = ЭтотОбъект[0].Объект;
		Набор.ТипСотрудника = ЭтотОбъект[0].ТипСотрудника;
		Набор.Пользователь = ЭтотОбъект[0].Пользователь;	
	Исключение              
		Возврат;
	КонецПопытки;
	Набор.Прочитать();
	
	Если ЗначениеЗаполнено(Набор.Пользователь) Тогда
		СтарыйСотрудник = Набор.Пользователь;
		Объект = Набор.Объект;
	КонецЕсли;
КонецПроцедуры
