
Функция НастройкиПользователяПочтыРФ() Экспорт

	Токен = ПолучитьДанныеТокенИлиКлюч().Токен; 
	Ключ = ПолучитьДанныеТокенИлиКлюч().Ключ; 
	
	СерверПочтыРФ = ПолучитьСерверПочтаРФ();      
	РесурсПочтаРФ = АдресПараметрыПользователя();
	
	HTTPЗапрос = ЗапросПоАдресуКПочтеРФ(Токен, Ключ, РесурсПочтаРФ); 
	HTTP = СоздатьЗащищенноеСоединение(СерверПочтыРФ);  
	ОтветHTTP = ПолучитьОтветJSON(HTTP, HTTPЗапрос);
	
	Возврат ОтветHTTP;
	
КонецФункции 

Функция НастройкиКоличествоЗапросовПочтыРФ() Экспорт

	Токен = ПолучитьДанныеТокенИлиКлюч().Токен; 
	Ключ = ПолучитьДанныеТокенИлиКлюч().Ключ; 
	
	СерверПочтыРФ = ПолучитьСерверПочтаРФ();      
	РесурсПочтаРФ = АдресКоличествоЗапросов();
	
	HTTPЗапрос = ЗапросПоАдресуКПочтеРФ(Токен, Ключ, РесурсПочтаРФ); 
	HTTP = СоздатьЗащищенноеСоединение(СерверПочтыРФ);  
	ОтветHTTP = ПолучитьОтветJSON(HTTP, HTTPЗапрос);
	
	Возврат ОтветHTTP;
	
КонецФункции 

Функция ПолучитьСерверПочтаРФ() Экспорт
	
	Сервер = "otpravka-api.pochta.ru";
	Возврат Сервер;	
	
КонецФункции 

Функция АдресПараметрыПользователя() Экспорт
	
	Ресурс = "/1.0/settings";
	Возврат Ресурс;	
	
КонецФункции 

Функция АдресКоличествоЗапросов() Экспорт
	
	Ресурс = "/1.0/settings/limit";
	Возврат Ресурс;	
	
КонецФункции 

Функция ПолучитьОтветJSON(HTTP, HTTPЗапрос) 
	
	СчетчикПопыток = 1;
	Пока СчетчикПопыток < 20 Цикл
		Попытка
			Ответ = HTTP.Получить(HTTPЗапрос);
			Прервать;
		Исключение
			СчетчикПопыток = СчетчикПопыток + 1;
		КонецПопытки;	
	КонецЦикла;
	Если СчетчикПопыток >= 20 Тогда
		ВызватьИсключение "Не удалось установить соединение с Почтой РФ!";	
	КонецЕсли;
	
	Возврат Ответ.ПолучитьТелоКакСтроку("UTF-8"); 
	
КонецФункции

Функция СоздатьЗащищенноеСоединение(Сервер)
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	HTTP = Новый HTTPСоединение(Сервер, , , , , , SSL);  
	Возврат HTTP;
	
КонецФункции

Функция БазовыйЗапросКПочтеРФ(Токен, Ключ)
	
	Запрос = Новый HTTPЗапрос;
	Запрос.Заголовки.Вставить("Content-Type", "application/json;charset=UTF-8");
	Запрос.Заголовки.Вставить("Authorization", "AccessToken " + Токен);
	Запрос.Заголовки.Вставить("X-User-Authorization", "Basic " + Ключ);
	Возврат Запрос;
	
КонецФункции

Функция ЗапросПоАдресуКПочтеРФ(Токен, Ключ, Ресурс)
	
 	БазовыйЗапрос = БазовыйЗапросКПочтеРФ(Токен, Ключ);
	БазовыйЗапрос.АдресРесурса = Ресурс;
	Возврат БазовыйЗапрос;
	
КонецФункции

Функция ПолучитьДанныеТокенИлиКлюч()
	
	Данные = Новый Структура();
	Данные.Вставить("Токен", бит_ИнтеграцияПочтаРФ.ПолучитьТокенИлиКлюч("токен")); 
	Данные.Вставить("Ключ", бит_ИнтеграцияПочтаРФ.ПолучитьТокенИлиКлюч("ключ")); 	
	Возврат Данные;
	
КонецФункции 






