
&НаКлиенте
Асинх Процедура СоздатьУникальныеЗначенияПоГОСТНаСервере()
	
	ОбещаниеАдаптеры  = ПолучитьИнформациюОСетевыхАдаптерахАсинх();
	РезАдаптеры = Ждать ОбещаниеАдаптеры;
	Адаптер = РезАдаптеры[0];	
	АдресСетевойКарты = Адаптер.MACАдрес; 
	
	Для Каждого СтрокаУстановки ИЗ Объект.ОбъектыДляУстановки Цикл 
		
		УУИД = ОбъектыСервер.СформироватьUUIDver1(ОбщегоНазначенияКлиент.ДатаСеанса(), АдресСетевойКарты);
		UIDНБКИ = УУИД + "-" + ОбъектыСервер.СгенерироватьКонтрольныйСимвол(УУИД); 
		СтрокаУстановки.УИДпоГОСТ = UIDНБКИ;
		
		
	КонецЦикла;	
	Объект.ТипУникальногоЗначения = ОбъектыСервер.РазыменоватьСсылку(Неопределено, "Перечисления.НБКИ_ТипыУникальныхЗначений.УИДПоГОСТ");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУникальныеЗначенияПоГОСТ(Команда)
	СоздатьУникальныеЗначенияПоГОСТНаСервере();
КонецПроцедуры  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ОбъектыДляУстановкиСоздатьУникальныеЗначенияПоГОСТ.Доступность = НЕ Объект.Проведен;
КонецПроцедуры
