Функция Создать() Экспорт

	СведенияОбИмуществе = СоздатьДокумент();
	СведенияОбИмуществе.Дата = ТекущаяДата();
	
	Возврат СведенияОбИмуществе;

КонецФункции // ()

// По переданной структуре заполняет документ,
//   в случае не корректных данных - вызывает Исключение
//
// Параметры:
//  Элемент  - ДокументОбъект.СведенияОбИмуществе - Документ для заполнения
//
//  Данные  - Структура - Параметры для заполнения документа
//    Контрагент - СправочникСсылка.Контрагенты - Обязателен к заполнению
//    Имущество - СправочникСсылка.Транспорт,
//                СправочникСсылка.Помещения,
//                СправочникСсылка.ЗемельныеУчастки - 
//    Источник - СправочникСсылка.ИсточникиСведений - Обязателен к заполнению
//    Сведения - Коллекция - Обязательные поля [Свойство, Значение]
//
// Возвращаемое значение:
//   ДокументОбъект.СведенияОбИмуществе   - Возвращает заполненый документ
//     В случае не корректных данных вызывает Исключение
Функция Заполнить(Элемент, Данные) Экспорт

	Если ТипЗнч(Элемент) <> Тип("ДокументОбъект.СведенияОбИмуществе") Тогда
	
		ВызватьИсключение "Не корректный документ";
	
	КонецЕсли;
	
	Источник = Данные["Источник"];
	Если Не КорректноеДанное(Источник, Тип("СправочникСсылка.ИсточникиСведений")) Тогда
	
		ВызватьИсключение "Не корректный источник";
	
	КонецЕсли;
	Элемент.УстановитьИсточник(Источник);
	
	Имущество = Данные["Имущество"];
	ТипыИмущества = Новый Массив;
	ТипыИмущества.Добавить(Тип("СправочникСсылка.Транспорт"));
	ТипыИмущества.Добавить(Тип("СправочникСсылка.Помещения"));
	ТипыИмущества.Добавить(Тип("СправочникСсылка.ЗемельныеУчастки"));
	Если Не КорректноеДанное(Имущество, ТипыИмущества) Тогда
	
		ВызватьИсключение "Не корректное имущество: " + Имущество.Метаданные().Синоним;
	
	КонецЕсли;
	Элемент.УстановитьИмущество(Имущество);
	
	Возврат Элемент.УстановитьПоля(Данные["Сведения"]);

КонецФункции // ()

Функция Провести(СведенияОбИмуществе) Экспорт

	Попытка
	
		СведенияОбИмуществе.Записать(РежимЗаписиДокумента.Проведение);
	
	Исключение
		ВызватьИсключение "Ошибка при проведении документа: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат СведенияОбИмуществе.Ссылка;

КонецФункции // ()

#Область Техническая

Функция КорректноеДанное(Элемент, НужныеТипы)

	Если Не УправлениеДанными.СодержитТип(НужныеТипы, ТипЗнч(Элемент)) Тогда
	
		Возврат Ложь;
	
	КонецЕсли;

	Если Элемент.Пустая() Тогда
	
		Возврат Ложь;
	
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // ()


#КонецОбласти


