Функция ПолучитьСчетОрганизацииТекущегоПользователя() Экспорт

	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Организация = ТекущийПользователь.Организация;
	Банк = Организация.Банк;
	Если ЗаполненРасчетныйСчет(Банк) Тогда
	
		Возврат Банк.РасчетныйСчет;
	
	КонецЕсли;
	
	Возврат "";

КонецФункции // ()

Функция ЗаполненРасчетныйСчет(Банк)

	Возврат ЗначениеЗаполнено(Банк) И ЗначениеЗаполнено(Банк.РасчетныйСчет);

КонецФункции // ()

// Возвращает организацию по умолчанию.
// Выбирается организация текущего пользователя
//
// Возвращаемое значение:
//   ОпределяемыйТип.Организация
//
Функция ОрганизацияПоУмолчанию() Экспорт

	Возврат ПараметрыСеанса.ТекущийПользователь.Организация;

КонецФункции // ()
