
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Макет = Отчеты.ОтчетПоИсполнительному.ПолучитьМакет("Макет");
	ТабДок.Очистить();
	
    ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ПериодОтчетаС = Строка(Формат(НачалоПериода, "ДЛФ=Д"));
	ОбластьЗаголовок.Параметры.ПериодОтчетаПо = Строка(Формат(КонецПериода, "ДЛФ=Д"));
	ТабДок.Вывести(ОбластьЗаголовок);	
	
	ОбластьШапка = ?(Отчет.КолонкаКредитор, Макет.ПолучитьОбласть("Шапка1"), Макет.ПолучитьОбласть("Шапка"));
	ТабДок.Вывести(ОбластьШапка);
	
	ТабДок.ФиксацияСверху = 4;
	ОбластьДанных = ?(Отчет.КолонкаКредитор, Макет.ПолучитьОбласть("ДанныеОтчета1"), Макет.ПолучитьОбласть("ДанныеОтчета"));
	
	//Подготовка таблицы с ДО подходящими по стадии
	ТипыМ = Новый Массив();
	ТипыМ.Добавить(Справочники.ТипыМероприятий.ПустаяСсылка());
	ТипыМ.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0068"));
	ТипыМ.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0069"));
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект КАК ДолговоеОбязательство
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	                      |			,
	                      |			Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	                      |				И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	                      |		ПО ОбъектыВРаботеОстатки.Объект = Мероприятие.Объект.Владелец
	                      |			И ((НЕ Мероприятие.ПометкаУдаления))
	                      |			И ((НЕ Мероприятие.ТипМероприятия В (&ТипыМ)))
	                      |			И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ (НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления)
	                      |					И Мероприятие.БизнесПроцесс.РезультатБПНаименование <> ""Отменено"")
	                      |			И ((НЕ Мероприятие.Объект.ОшибкаИД))
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ОбъектыВРаботеОстатки.Объект");
	Запрос.УстановитьПараметр("ТипыМ", ТипыМ);					  
	ТаблицаДО = Запрос.Выполнить().Выгрузить();
	ОтобратьПоСтадии(ТаблицаДО);
	ОтобратьПоРайонуСП(ТаблицаДО);

	Если Должник.Пустая() И Контрагент.Пустая() И Кредитор.Пустая() Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаДО.ДолговоеОбязательство,
		               |	ТаблицаДО.СтадияФлаг,
					   |	ТаблицаДО.СлужбаСП
		               |ПОМЕСТИТЬ ТаблицаДО
		               |ИЗ
		               |	&ТаблицаДО КАК ТаблицаДО";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаДО.ДолговоеОбязательство,
		               |	ТаблицаДО.СтадияФлаг,
					   |	ТаблицаДО.СлужбаСП					   
		               |ПОМЕСТИТЬ ТаблицаДОВрем
		               |ИЗ
		               |	&ТаблицаДО КАК ТаблицаДО
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаДОВрем.ДолговоеОбязательство,
		               |	ТаблицаДОВрем.СтадияФлаг,
					   |	ТаблицаДОВрем.СлужбаСП
		               |ПОМЕСТИТЬ ТаблицаДО
		               |ИЗ
		               |	ТаблицаДОВрем КАК ТаблицаДОВрем
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.Контрагенты КАК ДолговыеОбязательстваКонтрагенты
		               |		ПО ТаблицаДОВрем.ДолговоеОбязательство = ДолговыеОбязательстваКонтрагенты.Ссылка
		               |			И (ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Должник)
		               |					И ДолговыеОбязательстваКонтрагенты.Значение = &Должник
		               |				ИЛИ ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Контрагент)
		               |					И ДолговыеОбязательстваКонтрагенты.Значение = &Контрагент
		               |				ИЛИ ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Кредитор)
		               |					И ДолговыеОбязательстваКонтрагенты.Значение = &Кредитор)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаДОВрем.ДолговоеОбязательство,
		               |	ТаблицаДОВрем.СтадияФлаг,
					   |	ТаблицаДОВрем.СлужбаСП
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(*) >= &КолВо";	
		Запрос.УстановитьПараметр("Должник", Должник);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Кредитор", Кредитор);
		Запрос.УстановитьПараметр("КолВо", Число(Не Должник.Пустая()) + Число(Не Контрагент.Пустая()) + 
				Число(Не Кредитор.Пустая()))
	КонецЕсли;
	Запрос.УстановитьПараметр("ТаблицаДО", ТаблицаДО);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.ВыполнитьПакет();
	//
	
	///////////////////////////////////////
	// Выбор должника и номера закладной //
	///////////////////////////////////////
	Если Сотрудник.Пустая() Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОбъектыВРаботеОстатки.Объект.ВладелецДолжник КАК Должник,
		               |	ОбъектыВРаботеОстатки.Объект.ВладелецКредитор КАК Кредитор,
		               |	ОбъектыВРаботеОстатки.Объект КАК ДолговоеОбязательство,
		               |	ОбъектыВРаботеОстатки.Объект.Должник КАК ДолжникНаименование,
		               |	ОбъектыВРаботеОстатки.Объект.Кредитор КАК КредиторНаименование,
		               |	ТаблицаДО.СтадияФлаг,
		               |	ТаблицаДО.СлужбаСП
		               |ИЗ
		               |	РегистрНакопления.ОбъектыВРаботе.Остатки(
		               |			&ДатаОтчета,
		               |			Подразделение = &Подразделение
		               |				И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяССылка)
		               |				И (Объект = &ДолговоеОбязательство
		               |					ИЛИ &ПустоеДО)) КАК ОбъектыВРаботеОстатки
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДО КАК ТаблицаДО
		               |		ПО ОбъектыВРаботеОстатки.Объект = ТаблицаДО.ДолговоеОбязательство
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДопРеквизитыРегион
		               |		ПО ОбъектыВРаботеОстатки.Объект = ДопРеквизитыРегион.Ссылка
		               |			И (ДопРеквизитыРегион.Свойство.Код = ""     0125"")
		               |			И (ДопРеквизитыРегион.Значение = &Регион
		               |				ИЛИ &НезаполненРегион)
		               |ГДЕ
		               |	(НЕ ОбъектыВРаботеОстатки.Объект.ПометкаУдаления)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Должник";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОбъектыВРаботеОстатки.Объект.ВладелецДолжник КАК Должник,
		               |	ОбъектыВРаботеОстатки.Объект.ВладелецКредитор КАК Кредитор,
		               |	ОбъектыВРаботеОстатки.Объект КАК ДолговоеОбязательство,
		               |	ОбъектыВРаботеОстатки.Объект.Должник КАК ДолжникНаименование,
		               |	ОбъектыВРаботеОстатки.Объект.Кредитор КАК КредиторНаименование,
		               |	ТаблицаДО.СтадияФлаг,
		               |	ТаблицаДО.СлужбаСП
		               |ИЗ
		               |	РегистрНакопления.ОбъектыВРаботе.Остатки(
		               |			&ДатаОтчета,
		               |			Подразделение = &Подразделение
		               |				И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяССылка)
		               |				И (Объект = &ДолговоеОбязательство
		               |					ИЛИ &ПустоеДО)) КАК ОбъектыВРаботеОстатки
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДО КАК ТаблицаДО
		               |		ПО ОбъектыВРаботеОстатки.Объект = ТаблицаДО.ДолговоеОбязательство
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
		               |		ПО ОбъектыВРаботеОстатки.Объект = ОтветственныеСотрудники.Объект
		               |			И (ОтветственныеСотрудники.Пользователь = &Пользователь)
		               |			И (ОтветственныеСотрудники.ТипСотрудника.Код = ""     0002"")
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДопРеквизитыРегион
		               |		ПО ОбъектыВРаботеОстатки.Объект = ДопРеквизитыРегион.Ссылка
		               |			И (ДопРеквизитыРегион.Свойство.Код = ""     0125"")
		               |			И (ДопРеквизитыРегион.Значение = &Регион
		               |				ИЛИ &НезаполненРегион)
		               |ГДЕ
		               |	(НЕ ОбъектыВРаботеОстатки.Объект.ПометкаУдаления)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Должник";
	КонецЕсли;
						  
	Запрос.УстановитьПараметр("ДатаОтчета", КонецДня(ДатаОтчета));
	Запрос.УстановитьПараметр("Пользователь", Сотрудник);
	Запрос.УстановитьПараметр("Кредитор", Кредитор);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Должник", Должник);
	Запрос.УстановитьПараметр("ДолговоеОбязательство", ДолговоеОбязательство);
	Запрос.УстановитьПараметр("ПустоеДО", ДолговоеОбязательство.Пустая());
	Запрос.УстановитьПараметр("Регион", Регион);
	Запрос.УстановитьПараметр("НеЗаполненРегион", Регион.Пустая());

	МассивРезультатовМС = Новый Массив();	
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0220"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0315"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0221"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0183"));	
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0222"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0184"));
	Запрос.УстановитьПараметр("РезультатМС", МассивРезультатовМС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	НомерЗаписи = 0;
	Пока Выборка.Следующий() Цикл
		НомерЗаписи = НомерЗаписи + 1;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Мероприятие.ТипМероприятия,
		               |	Мероприятие.ФактическаяДата КАК ФактическаяДата,
		               |	Мероприятие.Комментарий,
		               |	Мероприятие.Ссылка
		               |ИЗ
		               |	Задача.Мероприятие КАК Мероприятие
		               |ГДЕ
		               |	Мероприятие.ФактическаяДата МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И Мероприятие.Выполнена
		               |	И (Мероприятие.Объект = &ДО
	                   |			ИЛИ Мероприятие.Объект.Владелец = &ДО)
		               |	И (НЕ Мероприятие.ПометкаУдаления)
		               |	И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
		               |			ИЛИ (НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления))
	                   |	И НЕ Мероприятие.ВыполненоКакНеАктуальное
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ФактическаяДата";
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
		Запрос.УстановитьПараметр("ТекДата", КонецДня(ДатаОтчета));
		Запрос.УстановитьПараметр("ДО", Выборка.ДолговоеОбязательство);
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		Выборка2 = Запрос.Выполнить().Выбрать();
		
		
		СтрокаДействий = "";
		Если Сред(Выборка.СтадияФлаг, 1, 1) = "1" Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	Мероприятие.Результат.Код КАК Код
			               |ИЗ
			               |	Задача.Мероприятие КАК Мероприятие
			               |ГДЕ
			               |	Мероприятие.Выполнена
			               |	И Мероприятие.Результат В(&РезультатМС)
			               |	И (Мероприятие.Объект = &ДО
	                       |			ИЛИ Мероприятие.Объект.Владелец = &ДО)
			               |	И Мероприятие.ДатаВыполнения < &ТекДата
			               |	И (НЕ Мероприятие.ПометкаУдаления)
			               |	И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
			               |			ИЛИ (НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления))
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Мероприятие.ФактическаяДата";
			Результат3 = Запрос.Выполнить().Выбрать();
			ТекМС = Ложь;
			Пока Результат3.Следующий() Цикл
				Если Результат3.Код = "     0220" ИЛИ Результат3.Код = "     0315" Тогда
					ТекМС = Истина;
					СтрокаДействий = СтрокаДействий + "УТВЕРЖДЕНО МИРОВОЕ СОГЛАШЕНИЕ" + Символы.ПС;
				ИначеЕсли (Результат3.Код = "     0221" ИЛИ Результат3.Код = "     0183") И ТекМС Тогда
					ТекМС = Ложь;
					СтрокаДействий = СокрЛП(СтрокаДействий) + ", ИСПОЛНЕНО" + Символы.ПС;
				ИначеЕсли (Результат3.Код = "     0222" ИЛИ Результат3.Код = "     0184") И ТекМС Тогда
					ТекМС = Ложь;
					СтрокаДействий = СокрЛП(СтрокаДействий) + ", НЕ ИСПОЛНЕНО" + Символы.ПС;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Сред(Выборка.СтадияФлаг, 2, 1) = "1" Тогда
			СтрокаДействий = СтрокаДействий + "ОТКАЗ ОТ ИСКА" + Символы.ПС;
		КонецЕсли;
		Если Сред(Выборка.СтадияФлаг, 3, 1) = "1" Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	МероприятиеДополнительныеРеквизиты.Ссылка,
			               |	МероприятиеДополнительныеРеквизиты.Значение
			               |ИЗ
			               |	Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
			               |ГДЕ
			               |	(МероприятиеДополнительныеРеквизиты.Ссылка.Объект = &ДО
			               |			ИЛИ МероприятиеДополнительныеРеквизиты.Ссылка.Объект.Владелец = &ДО)
			               |	И МероприятиеДополнительныеРеквизиты.Ссылка.Выполнена
			               |	И МероприятиеДополнительныеРеквизиты.Свойство = &Свойство
			               |	И МероприятиеДополнительныеРеквизиты.Значение >= &ТекДата
			               |	И МероприятиеДополнительныеРеквизиты.Ссылка.ДатаВыполнения < &ТекДата
			               |	И НЕ МероприятиеДополнительныеРеквизиты.Ссылка.ПометкаУдаления
			               |	И (МероприятиеДополнительныеРеквизиты.Ссылка.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
			               |			ИЛИ НЕ МероприятиеДополнительныеРеквизиты.Ссылка.БизнесПроцесс.ПометкаУдаления)
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	МероприятиеДополнительныеРеквизиты.Значение";
			Запрос.УстановитьПараметр("Свойство", 
					ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду("     2051")); //ДопРеквизитыМероприятий
			Результат3 = Запрос.Выполнить().Выбрать();
			Пока Результат3.Следующий() Цикл
				СтрокаДействий = СтрокаДействий + "ПРЕДОСТАВЛЕНА ОТСРОЧКА ДО " + Формат(Результат3.Значение, "ДЛФ=D") + Символы.ПС;
			КонецЦикла;	
		КонецЕсли;
		Если Сред(Выборка.СтадияФлаг, 4, 1) = "1" Тогда
			СтрокаДействий = СтрокаДействий + "ПОЛУЧЕНО СВИДЕТЕЛЬСТВО О РЕГИСТРАЦИИ ПРАВА СОБСТВЕННОСТИ" + Символы.ПС;
		КонецЕсли;
		Если Сред(Выборка.СтадияФлаг, 5, 1) = "1" Тогда
			СтрокаДействий = СтрокаДействий + "ПЕРЕЧИСЛЕНЫ ДЕНЕЖНЫЕ СРЕДСТВА" + Символы.ПС;
		КонецЕсли;
		ОбластьДанных.Параметры.Комментарии = СокрЛП(СтрокаДействий);
		
		
		//СтрСокр_0 - текущий комментарий
		//СтрСокр_1 - результат функции комментария
		//Стр_0 - предыдущий комментарий
		//Стр_1 - предыдущий результат функции комментария
		Номер = 1;
		Стр_0 = "";	
		Стр_1 = "";
		Стр_ = "";
		СтрокаДействий = "";
		Пока Выборка2.Следующий() Цикл
			СтрСокр_0 = СокрЛП(Выборка2.Комментарий);
			СтрСокр_1 = ?(Выборка2.Ссылка.Результат.ШаблонКомментария.Пустая(), "", 
					Справочники.ФункцииКомментариев.ВычислитьФункцию(
						Выборка2.Ссылка.Результат.ШаблонКомментария.Функция, Выборка2.Ссылка, ""));
			
			Если СтрСокр_0 <> "" И Стр_0 <> СтрСокр_0 И (Стр_1 <> СтрСокр_1 ИЛИ СтрСокр_1 = "") И Стр_ <> СтрСокр_0 Тогда
				Стр = Формат(Номер, "ЧГ=") + ") " + СтрСокр_0;
				СтрокаДействий = СтрокаДействий + Стр + Символы.ПС;
				Номер = Номер + 1;
				Стр_0 = СтрСокр_0;
				Стр_1 = СтрСокр_1;
				Стр_ = СтрСокр_0;
				
			ИначеЕсли СтрСокр_0 = "" И СтрСокр_1 <> "" И Стр_1 <> СтрСокр_1 И Стр_ <> СтрСокр_1 Тогда
				Стр = Формат(Номер, "ЧГ=") + ") " + СтрСокр_1;
				СтрокаДействий = СтрокаДействий + Стр + Символы.ПС;
				Номер = Номер + 1;
				Стр_0 = СтрСокр_1;
				Стр_1 = СтрСокр_1;
				Стр_ = СтрСокр_1;
				
			Иначе
				Стр_1 = СтрСокр_1;			
			КонецЕсли;		
		КонецЦикла;
		
		
		ОбластьДанных.Параметры.Номер = НомерЗаписи; 
		ОбластьДанных.Параметры.Должник = Выборка.Должник;
		ОбластьДанных.Параметры.ДолжникРас = Выборка.ДолжникНаименование;
		Если Отчет.КолонкаКредитор Тогда
			ОбластьДанных.Параметры.Кредитор = Выборка.Кредитор;		
			ОбластьДанных.Параметры.КредиторРас = Выборка.КредиторНаименование;
		КонецЕсли;
		ОбластьДанных.Параметры.ДолговоеОбязательство = Выборка.ДолговоеОбязательство;
		ОбластьДанных.Параметры.Действия = СокрЛП(СтрокаДействий);		
		
		
		ЗапросМ = Новый Запрос("ВЫБРАТЬ
		                       |	ТабКод.КодТипаМероприятия,
		                       |	ТабКод.КодДопРеквизитаМероприятия,
		                       |	ТабКод.НомерКолонки,
		                       |	ТабКод.КодРезультата
		                       |ПОМЕСТИТЬ ТабКод
		                       |ИЗ
		                       |	&ТабКод КАК ТабКод
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ
		                       |	Мероприятие.БизнесПроцесс КАК БизнесПроцесс,
		                       |	Мероприятие.Схема КАК Схема,
		                       |	Мероприятие.ОбъектРодитель КАК ОбъектРодитель,
		                       |	Мероприятие.ФактическаяДата,
		                       |	Мероприятие.ТипМероприятия.Код КАК ТипМероприятияКод,
		                       |	Мероприятие.Результат.Код КАК РезультатКод,
		                       |	МероприятиеДополнительныеРеквизиты.Свойство.Код КАК СвойствоКод,
		                       |	МероприятиеДополнительныеРеквизиты.Значение КАК Значение
		                       |ПОМЕСТИТЬ ТаблицаМ
		                       |ИЗ
		                       |	Задача.Мероприятие КАК Мероприятие
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
		                       |		ПО (МероприятиеДополнительныеРеквизиты.Ссылка = Мероприятие.Ссылка)
		                       |ГДЕ
		                       |	ВЫБОР ТИПЗНАЧЕНИЯ(Мероприятие.Объект)
		                       |			КОГДА ТИП(Справочник.ИсполнительныеДокументы)
		                       |				ТОГДА Мероприятие.Объект.Владелец = &ДО
		                       |						И (НЕ Мероприятие.Объект.ОшибкаИД)
		                       |			ИНАЧЕ Мероприятие.Объект = &ДО
		                       |		КОНЕЦ
		                       |	И Мероприятие.ФактическаяДата <= &ДатаОтчета
		                       |	И (НЕ Мероприятие.ПометкаУдаления)
		                       |	И Мероприятие.Выполнена
		                       |	И (НЕ Мероприятие.ВыполненоКакНеАктуальное)
		                       |	И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
		                       |			ИЛИ (НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления))");				
		ЗапросМ.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	    ЗапросМ.УстановитьПараметр("ТабКод", ТабКод.Выгрузить());
		ЗапросМ.УстановитьПараметр("ДО", Выборка.ДолговоеОбязательство);
		ЗапросМ.УстановитьПараметр("ДатаОтчета", КонецДня(ДатаОтчета));
	    ЗапросМ.ВыполнитьПакет();
		
		ОбластьДанных.Параметры.ДатаВозбужденияИП = ЗаписатьКолонку(ЗапросМ, 4, Выборка.ДолговоеОбязательство); // Дата возбужд. исп пправа.
		СтадияИДата = ВычислитьСтадиюИДату(Выборка.ДолговоеОбязательство);
		ОбластьДанных.Параметры.ДатаДействия = СтадияИДата.Дата;
		ОбластьДанных.Параметры.СтадияИП     = СтадияИДата.Стадия;
		ОснованиеИДата = ВычислитьОснованиеИДату(Выборка.ДолговоеОбязательство);
		ОбластьДанных.Параметры.ДатаОкончанияИП      = ОснованиеИДата.Дата;
		ОбластьДанных.Параметры.ОснованиеОкончанияИП = ОснованиеИДата.Основание;
		
		ТабДок.Вывести(ОбластьДанных);		
	КонецЦикла;	
	
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.ДатаОтчета = Строка(Формат(ДатаОтчета, "ДЛФ=Д"));
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаОтчета = ТекущаяДатаСеанса();
	НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецПериода = ТекущаяДатаСеанса();
	
	ЗаполнитьТаблицуКодов();
	
	ЗаполнитьСписокСтадий();
КонецПроцедуры

&НаСервере
Функция ЗаписатьКолонку(Запрос, НомерКолонки, ДО)
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ТабКод.КодДопРеквизитаМероприятия = """"
	               |			ТОГДА Мероприятие.ФактическаяДата
	               |		ИНАЧЕ Мероприятие.Значение
	               |	КОНЕЦ КАК ДатаМероприятия,
	               |	Мероприятие.БизнесПроцесс КАК БизнесПроцесс,
	               |	Мероприятие.Схема КАК Схема,
	               |	Мероприятие.ОбъектРодитель КАК ОбъектРодитель
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабКод КАК ТабКод
	               |		ПО Мероприятие.ТипМероприятияКод = ТабКод.КодТипаМероприятия
	               |			И (ТабКод.КодДопРеквизитаМероприятия = """"
	               |				ИЛИ Мероприятие.СвойствоКод = ТабКод.КодДопРеквизитаМероприятия)
	               |			И (ТабКод.НомерКолонки = &НомерКолонки)
	               |			И (Мероприятие.РезультатКод = ТабКод.КодРезультата
	               |				ИЛИ ТабКод.КодРезультата = """")
	               |ГДЕ
	               |	(Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	               |			ИЛИ НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаМероприятия,
	               |	БизнесПроцесс,
	               |	Схема,
	               |	ОбъектРодитель";
	Запрос.УстановитьПараметр("НомерКолонки", НомерКолонки);	
	Результат = Запрос.Выполнить().Выбрать();
	СтрокаТМП = "";
	Счетчик = 0;
	Пока Результат.Следующий() Цикл
		СтрДата = Формат(Результат.ДатаМероприятия, "ДЛФ=Д");
		Счетчик = Счетчик + 1;
		СтрокаТМП = СтрокаТМП + СтрДата + Символы.ПС;		
	КонецЦикла;
    Возврат СокрЛП(СтрокаТМП);	
КонецФункции

&НаСервере
Функция ВычислитьСтадиюИДату(ДО)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Мероприятие.Ссылка,
	                      |	Мероприятие.Результат,
	                      |	Мероприятие.Выполнена,
	                      |	Мероприятие.ДатаВыполнения,
	                      |	Мероприятие.Результат.Код КАК РезультатКод,
	                      |	ЕСТЬNULL(Мероприятие.Объект.Владелец, Мероприятие.Объект) КАК ОбъектВладелец,
	                      |	Мероприятие.ТипМероприятия,
	                      |	Мероприятие.ФактическаяДата
	                      |ПОМЕСТИТЬ ТаблицаМ
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |ГДЕ
	                      |	Мероприятие.Выполнена
	                      |	И Мероприятие.ДатаВыполнения < &ТекДата
	                      |	И ЕСТЬNULL(Мероприятие.Объект.Владелец, Мероприятие.Объект) = &Объект
	                      |	И (НЕ Мероприятие.ПометкаУдаления)
	                      |	И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |			ИЛИ (НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления))");
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("Объект", ДО);
	Запрос.УстановитьПараметр("ТекДата", КонецДня(ДатаОтчета));
	Запрос.ВыполнитьПакет();

	//12			
	Запрос.Текст = "ВЫБРАТЬ
	               |	МероприятиеДополнительныеРеквизиты.Ссылка,
	               |	МероприятиеДополнительныеРеквизиты.Значение
	               |ИЗ
	               |	Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаМ КАК Мероприятие
	               |		ПО (Мероприятие.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка)
	               |ГДЕ
	               |	МероприятиеДополнительныеРеквизиты.Ссылка.Выполнена
	               |	И МероприятиеДополнительныеРеквизиты.Свойство = &СвойствоПО
	               |	И МероприятиеДополнительныеРеквизиты.Значение >= &ТекДата
	               |	И МероприятиеДополнительныеРеквизиты.Ссылка.ДатаВыполнения < &ТекДата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МероприятиеДополнительныеРеквизиты.Значение";
	Запрос.УстановитьПараметр("СвойствоПО", 
			ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду("     2051")); //ДопРеквизитыМероприятий
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ДатаПО = Результат.Значение;
	Иначе
		ДатаПО = "";
	КонецЕсли;
			
	//11				
	МассивРезультатовМС = Новый Массив();	
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0220"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0315"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0221"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0183"));	
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0222"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0184"));
	Запрос.УстановитьПараметр("РезультатМС", МассивРезультатовМС);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.Результат.Код КАК Код
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |ГДЕ
	               |	Мероприятие.Выполнена
	               |	И Мероприятие.Результат В(&РезультатМС)
	               |	И Мероприятие.ДатаВыполнения < &ТекДата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Мероприятие.ФактическаяДата";
	Результат3 = Запрос.Выполнить().Выбрать();
	ДатаМС = "";
	Пока Результат3.Следующий() Цикл
		Если Результат3.Код = "     0220" ИЛИ Результат3.Код = "     0315" Тогда
			ДатаМС = Дата(1, 1, 1);
			//СтрокаДействий = СтрокаДействий + "УТВЕРЖДЕНО МИРОВОЕ СОГЛАШЕНИЕ" + Символы.ПС;
		ИначеЕсли (Результат3.Код = "     0221" ИЛИ Результат3.Код = "     0183") И ДатаМС <> "" Тогда
			ДатаМС = "";
			//СтрокаДействий = СокрЛП(СтрокаДействий) + ", ИСПОЛНЕНО" + Символы.ПС;
		ИначеЕсли (Результат3.Код = "     0222" ИЛИ Результат3.Код = "     0184") И ДатаМС <> "" Тогда
			ДатаМС = "";
			//СтрокаДействий = СокрЛП(СтрокаДействий) + ", НЕ ИСПОЛНЕНО" + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Если ДатаМС <> "" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	МероприятиеДополнительныеРеквизиты.Значение
		               |ИЗ
		               |	ТаблицаМ КАК Мероприятие
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
		               |		ПО Мероприятие.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка
		               |			И (МероприятиеДополнительныеРеквизиты.Свойство.Код = ""     2050"")
		               |ГДЕ
		               |	Мероприятие.Выполнена
		               |	И Мероприятие.ДатаВыполнения < &ТекДата
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	МероприятиеДополнительныеРеквизиты.Значение УБЫВ";
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			ДатаМС = Результат.Значение;
		КонецЕсли;
	КонецЕсли;
	
	//10
	МассивТипов10 = Новый Массив();	
	МассивТипов10.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0141"));
	МассивТипов10.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0062"));
	Запрос.УстановитьПараметр("Тип10", МассивТипов10);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ОбъектВладелец,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(МероприятиеДополнительныеРеквизиты.Значение, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА Мероприятие.ДатаВыполнения
	               |			ИНАЧЕ МероприятиеДополнительныеРеквизиты.Значение
	               |		КОНЕЦ) КАК Значение
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
	               |		ПО Мероприятие.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка
	               |			И (МероприятиеДополнительныеРеквизиты.Свойство.Код В (""     2131""))
	               |ГДЕ
	               |	Мероприятие.ТипМероприятия В(&Тип10)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.ОбъектВладелец";
	Результат = Запрос.Выполнить().Выбрать();	
	Если Результат.Следующий() Тогда
		Дата10 = Результат.Значение;
	Иначе
		Дата10 = "";
	КонецЕсли;
	
	//9
	МассивТипов9 = Новый Массив();	
	МассивТипов9.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0142"));
	Запрос.УстановитьПараметр("Тип9", МассивТипов9);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ОбъектВладелец,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(МероприятиеДополнительныеРеквизиты.Значение, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА Мероприятие.ДатаВыполнения
	               |			ИНАЧЕ МероприятиеДополнительныеРеквизиты.Значение
	               |		КОНЕЦ) КАК Значение
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
	               |		ПО Мероприятие.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка
	               |			И (МероприятиеДополнительныеРеквизиты.Свойство.Код В (""     2146""))
	               |ГДЕ
	               |	Мероприятие.ТипМероприятия В(&Тип9)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.ОбъектВладелец";
	Результат = Запрос.Выполнить().Выбрать();	
	Если Результат.Следующий() Тогда
		Дата9 = Результат.Значение;
	Иначе
		Дата9 = "";
	КонецЕсли;
	
	//8
	МассивТипов8 = Новый Массив();	
	МассивТипов8.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0061"));
	МассивТипов8.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0060"));
	Запрос.УстановитьПараметр("Тип8", МассивТипов8);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ОбъектВладелец,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(МероприятиеДополнительныеРеквизиты.Значение, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА Мероприятие.ДатаВыполнения
	               |			ИНАЧЕ МероприятиеДополнительныеРеквизиты.Значение
	               |		КОНЕЦ) КАК Значение
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
	               |		ПО Мероприятие.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка
	               |			И (МероприятиеДополнительныеРеквизиты.Свойство.Код В (""     2042"", ""     2043""))
	               |ГДЕ
	               |	Мероприятие.ТипМероприятия В(&Тип8)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.ОбъектВладелец";
	Результат = Запрос.Выполнить().Выбрать();	
	Если Результат.Следующий() Тогда
		Дата8 = Результат.Значение;
	Иначе
		Дата8 = "";
	КонецЕсли;
	
	//7
	МассивТипов7 = Новый Массив();	
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0051"));
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0055"));
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0115"));
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0117"));
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0116"));
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0056"));
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0057"));
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0058"));
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0059"));
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0063"));
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0140"));
	Запрос.УстановитьПараметр("Тип7", МассивТипов7);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ОбъектВладелец,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(МероприятиеДополнительныеРеквизиты.Значение, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА Мероприятие.ДатаВыполнения
	               |			ИНАЧЕ МероприятиеДополнительныеРеквизиты.Значение
	               |		КОНЕЦ) КАК Значение
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
	               |		ПО Мероприятие.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка
	               |			И (МероприятиеДополнительныеРеквизиты.Свойство.Код В (""     2147""))
	               |ГДЕ
	               |	Мероприятие.ТипМероприятия В(&Тип7)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.ОбъектВладелец";
	Результат = Запрос.Выполнить().Выбрать();	
	Если Результат.Следующий() Тогда
		Дата7 = Результат.Значение;
	Иначе
		Дата7 = "";
	КонецЕсли;
	
	//6
	МассивТипов6 = Новый Массив();	
	МассивТипов6.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0086"));
	Запрос.УстановитьПараметр("Тип6", МассивТипов6);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ОбъектВладелец,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(МероприятиеДополнительныеРеквизиты.Значение, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА Мероприятие.ДатаВыполнения
	               |			ИНАЧЕ МероприятиеДополнительныеРеквизиты.Значение
	               |		КОНЕЦ) КАК Значение
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
	               |		ПО Мероприятие.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка
	               |			И (МероприятиеДополнительныеРеквизиты.Свойство.Код В (""     2018""))
	               |ГДЕ
	               |	Мероприятие.ТипМероприятия В(&Тип6)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.ОбъектВладелец";
	Результат = Запрос.Выполнить().Выбрать();	
	Если Результат.Следующий() Тогда
		Дата6 = Результат.Значение;
	Иначе
		Дата6 = "";
	КонецЕсли;
		
	//5
	МассивТипов5 = Новый Массив();	
	МассивТипов5.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0080"));
	МассивТипов5.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0081"));
	Запрос.УстановитьПараметр("Тип5", МассивТипов5);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ОбъектВладелец,
	               |	МИНИМУМ(Мероприятие.ДатаВыполнения) КАК Значение
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |ГДЕ
	               |	Мероприятие.ТипМероприятия В(&Тип5)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.ОбъектВладелец";
	Результат = Запрос.Выполнить().Выбрать();	
	Если Результат.Следующий() Тогда
		Дата5 = Результат.Значение;
	Иначе
		Дата5 = "";
	КонецЕсли;
	
	МассивТипов52 = Новый Массив();	
	МассивТипов52.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0078"));
	МассивТипов52.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0079"));
	Запрос.УстановитьПараметр("Тип52", МассивТипов52);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ОбъектВладелец,
	               |	МИНИМУМ(МероприятиеДополнительныеРеквизиты.Значение) КАК Значение
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
	               |		ПО Мероприятие.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка
	               |			И (МероприятиеДополнительныеРеквизиты.Свойство.Код В (""     2009""))
	               |ГДЕ
	               |	Мероприятие.ТипМероприятия В(&Тип52)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.ОбъектВладелец";
	Результат = Запрос.Выполнить().Выбрать();	
	Если Результат.Следующий() Тогда
		Дата5 = Результат.Значение;
	КонецЕсли;
	
	//4
	МассивТипов4 = Новый Массив();	
	МассивТипов4.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0075"));
	МассивТипов4.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0076"));
	МассивТипов4.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0078"));
	МассивТипов4.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0079"));
	Запрос.УстановитьПараметр("Тип4", МассивТипов4);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ОбъектВладелец,
	               |	МИНИМУМ(Мероприятие.ДатаВыполнения) КАК Значение
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |ГДЕ
	               |	Мероприятие.ТипМероприятия В(&Тип4)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.ОбъектВладелец";
	Результат = Запрос.Выполнить().Выбрать();	
	Если Результат.Следующий() Тогда
		Дата4 = Результат.Значение;
	Иначе
		Дата4 = "";
	КонецЕсли;
	
	МассивТипов42 = Новый Массив();	
	МассивТипов42.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0073"));
	МассивТипов42.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0074"));
	Запрос.УстановитьПараметр("Тип42", МассивТипов42);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ОбъектВладелец,
	               |	МИНИМУМ(МероприятиеДополнительныеРеквизиты.Значение) КАК Значение
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
	               |		ПО Мероприятие.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка
	               |			И (МероприятиеДополнительныеРеквизиты.Свойство.Код В (""     2007""))
	               |ГДЕ
	               |	Мероприятие.ТипМероприятия В(&Тип42)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.ОбъектВладелец";
	Результат = Запрос.Выполнить().Выбрать();	
	Если Результат.Следующий() Тогда
		Дата4 = Результат.Значение;
	КонецЕсли;
	
	//3
	МассивТипов3 = Новый Массив();	
	МассивТипов3.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0072"));
	МассивТипов3.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0073"));
	МассивТипов3.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0074"));
	Запрос.УстановитьПараметр("Тип3", МассивТипов3);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ОбъектВладелец,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(МероприятиеДополнительныеРеквизиты.Значение, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА Мероприятие.ДатаВыполнения
	               |			ИНАЧЕ МероприятиеДополнительныеРеквизиты.Значение
	               |		КОНЕЦ) КАК Значение
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
	               |		ПО Мероприятие.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка
	               |			И (МероприятиеДополнительныеРеквизиты.Свойство.Код В (""     2024""))
	               |ГДЕ
	               |	Мероприятие.ТипМероприятия В(&Тип3)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.ОбъектВладелец";
	Результат = Запрос.Выполнить().Выбрать();	
	Если Результат.Следующий() Тогда
		Дата3 = Результат.Значение;
	Иначе
		Дата3 = "";
	КонецЕсли;
	
	//2
	МассивТипов2 = Новый Массив();	
	МассивТипов2.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0071"));
	Запрос.УстановитьПараметр("Тип2", МассивТипов2);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ОбъектВладелец,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(МероприятиеДополнительныеРеквизиты.Значение, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА Мероприятие.ДатаВыполнения
	               |			ИНАЧЕ МероприятиеДополнительныеРеквизиты.Значение
	               |		КОНЕЦ) КАК Значение
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
	               |		ПО Мероприятие.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка
	               |			И (МероприятиеДополнительныеРеквизиты.Свойство.Код В (""     2023""))
	               |ГДЕ
	               |	Мероприятие.ТипМероприятия В(&Тип2)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.ОбъектВладелец";
	Результат = Запрос.Выполнить().Выбрать();	
	Если Результат.Следующий() Тогда
		Дата2 = Результат.Значение;
	Иначе
		Дата2 = "";
	КонецЕсли;
	
	//1.5
	Запрос.УстановитьПараметр("Тип1_5", Справочники.РезультатыМероприятий.НайтиПоКоду("     0100"));
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ОбъектВладелец,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(МероприятиеДополнительныеРеквизиты.Значение, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА Мероприятие.ДатаВыполнения
	               |			ИНАЧЕ МероприятиеДополнительныеРеквизиты.Значение
	               |		КОНЕЦ) КАК Значение
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
	               |		ПО Мероприятие.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка
	               |			И (МероприятиеДополнительныеРеквизиты.Свойство.Код В (""     2017""))
	               |ГДЕ
	               |	Мероприятие.Результат = &Тип1_5
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.ОбъектВладелец";
	Результат = Запрос.Выполнить().Выбрать();	
	Если Результат.Следующий() Тогда
		Дата1_5 = Результат.Значение;
	Иначе
		Дата1_5 = "";
	КонецЕсли;
	
	//1
	МассивТипов1 = Новый Массив();	
	МассивТипов1.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0069"));
	МассивТипов1.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0070"));
	МассивТипов1.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0151"));
	Запрос.УстановитьПараметр("Тип1", МассивТипов1);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ОбъектВладелец,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(МероприятиеДополнительныеРеквизиты.Значение, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА Мероприятие.ДатаВыполнения
	               |			ИНАЧЕ МероприятиеДополнительныеРеквизиты.Значение
	               |		КОНЕЦ) КАК Значение
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
	               |		ПО Мероприятие.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка
	               |			И (МероприятиеДополнительныеРеквизиты.Свойство.Код В (""     2031""))
	               |ГДЕ
	               |	Мероприятие.ТипМероприятия В(&Тип1)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.ОбъектВладелец";
	Результат = Запрос.Выполнить().Выбрать();	
	Если Результат.Следующий() Тогда
		Дата1 = Результат.Значение;
	Иначе
		Дата1 = "";
	КонецЕсли;
	
	РДата = "";
	РСтадия = Перечисления.СтадииИсполнительногоПроизводства.ПустаяСсылка();
	Если ДатаПО <> "" Тогда
		РДата = Формат(ДатаПО, "ДФ=dd.MM.yyyy");
		РСтадия = Перечисления.СтадииИсполнительногоПроизводства.ПредоставленаОтсрочка;
	ИначеЕсли ДатаМС <> "" Тогда
		РДата = Формат(ДатаМС, "ДФ=dd.MM.yyyy");
		РСтадия = Перечисления.СтадииИсполнительногоПроизводства.УтвержденоМС;
	ИначеЕсли Дата10 <> "" Тогда
		РДата = Формат(Дата10, "ДФ=dd.MM.yyyy");
		РСтадия = Перечисления.СтадииИсполнительногоПроизводства.ПолученоСвидетельство;
	ИначеЕсли Дата9 <> "" Тогда
		РДата = Формат(Дата9, "ДФ=dd.MM.yyyy");
		РСтадия = Перечисления.СтадииИсполнительногоПроизводства.ДокументыПоданыНаРегистрацию;
	ИначеЕсли Дата8 <> "" Тогда
		РДата = Формат(Дата8, "ДФ=dd.MM.yyyy");
		РСтадия = Перечисления.СтадииИсполнительногоПроизводства.ИмуществоПереданоВзыскателю;
	ИначеЕсли Дата7 <> "" Тогда
		РДата = Формат(Дата7, "ДФ=dd.MM.yyyy");
		РСтадия = Перечисления.СтадииИсполнительногоПроизводства.ИмуществоПредложеноВзыскателю;
	ИначеЕсли Дата6 <> "" Тогда
		РДата = Формат(Дата6, "ДФ=dd.MM.yyyy");
		РСтадия = Перечисления.СтадииИсполнительногоПроизводства.ПеречисленыДенежныеСредства;
	ИначеЕсли Дата5 <> "" Тогда
		РДата = Формат(Дата5, "ДФ=dd.MM.yyyy");
		Если Дата5 < НачалоДня(ДатаОтчета) Тогда
			РСтадия = Перечисления.СтадииИсполнительногоПроизводства.ПроведеныВторыеТорги;
		Иначе
			РСтадия = Перечисления.СтадииИсполнительногоПроизводства.НазначеныВторыеТорги;
		КонецЕсли;
	ИначеЕсли Дата4 <> "" Тогда
		РДата = Формат(Дата4, "ДФ=dd.MM.yyyy");
		Если Дата4 < НачалоДня(ДатаОтчета) Тогда
			РСтадия = Перечисления.СтадииИсполнительногоПроизводства.ПроведеныПервыеТорги;
		Иначе
			РСтадия = Перечисления.СтадииИсполнительногоПроизводства.НазначеныПервыеТорги;
		КонецЕсли;
	ИначеЕсли Дата3 <> "" Тогда
		РДата = Формат(Дата3, "ДФ=dd.MM.yyyy");
		РСтадия = Перечисления.СтадииИсполнительногоПроизводства.ИмуществоПереданоНаРеализацию;
	ИначеЕсли Дата2 <> "" Тогда
		РДата = Формат(Дата2, "ДФ=dd.MM.yyyy");
		РСтадия = Перечисления.СтадииИсполнительногоПроизводства.НаложенАрест;
	ИначеЕсли Дата1_5 <> "" Тогда
		РДата = Формат(Дата1_5, "ДФ=dd.MM.yyyy");
		РСтадия = Перечисления.СтадииИсполнительногоПроизводства.ВозбужденоИП;
	ИначеЕсли Дата1 <> "" Тогда
		РДата = Формат(Дата1, "ДФ=dd.MM.yyyy");
		РСтадия = Перечисления.СтадииИсполнительногоПроизводства.ЗаявлениеПоданоВССП;
	КонецЕсли;
	
	Возврат Новый Структура("Дата, Стадия", РДата, РСтадия);
КонецФункции

&НаСервере
Функция ВычислитьОснованиеИДату(ДО)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Мероприятие.Ссылка,
	                      |	Мероприятие.Результат,
	                      |	Мероприятие.Выполнена,
	                      |	Мероприятие.ДатаВыполнения,
	                      |	Мероприятие.Результат.Код КАК РезультатКод,
	                      |	Мероприятие.Объект
	                      |ПОМЕСТИТЬ ТаблицаМ
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |ГДЕ
	                      |	Мероприятие.Выполнена
	                      |	И Мероприятие.ТипМероприятия.Код В (""     0110"", ""     0114"")
	                      |	И Мероприятие.Объект.Владелец = &Объект
	                      |	И НЕ Мероприятие.ПометкаУдаления
	                      |	И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |			ИЛИ НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления)
	                      |	И Мероприятие.ДатаВыполнения < &ТекДата
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МИНИМУМ(ВЫБОР
	                      |			КОГДА ЕСТЬNULL(МероприятиеДополнительныеРеквизиты.Значение, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	                      |				ТОГДА ТаблицаМ.ДатаВыполнения
	                      |			ИНАЧЕ МероприятиеДополнительныеРеквизиты.Значение
	                      |		КОНЕЦ) КАК Значение,
	                      |	ТаблицаМ.Объект,
	                      |	МАКСИМУМ(МероприятиеДополнительныеРеквизиты2.Значение) КАК Значение2
	                      |ИЗ
	                      |	ТаблицаМ КАК ТаблицаМ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
	                      |		ПО ТаблицаМ.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка
	                      |			И (МероприятиеДополнительныеРеквизиты.Свойство.Код = ""     2148"")
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты2
	                      |		ПО ТаблицаМ.Ссылка = МероприятиеДополнительныеРеквизиты2.Ссылка
	                      |			И (МероприятиеДополнительныеРеквизиты2.Свойство.Код = ""     2149"")
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТаблицаМ.Объект
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Значение");
	Запрос.УстановитьПараметр("Объект", ДО);
	Запрос.УстановитьПараметр("ТекДата", КонецДня(ДатаОтчета));
	Результат = Запрос.Выполнить().Выбрать();
	РДата = "";
	РОснование = "";
	Пока Результат.Следующий() Цикл
		РДата = РДата + Символы.ПС + Формат(Результат.Значение, "ДФ=dd.MM.yyyy");
		РОснование = РОснование + Символы.ПС + Результат.Значение2;
	КонецЦикла;
	
	Возврат Новый Структура("Дата, Основание", Сред(РДата, 2), Сред(РОснование, 2));
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуКодов()
	ТабКод.Очистить();
		
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0070";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2017";
	НоваяСтрока.НомерКолонки = 4;
	НоваяСтрока.КодРезультата = "     0100";
КонецПроцедуры

&НаКлиенте
Процедура РегионНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	 Параметр  = Новый ПараметрВыбора("Отбор.Владелец", НайтиПВХПоКоду("     0125")) ;
	 НовыйМассив = Новый Массив();
	 НовыйМассив.Добавить(Параметр);
	 НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	 Элементы.Регион.ПараметрыВыбора = НовыеПараметры;
КонецПроцедуры

&НаСервере
Функция НайтиПВХПоКоду(Код)
 	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду(Код); 
КонецФункции // НайтиПВХПоКоду()

&НаКлиенте
Процедура СтадияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Форма = ПолучитьФорму("Отчет.ОтчетПоВзысканию.Форма.ФормаПеречисления");
	Форма.Список = Стадия;
	Форма.ОткрытьМодально();
	СтадияТекст = Форма.Результат;    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСтадий()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КартыМаршрутов.Ссылка,
	                      |	КартыМаршрутов.Наименование КАК Наименование
	                      |ИЗ
	                      |	Справочник.КартыМаршрутов КАК КартыМаршрутов
	                      |ГДЕ
	                      |	(НЕ КартыМаршрутов.ПометкаУдаления)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Наименование");
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл 
		Стадия.Добавить(Результат.Ссылка, Результат.Наименование);	
	КонецЦикла;
	Стадия.Добавить(Перечисления.СостоянияДел.МировоеСоглашение, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.МировоеСоглашение.Синоним);
	Стадия.Добавить(Перечисления.СостоянияДел.ОтказОтИска, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.ОтказОтИска.Синоним);
	Стадия.Добавить(Перечисления.СостоянияДел.ПолученоСвидетельство, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.ПолученоСвидетельство.Синоним);
	Стадия.Добавить(Перечисления.СостоянияДел.ПредоставленаОтсрочка, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.ПредоставленаОтсрочка.Синоним);
	Стадия.Добавить(Перечисления.СостоянияДел.ПеречисленыДенежныеСредства, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.ПеречисленыДенежныеСредства.Синоним);
КонецПроцедуры

&НаСервере
Процедура ОтобратьПоСтадии(Таблица)
	МассивСтадий = Новый Массив();	
	ФлагПоискаМС = Ложь;
	ФлагПоискаОИ = Ложь;
	ФлагПоискаПО = Ложь;
	ФлагПоискаПС = Ложь;
	ФлагПоискаПД = Ложь;
	Для Каждого Элемент Из Стадия Цикл
		Если Элемент.Пометка Тогда
			Если ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.КартыМаршрутов") Тогда
				МассивСтадий.Добавить(Элемент.Значение);			
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.МировоеСоглашение Тогда
				ФлагПоискаМС = Истина;
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.ОтказОтИска Тогда
				ФлагПоискаОИ = Истина;
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.ПредоставленаОтсрочка Тогда
				ФлагПоискаПО = Истина;
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.ПолученоСвидетельство Тогда
				ФлагПоискаПС = Истина;
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.ПеречисленыДенежныеСредства Тогда
				ФлагПоискаПД = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Таблица.ДолговоеОбязательство
	                      |ПОМЕСТИТЬ Таблица
	                      |ИЗ
	                      |	&Таблица КАК Таблица
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Мероприятие.Ссылка,
	                      |	ЕСТЬNULL(Мероприятие.Объект.Владелец, Мероприятие.Объект) КАК Объект,
	                      |	Мероприятие.Схема,
	                      |	Мероприятие.БизнесПроцесс,
	                      |	Мероприятие.Результат,
	                      |	Мероприятие.Дата,
	                      |	Мероприятие.ДатаВыполнения,
	                      |	Мероприятие.Выполнена,
	                      |	Мероприятие.ТипМероприятия
	                      |ПОМЕСТИТЬ ТаблицаМ
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |ГДЕ
	                      |	НЕ Мероприятие.ПометкаУдаления
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Таблица.ДолговоеОбязательство,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеМС.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) + МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеОИ.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) + МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеПО.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) + МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеПС.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) + МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеПД.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) КАК СтадияФлаг
	                      |ИЗ
	                      |	Таблица КАК Таблица
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеСтадии
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеСтадии.Объект
	                      |			И (МероприятиеСтадии.Схема В (&МассивСтадий))
	                      |			И (МероприятиеСтадии.ДатаВыполнения > &ТекДата
	                      |				ИЛИ НЕ МероприятиеСтадии.Выполнена)
	                      |			И (МероприятиеСтадии.Дата < &ТекДата)
	                      |			И (НЕ МероприятиеСтадии.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеМС
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеМС.Объект
	                      |			И (МероприятиеМС.Выполнена)
	                      |			И (МероприятиеМС.Результат В (&МассивРезультатовМС))
	                      |			И (МероприятиеМС.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеМС.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеМС.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеОИ
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеОИ.Объект
	                      |			И (МероприятиеОИ.Выполнена)
	                      |			И (МероприятиеОИ.Результат В (&МассивРезультатовОИ))
	                      |			И (МероприятиеОИ.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеОИ.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеОИ.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеПО
	                      |		ПО (Таблица.ДолговоеОбязательство = ЕСТЬNULL(МероприятиеПО.Ссылка.Объект.Владелец, МероприятиеПО.Ссылка.Объект))
	                      |			И (МероприятиеПО.Ссылка.Выполнена)
	                      |			И (МероприятиеПО.Свойство В (&МассивРезультатовПО))
	                      |			И (МероприятиеПО.Значение >= &ТекДата)
	                      |			И (МероприятиеПО.Ссылка.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеПО.Ссылка.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеПО.Ссылка.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеПС
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеПС.Объект
	                      |			И (МероприятиеПС.Выполнена)
	                      |			И (МероприятиеПС.Результат В (&МассивРезультатовПС))
	                      |			И (МероприятиеПС.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеПС.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеПС.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеПД
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеПД.Объект
	                      |			И (МероприятиеПД.Выполнена)
	                      |			И (МероприятиеПД.ТипМероприятия В (&МассивТиповМероприятийПД))
	                      |			И (МероприятиеПД.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеПД.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеПД.БизнесПроцесс.ПометкаУдаления)
	                      |ГДЕ
	                      |	(&ФлагБезУсловий
	                      |			ИЛИ НЕ МероприятиеСтадии.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеМС.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеОИ.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеПО.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеПС.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеПД.Ссылка ЕСТЬ NULL )
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Таблица.ДолговоеОбязательство
	                      |
	                      |ИМЕЮЩИЕ
	                      |	(&ФлагБезУсловий
	                      |		ИЛИ &ФлагПоискаСтадии
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеСтадии.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаМС
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеМС.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаОИ
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеОИ.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаПО
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеПО.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаПС
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеПС.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаПД
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеПД.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1)");
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("МассивСтадий", МассивСтадий);
	Запрос.УстановитьПараметр("ФлагБезУсловий", МассивСтадий.Количество() = 0 И Не ФлагПоискаМС И Не ФлагПоискаОИ И 
			Не ФлагПоискаПО И Не ФлагПоискаПС И Не ФлагПоискаПД);
	Запрос.УстановитьПараметр("ТекДата", КонецДня(ДатаОтчета));	
	
	Запрос.УстановитьПараметр("ФлагПоискаСтадии", МассивСтадий.Количество() > 0);
	Запрос.УстановитьПараметр("ФлагПоискаМС", ФлагПоискаМС);
	Запрос.УстановитьПараметр("ФлагПоискаОИ", ФлагПоискаОИ);
	Запрос.УстановитьПараметр("ФлагПоискаПО", ФлагПоискаПО);
	Запрос.УстановитьПараметр("ФлагПоискаПС", ФлагПоискаПС);
	Запрос.УстановитьПараметр("ФлагПоискаПД", ФлагПоискаПД);
			
	МассивРезультатовМС = Новый Массив();	
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0220"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0315"));
	
	МассивРезультатовОИ = Новый Массив();
	МассивРезультатовОИ.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0321"));
	МассивРезультатовОИ.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0322"));
	
	Запрос.УстановитьПараметр("МассивРезультатовМС", МассивРезультатовМС);
	Запрос.УстановитьПараметр("МассивРезультатовОИ", МассивРезультатовОИ);
	Запрос.УстановитьПараметр("МассивРезультатовПО", 
			ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду("     2051")); //ДопРеквизитыМероприятий
			//Справочники.РезультатыМероприятий.НайтиПоКоду("     0320"));
	Запрос.УстановитьПараметр("МассивРезультатовПС", Справочники.РезультатыМероприятий.НайтиПоКоду("     0216"));
	Запрос.УстановитьПараметр("МассивТиповМероприятийПД", Справочники.ТипыМероприятий.НайтиПоКоду("     0083"));
	
	Таблица = Запрос.Выполнить().Выгрузить();
КонецПроцедуры

&НаСервере
Процедура ОтобратьПоРайонуСП(Таблица)
	Если РайонСлужбыСП.Пустая() Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Таблица.ДолговоеОбязательство,
		                      |	Таблица.СтадияФлаг
		                      |ПОМЕСТИТЬ Таблица
		                      |ИЗ
		                      |	&Таблица КАК Таблица
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Таблица.ДолговоеОбязательство,
		                      |	Таблица.СтадияФлаг,
		                      |	ВЫРАЗИТЬ("""" КАК СТРОКА(1024)) КАК СлужбаСП,
		                      |	МАКСИМУМ(ИсполнительныеДокументы.Ссылка) КАК Ссылка
		                      |ИЗ
		                      |	Таблица КАК Таблица
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
		                      |		ПО Таблица.ДолговоеОбязательство = ИсполнительныеДокументы.Владелец
		                      |			И (ИсполнительныеДокументы.СлужбаСП <> ЗНАЧЕНИЕ(Справочник.СудебныеПриставы.ПустаяСсылка))
		                      |			И (НЕ ИсполнительныеДокументы.ОшибкаИД)
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	Таблица.ДолговоеОбязательство,
		                      |	Таблица.СтадияФлаг");
		Запрос.УстановитьПараметр("Таблица", Таблица);
		Таблица = Запрос.Выполнить().Выгрузить();
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИсполнительныеДокументы.СлужбаСП.Наименование КАК СлужбаСП
		               |ИЗ
		               |	Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
		               |ГДЕ
		               |	ИсполнительныеДокументы.Владелец = &Владелец
		               |	И ИсполнительныеДокументы.СлужбаСП <> ЗНАЧЕНИЕ(Справочник.СудебныеПриставы.ПустаяСсылка)
					   |	И (Не ИсполнительныеДокументы.ОшибкаИД)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ИсполнительныеДокументы.СлужбаСП,
		               |	ИсполнительныеДокументы.СлужбаСП.Наименование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	СлужбаСП";
		Для Каждого Элемент Из Таблица Цикл
			Если Элемент.Ссылка <> Null Тогда		   
				Запрос.УстановитьПараметр("Владелец", Элемент.ДолговоеОбязательство);
				Результат = Запрос.Выполнить().Выбрать();
				Пока Результат.Следующий() Цикл
					Элемент.СлужбаСП = (Элемент.СлужбаСП + ", " + Результат.СлужбаСП);
				КонецЦикла;
				Элемент.СлужбаСП = Сред(Элемент.СлужбаСП, 3);
			КонецЕсли;
		КонецЦикла;
		
	Иначе	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Таблица.ДолговоеОбязательство,
		                      |	Таблица.СтадияФлаг
		                      |ПОМЕСТИТЬ Таблица
		                      |ИЗ
		                      |	&Таблица КАК Таблица
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Таблица.ДолговоеОбязательство,
		                      |	Таблица.СтадияФлаг,
		                      |	ИсполнительныеДокументы.СлужбаСП.Наименование КАК СлужбаСП
		                      |ИЗ
		                      |	Таблица КАК Таблица
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
		                      |		ПО Таблица.ДолговоеОбязательство = ИсполнительныеДокументы.Владелец
		                      |			И (ИсполнительныеДокументы.СлужбаСП = &СлужбаСП)
		                      |			И (НЕ ИсполнительныеДокументы.ОшибкаИД)
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	Таблица.ДолговоеОбязательство,
		                      |	Таблица.СтадияФлаг,
		                      |	ИсполнительныеДокументы.СлужбаСП.Наименование");
		Запрос.УстановитьПараметр("Таблица", Таблица);
		Запрос.УстановитьПараметр("СлужбаСП", РайонСлужбыСП);
		Таблица = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
КонецПроцедуры
