
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИмяФормыРодителя = Неопределено;
	Попытка
		ИмяФормыРодителя = ЭтаФорма.ВладелецФормы.ИмяФормы;
	Исключение
	КонецПопытки;

	Если ИмяФормыРодителя = "Документ.ЗагрузкаДанныхДолжника.Форма.ФормаДокумента" Тогда
		УстановитьОтборПоПолю(0);
	ИначеЕсли ИмяФормыРодителя = "Документ.ПоступлениеПлатежей.Форма.ФормаДокумента" Тогда
		УстановитьОтборПоПолю(1);
	ИначеЕсли ИмяФормыРодителя = "Документ.ЗагрузкаЗадолженности.Форма.ФормаДокумента" Тогда
		УстановитьОтборПоПолю(2);
	ИначеЕсли ИмяФормыРодителя = "Документ.АктуализацияЗадолженности.Форма.ФормаДокумента" Тогда
		УстановитьОтборПоПолю(3);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПолю(Индекс)
	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[Индекс].Использование = Истина;		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("ФорматЗагрузкиВыбор", ПодчиненныеЭлементы.Список.ТекущаяСтрока);
КонецПроцедуры
