
&НаКлиенте
Процедура ОК(Команда)
	Закрыть(ПолучитьЗначенияПараметров());
КонецПроцедуры

//Чуров
&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("ДеревоРешенийНастройкаВыбор", Параметры.Команда ,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗначенияПараметров()
	//	Форма.ТипМероприятия = Объект.ТипМероприятия;
	//Форма.ЗаголовокЭлемента = СтрокаТекЭлемент.Наименование;
	//Форма.РезультатМероприятия = СтрокаТекЭлемент.РезультатМероприятия;
	//Форма.ВыборКонтактногоЛица = (СтрокаТекЭлемент.ВыборИзСписка = "Да");
	//Форма.ПодсказкаПользователю = СтрокаТекЭлемент.ПодсказкаПользователю;
	//Форма.Шаблон = СтрокаТекЭлемент.Шаблон;

	
	
	ЗначенияПолей = Новый Структура;
	ЗначенияПолей.Вставить("ЗаголовокЭлемента",ЗаголовокЭлемента);
	ЗначенияПолей.Вставить("РезультатМероприятия",     РезультатМероприятия);
	ЗначенияПолей.Вставить("ВыборКонтактногоЛица",     ВыборКонтактногоЛица);
	ЗначенияПолей.Вставить("ПодсказкаПользователю", ПодсказкаПользователю);
	ЗначенияПолей.Вставить("Шаблон",    Шаблон);
	
	Результат = Новый Структура;
	Результат.Вставить("ЗначенияПолей", ЗначенияПолей);                     	
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыборКонтактногоЛица = Параметры.ВыборКонтактногоЛица;
	ЗаголовокЭлемента = Параметры.ЗаголовокЭлемента;
	ПодсказкаПользователю = Параметры.ПодсказкаПользователю;
	РезультатМероприятия = Параметры.РезультатМероприятия;
	ТипМероприятия = Параметры.ТипМероприятия;
	Шаблон = Параметры.Шаблон;
КонецПроцедуры

 