
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	Для Каждого Элемент Из Метаданные.Отчеты Цикл		
		Об = Справочники.ХранилищеВнешнихОтчетов.СоздатьЭлемент();				
		Об.Наименование      = Элемент.Синоним;
		Об.Внутренний        = Истина;
		Об.ИмяОтчета         = Элемент.Имя;
		Об.Родитель          = Справочники.ХранилищеВнешнихОтчетов.Предопределенные;
		Об.ПрикрепляемыйФайл = Элемент.Имя;
		Попытка
			Об.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;	  
КонецПроцедуры
