////////////////////////////////////////////////////////////////////////////////
// Для взаимодействия

Процедура УдалитьПараметрИзСписка(СписокПараметров, ПредставлениеПараметра) Экспорт

	НужныйПараметр = Неопределено;
	Для Каждого Параметр Из СписокПараметров Цикл
		Если Параметр.Представление = ПредставлениеПараметра Тогда
			НужныйПараметр = Параметр;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НужныйПараметр <> Неопределено Тогда
	
		СписокПараметров.Удалить(НужныйПараметр);
	
	КонецЕсли;

КонецПроцедуры

