
#Область ПрограммныйИнтерфейс

Функция РуководительОрганизации() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ЗапросЕсиаОтЛицаРуководителя = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;

	Возврат ПустаяСсылка();
	
КонецФункции // ()

Функция ВладелецМесенджера(Элемент) Экспорт

	Возврат Элемент;

КонецФункции // ()

#Область ИдентификацияЭлементов

Функция ПолучитьИдентификатор(Элемент) Экспорт

	Возврат Элемент.УникальныйИдентификатор();

КонецФункции // ()

Функция ПолучитьЭлементПоИдентификатору(Идентификатор) Экспорт

	Возврат РегистрыСведений.ИдентификаторыЧатовТелеграм
		.НайтиОтправителя(Идентификатор);

КонецФункции // ()

Функция ЭтоКлиент() Экспорт

	Возврат Истина;

КонецФункции // ()

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОтслеживаниеИзменений(Отказ, Объект, ТекстИзменений) Экспорт
	Если ТекстИзменений = "" ИЛИ Не Константы.КонтрольИзмененийОбъектов.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаДО = Объект;	
	Если ТипЗнч(Объект) = Тип("ЗадачаСсылка.Мероприятие") Тогда
		СсылкаДО = Объект.Объект;	
	КонецЕсли;
	
	Попытка
		Если ЗначениеЗаполнено(СсылкаДО.Владелец) Тогда;
			СсылкаДО = СсылкаДО.Владелец;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	//выдергиваем список сотрудников, у которых включен мониторинг данного объекта.
	//и каждому сотруднигу записываем в РС информацию об изменении данного объекта
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Объект = &Объект) КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	                      |		ПО (ОбъектыВРаботеОстатки.Сотрудник = Пользователи.Ссылка
	                      |					И Пользователи.ОтслеживаниеИзменений = ЗНАЧЕНИЕ(Перечисление.ОтслеживаниеИзменений.Сотрудник)
	                      |				ИЛИ ОбъектыВРаботеОстатки.Подразделение = Пользователи.Подразделение
	                      |					И Пользователи.ОтслеживаниеИзменений = ЗНАЧЕНИЕ(Перечисление.ОтслеживаниеИзменений.Подразделение)
	                      |				ИЛИ ОбъектыВРаботеОстатки.Организация = Пользователи.Организация
	                      |					И Пользователи.ОтслеживаниеИзменений = ЗНАЧЕНИЕ(Перечисление.ОтслеживаниеИзменений.Организация))
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Пользователи.Ссылка");
	Запрос.УстановитьПараметр("Объект", СсылкаДО);
	Результат = Запрос.Выполнить().Выбрать();
	
	Стр = Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMddHHmmss")
		+ УдалитьОбщегоНазначения.ТекущийПользователь().Наименование
		+ ";" + ТекстИзменений + "|";
	
	Пока Результат.Следующий() Цикл
		Набор = РегистрыСведений.ИзмененныеОбъекты.СоздатьМенеджерЗаписи();
		Набор.Объект = Объект;
		Набор.Сотрудник = Результат.Ссылка;
		Набор.Прочитать();
		
		Набор.Объект = Объект;
		Набор.Сотрудник = Результат.Ссылка;
		Набор.Сообщение = Набор.Сообщение + Стр;
		Попытка
			Набор.Записать();
		Исключение
			Отказ = Истина;
			Возврат;
		КонецПопытки; 
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти