
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Код) Тогда
		Номер_ = 1;
		Пока Не Справочники.Пользователи.НайтиПоКоду(Формат(Номер_, "ЧЦ=9; ЧН=; ЧВН=; ЧГ=")).Пустая() Цикл
			Номер_ = Номер_ + 1;
		КонецЦикла;
		ЭтотОбъект.Код = Формат(Номер_, "ЧЦ=9; ЧН=; ЧВН=; ЧГ=");
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторПользователяИБ) И 
			Пользователи.ПользовательИБСуществует(ИдентификаторПользователяИБ) Тогда
		ОписаниеОшибки = "";
		Если НЕ Пользователи.УдалитьПользователяИБ(ИдентификаторПользователяИБ, ОписаниеОшибки) Тогда
			ВызватьИсключение(ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если ЭтотОбъект.ЭтоГруппа Тогда
		ЭтотОбъект.Код = "";
	Иначе
		ЭтотОбъект.ИдентификаторПользователяИБ = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

