
&НаКлиенте
Процедура ОК(Команда)
	Результат = "";
	Для Каждого Поле Из ПолеПараметров Цикл
		Результат = Результат + Поле.ИмяКолонки + "|" + Поле.КоличествоСимволов + "|" + Поле.Разделитель + "|";
	КонецЦикла;
    Результат = Лев(Результат,СтрДлина(Результат));	
	//Оповестить("ЗакрытиеФормыУстановкаПараметровСвязиВыборКолонок",Результат);
	Закрыть(Результат);		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Результат = ИзменяемыйЭлемент;
		
	Список = Технический.ПреобразоватьСтрокуВСписок(ИзменяемыйЭлемент);
	Для Индекс = 1 по Список.Количество() Цикл
		ТекСтрока = ПолеПараметров.Добавить();
		ТекСтрока.ИмяКолонки = Список.Получить(Индекс-1);
		Попытка
			ТекСтрока.КоличествоСимволов = Число(Список.Получить(Индекс).Значение);
			Попытка
				ТекСтрока.Разделитель = Список.Получить(Индекс+1);
			Исключение
			КонецПопытки;
			Индекс = Индекс+2;
		Исключение
			Индекс = Индекс;
		КонецПопытки;
	КонецЦикла;

	Элементы.ИмяКолонки.СписокВыбора.ЗагрузитьЗначения(СписокПараметров.ВыгрузитьЗначения());                     
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокПараметров = Параметры.СписокПараметров;
	ИзменяемыйЭлемент = Параметры.ИзменяемыйЭлемент;	
КонецПроцедуры

