
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Элемент Из Список.Параметры.Элементы Цикл
		Если Строка(Элемент.Параметр) = "Ответственный" Тогда
			Элемент.Значение = ПараметрыСеанса.ТекущийПользователь;
			Элемент.Использование = Истина;
		ИначеЕсли Строка(Элемент.Параметр) = "ТекущаяДата" Тогда
			Элемент.Значение = ТекущаяДатаСеанса();
			Элемент.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	НапомнитьЧерез = Перечисления.НапоминанияИнтервалыПереноса.Минут15;
КонецПроцедуры


&НаСервере
Процедура ОткрытьНаСервере()
КонецПроцедуры


&НаКлиенте
Процедура СписокОткрыть(Команда)
	
	Параметры = Новый Структура("Ключ", Элементы.Список.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Задача.Мероприятие.Форма.ФормаМероприятияВеб", Параметры);

КонецПроцедуры


&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура СсылкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СсылкаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СсылкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Параметры = Новый Структура("Ключ", Элементы.Список.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Задача.Мероприятие.Форма.ФормаМероприятияВеб", Параметры);
КонецПроцедуры


&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Параметры = Новый Структура("Ключ", Элементы.Список.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Задача.Мероприятие.Форма.ФормаМероприятияВеб", Параметры);

КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Параметры = Новый Структура("Ключ", Элементы.Список.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Задача.Мероприятие.Форма.ФормаМероприятияВеб", Параметры);

КонецПроцедуры


&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Параметры = Новый Структура("Ключ", Элементы.Список.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Задача.Мероприятие.Форма.ФормаМероприятияВеб", Параметры);
КонецПроцедуры


&НаКлиенте
Процедура Создать(Команда)
	ОткрытьФорму("Задача.Мероприятие.Форма.ФормаМероприятияВеб");
КонецПроцедуры

