
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Элемент Из Список.Параметры.Элементы Цикл
		Если Строка(Элемент.Параметр) = "Ответственный" Тогда
			Элемент.Значение = ПараметрыСеанса.ТекущийПользователь;
			Элемент.Использование = Истина;
		ИначеЕсли Строка(Элемент.Параметр) = "ТекущаяДата" Тогда
			Элемент.Значение = ТекущаяДата();
			Элемент.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	НапомнитьЧерез = Перечисления.НапоминанияИнтервалыПереноса.Минут15;
КонецПроцедуры


&НаСервере
Процедура ОткрытьНаСервере()
КонецПроцедуры


&НаКлиенте
Процедура СписокОткрыть(Команда)
	пар = Новый Структура("Ключ", Элементы.Список.ТекущиеДанные.Ссылка);
	Форма = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятияВеб", пар);
	ОткрытьФорму(Форма);
	
	//Форма = .ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятияВеб");
	//Форма.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура СсылкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СсылкаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СсылкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	пар = Новый Структура("Ключ", Элементы.Список.ТекущиеДанные.Ссылка);
	Форма = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятияВеб", пар);
	ОткрытьФорму(Форма);	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	пар = Новый Структура("Ключ", Элементы.Список.ТекущиеДанные.Ссылка);
	Форма = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятияВеб", пар);
	ОткрытьФорму(Форма);	

КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
	пар = Новый Структура("Ключ", Элементы.Список.ТекущиеДанные.Ссылка);
	Форма = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятияВеб", пар);
	ОткрытьФорму(Форма);	

КонецПроцедуры


&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	пар = Новый Структура("Ключ", Элементы.Список.ТекущиеДанные.Ссылка);
	Форма = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятияВеб", пар);
	ОткрытьФорму(Форма);
КонецПроцедуры


&НаКлиенте
Процедура Создать(Команда)
	Форма = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятияВеб");
	ОткрытьФорму(Форма);
КонецПроцедуры

