
Процедура ЗаполнитьТабличныйДокумент(ТабДок) Экспорт
	Макет = ЭтотОбъект.ПолучитьМакет("МакетДолг");
	ТабДок.Очистить();	
	
	Если ТипЗнч(Объект) = Тип("ЗадачаСсылка.Мероприятие") Тогда
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Мероприятие = Объект;
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Область = Макет.ПолучитьОбласть("ШапкаДолг");
		
		Если Константы.УчетПоДО.Получить() = Истина Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДолговыеОбязательстваКонтрагенты.Ссылка КАК ДО,
			                      |	ДолговыеОбязательстваКонтрагенты.Значение КАК Должник
			                      |ПОМЕСТИТЬ Табл_ДО
			                      |ИЗ
			                      |	Справочник.ДолговыеОбязательства.Контрагенты КАК ДолговыеОбязательстваКонтрагенты
			                      |ГДЕ
			                      |	ДолговыеОбязательстваКонтрагенты.Значение = &Объект
			                      |	И ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = &ВидКонтрагента
			                      |;
			                      |
			                      |////////////////////////////////////////////////////////////////////////////////
			                      |ВЫБРАТЬ
			                      |	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток КАК ОсновнойДолгРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.ПроцентыРеглОстаток КАК ПроцентыРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.ШтрафыРеглОстаток КАК ШтрафыРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая1РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая2РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая3РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая4РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая5РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая6РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая7РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая8РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток КАК СуммаРеглОстаток
			                      |ИЗ
			                      |	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(
			                      |			&Период,
			                      |			Объект В
			                      |				(ВЫБРАТЬ
			                      |					ааа.ДО
			                      |				ИЗ
			                      |					Табл_ДО КАК ааа)) КАК ЗадолженностьПоОбъектамОстатки");
			Запрос.УстановитьПараметр("ВидКонтрагента", Перечисления.ВидыКонтрагентов.Должник);
		Иначе
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток КАК ОсновнойДолгРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.ПроцентыРеглОстаток КАК ПроцентыРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.ШтрафыРеглОстаток КАК ШтрафыРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая1РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая2РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая3РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая4РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая5РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая6РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая7РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая8РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток КАК СуммаРеглОстаток
			                      |ИЗ
			                      |	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&Период, Объект = &Объект) КАК ЗадолженностьПоОбъектамОстатки");							  
		КонецЕсли;
		Запрос.УстановитьПараметр("Объект", Объект);        
		
		Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
		Результат = Запрос.Выполнить().Выбрать();
				
		Область.Параметры.ОсновнойДолг = "0";		
		Область.Параметры.Проценты = "0";
		Область.Параметры.Штрафы = "0";
		Область.Параметры.Пени = "0";
		Область.Параметры.Составляющая1 = "0";
		Область.Параметры.Составляющая2 = "0";
		Область.Параметры.Составляющая3 = "0";
		Область.Параметры.Составляющая4 = "0";
		Область.Параметры.Составляющая5 = "0";
		Область.Параметры.Составляющая6 = "0";
		Область.Параметры.Составляющая7 = "0";
		Область.Параметры.Составляющая8 = "0";
		Область.Параметры.Итого = "0";
		
		Если Результат.Следующий() Тогда
			Область.Параметры.ОсновнойДолг = Формат(Результат.ОсновнойДолгРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Проценты = Формат(Результат.ПроцентыРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Штрафы = Формат(Результат.ШтрафыРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Пени = Формат(Результат.ПениРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая1 = Формат(Результат.Составляющая1РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая2 = Формат(Результат.Составляющая2РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая3 = Формат(Результат.Составляющая3РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая4 = Формат(Результат.Составляющая4РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая5 = Формат(Результат.Составляющая5РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая6 = Формат(Результат.Составляющая6РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая7 = Формат(Результат.Составляющая7РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая8 = Формат(Результат.Составляющая8РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Итого = Формат(Результат.СуммаРеглОстаток, "ЧДЦ=2; ЧН=0");		
			Область.Параметры.Валюта = Константы.ВалютаРегламентированногоУчета.Получить().НаименованиеПолное;
		КонецЕсли;
	Иначе	
		Область = Макет.ПолучитьОбласть("ШапкаДолг");
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.ПроцентыРеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.ШтрафыРеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая1РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая2РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая3РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая4РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая5РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая6РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая7РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая8РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток
		                      |ИЗ
		                      |	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&Период, Объект = &Объект) КАК ЗадолженностьПоОбъектамОстатки");
		Запрос.УстановитьПараметр("Объект", Объект);                         
		Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
		Результат = Запрос.Выполнить().Выбрать();
		
		Область.Параметры.ОсновнойДолг = "0";
		Область.Параметры.Проценты = "0";
		Область.Параметры.Штрафы = "0";
		Область.Параметры.Пени = "0";
		Область.Параметры.Составляющая1 = "0";
		Область.Параметры.Составляющая2 = "0";
		Область.Параметры.Составляющая3 = "0";
		Область.Параметры.Составляющая4 = "0";
		Область.Параметры.Составляющая5 = "0";
		Область.Параметры.Составляющая6 = "0";
		Область.Параметры.Составляющая7 = "0";
		Область.Параметры.Составляющая8 = "0";
		Область.Параметры.Итого = "0";
	
		
		Если Результат.Следующий() Тогда
			Область.Параметры.ОсновнойДолг = Формат(Результат.ОсновнойДолгРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Проценты = Формат(Результат.ПроцентыРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Штрафы = Формат(Результат.ШтрафыРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Пени = Формат(Результат.ПениРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая1 = Формат(Результат.Составляющая1РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая2 = Формат(Результат.Составляющая2РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая3 = Формат(Результат.Составляющая3РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая4 = Формат(Результат.Составляющая4РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая5 = Формат(Результат.Составляющая5РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая6 = Формат(Результат.Составляющая6РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая7 = Формат(Результат.Составляющая7РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая8 = Формат(Результат.Составляющая8РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Итого = Формат(Результат.СуммаРеглОстаток, "ЧДЦ=2; ЧН=0");		
			Область.Параметры.Валюта = Константы.ВалютаРегламентированногоУчета.Получить().НаименованиеПолное;
		КонецЕсли;
	КонецЕсли;
	
	Область.Параметры.ОсновнойДолгИмя = ПланыВидовХарактеристик.ТипыЗадолженности.ОсновнойДолг.Наименование;
	Область.Параметры.ПроцентыИмя = ПланыВидовХарактеристик.ТипыЗадолженности.Проценты.Наименование;
	Область.Параметры.ШтрафыИмя = ПланыВидовХарактеристик.ТипыЗадолженности.Штрафы.Наименование;
	Область.Параметры.ПениИмя = ПланыВидовХарактеристик.ТипыЗадолженности.Пени.Наименование;
	Область.Параметры.Составляющая1Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая1.Наименование;
	Область.Параметры.Составляющая2Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая2.Наименование;
	Область.Параметры.Составляющая3Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая3.Наименование;
	Область.Параметры.Составляющая4Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая4.Наименование;
	Область.Параметры.Составляющая5Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая5.Наименование;
	Область.Параметры.Составляющая6Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая6.Наименование;
	Область.Параметры.Составляющая7Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая7.Наименование;
	Область.Параметры.Составляющая8Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая8.Наименование;	
	
	ТабДок.Вывести(Область);
КонецПроцедуры
