
Процедура ПриЗаписи(Отказ, Замещение)
	ОбъектыОтбора = ОбъектыСервер.ОтборОбъектовПоРегистратору(ЭтотОбъект);
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ИсковыеТребованияОстатки.Займ КАК Займ,
	|	ИсковыеТребованияОстатки.ЦенаИскаОстаток КАК ЦенаИскаОстаток
	|ПОМЕСТИТЬ ТекЗадолженность
	|ИЗ
	|	РегистрНакопления.ИсковыеТребования.Остатки(, Займ В (&МассивОбъектов)) КАК ИсковыеТребованияОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыВРаботеОстатки.Объект КАК ОбъектВРаботе
	|ПОМЕСТИТЬ ОбъектыВРаботе
	|ИЗ
	|	РегистрНакопления.ОбъектыВРаботе.Остатки(, Объект В (&Объекты)) КАК ОбъектыВРаботеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыВРаботе.ОбъектВРаботе КАК ОбъектВРаботе,
	|	ТекЗадолженность.ЦенаИскаОстаток КАК ЦенаИскаОстаток
	|ИЗ
	|	ОбъектыВРаботе КАК ОбъектыВРаботе
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекЗадолженность КАК ТекЗадолженность
	|		ПО ОбъектыВРаботе.ОбъектВРаботе = ТекЗадолженность.Займ"); 
	
	Запрос.УстановитьПараметр("МассивОбъектов",ОбъектыОтбора);  
	Запрос.УстановитьПараметр("Объекты",ОбъектыОтбора);
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Набор = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(Результат.ОбъектВРаботе);
		
		Если ЗначениеЗаполнено(Результат.ОбъектВРаботе) Тогда
			
			
			Если Результат.ЦенаИскаОстаток <> 0 И Результат.ЦенаИскаОстаток <> null Тогда
				Нов = Набор.Добавить();
				Нов.Объект = Результат.ОбъектвРаботе;
				Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.Сумма;
				Нов.СуммаДО   = Результат.ЦенаИскаОстаток;
				Нов.СуммаРегл = Результат.ЦенаИскаОстаток;
			КонецЕсли;
			
			
		КонецЕсли;	
		
		Попытка
			Набор.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
			Отказ = Истина;
			Возврат;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры
