
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ФССП_СостояниеИП
	Движения.ФССП_СостояниеИП.Записывать = Истина;
	Движение = Движения.ФССП_СостояниеИП.Добавить();
	Движение.Период = Дата;
	Движение.ИП = ИсполнительноеПроизводство;
	Движение.СтатусИП = СтатусИП;
	Движение.Завершено = Завершено;
	Движение.ОтделСудебныхПриставов = ОтделСудебныхПриставов;
	Движение.СудебныйПриставИсполнитель = СудебныйПриставИсполнитель;
	Движение.ПричинаОкончания = ПричинаОкончания;
	Движение.ДатаОкончания = ДатаОкончания;
	Движение.Предмет1 = Предмет1;
	Движение.Сумма1 = Сумма1;
	Движение.Предмет2 = Предмет2;
	Движение.Сумма2 = Сумма2;
	Движение.НомерИД = НомерИД;
	Движение.НомерСД = НомерСД;
	Движение.ДатаВозбуждения = ДатаВозбуждения;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ФССП_ИсполнительноеПроизводство") Тогда
		// Заполнение шапки
		ИсполнительноеПроизводство = ДанныеЗаполнения.Ссылка;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ФССП_СостояниеИПСрезПоследних.Период КАК Период,
		                      |	ФССП_СостояниеИПСрезПоследних.Регистратор КАК Регистратор,
		                      |	ФССП_СостояниеИПСрезПоследних.НомерСтроки КАК НомерСтроки,
		                      |	ФССП_СостояниеИПСрезПоследних.Активность КАК Активность,
		                      |	ФССП_СостояниеИПСрезПоследних.ИП КАК ИП,
		                      |	ФССП_СостояниеИПСрезПоследних.bailiff КАК bailiff,
		                      |	ФССП_СостояниеИПСрезПоследних.department КАК department,
		                      |	ФССП_СостояниеИПСрезПоследних.name КАК name,
		                      |	ФССП_СостояниеИПСрезПоследних.subject КАК subject,
		                      |	ФССП_СостояниеИПСрезПоследних.ip_end КАК ip_end,
		                      |	ФССП_СостояниеИПСрезПоследних.exe_production КАК exe_production,
		                      |	ФССП_СостояниеИПСрезПоследних.details КАК details,
		                      |	ФССП_СостояниеИПСрезПоследних.СтатусИП КАК СтатусИП,
		                      |	ФССП_СостояниеИПСрезПоследних.Завершено КАК Завершено,
		                      |	ФССП_СостояниеИПСрезПоследних.ОтделСудебныхПриставов КАК ОтделСудебныхПриставов,
		                      |	ФССП_СостояниеИПСрезПоследних.СудебныйПриставИсполнитель КАК СудебныйПриставИсполнитель,
		                      |	ФССП_СостояниеИПСрезПоследних.ПричинаОкончания КАК ПричинаОкончания,
		                      |	ФССП_СостояниеИПСрезПоследних.ДатаОкончания КАК ДатаОкончания,
		                      |	ФССП_СостояниеИПСрезПоследних.Предмет1 КАК Предмет1,
		                      |	ФССП_СостояниеИПСрезПоследних.Сумма1 КАК Сумма1,
		                      |	ФССП_СостояниеИПСрезПоследних.Предмет2 КАК Предмет2,
		                      |	ФССП_СостояниеИПСрезПоследних.Сумма2 КАК Сумма2,
		                      |	ФССП_СостояниеИПСрезПоследних.Предмет3 КАК Предмет3,
		                      |	ФССП_СостояниеИПСрезПоследних.Сумма3 КАК Сумма3,
		                      |	ФССП_СостояниеИПСрезПоследних.НомерИД КАК НомерИД,
		                      |	ФССП_СостояниеИПСрезПоследних.НомерСД КАК НомерСД,
		                      |	ФССП_СостояниеИПСрезПоследних.ДатаВозбуждения КАК ДатаВозбуждения
		                      |ИЗ
		                      |	РегистрСведений.ФССП_СостояниеИП.СрезПоследних КАК ФССП_СостояниеИПСрезПоследних
		                      |ГДЕ
		                      |	ФССП_СостояниеИПСрезПоследних.ИП = &ИП");
		Запрос.УстановитьПараметр("ИП", ДанныеЗаполнения.Ссылка);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		КонецЕсли;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
