
Процедура ЗагрузитьГрафикНачислений() Экспорт

	Если ТекущийДоговор = Неопределено Тогда
		Сообщить("У данного займа не определен текущий график! Расчет исковых требований невозможен!");
		Возврат;
	КонецЕсли;	
	
	Остатки = Неопределено;
	ЭтотОбъект.ИсторияПлатежей.Выгрузить();
	График = РасчетЗадолженностиМФО.РасчитатьГрафикПлатежейИНачисленийНачальныеОстатки(ТекущийДоговор, ДатаРасчета, ЭтотОбъект.ИсторияПлатежей, Остатки); 
	ЭтотОбъект.ГрафикНачисленияИПогашения.Очистить();
	
	Для Каждого Элемент Из График Цикл
		стр = ЭтотОбъект.ГрафикНачисленияИПогашения.Добавить();
		ЗаполнитьЗначенияСвойств(стр, Элемент);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанные() Экспорт
	ТекущийДоговор = РасчетЗадолженностиМФО.ПолучитьТекущийДоговор(ЭтотОбъект.Займ, НачалоДня(ТекущаяДатаСеанса()));
	ЭтотОбъект.СуммаВыданногоЗайма = ТекущийДоговор.СуммаВыданногоЗайма;
	ЭтотОбъект.ПроцентнаяСтавка = ТекущийДоговор.ПроцентнаяСтавка;
	ЭтотОбъект.ДатаВыдачиЗайма = ТекущийДоговор.ДатаВыдачиЗайма;
	ЭтотОбъект.ДатаПогашения = ТекущийДоговор.ДатаПогашения;
	ЭтотОбъект.ПрограммаРасчета = ТекущийДоговор.ПрограммаРасчета;
	
	ЭтотОбъект.ИсторияПлатежей.Очистить();
	История = РасчетЗадолженностиМФО.ПолучитьИсториюПлатежей(ТекущийДоговор);
	Для Каждого Элемент Из История Цикл
		стр = ЭтотОбъект.ИсторияПлатежей.Добавить();
		ЗаполнитьЗначенияСвойств(стр, Элемент);
	КонецЦикла;
КонецПроцедуры