
Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	ПодразделениеПринимающее = Неопределено;
	Схема = РегистрыСведений.НастройкиБП.ПолучитьСхемуПоОперации(ЭтотОбъект.ОрганизацияПринимающая, ПодразделениеПринимающее, 
			ЭтотОбъект.Операция);	
	Для Каждого Элемент Из ЭтотОбъект.ДолговыеОбязательства Цикл
		НовыйБП = БизнесПроцессы.БизнесПроцессы.СоздатьБизнесПроцесс();
		НовыйБП.Дата = ТекущаяДатаСеанса();
		НовыйБП.Организация = ЭтотОбъект.ОрганизацияПринимающая;
		НовыйБП.Операция = ЭтотОбъект.Операция;
		НовыйБП.Автор = ЭтотОбъект.Ссылка;
		НовыйБП.Комментарий = "Документ ""Передача на выполнение""";
		НовыйБП.Объект = Элемент.Объект;		
		НовыйБП.Подразделение = ПодразделениеПринимающее;
		НовыйБП.Схема = Схема;	
		НовыйБП.БПРодитель = ЭтотОбъект.Ссылка;
		Попытка
			НовыйБП.Записать();
		Исключение
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		НовыйБП.ЗапуститьБизнесПроцесс(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
КонецПроцедуры
