
&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	ОткрытьФорму("Задача.Мероприятие.ФормаВыбора", ПараметрыФормы, Элементы.Мероприятия);
КонецПроцедуры

&НаКлиенте
Процедура МероприятияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
		НоваяСтрока = Объект.Мероприятия.Добавить();
		НоваяСтрока.Мероприятие = ВыбранныйЭлемент;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьУстановкуСрокаНаСервере()
	Если Переключатель = 1 Тогда
		ДобавитьКСроку = (ДобавитьКСрокуДней * 1440 + ДобавитьКСрокуЧасов * 60 + ДобавитьКСрокуМин) * 60;
		Для Каждого Стр ИЗ Объект.Мероприятия Цикл
			Об = Стр.Мероприятие.ПолучитьОбъект();
			Об.СрокВыполнения = Об.СрокВыполнения + ДобавитьКСроку;	
			Об.СрокВыполненияПричина = Причина;	
			Об.Записать();
		КонецЦикла;
	ИначеЕсли Переключатель = 2 Тогда
		Для Каждого Стр ИЗ Объект.Мероприятия Цикл
			Об = Стр.Мероприятие.ПолучитьОбъект();
			Об.СрокВыполнения = ПеренестиДату;	
			Об.СрокВыполненияПричина = Причина;
			Об.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьУстановкуСрока(Команда)
	ВыполнитьУстановкуСрокаНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьКСрокуДнейПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьКСрокуЧасовПриИзменении(Элемент)
	Если ДобавитьКСрокуЧасов > 23 Тогда
		ДобавитьКСрокуЧасов = 23;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьКСрокуМинПриИзменении(Элемент)
	Если ДобавитьКСрокуМин > 59 Тогда
		ДобавитьКСрокуМин = 59;
	КонецЕсли;	
КонецПроцедуры

