
Процедура ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийОбъекты, ТаблицаДвиженийСобытия) Экспорт
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("МоментДо", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Автор", ЭтотОбъект.Автор);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ЗагрузкаВПроизвВалюте", ЭтотОбъект.Пересчитать);
	Запрос.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	АктуализацияЗадолженностиОбъекты.Ссылка,
	               |	АктуализацияЗадолженностиОбъекты.НомерСтроки,
	               |	АктуализацияЗадолженностиОбъекты.Объект,
	               |	ВЫБОР
	               |		КОГДА АктуализацияЗадолженностиОбъекты.ВалютаЗагрузки = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	               |			ТОГДА &ВалютаРегл
	               |		ИНАЧЕ АктуализацияЗадолженностиОбъекты.ВалютаЗагрузки
	               |	КОНЕЦ КАК ВалютаЗагрузки,
	               |	АктуализацияЗадолженностиОбъекты.ОсновнойДолг,
	               |	АктуализацияЗадолженностиОбъекты.Проценты,
	               |	АктуализацияЗадолженностиОбъекты.Штрафы,
	               |	АктуализацияЗадолженностиОбъекты.Пени,
	               |	АктуализацияЗадолженностиОбъекты.Составляющая1,
	               |	АктуализацияЗадолженностиОбъекты.Составляющая2,
	               |	АктуализацияЗадолженностиОбъекты.Составляющая3,
	               |	АктуализацияЗадолженностиОбъекты.Составляющая4,
	               |	АктуализацияЗадолженностиОбъекты.Составляющая5,
	               |	АктуализацияЗадолженностиОбъекты.Составляющая6,
	               |	АктуализацияЗадолженностиОбъекты.Составляющая7,
	               |	АктуализацияЗадолженностиОбъекты.Составляющая8
	               |ПОМЕСТИТЬ Объекты
	               |ИЗ
	               |	Документ.АктуализацияЗадолженности.Объекты КАК АктуализацияЗадолженностиОбъекты
	               |ГДЕ
	               |	АктуализацияЗадолженностиОбъекты.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Объекты.Объект
	               |ИЗ
	               |	Объекты КАК Объекты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Объекты.Объект
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(*) > 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Объекты.Ссылка,
	               |	Объекты.Объект,
	               |	Объекты.НомерСтроки,
	               |	Объекты.ВалютаЗагрузки,
	               |	ЕСТЬNULL(ДолговыеОбязательства.ВалютаДоговора, &ВалютаРегл) КАК ВалютаДоговора,
	               |	Объекты.ОсновнойДолг,
	               |	Объекты.Проценты,
	               |	Объекты.Штрафы,
	               |	Объекты.Пени,
	               |	Объекты.Составляющая1,
	               |	Объекты.Составляющая2,
	               |	Объекты.Составляющая3,
	               |	Объекты.Составляющая4,
	               |	Объекты.Составляющая5,
	               |	Объекты.Составляющая6,
	               |	Объекты.Составляющая7,
	               |	Объекты.Составляющая8
	               |ПОМЕСТИТЬ ОбъектыПлюсВалютаДоговора
	               |ИЗ
	               |	Объекты КАК Объекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	               |		ПО Объекты.Объект = ДолговыеОбязательства.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Объекты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Валюта,
	               |	КурсыВалютСрезПоследних.Курс * КурсыВалютСрезПоследних.Кратность КАК Курс
	               |ПОМЕСТИТЬ СрезПоДате
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбъектыПлюсВалютаДоговора.Ссылка,
	               |	ОбъектыПлюсВалютаДоговора.Объект,
	               |	ОбъектыПлюсВалютаДоговора.НомерСтроки,
	               |	ОбъектыПлюсВалютаДоговора.ВалютаЗагрузки,
	               |	ОбъектыПлюсВалютаДоговора.ВалютаДоговора,
	               |	СрезПоДате1.Курс КАК КурсДО,
	               |	СрезПоДате2.Курс КАК КурсЗАГ,
	               |	ОбъектыПлюсВалютаДоговора.ОсновнойДолг,
	               |	ОбъектыПлюсВалютаДоговора.Проценты,
	               |	ОбъектыПлюсВалютаДоговора.Штрафы,
	               |	ОбъектыПлюсВалютаДоговора.Пени,
	               |	ОбъектыПлюсВалютаДоговора.Составляющая1,
	               |	ОбъектыПлюсВалютаДоговора.Составляющая2,
	               |	ОбъектыПлюсВалютаДоговора.Составляющая3,
	               |	ОбъектыПлюсВалютаДоговора.Составляющая4,
	               |	ОбъектыПлюсВалютаДоговора.Составляющая5,
	               |	ОбъектыПлюсВалютаДоговора.Составляющая6,
	               |	ОбъектыПлюсВалютаДоговора.Составляющая7,
	               |	ОбъектыПлюсВалютаДоговора.Составляющая8
	               |ПОМЕСТИТЬ Итог
	               |ИЗ
	               |	ОбъектыПлюсВалютаДоговора КАК ОбъектыПлюсВалютаДоговора
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СрезПоДате КАК СрезПоДате1
	               |		ПО (СрезПоДате1.Валюта = ОбъектыПлюсВалютаДоговора.ВалютаДоговора)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СрезПоДате КАК СрезПоДате2
	               |		ПО (СрезПоДате2.Валюта = ОбъектыПлюсВалютаДоговора.ВалютаЗагрузки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ СрезПоДате
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ОбъектыПлюсВалютаДоговора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Итог.Ссылка КАК Регистратор,
	               |	Итог.Объект,
	               |	Итог.ВалютаДоговора КАК ВалютаДО,
	               |	Итог.ВалютаЗагрузки КАК ВалютаЗАГ,
	               |	&Период КАК Период,
	               |	Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8 КАК СуммаВВалютеЗагрузки,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = Итог.ВалютаДоговора
	               |			ТОГДА Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА (Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8) / Итог.КурсДО
	               |		ИНАЧЕ (Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8) * Итог.КурсЗАГ
	               |	КОНЕЦ КАК СуммаДООстаток,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8
	               |		ИНАЧЕ (Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8) * Итог.КурсЗАГ
	               |	КОНЕЦ КАК СуммаРеглОстаток,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = Итог.ВалютаДоговора
	               |			ТОГДА Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА (Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8) / Итог.КурсДО
	               |		ИНАЧЕ (Итог.ОсновнойДолг + Итог.Проценты + Итог.Пени + Итог.Штрафы + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8) * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.СуммаДООстаток, 0) КАК СуммаДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8
	               |		ИНАЧЕ (Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8) * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток, 0) КАК СуммаРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = Итог.ВалютаДоговора
	               |			ТОГДА Итог.ОсновнойДолг
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.ОсновнойДолг / Итог.КурсДО
	               |		ИНАЧЕ Итог.ОсновнойДолг * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.ОсновнойДолгДООстаток, 0) КАК ОсновнойДолгДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.ОсновнойДолг
	               |		ИНАЧЕ Итог.ОсновнойДолг * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток, 0) КАК ОсновнойДолгРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = Итог.ВалютаДоговора
	               |			ТОГДА Итог.Проценты
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Проценты / Итог.КурсДО
	               |		ИНАЧЕ Итог.Проценты * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.ПроцентыДООстаток, 0) КАК ПроцентыДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Проценты
	               |		ИНАЧЕ Итог.Проценты * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.ПроцентыРеглОстаток, 0) КАК ПроцентыРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = Итог.ВалютаДоговора
	               |			ТОГДА Итог.Штрафы
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Штрафы / Итог.КурсДО
	               |		ИНАЧЕ Итог.Штрафы * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.ШтрафыДООстаток, 0) КАК ШтрафыДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Штрафы
	               |		ИНАЧЕ Итог.Штрафы * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.ШтрафыРеглОстаток, 0) КАК ШтрафыРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = Итог.ВалютаДоговора
	               |			ТОГДА Итог.Пени
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Пени / Итог.КурсДО
	               |		ИНАЧЕ Итог.Пени * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.ПениДООстаток, 0) КАК ПениДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Пени
	               |		ИНАЧЕ Итог.Пени * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток, 0) КАК ПениРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = Итог.ВалютаДоговора
	               |			ТОГДА Итог.Составляющая1
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая1 / Итог.КурсДО
	               |		ИНАЧЕ Итог.Составляющая1 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая1ДООстаток, 0) КАК Составляющая1ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая1
	               |		ИНАЧЕ Итог.Составляющая1 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая1РеглОстаток, 0) КАК Составляющая1Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = Итог.ВалютаДоговора
	               |			ТОГДА Итог.Составляющая2
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая2 / Итог.КурсДО
	               |		ИНАЧЕ Итог.Составляющая2 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая2ДООстаток, 0) КАК Составляющая2ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая2
	               |		ИНАЧЕ Итог.Составляющая2 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая2РеглОстаток, 0) КАК Составляющая2Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = Итог.ВалютаДоговора
	               |			ТОГДА Итог.Составляющая3
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая3 / Итог.КурсДО
	               |		ИНАЧЕ Итог.Составляющая3 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая3ДООстаток, 0) КАК Составляющая3ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая3
	               |		ИНАЧЕ Итог.Составляющая3 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая3РеглОстаток, 0) КАК Составляющая3Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = Итог.ВалютаДоговора
	               |			ТОГДА Итог.Составляющая4
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая4 / Итог.КурсДО
	               |		ИНАЧЕ Итог.Составляющая4 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая4ДООстаток, 0) КАК Составляющая4ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая4
	               |		ИНАЧЕ Итог.Составляющая4 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая4РеглОстаток, 0) КАК Составляющая4Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = Итог.ВалютаДоговора
	               |			ТОГДА Итог.Составляющая5
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая5 / Итог.КурсДО
	               |		ИНАЧЕ Итог.Составляющая5 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая5ДООстаток, 0) КАК Составляющая5ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая5
	               |		ИНАЧЕ Итог.Составляющая5 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая5РеглОстаток, 0) КАК Составляющая5Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = Итог.ВалютаДоговора
	               |			ТОГДА Итог.Составляющая6
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая6 / Итог.КурсДО
	               |		ИНАЧЕ Итог.Составляющая6 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая6ДООстаток, 0) КАК Составляющая6ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая6
	               |		ИНАЧЕ Итог.Составляющая6 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая6РеглОстаток, 0) КАК Составляющая6Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = Итог.ВалютаДоговора
	               |			ТОГДА Итог.Составляющая7
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая7 / Итог.КурсДО
	               |		ИНАЧЕ Итог.Составляющая7 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая7ДООстаток, 0) КАК Составляющая7ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая7
	               |		ИНАЧЕ Итог.Составляющая7 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая7РеглОстаток, 0) КАК Составляющая7Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = Итог.ВалютаДоговора
	               |			ТОГДА Итог.Составляющая8
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая8 / Итог.КурсДО
	               |		ИНАЧЕ Итог.Составляющая8 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая8ДООстаток, 0) КАК Составляющая8ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалютаЗагрузки = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая8
	               |		ИНАЧЕ Итог.Составляющая8 * Итог.КурсЗАГ
	               |	КОНЕЦ - ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая8РеглОстаток, 0) КАК Составляющая8Регл,
	               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) КАК ОстатокВРаботе
	               |ПОМЕСТИТЬ ДОЗагрузка
	               |ИЗ
	               |	Итог КАК Итог
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(&МоментДо, ) КАК ОбъектыВРаботеОстатки
	               |		ПО Итог.Объект = ОбъектыВРаботеОстатки.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&МоментДо, ) КАК ЗадолженностьПоОбъектамОстатки
	               |		ПО Итог.Объект = ЗадолженностьПоОбъектамОстатки.Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Итог
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДОЗагрузка.Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	ВЫБОР
	               |		КОГДА ДОЗагрузка.СуммаДО > 0
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидДвиженияЗадолженности.Начисление)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидДвиженияЗадолженности.Списание)
	               |	КОНЕЦ КАК ВидДвиженияЗадолженности,
	               |	ДОЗагрузка.Объект,
	               |	ДОЗагрузка.ВалютаДО,
	               |	ДОЗагрузка.СуммаДО,
	               |	ДОЗагрузка.СуммаРегл,
	               |	ДОЗагрузка.ОсновнойДолгДО,
	               |	ДОЗагрузка.ОсновнойДолгРегл,
	               |	ДОЗагрузка.ПроцентыДО,
	               |	ДОЗагрузка.ПроцентыРегл,
	               |	ДОЗагрузка.ШтрафыДО,
	               |	ДОЗагрузка.ШтрафыРегл,
	               |	ДОЗагрузка.ПениДО,
	               |	ДОЗагрузка.ПениРегл,
	               |	ДОЗагрузка.Составляющая1ДО,
	               |	ДОЗагрузка.Составляющая1Регл,
	               |	ДОЗагрузка.Составляющая2ДО,
	               |	ДОЗагрузка.Составляющая2Регл,
	               |	ДОЗагрузка.Составляющая3ДО,
	               |	ДОЗагрузка.Составляющая3Регл,
	               |	ДОЗагрузка.Составляющая4ДО,
	               |	ДОЗагрузка.Составляющая4Регл,
	               |	ДОЗагрузка.Составляющая5ДО,
	               |	ДОЗагрузка.Составляющая5Регл,
	               |	ДОЗагрузка.Составляющая6ДО,
	               |	ДОЗагрузка.Составляющая6Регл,
	               |	ДОЗагрузка.Составляющая7ДО,
	               |	ДОЗагрузка.Составляющая7Регл,
	               |	ДОЗагрузка.Составляющая8ДО,
	               |	ДОЗагрузка.Составляющая8Регл,
	               |	ДОЗагрузка.ОстатокВРаботе
	               |ИЗ
	               |	ДОЗагрузка КАК ДОЗагрузка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДОЗагрузка.Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗагруженаЗадолженность) КАК ВидСобытия,
	               |	ДОЗагрузка.Регистратор КАК ИсточникСобытия,
	               |	ДОЗагрузка.Объект,
	               |	&Автор,
	               |	ДОЗагрузка.СуммаРегл КАК СуммаДокумента
	               |ИЗ
	               |	ДОЗагрузка КАК ДОЗагрузка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ДОЗагрузка";			   
	Результат = Запрос.ВыполнитьПакет();
	Если Не Результат[1].Пустой() Тогда
		ВызватьИсключение "Дублирование Объектов табличной части!";
		Возврат;
	КонецЕсли;
	ТаблицаДвиженийОбъекты = Результат[Результат.ВГраница() - 2].Выгрузить();
	ТаблицаДвиженийСобытия = Результат[Результат.ВГраница() - 1].Выгрузить();
КонецПроцедуры

Процедура ПровестиПоследовательность(ЭтотОбъект) Экспорт
	//Корректировка последовательности, поиск первого документа актуализации и его ПРОГРАММНОЕ перепроведение
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаОб.Объект
	                      |ПОМЕСТИТЬ ТаблицаОб
	                      |ИЗ
	                      |	&ТаблицаОб КАК ТаблицаОб
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаОб.Объект КАК Объект,
	                      |	АктуализацияЗадолженностиОбъекты.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	ТаблицаОб КАК ТаблицаОб
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктуализацияЗадолженности.Объекты КАК АктуализацияЗадолженностиОбъекты
	                      |		ПО ТаблицаОб.Объект = АктуализацияЗадолженностиОбъекты.Объект
	                      |			И (АктуализацияЗадолженностиОбъекты.Ссылка.МоментВремени > &МоментВремени)
	                      |			И (АктуализацияЗадолженностиОбъекты.Ссылка.Проведен)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Объект,
	                      |	АктуализацияЗадолженностиОбъекты.Ссылка.МоментВремени");
	Запрос.УстановитьПараметр("МоментВремени", ЭтотОбъект.МоментВремени());
	Запрос.УстановитьПараметр("ТаблицаОб", ЭтотОбъект.Объекты.Выгрузить(, "Объект"));
	Результат = Запрос.Выполнить().Выбрать();
	ТаблицаАЗ = Новый ТаблицаЗначений();
	ТаблицаАЗ.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.АктуализацияЗадолженности"));
	
	Пока Результат.СледующийПоЗначениюПоля("Объект") Цикл
		ТаблицаАЗ.Добавить().Ссылка = Результат.Ссылка;
	КонецЦикла;
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаАЗ.Ссылка 
	               |ПОМЕСТИТЬ ТаблицаАЗ
	               |ИЗ
	               |	&ТаблицаАЗ КАК ТаблицаАЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаАЗ.Ссылка
	               |ИЗ
	               |	ТаблицаАЗ КАК ТаблицаАЗ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаАЗ.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТаблицаАЗ.Ссылка.МоментВремени";
	Запрос.УстановитьПараметр("ТаблицаАЗ", ТаблицаАЗ);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ТаблицаДвиженийОбъекты = Неопределено;
		ТаблицаДвиженийСобытия = Неопределено;

		Документы.АктуализацияЗадолженности.ИнициализироватьДанныеДокумента(Результат.Ссылка, ТаблицаДвиженийОбъекты, 
				ТаблицаДвиженийСобытия);
		
		Набор = РегистрыНакопления.ЗадолженностьПоОбъектам.СоздатьНаборЗаписей();
		Набор.Отбор["Регистратор"].Значение = Результат.Ссылка;
		Набор.Прочитать();
		Набор.Загрузить(ТаблицаДвиженийОбъекты);
		Набор.Записать();
		
		Набор = РегистрыНакопления.СобытияПоОбъектам.СоздатьНаборЗаписей();
		Набор.Отбор["Регистратор"].Значение = Результат.Ссылка;
		Набор.Прочитать();
		Набор.Загрузить(ТаблицаДвиженийСобытия);
		Набор.Записать();
	КонецЦикла;   	
КонецПроцедуры
