
Процедура ОбработкаУдаленияПроведения(Отказ)
	//ПроведениеСервер.ОчиститьДвиженияДокумента(ЭтотОбъект,, Отказ);
	
	//Корректировка последовательности, поиск первого документа актуализации и его ПРОГРАММНОЕ перепроведение 
	ЭтотОбъект.Движения.ЗадолженностьПоОбъектам.Записывать = Истина;
	ЭтотОбъект.Движения.ЗадолженностьПоОбъектамВнесудебная.Записывать = Истина;
	ЭтотОбъект.Движения.Записать();      
	ОбъектыСервер.УдалитьСтадииОтменаПроведения(ЭтотОбъект);
  	Документы.АктуализацияЗадолженности.ПровестиПоследовательность(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	Если ВалютаРегл = Справочники.Валюты.ПустаяСсылка() Тогда
		Сообщить("Не определена валюта регламентированного учета!");
		Отказ = Истина;
	КонецЕсли; 
	
	СтарыйУчет = Константы.ИспользоватьСтандарныйУчетЗадолженности.Получить();
	
	ТаблицаДвиженийОбъекты = Неопределено;
	ТаблицаДвиженийСобытия = Неопределено;
	
	Документы.АктуализацияЗадолженности.ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийОбъекты, 
			ТаблицаДвиженийСобытия);
		
	Если Не Отказ И ТаблицаДвиженийОбъекты.Количество() > 0 Тогда
		Если СтарыйУчет Тогда
			ЭтотОбъект.Движения.ЗадолженностьПоОбъектам.Загрузить(ТаблицаДвиженийОбъекты);
			ЭтотОбъект.Движения.ЗадолженностьПоОбъектам.Записывать = Истина;
		Иначе
			ЭтотОбъект.Движения.ЗадолженностьПоОбъектамВнесудебная.Загрузить(ТаблицаДвиженийОбъекты);
			ЭтотОбъект.Движения.ЗадолженностьПоОбъектамВнесудебная.Записывать = Истина;
		КонецЕсли;
	КонецЕсли;		
			
	Если Не Отказ И ТаблицаДвиженийСобытия.Количество() > 0 Тогда
		ЭтотОбъект.Движения.СобытияПоОбъектам.Загрузить(ТаблицаДвиженийСобытия);
		ЭтотОбъект.Движения.СобытияПоОбъектам.Записывать = Истина;
	КонецЕсли;		
			
	ЭтотОбъект.Движения.Записать();	
	
	//Корректировка последовательности, поиск первого документа актуализации и его ПРОГРАММНОЕ перепроведение
  	Документы.АктуализацияЗадолженности.ПровестиПоследовательность(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);	
КонецПроцедуры
