
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Определитель = "https://www.kody.su/check-tel";  
КонецПроцедуры

&НаКлиенте
Процедура Запросить()
	Если ЗначениеЗаполнено(ЭтаФорма.Номер) = Истина Тогда
		document = ЭтаФорма.Элементы.Определитель.Документ;
		number = document.querySelector(".imp:nth-child(1)");
		number.value = ЭтаФорма.Номер;
		searchbutton = document.querySelector(".imp:nth-child(3)");
		searchbutton.click();
		ПодключитьОбработчикОжидания("ПолучитьОператораИРегион", 1, Истина);
	Иначе
		Предупреждение("Не заполнен номер телефона!",,"Определение оператора и региона");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОператораИРегион()
	document = ЭтаФорма.Элементы.Определитель.Документ;
	operatorregion = СтрЗаменить(СтрЗаменить(document.querySelector("strong:nth-child(2)").firstChild.nodeValue, "[", "("), "]", ")");
	ЭтаФорма.ОператорИРегион = СтрЗаменить(operatorregion, ",", "");
	time = document.querySelector("#time").firstChild.nodeValue;
	ЭтаФорма.ВремяВРегионе = time;
	mnp = СтрЗаменить(СтрЗаменить(document.querySelector("p:nth-child(10)").innerHTML, "<b>", ""), "</b>", "");
	ЭтаФорма.ПереносКДругомуОператору = mnp;
КонецПроцедуры

