&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Имущество) Тогда
	
		УстановитьТипИмущества(Объект.Имущество);
	
	КонецЕсли;
	
	Объект.Источник = Справочники.ИсточникиСведений.РучнойВвод;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмуществоПриИзменении(Элемент)
	
	ИмуществоПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИмуществоПриИзмененииНаСервере()

	ТипыИмущества.Очистить();
	УстановитьТипИмущества(Объект.Имущество);
	ПроверитьКорректностьСвойств(ТипыИмущества);

КонецПроцедуры

&НаСервере
Процедура УстановитьТипИмущества(Имущество)

	ДопустимыеТипы = Справочники[Имущество.Метаданные().Имя].ДопустимыеВариантыСвойст();
	Для каждого ДопустимыйТип Из ДопустимыеТипы Цикл
	
		ВыводимыйТип = ТипыИмущества.Добавить();
		ВыводимыйТип.Тип = ДопустимыйТип;
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПроверитьКорректностьСвойств(КонтролирующийТипИмущества)

	ПроверитьЗаполнение();

КонецПроцедуры

&НаКлиенте
Процедура ДанныеСвойствоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Данные.ТекущиеДанные;
	ТипСвойства = ТекущиеДанные.Свойство.ТипЗначения;
	
	ТекущиеДанные.Значение = УправлениеДанными.ЗначениеПоУмолчанию(ТипСвойства);

КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.Данные.ТекущиеДанные;
	УправлениеДанными.ОграничитьТипыЗначения(
		ТекущиеДанные.Свойство,
		Элемент
	);

КонецПроцедуры







