Функция ПолучитьЗначениеСвойстваОбъекта(ВходящийОбъект, ВходящееСвойство) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект = &Объект
		|	И ДополнительныеСведения.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект", ВходящийОбъект);
	Запрос.УстановитьПараметр("Свойство", ВходящееСвойство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗначениеСвойстваОбъекта = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Значение");
	
	Возврат ЗначениеСвойстваОбъекта;

КонецФункции // ()
