
Функция ПроверитьВыполнениеСкоринга(КоличествоЧасов) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыСкоринга.Ссылка
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ВидыСкоринга КАК ВидыСкоринга
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентныеДействияПоКатегориям КАК РегламентныеДействияПоКатегориям
	                      |		ПО (РегламентныеДействияПоКатегориям.РегламентноеДействие = ВидыСкоринга.Ссылка)
	                      |ГДЕ
	                      |	ВидыСкоринга.Используется
	                      |	И ЕСТЬNULL(РегламентныеДействияПоКатегориям.ДатаЗавершенияПоследнегоЗапуска, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) < &Дата");
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 3600 * КоличествоЧасов); 
	Возврат Не Запрос.Выполнить().Выбрать().Следующий();
КонецФункции
