
&НаКлиенте
Процедура ВидОбеспеченияПриИзменении(Элемент)
	СброситьДанные();
	ПроверитьАктуальность();
	УправлениеВидимостьюКлиент();
КонецПроцедуры   

&НаСервере
Функция ВидОбеспечительстваПоручительство()
	Возврат Перечисления.ВидыОбеспечения.Поручительство; 
КонецФункции   

&НаСервере
Функция ВидОбеспечительстваЗалог()
	Возврат Перечисления.ВидыОбеспечения.Залог; 
КонецФункции  

 &НаСервере
Функция ВидОбеспечительстваСтрахование()
	Возврат Перечисления.ВидыОбеспечения.Страхование; 
КонецФункции   

 &НаСервере
Процедура СброситьДанные()
	Объект.Поручитель = "";
	Объект.ПризнакНаличияФраншизы = Ложь;
	Объект.ПредметЗалога = "";
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьИзСпискаПоручителейНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Поручительства.Поручитель КАК Поручитель
		|ИЗ
		|	РегистрСведений.Поручительства КАК Поручительства
		|ГДЕ
		|	Поручительства.ДолговоеОбязательство = &ДолговоеОбязательство";
	
	Запрос.УстановитьПараметр("ДолговоеОбязательство", Объект.ОбъектОбеспечительства);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Поручитель = ВыборкаДетальныеЗаписи.Поручитель;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзСпискаПоручителей(Команда)
	ЗаполнитьИзСпискаПоручителейНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьВСписокПоручителейНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Поручитель) И ЗначениеЗаполнено(Объект.ОбъектОбеспечительства) Тогда 
		МЗ = РегистрыСведений.Поручительства.СоздатьМенеджерЗаписи();
		МЗ.ДолговоеОбязательство = Объект.ОбъектОбеспечительства;
		МЗ.Поручитель = Объект.Поручитель;
		МЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВСписокПоручителей(Команда)
	ДобавитьВСписокПоручителейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюКлиент();
КонецПроцедуры   

&НаКлиенте
Процедура УправлениеВидимостьюКлиент()
	Если Объект.ВидОбеспечения = ВидОбеспечительстваПоручительство() Тогда
		Элементы.ГруппаПоручитель.Видимость = Истина;
	Иначе
		Элементы.ГруппаПоручитель.Видимость = Ложь;
	КонецЕсли;  
	
	Если Объект.ВидОбеспечения = ВидОбеспечительстваСтрахование() Тогда
		Элементы.ПризнакНаличияФраншизы.Видимость = Истина;
		
	Иначе
		Элементы.ПризнакНаличияФраншизы.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ВидОбеспечения = ВидОбеспечительстваЗалог() Тогда
		Элементы.ГруппаЗалог.Видимость = Истина;   
	Иначе
		Элементы.ГруппаЗалог.Видимость = Ложь;
	КонецЕсли;   
	
КонецПроцедуры  


&НаКлиенте
Процедура ПроверитьАктуальность()
	
	Если Объект.ВидОбеспечения = ВидОбеспечительстваСтрахование() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = ЭтаФорма.Элементы.ВалютаСтоимостиПредметаДоговора;
		Сообщение.Текст = "Поля Валюта и Стоимость предмета договора для Страхования неактуальны при использовании Единого формата отчета в БКИ";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если Объект.ВидОбеспечения = ВидОбеспечительстваЗалог() Тогда 
		Если Не ЗначениеЗаполнено(Объект.КодОКАТОМестаНахожденияЗалога) ИЛИ Не ЗначениеЗаполнено(Объект.АктуальнаяСтоимостьПредметаЗалога) ИЛИ ЗначениеЗаполнено(Объект.ДатаРасчетаАктуальнойСтоимостиПредметаЗалога) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Поле = "Объект.КодОКАТОМестаНахожденияЗалога";
			Сообщение.Текст = "Поля Код ОКАТО, Акутальная  стоимость и дата расчета актуальной стоимости необходимы при использовании Единого формата отчета в БКИ";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры 



