
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЯчейкаДата = ПолеИсходнойТаблицы.Область("R1C1");
	ЯчейкаДата.Текст = "Дата платежа";
	ЯчейкаСумма = ПолеИсходнойТаблицы.Область("R1C2");
	ЯчейкаСумма.Текст = "Сумма платежа";
КонецПроцедуры

&НаКлиенте
Процедура ФайлИмпортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл платежей...";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Табличный документ(*.xls, *.xlsx, *.ods)|*.xls?;*.ods|";
	//МассивПутейДокументов = Новый Массив;
	Если Диалог.Выбрать() Тогда
		ФайлИмпорта = Диалог.ПолноеИмяФайла;
		ДД = новый ДвоичныеДанные(ФайлИмпорта);
		ЗагрузитьТабличныйДокумент(ПолеИсходнойТаблицы,ДД);	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТабличныйДокумент(ПолеИсходнойТаблицы,ДД)
	Попытка
		ПолеИсходнойТаблицы.Прочитать(ФайлИмпорта);
	Исключение
		//Сообщить(ОписаниеОшибки());
		//Загружено = РаботаСДокументами.мПрочитатьТабличныйДокументИзExcel(ПолеИсходнойТаблицы, ФайлИмпорта, 1);
		Загружено = РаботаСДокументами.ПрочитатьТабличныйДокументExcelизДвоичныхДанных(ПолеИсходнойТаблицы,ДД,1);
	КонецПопытки	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНаДругуюФорму(Команда)
	ВладелецФормы.Объект.СписокПлатежей.Очистить();
	Для НомерСтроки = 2 По ПолеИсходнойТаблицы.ВысотаТаблицы Цикл		
		Нов = ВладелецФормы.Объект.СписокПлатежей.Добавить();
		Нов.СуммаПлатежа = ПолеИсходнойТаблицы.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C2").Текст;
		Попытка
			Нов.ДатаПлатежа = Дата(ПолеИсходнойТаблицы.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C1").Текст + " 00:00:00");
		Исключение
			Нов.ДатаПлатежа = Дата(1,1,1);
		КонецПопытки;	
	КонецЦикла;
	ЭтаФорма.Закрыть(); 	
КонецПроцедуры