
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЯчейкаДата = ПолеИсходнойТаблицы.Область("R1C1");
	ЯчейкаДата.Текст = "Дата платежа";
	ЯчейкаСумма = ПолеИсходнойТаблицы.Область("R1C2");
	ЯчейкаСумма.Текст = "Сумма платежа";
КонецПроцедуры

#Область СчитатьФайл

&НаКлиенте
Асинх Процедура ПрочитатьФайлСКлиента()

	ДанныеПрочитанногоФайла = Неопределено;
	Попытка
	
		ДанныеПрочитанногоФайла = Ждать УправлениеЗагрузкойКлиент.ИмпортироватьФайл(ЭтаФорма.УникальныйИдентификатор);
	
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ДанныеПрочитанногоФайла) Тогда
	
		Возврат;
	
	КонецЕсли;
	
	ПолеИсходнойТаблицы = ДанныеПрочитанногоФайла["ТабличныйДокумент"];
	ФайлИмпорта = ДанныеПрочитанногоФайла["ПутьФайлаНаКлиенте"];

КонецПроцедуры

&НаКлиенте
Процедура ФайлИмпортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПрочитатьФайлСКлиента();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДобавитьНаДругуюФорму(Команда)
	ВладелецФормы.Объект.СписокПлатежей.Очистить();
	Для НомерСтроки = 2 По ПолеИсходнойТаблицы.ВысотаТаблицы Цикл		
		Нов = ВладелецФормы.Объект.СписокПлатежей.Добавить();
		Нов.СуммаПлатежа = ПолеИсходнойТаблицы.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C2").Текст;
		Попытка
			Нов.ДатаПлатежа = Дата(ПолеИсходнойТаблицы.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C1").Текст + " 00:00:00");
		Исключение
			Нов.ДатаПлатежа = Дата(1,1,1);
		КонецПопытки;	
	КонецЦикла;
	ЭтаФорма.Закрыть(); 	
КонецПроцедуры