
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СтатусыШПИРегистрация
	Движения.СтатусыШПИРегистрация.Записывать = Истина;
	Для Каждого ТекСтрокаШПИ Из ШПИ Цикл
		Движение = Движения.СтатусыШПИРегистрация.Добавить();
		Движение.Период = Дата;
		Движение.ШПИ = ТекСтрокаШПИ.ШПИ;
		Движение.Корреспонденция = ТекСтрокаШПИ.Корреспонденция;
		Движение.ИдентификаторПочты = ТекСтрокаШПИ.ИдентификаторПочты;
		Движение.Статус = ТекСтрокаШПИ.Статус;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
