
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СтатусыШПИРегистрация
	Движения.СтатусыШПИРегистрация.Записывать = Истина;
	Для Каждого ТекСтрокаШПИ Из ШПИ Цикл
		Если ЗначениеЗаполнено(ТекСтрокаШПИ.ШПИ) Тогда
			Движение = Движения.СтатусыШПИРегистрация.Добавить();
			Движение.Период = Дата;
			Движение.ШПИ = ТекСтрокаШПИ.ШПИ;
			Движение.Корреспонденция = ТекСтрокаШПИ.Корреспонденция;
			Движение.ИдентификаторПочты = ТекСтрокаШПИ.ИдентификаторПочты;
			Движение.Статус = ТекСтрокаШПИ.Статус;
		КонецЕсли;
	КонецЦикла;
	
	Если Движения.СтатусыШПИРегистрация.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
