
&НаСервере
Процедура ПриОткрытииНаСервере()
	// Получим непредопредленное значение с сервера
	ЭтаФорма.РольАБД = РольДоступна("АБД");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Получим непредопредленное значение с сервера
	ПриОткрытииНаСервере();
КонецПроцедуры

 &НаСервере
Процедура СформироватьСпискиНаСервере()
	ФоновыеЗадания.Выполнить("ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвона",,,"Формирование списков автообзвона");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписки(Команда)
	Если ЭтаФорма.РольАБД = Истина Тогда
		ПоказатьОповещениеПользователя("Формирование списков автообзвона",,"Задание запущено в фоновом режиме",БиблиотекаКартинок.NC_Подсистема_тсАдминистрирование);
		СформироватьСпискиНаСервере();
	Иначе
		Предупреждение("Нарушение прав доступа!",,"Предупреждение");
	КонецЕсли;
КонецПроцедуры

 &НаСервере
Процедура УдалитьСпискиНаСервере()
	ФоновыеЗадания.Выполнить("ФоновыеЗаданияМодуль.УдалениеСписковАвтообзвона",,,"Удаление списков автообзвона");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСписки(Команда)
	Если ЭтаФорма.РольАБД = Истина Тогда
		ПоказатьОповещениеПользователя("Удаление списков автообзвона",,"Задание запущено в фоновом режиме",БиблиотекаКартинок.NC_Подсистема_тсАдминистрирование);
		УдалитьСпискиНаСервере();
	Иначе
		Предупреждение("Нарушение прав доступа!",,"Предупреждение");
	КонецЕсли;
КонецПроцедуры