Процедура ЗаполнитьСклоненияВФоне(ПараметрыЗаполнения, Адрес) Экспорт

	НовыеИмена = ОбработатьИмена(ПараметрыЗаполнения["Имена"]);
	
	Для каждого Имя Из НовыеИмена Цикл
	
		ЗаписатьНаборСклонений(ПараметрыЗаполнения["Контрагент"], Имя);
	
	КонецЦикла;
	
	Счетчик = 0;
	Пока Счетчик < 10000000 Цикл
	
		Счетчик = Счетчик + 1;
	
	КонецЦикла;

КонецПроцедуры

#Область Техническая

Функция ОбработатьИмена(ИменаИзТабличнойЧасти)

	НовыеИмена = Новый Массив;
	
	Для каждого Имя Из ИменаИзТабличнойЧасти Цикл
	
		НовоеИмя = ОбработатьИмя(Имя);
		Если Не ЗначениеЗаполнено(НовоеИмя) Тогда
		
			Продолжить;
		
		КонецЕсли;
		НовыеИмена.Добавить(НовоеИмя);
	
	КонецЦикла;
	
	Возврат НовыеИмена;

КонецФункции

Функция ОбработатьИмя(Знач Имя)

	НовоеИмя = СокрЛП(Имя);
	НовоеИмя = ТРег(НовоеИмя);
	НовоеИмя = СтрЗаменить(НовоеИмя, "ё", "е");
	
	Возврат НовоеИмя;

КонецФункции

Функция ЗаписатьНаборСклонений(Элемент, ИмяТЧ)

	НаборЗаписей = РегистрыСведений.СклонениеФИО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Элемент);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Контрагент = Элемент;
	
	Выборка = РегистрыСведений.СклонениеФИО.ИзмененоВРучную(Элемент, ИмяТЧ);
	Если Выборка <> Неопределено И Выборка.Следующий() Тогда
	
		НоваяЗапись.Инициалы = Выборка.Инициалы;
		НоваяЗапись.Именительный = Выборка.Именительный;
		НоваяЗапись.Родительный = Выборка.Родительный;
		НоваяЗапись.Творительный = Выборка.Творительный;
		НоваяЗапись.Предолжный = Выборка.Предолжный;
		НоваяЗапись.Дательный = Выборка.Дательный;
		НоваяЗапись.ИзмененоВРучную = Выборка.ИзмененоВРучную;
		Возврат Ложь;
	
	КонецЕсли;
	
	НоваяЗапись.Инициалы = Инициалы(ИмяТЧ);
	
	ЗаписатьСклонения(НоваяЗапись, ИмяТЧ);
	
	НаборЗаписей.Записать();
	
	Возврат Истина;

КонецФункции // ()

Функция ЗаписатьСклонения(Запись, ФИОКонтрагента)

	// Если протащить пол, можно точно указать
	Запись.Именительный = ПолучитьПадеж(ФИОКонтрагента, "Именительный");
	Запись.Родительный = ПолучитьПадеж(ФИОКонтрагента, "Родительный");
	Запись.Творительный = ПолучитьПадеж(ФИОКонтрагента, "Творительный");
	Запись.Предолжный = ПолучитьПадеж(ФИОКонтрагента, "Предложный");
	Запись.Дательный = ПолучитьПадеж(ФИОКонтрагента, "Дательный");

	Возврат Запись;

КонецФункции // ()

Функция ПолучитьПадеж(ФИОКонтрагента, Падеж)

	Формат = "ПД=" + Падеж;
	Результат = ПолучитьСклоненияСтроки(ФИОКонтрагента, , Формат);
	
	Ответ = "";
	Если Результат.Количество() > 0 Тогда
	
		Ответ = Результат[0];
	
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции

Функция Инициалы(СтрФИО)
	
	сФио = ФизическиеЛицаКлиентСервер.ЧастиИмени(СтрФИО);
	Если сФио.Свойство("Имя") И сФио.Свойство("Отчество") Тогда
		Инициалы = Лев(сФио.Имя,1) + " " +  Лев(сФио.Отчество,1);
		Возврат Инициалы;
	КонецЕсли;
	
	Возврат "";
КонецФункции

#КонецОбласти