
&НаКлиенте
Процедура РаспределитьПоСотрудникам(Команда)
	РаспределитьПоСотрудникамНаСервере();	
КонецПроцедуры

&НаСервере
Процедура РаспределитьПоСотрудникамНаСервере()
	ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
	ЗначениеОбъект.ВыполнитьРаспределение();
	ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаСервере
Процедура СортироватьОбъектыПоСумме()
	ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
	ЗначениеОбъект.СортироватьОбъектыПоСуммам();
	ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);	      
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
	СортироватьОбъектыПоСумме();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектыСервер.ОграничитьТипОбъекта(Элементы.ОбъектыОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
	
	ЗаполнитьНастройкиРаспределения();
	СортироватьОбъектыПоСумме();
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
	Элементы.ОбъектыПодборПоНастройкам.Видимость = Константы.ИспользоватьНастройкиПодбораОбъектовУчета.Получить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиРаспределения()
	ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
	ЗначениеОбъект.ЗаполнитьНастройкиРаспределения();
	ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");	
КонецПроцедуры


&НаКлиенте
Процедура СотрудникиПриИзменении(Элемент)
	//ЗаполнитьНастройкиРаспределения();
КонецПроцедуры


&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	ЗаполнитьНастройкиРаспределения();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элементы.ОбъектыОбъект.ВыбиратьТип = (Элементы.Объекты.ТекущиеДанные.Объект = Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтроку(Элемент);
	//СортироватьОбъектыПоСумме();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПолеПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтрокуОбъект(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ОбъектыОбъектСоздание(Элемент, СтандартнаяОбработка)
	//СортироватьОбъектыПоСумме();
КонецПроцедуры


&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	Попытка
		Объект.ТипСотрудника = ОбъектыСервер.РазыменоватьСсылку(Объект.Ответственный, "ТипСотрудника");
	Исключение
		Объект.ТипСотрудника = Неопределено;
	КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура РаспределятьПоДолямПриИзменении(Элемент)
	Элементы.СотрудникиДоля.Видимость = Объект.РаспределятьПоДолям;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.СотрудникиДоля.Видимость = Объект.РаспределятьПоДолям;
	Элементы.СотрудникиКоличествоДОБезУчетаОбъектовВРаботе.Видимость = Объект.НеУчитыватьОбъектыВРаботе;
	Элементы.СотрудникиСуммаЗадолженностиБезУчетаОбъектовВРаботе.Видимость = Объект.НеУчитыватьОбъектыВРаботе;	
КонецПроцедуры


&НаКлиенте
Процедура НеУчитыватьОбъектыВРаботеПриИзменении(Элемент)
	Элементы.СотрудникиКоличествоДОБезУчетаОбъектовВРаботе.Видимость = Объект.НеУчитыватьОбъектыВРаботе;
	Элементы.СотрудникиСуммаЗадолженностиБезУчетаОбъектовВРаботе.Видимость = Объект.НеУчитыватьОбъектыВРаботе;
КонецПроцедуры


&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
	СортироватьОбъектыПоСумме();
КонецПроцедуры


&НаКлиенте
Процедура ПодборПоНастройкам(Команда)
	ОбъектыКлиент.ПодборПоНастройкам(ЭтаФорма);
	СортироватьОбъектыПоСумме();
КонецПроцедуры

