
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция возвращает сведения о внешней обработке
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Структура	- Структура, содержащая сведения об обработке
//
Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = Новый Структура;         
	ПараметрыРегистрации.Вставить("Вид",				"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", 		"Работа с сервисом SMS4B");
	ПараметрыРегистрации.Вставить("Версия",				"1.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим",	Ложь);
	ПараметрыРегистрации.Вставить("Информация",			"Универсальная обработка для работы с сервисом SMS4B");
	ПараметрыРегистрации.Вставить("ВерсияБСП",			"2.1.8.1");
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "Работа с сервисом SMS4B", "смсОткрытьОбработкуРаботаССервисомSMS4B", "ОткрытиеФормы", Ложь, "");  
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	Возврат ПараметрыРегистрации;
КонецФункции // СведенияОВнешнейОбработке()

// Функция создает таблицу команд
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	ТаблицаЗначений	- Таблица команд
//
Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление",			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор",			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование",			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение",	Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор",				Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции // ПолучитьТаблицуКоманд()

// Процедура добавляет команду в таблицу команд
//
// Параметры:
//	ТаблицаКоманд			- ТаблицаЗначений	- Таблица команд
//	Представление			- Строка			- Представление команды в пользовательском интерфейсе
//	Идентификатор			- Строка			- Идентификатор команды
//	Использование			- Строка			- Вариант запуска команды
//	ПоказыватьОповещение	- Булево			- Использование оповещений
//	Модификатор				- Строка			- Дополнительный модификатор команды
//
Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление			= Представление;
	НоваяКоманда.Идентификатор			= Идентификатор;
	НоваяКоманда.Использование			= Использование;
	НоваяКоманда.ПоказыватьОповещение	= ПоказыватьОповещение;
	НоваяКоманда.Модификатор			= Модификатор;
КонецПроцедуры //  ДобавитьКоманду()
