
#Область ПрограммныйИнтерфейс

Функция НеКорректныйПараметр(Инструкция) Экспорт

	Возврат ИнструкцияКОшибке(
		"Не корректный параметр",
		Инструкция
	);

КонецФункции // ()

Функция ИнструкцияКОшибке(Ошибка, Инструкция) Экспорт

	Возврат СтрШаблон(
		"Выполняемая операция:
		|%1:
		|Возможные причины:
		|%2
		|",
		Ошибка,
		Инструкция
	);

КонецФункции // ()

Функция СообщениеЛогер(Действие, Пояснение = "") Экспорт

	ОбщийТекст = "[%1] - %2";
	Возврат СообщениеПользователюСФормы(ОбщийТекст, Действие, Пояснение);

КонецФункции // ()

Функция СообщениеПользователюСФормыОшибка(Операция, Пояснение = "") Экспорт

	ОбщийТекст = "При выполнении операции: %1
				|Возникли ошибки
				|%2";
	Возврат СообщениеПользователюСФормы(ОбщийТекст, Операция, Пояснение);

КонецФункции // ()

Функция СообщениеПользователюСФормыУспех(Операция, Пояснение = "") Экспорт

	ОбщийТекст = "Выполненая операция: %1
				|Успешно завершилась
				|%2";
	Возврат СообщениеПользователюСФормы(ОбщийТекст, Операция, Пояснение);

КонецФункции // ()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СообщениеПользователюСФормы(Текст, Операция, Пояснение = "")

	Возврат СтрШаблон(
		Текст,
		Операция,
		Пояснение
	);

КонецФункции // ()

#КонецОбласти