
&НаКлиенте
Процедура ВыгрузкаНомеров(Команда)
	// Выгрузить номера для рассылки
	TXT = Новый Файл("C:\1c_uz_wa\numbers.txt");
	Если TXT.Существует() Тогда
		КомандаВыгрузкаНомеров = "C:\1c_uz_wa\numbers.txt";
		ЗапуститьПриложение(КомандаВыгрузкаНомеров);
	Иначе
		Предупреждение("Не найден файл номеров!",,"Интеграция с WhatsApp");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаШаблона(Команда)
	// Выгрузить шаблон сообщения
	TXT = Новый Файл("C:\1c_uz_wa\message.txt");
	Если TXT.Существует() Тогда
		КомандаВыгрузкаШаблона = "C:\1c_uz_wa\message.txt";
		ЗапуститьПриложение(КомандаВыгрузкаШаблона);
	Иначе
		Предупреждение("Не найден файл шаблона!",,"Интеграция с WhatsApp");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьБезДокумента(Команда)
	// Автоматизатор без вложений
	BAT = Новый Файл("C:\1c_uz_wa\automator_nodoc.bat");
	Если BAT.Существует() Тогда
		ПоказатьОповещениеПользователя("Интеграция с WhatsApp",,"Запуск приложения...",БиблиотекаКартинок.NC_ПодсистемаИнтеграцияСWhatsApp);
		КомандаОтправитьБезДокумента = "C:\1c_uz_wa\automator_nodoc.bat";
		ЗапуститьПриложение(КомандаОтправитьБезДокумента);
	Иначе
		Предупреждение("Не установлен компонент рассылки!",,"Интеграция с WhatsApp");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСДокументом(Команда)
	// Автоматизатор с вложениями
	BAT = Новый Файл("C:\1c_uz_wa\automator.bat");
	Если BAT.Существует() Тогда
		ПоказатьОповещениеПользователя("Интеграция с WhatsApp",,"Запуск приложения...",БиблиотекаКартинок.NC_ПодсистемаИнтеграцияСWhatsApp);
		КомандаОтправитьСДокументом = "C:\1c_uz_wa\automator.bat";
		ЗапуститьПриложение(КомандаОтправитьСДокументом);
	Иначе
		Предупреждение("Не установлен компонент рассылки!",,"Интеграция с WhatsApp");
	КонецЕсли;
КонецПроцедуры


