
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.СостоянияПоАвтоинформированию.Записывать = Истина;
	
	ФайлТСИ = Новый ТекстовыйДокумент();
	УчеткаEmail = Константы.УчеткаEMailРассылок.Получить();
	Почта = Справочники.ШаблоныТекстаДляАвтоинформирования.СоздатьОбъектПочта(УчеткаEmail);
	МассивПолучателей = Новый Массив();
	ДатаАктуальности = Формат(ТекущаяДатаСеанса() + ДнейНаВыполнение * 3600 * 24, "ДФ=yyyyMMdd");
		
	Для Каждого Элемент Из ЭтотОбъект.Объекты Цикл
		ОтказДействия = Ложь;
		Если Элемент.Действие.Пустая() ИЛИ Элемент.Объект.Пустая() ИЛИ Элемент.Шаблон.Пустая() Тогда
			ОтказДействия = Истина;
		КонецЕсли;
		
		Если ОтказДействия Тогда
			Продолжить;
		КонецЕсли;
		
		УИД = Новый УникальныйИдентификатор();
		Если Элемент.Действие = Перечисления.ВариантыДействийДляСкоринга.ПроизвольноеДействие Тогда
			Действие = Элемент.Шаблон;
			Справочники.ШаблоныТекстаДляАвтоинформирования.ВыполнитьПроизвольноеДействие(Элемент.Шаблон.Действие);
			
		Иначе	 
			Действие = Элемент.Действие;
			Документы.ЗаданияДляАвтоинформирования.ДобавитьЗаписьВФайлТСИ(ФайлТСИ, Элемент.Объект, Элемент.Шаблон, Строка(УИД), 
					Элемент.Действие, ВидКИ, ОтказДействия, ДатаАктуальности);
		КонецЕсли;
		
		Если Не ОтказДействия Тогда	
			Движение = Движения.СостоянияПоАвтоинформированию.Добавить();
			Движение.Регистратор = ЭтотОбъект.Ссылка;
			Движение.Период = Дата;
			Движение.Объект = Элемент.Объект;
			Движение.Действие = Действие;					
			Движение.УИД = УИД;		
		КонецЕсли;	
	КонецЦикла;
	
	Если ФайлТСИ.КоличествоСтрок() > 0 Тогда
		Документы.ЗаданияДляАвтоинформирования.ЗаписатьФайлТСИ(ФайлТСИ, ЭтотОбъект.Ссылка);
	КонецЕсли;
	
	Если Почта <> Неопределено Тогда
		Почта.Отключиться();
	КонецЕсли;
КонецПроцедуры

Процедура ОтправитьEMailСообщение(Почта, УчеткаEmail, ТекстСообщения)
	Письмо = Новый ИнтернетПочтовоеСообщение();	
	Письмо.Тема = "ЖЖЖ"; 
	Текст = Письмо.Тексты.Добавить(ТекстСообщения);
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Письмо.ИмяОтправителя = "ППП";
	//Письмо.Отправитель.Адрес = "mav@trsoft.ru"; 
	Письмо.Отправитель.ОтображаемоеИмя = "ФФФ"; 
	//Письмо.ОбратныйАдрес.Добавить("mav@trsoft.ru");
	Письмо.Получатели.Добавить("san_pancho@mail.ru");
	
	Почта.Послать(Письмо);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если Не Действие.Пустая() ИЛИ Не ВидКИ.Пустая() ИЛИ Не Шаблон.Пустая() Тогда
		ТЗ = Объекты.Выгрузить();
		Если Не Действие.Пустая() Тогда
			ТЗ.ЗаполнитьЗначения(Действие, "Действие");		
		КонецЕсли;	
		Если Не ЭтотОбъект.ВидКИ.Пустая() Тогда
			ТЗ.ЗаполнитьЗначения(ВидКИ, "ВидКИ");
		КонецЕсли;	
		Если Не ЭтотОбъект.Шаблон.Пустая() Тогда
			ТЗ.ЗаполнитьЗначения(Шаблон, "Шаблон");
		КонецЕсли;	
		Объекты.Загрузить(ТЗ);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)	
	ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);	
КонецПроцедуры
