Процедура СнятьВсехОтветственных(Объект) Экспорт

	Записи = СоздатьНаборЗаписей();
	Записи.Отбор.Объект.Установить(Объект);
	
	Записи.Записать(Истина);

КонецПроцедуры

Функция ЗапросДляОпределенияОтветственного() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОтветственныеСотрудники.Пользователь,
	                      |	ОтветственныеСотрудники.Пользователь.Наименование КАК Наименование,
	                      |	ВЫБОР
	                      |		КОГДА ОтветственныеСотрудники.Объект = &Объект
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 2
	                      |	КОНЕЦ КАК Приоритет1,
	                      |	1 КАК Приоритет2,
	                      |	ОтветственныеСотрудники.ТипСотрудника
	                      |ПОМЕСТИТЬ ТипыС
	                      |ИЗ
	                      |	РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |ГДЕ
	                      |	ОтветственныеСотрудники.Объект = &Объект
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ  
	                      |	СотрудникиВПомощь.Пользователь,
	                      |	СотрудникиВПомощь.Пользователь.Наименование,
	                      |	ВЫБОР
	                      |		КОГДА СотрудникиВПомощь.Объект = &Объект
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 2
	                      |	КОНЕЦ,
	                      |	2,
	                      |	СотрудникиВПомощь.ТипСотрудника
	                      |ИЗ
	                      |	РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	                      |ГДЕ
	                      |	СотрудникиВПомощь.Объект = &Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ 
	                      |	ТипыС.Пользователь КАК Ссылка,
	                      |	ТипыС.Пользователь.Наименование КАК Наименование,
	                      |	ТипыС.ТипСотрудника.Глубина
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		МАКСИМУМ(ТипыСотрудников.Глубина) КАК Глубина
	                      |	ИЗ
	                      |		ТипыС КАК ТипыС
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	                      |			ПО ТипыС.ТипСотрудника = ТипыСотрудников.Ссылка
	                      |	ГДЕ
	                      |		ВЫРАЗИТЬ(&ТипСотрудника КАК ПланВидовХарактеристик.ТипыСотрудников).Родители ПОДОБНО ТипыСотрудников.РодителиШаблон) КАК ОтвМакс
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыС КАК ТипыС
	                      |		ПО (ТипыС.ТипСотрудника.Глубина = ОтвМакс.Глубина)
	                      |			И (ВЫРАЗИТЬ(&ТипСотрудника КАК ПланВидовХарактеристик.ТипыСотрудников).Родители ПОДОБНО ТипыС.ТипСотрудника.РодителиШаблон)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТипыС.Приоритет1,
	                      |	ТипыС.Приоритет2");
	
	Возврат Запрос;

КонецФункции // ()


