// Получение описания веб-сервиса 
Функция ДляМгновеннойОперации() Экспорт

	Возврат 7;

КонецФункции

// Проверка корректности введенного адреса, взаимодействие с менеджером
// сервиса в модели сервиса и прочие «быстрые» операции
Функция ДляБыстройОперации() Экспорт

	Возврат 15;

КонецФункции

// Получение сведений об одном контрагенте, обмен сообщениями,
// отправка SMS, удаленное администрирование ИБ в модели сервиса
Функция ДляОперацииПолучениеСведений() Экспорт

	Возврат 60;

КонецФункции

// Передача сообщений обмена данными через веб-сервис или получение
// файлов из внешнего ресурса до 1 Мб.
Функция ДляМедленнойОперации() Экспорт

	Возврат 120;

КонецФункции
