
Функция ПолучитьИмяСправочника(ОбъектУчета) Экспорт
	
	НастройкаСоответствия = СоответствиеКСправочнику();
	
	Возврат НастройкаСоответствия.Получить(ОбъектУчета);
	
	//Если ОбъектУчета = Перечисления.ОбъектыУчета.Контрагенты Тогда
	//	Возврат "Контрагенты";
	//ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.ДоговорыКонтрагентов Тогда
	//	Возврат "ДоговорыКонтрагентов";
	//ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.УслугиПоДоговорам Тогда
	//	Возврат "УслугиПоДоговору";
	//ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.ДолговыеОбязательства Тогда
	//	Возврат "ДолговыеОбязательства";
	//ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.ИсполнительныеДокументы Тогда
	//	Возврат "ИсполнительныеДокументы";
	//ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.Залоги Тогда
	//	Возврат "Залоги";
	//Иначе
	//	Возврат Неопределено;
	//КонецЕсли;
КонецФункции

#Область Конфигурация

Функция СоответствиеКСправочнику()

	Настройка = Новый Соответствие;
	Настройка.Вставить(Перечисления.ОбъектыУчета.Контрагенты,             "Контрагенты");
	Настройка.Вставить(Перечисления.ОбъектыУчета.ДоговорыКонтрагентов,    "ДоговорыКонтрагентов");
	Настройка.Вставить(Перечисления.ОбъектыУчета.УслугиПоДоговорам,       "УслугиПоДоговору");
	Настройка.Вставить(Перечисления.ОбъектыУчета.ДолговыеОбязательства,   "ДолговыеОбязательства");
	Настройка.Вставить(Перечисления.ОбъектыУчета.ИсполнительныеДокументы, "ИсполнительныеДокументы");
	Настройка.Вставить(Перечисления.ОбъектыУчета.Залоги,                  "Залоги");
	
	Возврат Настройка;

КонецФункции // ()

#КонецОбласти




Функция ПолучитьТипСправочника(ОбъектУчета) Экспорт
	Имя = ПолучитьИмяСправочника(ОбъектУчета);
	Если Имя <> Неопределено Тогда      
		Возврат Тип("СправочникСсылка." + Имя);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
