
Функция ПолучитьИмяСправочника(ОбъектУчета) Экспорт
	Если ОбъектУчета = Перечисления.ОбъектыУчета.Контрагенты Тогда
		Возврат "Контрагенты";
	ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.ДоговорыКонтрагентов Тогда
		Возврат "ДоговорыКонтрагентов";
	ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.УслугиПоДоговорам Тогда
		Возврат "УслугиПоДоговору";
	ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.ДолговыеОбязательства Тогда
		Возврат "ДолговыеОбязательства";
	ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.ИсполнительныеДокументы Тогда
		Возврат "ИсполнительныеДокументы";
	ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.Залоги Тогда
		Возврат "Залоги";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьТипСправочника(ОбъектУчета) Экспорт
	Имя = ПолучитьИмяСправочника(ОбъектУчета);
	Если Имя <> Неопределено Тогда      
		Возврат Тип("СправочникСсылка." + Имя);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
