
&НаКлиенте
Процедура ЗаполнитьНаименованияСвойствПоПодобным(Команда)
	ЗаполнитьНаименованияСвойствПоПодобнымиНаСверере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаименованияСвойствПоПодобнымиНаСверере()
	БанкротствоСервер.ЗаполнитьНаименованияСвойствПоПодобным();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзМакетаЭлемены(Команда)
	ЗагрузитьИзМакетаЭлеменыНаСверере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзМакетаЭлеменыНаСверере()
	Справочники.БанкротствоИерархияСвойств.ЗагрузитьИзМакетаЭлемены();
	Справочники.БанкротствоЗначенияСвойств.ЗагрузитьИзМакетаЭлемены();
КонецПроцедуры
