
&НаКлиенте
Процедура ПринятьВызов(Команда)
	Закрыть("принять");
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьВызов(Команда) Экспорт
	Закрыть("отклонить");
КонецПроцедуры

&НаСервере
Процедура ОткрытьКарточкуКлиентаНаСервере()
	ЭтаФорма.ДолговоеОбязательство = Справочники.ДолговыеОбязательства.НайтиПоРеквизиту("Должник", Абонент);
	ЭтаФорма.Кредитор = ЭтаФорма.ДолговоеОбязательство.Кредитор;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуКлиента(Команда)
	//Если КонтрагентНайден Тогда
	//	Если ТипЗнч(Абонент) = Тип("Строка") Тогда
	//		бит_ТелефонияКлиентПереопределяемый.ПоказПредупреждение(Абонент);
	//	Иначе
	//		бит_ТелефонияКлиентПереопределяемый.ОткрытьКарточкуКлиента(Абонент);
	//	КонецЕсли;
	//Иначе
	//	бит_ТелефонияКлиентПереопределяемый.ПоказПредупреждение("Номер неизвестен");
	//КонецЕсли;
	
	// Открыть ДО вместо контрагента
	ОткрытьКарточкуКлиентаНаСервере();
	Если ЗначениеЗаполнено(ЭтаФорма.ДолговоеОбязательство) = Истина Тогда
		ОткрытьЗначение(ЭтаФорма.ДолговоеОбязательство)
	Иначе
		Предупреждение("Не удалось найти договор",,"БИТ.Phone");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//
	Если бит_ТелефонияКлиентПереопределяемый.ПроверкаНовыйИнтерфейсТакси() Тогда
		Элементы.ПринятьВызов.Высота = 0;
		Элементы.ОтклонитьВызов.Высота = 0;
		Элементы.ОткрытьКарточкуКлиента.Высота = 0;
	КонецЕсли;
	//
	Элементы.Абонент.Видимость = КонтрагентНайден;
	Элементы.КонтактноеЛицо.Видимость = КонтрагентНайден И ЗначениеЗаполнено(КонтактноеЛицо);
	// Скрыть техническую информацию
	// Элементы.НабранныйНомер.Видимость = ЗначениеЗаполнено(НабранныйНомер);
	//
	
	//
	//Если КонтрагентНайден
	//		И (ТипЗнч(Абонент) = Тип("СправочникСсылка." + бит_ТелефонияСерверПереопределяемый.ПолучитьИмяСправочникаКонтрагентов())) Тогда
	//	//
	//	Элементы.ТипАбонента.Видимость = Истина;
	//	Элементы.ГруппаДокументыАбонента.Видимость = Истина;
	//	//
	//	стрТипАбонента = "";
	//	//
	//	Если бит_ТелефонияСерверПереопределяемый.ПроверкаКонтрагентПокупатель(Абонент) Тогда
	//		стрТипАбонента = "Покупатель";
	//	КонецЕсли;
	//	//
	//	Если бит_ТелефонияСерверПереопределяемый.ПроверкаКонтрагентПоставщик(Абонент) Тогда
	//		Если ЗначениеЗаполнено(стрТипАбонента) Тогда
	//			стрТипАбонента = стрТипАбонента + ", Поставщик";
	//		Иначе
	//			стрТипАбонента = "Поставщик";
	//		КонецЕсли;
	//	КонецЕсли;
	//	//
	//	Если НЕ ЗначениеЗаполнено(стрТипАбонента) Тогда
	//		стрТипАбонента = "не задан";
	//	КонецЕсли;
	//	//
	//	ТипАбонента = стрТипАбонента;
	//	//
	//Иначе
	//	Элементы.ТипАбонента.Видимость = Ложь;
	//	Элементы.ГруппаДокументыАбонента.Видимость = Ложь;
	//КонецЕсли;
	
	// Скрыть ДО и кредитора, если не удалось найти договор
	ОткрытьКарточкуКлиентаНаСервере();
	Если ЗначениеЗаполнено(ЭтаФорма.ДолговоеОбязательство) = Ложь И ЗначениеЗаполнено(ЭтаФорма.Кредитор) = Ложь Тогда
		ЭтаФорма.Элементы.Абонент.Видимость = Истина;
		ЭтаФорма.Абонент = "Неопознанный";
		ЭтаФорма.Элементы.ДолговоеОбязательство.Видимость = Ложь;
		ЭтаФорма.Элементы.Кредитор.Видимость = Ложь;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПродажНажатие(Элемент)
	бит_ТелефонияКлиентПереопределяемый.ОткрытьДокументыПродаж(Абонент);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоступленияНажатие(Элемент)
	бит_ТелефонияКлиентПереопределяемый.ОткрытьДокументыПоступления(Абонент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПокупателяНажатие(Элемент)
	бит_ТелефонияКлиентПереопределяемый.ОткрытьЗаказыПокупателя(Абонент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПоставщикуНажатие(Элемент)
	бит_ТелефонияКлиентПереопределяемый.ОткрытьЗаказыПоставщику(Абонент);
КонецПроцедуры

&НаКлиенте
Процедура СчетаНаОплатуПокупателяНажатие(Элемент)
	бит_ТелефонияКлиентПереопределяемый.ОткрытьСчетаНаОплатуПокупателя(Абонент);
КонецПроцедуры
