
Функция ОбщиеСведения(Соответствие) Экспорт

	Если Соответствие.Назначение <> "Документ ссылка: Поступление платежей" Тогда
	
		ВызватьИсключение "Для выбранного соответствия не поддерживается загрузка: "
							+ Соответствие.Назначение;
	
	КонецЕсли;
	
	Возврат Документы.ПоступлениеПлатежей.ОбщиеСведения();

КонецФункции // ()

Процедура ОбработатьНастройку(Соответствие, НастройкаЗагрузки, ТабличныйДокумент) Экспорт

	Если Соответствие.Назначение <> "Документ ссылка: Поступление платежей" Тогда
	
		ВызватьИсключение "Для выбранного соответствия не поддерживается загрузка: "
							+ Соответствие.Назначение;
	
	КонецЕсли;

	Платежи = Документы.ПоступлениеПлатежей
		.ЗаполнитьБазовыеЗначения(НастройкаЗагрузки)
		.ЗагрузитьДанные(Соответствие, ТабличныйДокумент)
		.Обработать()
	;
	
	Если Не ЗначениеЗаполнено(Платежи) Тогда
	
		Возврат;
	
	КонецЕсли;
	УправлениеЗагрузкамиДанных.ПоместитьТабличнуюЧастьВХранилище(
		ТабличныйДокумент,
		Платежи
	);
	
КонецПроцедуры

Функция ОбработатьОшибку(ИнформацияОбОшибке) Экспорт

	ОписаниеОшибки = УправленияСообщениями.СформироватьТекстОшибки(
		ИнформацияОбОшибке,
		"Ошибка при загрузке файла"
	);
	
	Данные = Новый Массив;
	Данные.Добавить(ОписаниеОшибки["Выражение"]);
	
	Логер = БЛогер_Логирование.Создать();
	БЛогер_Логирование.Добавить(
		Логер,
		ОписаниеОшибки["Стек"],
		Перечисления.БЛогер_Уровни.Ошибка
	);
	
	Возврат Данные;

КонецФункции // ()