
Процедура ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийОбъекты, ТаблицаДвиженийСобытия) Экспорт
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("МоментДо", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Автор", ЭтотОбъект.Автор);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("Объект", ЭтотОбъект.Объект);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	&Объект КАК Объект,
	               |	&Период КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	ЗадолженностьПоОбъектамОстатки.Составляющая1РеглОстаток КАК Составляющая1Регл
	               |ИЗ
	               |	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(, Объект = &Объект) КАК ЗадолженностьПоОбъектамОстатки
	               |ГДЕ
	               |	ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.Составляющая1РеглОстаток, 0) <> 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	&Объект,
	               |	РеструктуризацияДолгаПлатежи.Дата,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	               |	РеструктуризацияДолгаПлатежи.Составляющая1
	               |ИЗ
	               |	Документ.УдалитьРеструктуризацияДолга.Платежи КАК РеструктуризацияДолгаПлатежи
	               |ГДЕ
	               |	РеструктуризацияДолгаПлатежи.Ссылка = &Ссылка";			   
	ТаблицаДвиженийОбъекты = Запрос.Выполнить().Выгрузить();
КонецПроцедуры

Процедура ПровестиПоследовательность(ЭтотОбъект) Экспорт
	//Корректировка последовательности, поиск первого документа РеструктуризацияДолга и его ПРОГРАММНОЕ перепроведение
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	УдалитьРеструктуризацияДолга.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.УдалитьРеструктуризацияДолга КАК УдалитьРеструктуризацияДолга
	                      |ГДЕ
	                      |	УдалитьРеструктуризацияДолга.Объект = &Объект
	                      |	И УдалитьРеструктуризацияДолга.МоментВремени > &МоментВремени
	                      |	И УдалитьРеструктуризацияДолга.Проведен
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	УдалитьРеструктуризацияДолга.МоментВремени");
	Запрос.УстановитьПараметр("МоментВремени", ЭтотОбъект.МоментВремени());
	Запрос.УстановитьПараметр("Объект", ЭтотОбъект.Объект);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ТаблицаДвиженийОбъекты = Неопределено;
		ТаблицаДвиженийСобытия = Неопределено;

		Документы.УдалитьРеструктуризацияДолга.ИнициализироватьДанныеДокумента(Результат.Ссылка, ТаблицаДвиженийОбъекты, 
				ТаблицаДвиженийСобытия);
		
		Набор = РегистрыНакопления.ЗадолженностьПоОбъектам.СоздатьНаборЗаписей();
		Набор.Отбор["Регистратор"].Значение = Результат.Ссылка;
		Набор.Прочитать();
		Набор.Загрузить(ТаблицаДвиженийОбъекты);
		Набор.Записать();
		
		//Набор = РегистрыНакопления.СобытияПоОбъектам.СоздатьНаборЗаписей();
		//Набор.Отбор["Регистратор"].Значение = Результат.Ссылка;
		//Набор.Прочитать();
		//Набор.Загрузить(ТаблицаДвиженийСобытия);
		//Набор.Записать();
	КонецЕсли;
КонецПроцедуры
