
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	Если ВалютаРегл = Справочники.Валюты.ПустаяСсылка() Тогда
		Сообщить("Не определена валюта регламентированного учета!");
		Отказ = Истина;
	КонецЕсли;
	
	ТаблицаДвиженийОбъекты = Неопределено;
	ТаблицаДвиженийСобытия = Неопределено;
	
	Документы.УдалитьРеструктуризацияДолга.ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийОбъекты, 
			ТаблицаДвиженийСобытия);
		
	Если Не Отказ И ТаблицаДвиженийОбъекты.Количество() > 0 Тогда
		ЭтотОбъект.Движения.ЗадолженностьПоОбъектам.Загрузить(ТаблицаДвиженийОбъекты);
		ЭтотОбъект.Движения.ЗадолженностьПоОбъектам.Записывать = Истина;
	КонецЕсли;		
			
	//Если Не Отказ И ТаблицаДвиженийСобытия.Количество() > 0 Тогда
	//	ЭтотОбъект.Движения.СобытияПоОбъектам.Загрузить(ТаблицаДвиженийСобытия);
	//	ЭтотОбъект.Движения.СобытияПоОбъектам.Записывать = Истина;
	//КонецЕсли;		
			
	////ЭтотОбъект.Движения.Записать();	
	
	//Корректировка последовательности, поиск первого документа РеструктуризацияДолга и его ПРОГРАММНОЕ перепроведение
  	Документы.УдалитьРеструктуризацияДолга.ПровестиПоследовательность(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//ПроведениеСервер.ОчиститьДвиженияДокумента(ЭтотОбъект,, Отказ);
	
	//Корректировка последовательности, поиск первого документа РеструктуризацияДолга и его ПРОГРАММНОЕ перепроведение
  	Документы.УдалитьРеструктуризацияДолга.ПровестиПоследовательность(ЭтотОбъект);
КонецПроцедуры
