
&НаСервере
Функция АдресОбъектаЦКТ(НовыйАдрес = Неопределено) Экспорт
	Если НовыйАдрес <> Неопределено Тогда
		ПараметрыСеанса.АдресОбъектаЦКТ = НовыйАдрес;	
	КонецЕсли;
	Возврат ПараметрыСеанса.АдресОбъектаЦКТ;
КонецФункции

&НаСервере
Функция АдресОбъектаУЭД(НовыйАдрес = Неопределено) Экспорт
	Если НовыйАдрес <> Неопределено Тогда
		ПараметрыСеанса.АдресОбъектаУЭД = НовыйАдрес;	
	КонецЕсли;
	Возврат ПараметрыСеанса.АдресОбъектаУЭД;
КонецФункции

&НаСервере
Функция ТекущийIPАдрес(НовыйАдрес = Неопределено) Экспорт
	Если НовыйАдрес <> Неопределено Тогда
		ПараметрыСеанса.ТекущийIPАдрес = НовыйАдрес;	
	КонецЕсли;
	//Возврат "";
	Возврат ПараметрыСеанса.ТекущийIPАдрес;
КонецФункции

&НаСервере
Функция ИспользоватьЦКТ() Экспорт
	Возврат Не Константы.ПодключениеЦКТ.Получить().Пустая();
КонецФункции

&НаСервере
Функция СтрокаПодключенияКЦКТ() Экспорт
	Результат = "";
	Если Не Константы.ПодключениеЦКТ.Получить().Пустая() Тогда
		ПодключениеЦКТ = Константы.ПодключениеЦКТ.Получить();	
		Результат = Результат + "File = """ + ПодключениеЦКТ.Файл + """;";
		Если ЗначениеЗаполнено(ПодключениеЦКТ.Пользователь) Тогда
			Результат = Результат + " Usr = """ + ПодключениеЦКТ.Пользователь + """;";
		КонецЕсли;	
		Если ЗначениеЗаполнено(ПодключениеЦКТ.Пароль) Тогда
			//Результат = Результат + " Usr = """ + ПодключениеЦКТ.Пароль + """;";
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьМакетСправочника(ИмяСправочника, ИмяМакета) Экспорт
	Попытка
    	Возврат Вычислить("Справочники." + ИмяСправочника + ".ПолучитьМакет(ИмяМакета)");
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаСервере
Функция ПодключитьКомпоненту() Экспорт
	ФайлТемп = Новый Файл(ПолучитьИмяВременногоФайла());
	
	//
	Подключена = ПодключитьВнешнююКомпоненту(ФайлТемп.Путь + "AddInEDCNative.dll", "AddInEDCExten", 
			ТипВнешнейКомпоненты.Native);		
	Попытка
		ДрайверКомпоненты = Новый("AddIn.AddInEDCExten.AddInEDCExtension");		
		ПараметрыСеанса.АдресОбъектаУЭД = ПоместитьВоВременноеХранилище(ДрайверКомпоненты, Новый УникальныйИдентификатор());
		Возврат Истина;
	Исключение
		Подключена = ПодключитьВнешнююКомпоненту(ФайлТемп.Путь + "AddInEDC64.dll", "AddInEDCExten", 
				ТипВнешнейКомпоненты.Native);
		Попытка
			ДрайверКомпоненты = Новый("AddIn.AddInEDCExten.AddInEDCExtension");		
			ПараметрыСеанса.АдресОбъектаУЭД = ПоместитьВоВременноеХранилище(ДрайверКомпоненты, Новый УникальныйИдентификатор());
			Возврат Истина;
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецПопытки;		
КонецФункции

&НаСервере
Процедура СкопироватьКомпонентуСервер(ИмяСправочника, ИмяМакета, Принудительно) Экспорт
	ФайлТемп = Новый Файл(ПолучитьИмяВременногоФайла());	
	
	//
	Если Не Принудительно Тогда	
		Файл = Новый Файл(ФайлТемп.Путь + ИмяМакета + ".dll");
		Если Файл.Существует() Тогда
			Возврат ;
		КонецЕсли;
	КонецЕсли;
	
	ДД = РаботаСЦКТСервер.ПолучитьМакетСправочника(ИмяСправочника, ИмяМакета);
	Если ДД <> Неопределено Тогда
		Попытка
			ДД.Записать(ФайлТемп.Путь + ИмяМакета + ".dll");
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	Иначе
		Сообщить("Ошибка обновления компоненты " + ИмяМакета + ".dll!");
	КонецЕсли;	
КонецПроцедуры
