
Функция OrderCallBackPOST(Запрос)
	
	Сообщение = Запрос.ПолучитьТелоКакСтроку("UTF-8");
	Если ЗначениеЗаполнено(Сообщение) Тогда
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки("OK");
		Бит_Мандарин.РаспарситьstrCallBack(Сообщение);
	Иначе
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки(Сообщение);
	КонецЕсли;
	
	//Сооб = Задачи.Сообщения.СоздатьЗадачу();
	//Сооб.Дата = ТекущаяДата();
	//Сооб.Наименование = "Ошибка CallBack Mandarin!";
	//Сооб.Автор = ПараметрыСеанса.ТекущийПользователь;
	//Сооб.ТипСообщения = Перечисления.ТипыСообщений.КСотруднику;
	//Сооб.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
	//Сооб.Текст = Сообщение;
	//Сооб.Записать();

	
	Возврат Ответ;
КонецФункции


//Функция OrderCallBackPOST(Запрос)
//	//1.получаем тело запроса
//	Сообщение = Запрос.ПолучитьТелоКакСтроку("UTF-8");
//	
//	//2.десериализуем данные о транзакции из JSON
//	//ЧтениеJSON = Новый ЧтениеJSON;
//	//ЧтениеJSON.УстановитьСтроку(Сообщение);
//	//ДанныеТранзакции = ПрочитатьJSON(ЧтениеJSON);
//	//ЧтениеJSON.Закрыть();
//	Если ЗначениеЗаполнено(Сообщение) Тогда
//		Ответ = Новый HTTPСервисОтвет(200);
//		Ответ.УстановитьТелоИзСтроки("OK");
//		Сооб = Задачи.Сообщения.СоздатьЗадачу();
//		Сооб.Дата = ТекущаяДата();
//		Сооб.Наименование = "CallBack Mandarin!";
//		Сооб.Автор = ПараметрыСеанса.ТекущийПользователь;
//		Сооб.ТипСообщения = Перечисления.ТипыСообщений.КСотруднику;
//		Сооб.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
//		Сооб.Текст = Сообщение + Строка(ТекущаяДата());
//		Сооб.Записать();
//		
//		
//		//Тут будет вызов работы с документами
//	Иначе
//		Ответ = Новый HTTPСервисОтвет(402);
//		Возврат Ответ;
//	КонецЕсли;
//	
//	
//	Возврат Ответ;
//	
//КонецФункции

//Сооб = Задачи.Сообщения.СоздатьЗадачу();
		//Сооб.Дата = ТекущаяДата();
		//Сооб.Наименование = "200 CallBack Mandarin!";
		//Сооб.Автор = ПараметрыСеанса.ТекущийПользователь;
		//Сооб.ТипСообщения = Перечисления.ТипыСообщений.КСотруднику;
		//Сооб.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
		//Сооб.Текст = Сообщение + Строка(ТекущаяДата());
		//Сооб.Записать();

