
&НаКлиенте
Процедура ОК(Команда)
	
	СтрокаПараметров  = "";
	
    Счетчик = 1;
	
	Пока Счетчик<=5 Цикл
		
		Столб1 = Элементы.Найти("Строка"+Строка(Счетчик)+"Столб1").ТекстРедактирования; 
		
		Если Столб1 = "" Тогда
		    Счетчик = Счетчик +1;
			Продолжить;
		
		КонецЕсли; 
		
		Столб2 = Элементы.Найти("Строка"+Строка(Счетчик)+"Столб2").ТекстРедактирования; 			
		
		
		СтрокаПараметров = СтрокаПараметров + Столб1 + "|" + Столб2 + "|" + Элементы.Найти("Строка"+Строка(Счетчик)+"Столб3").ТекстРедактирования + "|";
		Счетчик = Счетчик +1;
	КонецЦикла; 
	
   СтрокаПараметров = Лев(СтрокаПараметров,СтрДлина(СтрокаПараметров));
   ЭтаФорма.Закрыть(СтрокаПараметров);	
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для каждого Колонка Из СписокИменКолонокИсхТаблицы Цикл
		 Элементы.Строка1Столб1.СписокВыбора.Добавить(Колонка);
    	 Элементы.Строка2Столб1.СписокВыбора.Добавить(Колонка);
		 Элементы.Строка3Столб1.СписокВыбора.Добавить(Колонка);
		 Элементы.Строка4Столб1.СписокВыбора.Добавить(Колонка);
		 Элементы.Строка5Столб1.СписокВыбора.Добавить(Колонка);
	КонецЦикла;
		
КонецПроцедуры


