
Процедура ПриЗаписи(Отказ, Замещение)
	//3.7.4.18: обновление регистра РС Задолженность по Объектам остатки переехало в процедуру
	//ОбъектыСервер.ЗаписатьТекущиеПараметрыЗадолженностиОбработчик	
КонецПроцедуры

Функция ПолучитьМассивНазванияСоставляющих()

	МассивНазванияСоставляющих = Новый Массив;
	
	МассивНазванияСоставляющих.Добавить("Сумма");
	МассивНазванияСоставляющих.Добавить("ОсновнойДолг");
	МассивНазванияСоставляющих.Добавить("Проценты");
	МассивНазванияСоставляющих.Добавить("Штрафы");
	МассивНазванияСоставляющих.Добавить("Пени");
	МассивНазванияСоставляющих.Добавить("Составляющая1");
	МассивНазванияСоставляющих.Добавить("Составляющая2");
	МассивНазванияСоставляющих.Добавить("Составляющая3");
	МассивНазванияСоставляющих.Добавить("Составляющая4");
	МассивНазванияСоставляющих.Добавить("Составляющая5");
	МассивНазванияСоставляющих.Добавить("Составляющая6");
	МассивНазванияСоставляющих.Добавить("Составляющая7");
	МассивНазванияСоставляющих.Добавить("Составляющая8");
	
	Возврат МассивНазванияСоставляющих;

КонецФункции // ()

Функция ПолучитьСуфиксПараметраЗапроса()

	Возврат "Остаток";

КонецФункции

Функция ПолучитьМассивЧастейРегистров()

	МассивЧастейРегистров = Новый Массив;
	
	МассивЧастейРегистров.Добавить("ДО");
	МассивЧастейРегистров.Добавить("Регл");
	
	Возврат МассивЧастейРегистров;

КонецФункции