
Процедура ПриЗаписи(Отказ, Замещение)
	ОбъектыОтбора = ОбъектыСервер.ОтборОбъектовПоРегистратору(ЭтотОбъект);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Объект КАК Объект,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.СуммаДООстаток КАК СуммаДООстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.СуммаРеглОстаток КАК СуммаРеглОстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ОсновнойДолгРеглОстаток КАК ОсновнойДолгРеглОстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПроцентыРеглОстаток КАК ПроцентыРеглОстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ШтрафыРеглОстаток КАК ШтрафыРеглОстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ОсновнойДолгДООстаток КАК ОсновнойДолгДООстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПроцентыДООстаток КАК ПроцентыДООстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ШтрафыДООстаток КАК ШтрафыДООстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПениРеглОстаток КАК ПениРеглОстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПениДООстаток КАК ПениДООстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая1ДООстаток КАК Составляющая1ДООстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая1РеглОстаток КАК Составляющая1РеглОстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая2ДООстаток КАК Составляющая2ДООстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая2РеглОстаток КАК Составляющая2РеглОстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая3ДООстаток КАК Составляющая3ДООстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая3РеглОстаток КАК Составляющая3РеглОстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая4ДООстаток КАК Составляющая4ДООстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая4РеглОстаток КАК Составляющая4РеглОстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая5ДООстаток КАК Составляющая5ДООстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая5РеглОстаток КАК Составляющая5РеглОстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая6ДООстаток КАК Составляющая6ДООстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая6РеглОстаток КАК Составляющая6РеглОстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая7ДООстаток КАК Составляющая7ДООстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая7РеглОстаток КАК Составляющая7РеглОстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая8ДООстаток КАК Составляющая8ДООстаток,
	                      |	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая8РеглОстаток КАК Составляющая8РеглОстаток
	                      |ПОМЕСТИТЬ ТекЗадолженность
	                      |ИЗ
	                      |	РегистрНакопления.ЗадолженностьПоОбъектамВнесудебная.Остатки(, Объект В (&МассивОбъектов)) КАК ЗадолженностьПоОбъектамВнесудебнаяОстатки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект КАК ОбъектВРаботе
	                      |ПОМЕСТИТЬ ОбъектыВРаботе
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Объект В (&Объекты)) КАК ОбъектыВРаботеОстатки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботе.ОбъектВРаботе КАК ОбъектВРаботе,
	                      |	ТекЗадолженность.Объект КАК Объект,
	                      |	ТекЗадолженность.СуммаДООстаток КАК СуммаДООстаток,
	                      |	ТекЗадолженность.СуммаРеглОстаток КАК СуммаРеглОстаток,
	                      |	ТекЗадолженность.ОсновнойДолгРеглОстаток КАК ОсновнойДолгРеглОстаток,
	                      |	ТекЗадолженность.ПроцентыРеглОстаток КАК ПроцентыРеглОстаток,
	                      |	ТекЗадолженность.ШтрафыРеглОстаток КАК ШтрафыРеглОстаток,
	                      |	ТекЗадолженность.ОсновнойДолгДООстаток КАК ОсновнойДолгДООстаток,
	                      |	ТекЗадолженность.ПроцентыДООстаток КАК ПроцентыДООстаток,
	                      |	ТекЗадолженность.ШтрафыДООстаток КАК ШтрафыДООстаток,
	                      |	ТекЗадолженность.ПениРеглОстаток КАК ПениРеглОстаток,
	                      |	ТекЗадолженность.ПениДООстаток КАК ПениДООстаток,
	                      |	ТекЗадолженность.Составляющая1ДООстаток КАК Составляющая1ДООстаток,
	                      |	ТекЗадолженность.Составляющая1РеглОстаток КАК Составляющая1РеглОстаток,
	                      |	ТекЗадолженность.Составляющая2ДООстаток КАК Составляющая2ДООстаток,
	                      |	ТекЗадолженность.Составляющая2РеглОстаток КАК Составляющая2РеглОстаток,
	                      |	ТекЗадолженность.Составляющая3ДООстаток КАК Составляющая3ДООстаток,
	                      |	ТекЗадолженность.Составляющая3РеглОстаток КАК Составляющая3РеглОстаток,
	                      |	ТекЗадолженность.Составляющая4ДООстаток КАК Составляющая4ДООстаток,
	                      |	ТекЗадолженность.Составляющая4РеглОстаток КАК Составляющая4РеглОстаток,
	                      |	ТекЗадолженность.Составляющая5ДООстаток КАК Составляющая5ДООстаток,
	                      |	ТекЗадолженность.Составляющая5РеглОстаток КАК Составляющая5РеглОстаток,
	                      |	ТекЗадолженность.Составляющая6ДООстаток КАК Составляющая6ДООстаток,
	                      |	ТекЗадолженность.Составляющая6РеглОстаток КАК Составляющая6РеглОстаток,
	                      |	ТекЗадолженность.Составляющая7ДООстаток КАК Составляющая7ДООстаток,
	                      |	ТекЗадолженность.Составляющая7РеглОстаток КАК Составляющая7РеглОстаток,
	                      |	ТекЗадолженность.Составляющая8ДООстаток КАК Составляющая8ДООстаток,
	                      |	ТекЗадолженность.Составляющая8РеглОстаток КАК Составляющая8РеглОстаток
	                      |ИЗ
	                      |	ОбъектыВРаботе КАК ОбъектыВРаботе
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТекЗадолженность КАК ТекЗадолженность
	                      |		ПО ОбъектыВРаботе.ОбъектВРаботе = ТекЗадолженность.Объект"); 
	
	Запрос.УстановитьПараметр("МассивОбъектов",ОбъектыОтбора);  
	Запрос.УстановитьПараметр("Объекты",ОбъектыОтбора);

	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Набор = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(Результат.ОбъектВРаботе);
		
		Если ЗначениеЗаполнено(Результат.ОбъектВРаботе) Тогда
			
			МассивНазванияСоставляющих = ПолучитьМассивНазванияСоставляющих();
			МассивЧастейРегистров = ПолучитьМассивЧастейРегистров();
			СуфиксПараметраЗапроса = ПолучитьСуфиксПараметраЗапроса();
			
			Для каждого НазваниеСоставляющей Из МассивНазванияСоставляющих Цикл
			
				СоставляющаяДООстаток = НазваниеСоставляющей + МассивЧастейРегистров[0] + СуфиксПараметраЗапроса;
				СоставляющаяРеглОстаток = НазваниеСоставляющей + МассивЧастейРегистров[1] + СуфиксПараметраЗапроса;
				Если Результат[СоставляющаяДООстаток] <> 0 И Результат[СоставляющаяРеглОстаток] <> 0 И Результат[СоставляющаяДООстаток] <> null И Результат[СоставляющаяРеглОстаток] <> null Тогда
					Нов = Набор.Добавить();
					Нов.Объект = Результат.ОбъектвРаботе;
					Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности[НазваниеСоставляющей];
					Нов.СуммаДО   = Результат[СоставляющаяДООстаток];
					Нов.СуммаРегл = Результат[СоставляющаяРеглОстаток];
				КонецЕсли;
			
			КонецЦикла;
							
		КонецЕсли;	
				
		Попытка
			// Ускорить проведение документов
			НачатьТранзакцию();
			Набор.Записать();
			ЗафиксироватьТранзакцию();
			//
		Исключение
			Сообщить(ОписаниеОшибки());
			Отказ = Истина;
			Возврат;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьМассивНазванияСоставляющих()

	МассивНазванияСоставляющих = Новый Массив;
	
	МассивНазванияСоставляющих.Добавить("Сумма");
	МассивНазванияСоставляющих.Добавить("ОсновнойДолг");
	МассивНазванияСоставляющих.Добавить("Проценты");
	МассивНазванияСоставляющих.Добавить("Штрафы");
	МассивНазванияСоставляющих.Добавить("Пени");
	МассивНазванияСоставляющих.Добавить("Составляющая1");
	МассивНазванияСоставляющих.Добавить("Составляющая2");
	МассивНазванияСоставляющих.Добавить("Составляющая3");
	МассивНазванияСоставляющих.Добавить("Составляющая4");
	МассивНазванияСоставляющих.Добавить("Составляющая5");
	МассивНазванияСоставляющих.Добавить("Составляющая6");
	МассивНазванияСоставляющих.Добавить("Составляющая7");
	МассивНазванияСоставляющих.Добавить("Составляющая8");
	
	Возврат МассивНазванияСоставляющих;

КонецФункции // ()

Функция ПолучитьСуфиксПараметраЗапроса()

	Возврат "Остаток";

КонецФункции

Функция ПолучитьМассивЧастейРегистров()

	МассивЧастейРегистров = Новый Массив;
	
	МассивЧастейРегистров.Добавить("ДО");
	МассивЧастейРегистров.Добавить("Регл");
	
	Возврат МассивЧастейРегистров;

КонецФункции
