
Процедура ОбработкаУдаленияПроведения(Отказ)
	Для каждого стр из СписокИсходящейКорреспонденции Цикл
		КоррОбъект = Стр.ИсходящаяКорреспонденция.ПолучитьОбъект();
		КоррОбъект.ПометкаУдаления = Истина;
		Для каждого Ф из КоррОбъект.ПрикрепленныеФайлы Цикл
			ДокОбъект = Ф.ПрикрепленныйФайл.ПолучитьОбъект();
			ДокОбъект.РегистраторКорреспонденции = "";
			ДокОбъект.Записать();
		КонецЦикла;
		КоррОбъект.Записать();
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для каждого стр из СписокИсходящейКорреспонденции Цикл
		КоррОбъект = Стр.ИсходящаяКорреспонденция.ПолучитьОбъект();
		Если КоррОбъект.ПометкаУдаления = Истина Тогда
			КоррОбъект.ПометкаУдаления = Ложь;
			Для каждого Ф из КоррОбъект.ПрикрепленныеФайлы Цикл
				ДокОбъект = Ф.ПрикрепленныйФайл.ПолучитьОбъект();
				ДокОбъект.РегистраторКорреспонденции = Стр.ИсходящаяКорреспонденция;
				ДокОбъект.Записать();
			КонецЦикла;
			КоррОбъект.Записать();
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.СписокИсходящейКорреспонденции.Очистить();
	Для каждого стр из ЭтотОбъект.Объекты Цикл
		стр.КомплектСформирован = Ложь;
	КонецЦикла;	
КонецПроцедуры
