
&НаКлиенте
Процедура Применить(Команда)
	
	Если НЕ УсловияЗаполненияВыполнены() Тогда
	
		Возврат;
	
	КонецЕсли;
	
	УстановитьПараметрыЛицензирования();
	ОбновитьИнтерфейс();
	
	сл2_МодульПродуктаУЗ.ИнициализацияПродукта();
	
	Оповестить("ОбновитьВерсиюЛицензирования");
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Перезапустите сеанс";
	Сообщение.Сообщить();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ УсловияЗаполненияВыполнены() Тогда
	
		Отказ = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция УсловияЗаполненияВыполнены()

	Если НЕ ЗначениеЗаполнено(СпособЛицензирования) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Требуется выбрать версию Клиента лицензирования";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // ()

&НаСервере
Процедура УстановитьПараметрыЛицензирования()

	Константы.СистемаЛицензирования.Установить(СпособЛицензирования);
	Константы.ВерсияПрограммы.Установить(ВерсияПрограммы);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКлиентаЛицензирования()

	Если СпособЛицензирования = ПредопределенноеЗначение("Перечисление.СистемыЛицензирования.СЛ_1" ) Тогда
	
		бит_сл_клиент.ИнициализацияКлиентаЛицензирования();
		ОткрытьФорму("Обработка.бит_сл_КлиентЛицензирования.Форма.СистемаЛицензирования_упр");
		Возврат;
	
	КонецЕсли;
	
	сл2_Клиент.Инициализация();
	ОткрытьФорму("Обработка.сл2_КлиентЛицензирования.Форма.ОсновнаяФорма");

КонецПроцедуры
