
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СкрыватьПараметрыПанели Тогда
		Элементы.СоздаватьСобытиеПриВходящемЗвонке.Видимость	= Ложь;
		Элементы.СоздаватьСобытиеПриИсходящемЗвонке.Видимость	= Ложь;
		Элементы.СоздаватьСобытияПриВнутреннихЗвонках.Видимость	= Ложь;
		Элементы.АвтозапускПриСтартеСистемы.Видимость			= Ложь;
	КонецЕсли;
	ОбновитьДоступность();
	
	Элементы.ВерсияТелефонии.Заголовок = "Версия подсистемы телефонии " + бит_ТелефонияСервер.ПолучитьВерсиюПодсистемы();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступность()
	Элементы.ПрефиксВыходаНаВнешнююЛинию.Доступность = НЕ Запись.ИспользоватьПрямойНабор;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПрямойНаборПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры
