
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НовыйЭлемент = ПустаяСтрока(Параметры.Ключ.УникальныйИдентификатор());
	
	ЗадатьИмяКаталога = ПустаяСтрока(Объект.ИмяПредопределенныхДанных)
			Или НовыйЭлемент;
	
	Элементы.ИмяКаталога.Доступность = ЗадатьИмяКаталога;

	НачальноеЗаполнениеИмениКаталога = Не ПустаяСтрока(Объект.ИмяПредопределенныхДанных)
		И ПустаяСтрока(Объект.ИмяКаталога);
	Если НачальноеЗаполнениеИмениКаталога Тогда
	
		ТекущийОбъект = РеквизитФормыВЗначение("Объект");
		ТекущийОбъект.Заполнить(Неопределено);
		Объект.ИмяКаталога = ТекущийОбъект.ИмяКаталога;
		ТекущийОбъект.Записать();
	
	КонецЕсли;
	
	ПолучитьТокен();

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТокенИзменен Тогда
	
		Справочники.НастройкиЧатовТелеграм
			.ЗаписатьТокен(Объект.Ссылка, Токен);
		
		ТокенИзменен = Ложь;
	
	КонецЕсли;

	Токен = ?(ЗначениеЗаполнено(Токен), ЭтотОбъект.УникальныйИдентификатор, "");

КонецПроцедуры

&НаКлиенте
Процедура ТокенПриИзменении(Элемент)
	ТокенИзменен = Истина
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "АдресПриемаЗарегестрирован" Тогда
	
		Объект.АдресЗарегестрирован = Параметр;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьТокен()
	
	Если Не Параметры.Ключ.Пустая() Тогда
	
		Токен = Справочники.НастройкиЧатовТелеграм
			.ПолучитьТокен(Объект.Ссылка);
	
	КонецЕсли;

	Токен = ?(ЗначениеЗаполнено(Токен), ЭтотОбъект.УникальныйИдентификатор, "");

КонецПроцедуры

#КонецОбласти


