
Процедура ПометитьНаУдалениеНеВыполненныеМероприятия(Ссылка) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	               |	Мероприятие.Ссылка
	               |ИЗ
	               |	Задача.Мероприятие КАК Мероприятие
	               |ГДЕ
	               |	Мероприятие.БизнесПроцесс = &БизнесПроцесс
	               |	И Мероприятие.Выполнена = ЛОЖЬ");
	Запрос.УстановитьПараметр("БизнесПроцесс", Ссылка); 
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
	
		Мероприятие = Результат.Ссылка;
		Если Мероприятие.Пустая() Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		Мероприятие
			.ПолучитьОбъект()
			.УстановитьПометкуУдаления(Истина);
	
	КонецЦикла;

КонецПроцедуры