
Процедура ОбработатьRejectФайл() Экспорт   
	Если ЭтотОбъект.СтруктураВыгрузки.Количество() = 0 Тогда
		Сообщить("Ранее для корректировки не формировалась структура выгрузки, обработка не возможна!");
		Возврат;
	КонецЕсли;	  
	 
	ТипФайлаОтказа = ОпределитьПолныйЧастичныйОтказ(ТекстФайлаОтказа);
	Если ТипФайлаОтказа = Перечисления.НБКИ_ТипыОтказов.Полный Тогда
		ПроставитьДокументуНеПринято();
	ИначеЕсли ТипФайлаОтказа =  Перечисления.НБКИ_ТипыОтказов.Частичный Тогда	
		ПроставитьЗаписямНепринято(ТекстФайлаОтказа); 
	Иначе
		Сообщить("Ошибка чтения файла-отказа!");
	КонецЕсли;
КонецПроцедуры 

Функция ОпределитьПолныйЧастичныйОтказ(RejectФайл) Экспорт  
	МассивСтрок = СтрРазделить(Строка(RejectФайл), Символы.ПС, Ложь);
	Для Каждого стр Из МассивСтрок Цикл  
		ТипОтказа =  Перечисления.НБКИ_ТипыОтказов.Частичный; 
		Если СтрНайти(стр, "ERROR	HEADER") > 0 ИЛИ СтрНайти(стр, "ERROR	0_GROUPHEADER	M") > 0 
				ИЛИ СтрНайти(стр, "ERROR	0_GROUPHEADER	NUM") > 0 ИЛИ СтрНайти(стр, "ERROR	TRAILER") > 0 Тогда 
			ТипОтказа = Перечисления.НБКИ_ТипыОтказов.Полный;
			Прервать;
		КонецЕсли; 
	КонецЦикла;     
	
	ЗаполнитьДатуИмяОтказа(МассивСтрок[0]);
	
	Возврат ТипОтказа;
КонецФункции  

Процедура ПроставитьДокументуНеПринято() Экспорт
	Для Каждого Стр Из ЭтотОбъект.СтруктураВыгрузки Цикл
		Стр.Принято = Ложь;
	КонецЦикла;	
КонецПроцедуры 

Процедура ПроставитьЗаписямНепринято(RejectФайл) Экспорт  
	Для Каждого Заголовок Из ЭтотОбъект.СтруктураВыгрузки Цикл
		Заголовок.Принято = Истина;
	КонецЦикла; 
	
	МассивСтрок = СтрРазделить(Строка(RejectФайл), Символы.ПС, Ложь);
	Для Каждого стр Из МассивСтрок Цикл 
		Если СтрНайти(стр, "0_GROUPHEADER") > 0 Тогда
			Для Каждого Заголовок Из ЭтотОбъект.СтруктураВыгрузки Цикл
				Если стр = Заголовок.ЗаголовокGroupHeader Тогда
					Заголовок.Принято = Ложь; 
					Сообщить("Не принято: " + Строка(Заголовок.ОбъектУчета) + " " + Строка(Заголовок.ЗаголовокGroupHeader));
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры 
 	

Функция СформироватьФайлыКорректировкиRUTDF(ТекстСообщения) Экспорт  
	
	Если ЭтотОбъект.Ссылка.Пустая() Тогда
		ДокОтчетСсылка = Документы.НБКИДокументКорректировкаRUTDF.ПустаяСсылка(); 
		ЭтотОбъект.УстановитьСсылкуНового(ДокОтчетСсылка);   
		ЭтотОбъект.УстановитьНовыйНомер();
		ЭтотОбъект.Записать();
	КонецЕсли;	    
	
	СсылкаНаДокумент = ЭтотОбъект.Ссылка;

	ДатаОтчета = Дата; 
	
	ТекстовыйДок = Новый ТекстовыйДокумент;
	СтрокаЗаголовок = КредитныеИстории.СформироватьТекстЗаголовкаHEADER(НастройкаВыгрузки, ИмяФайла, ДатаОтчета, НепринятыйДокумент);
	ТекстовыйДок.ДобавитьСтроку(СтрокаЗаголовок);
	
	КоличествоОбъектовУчета = 0;
	КоличествоГруппБлоков = 0; 
	
	ЭтоКорректировка = ЗначениеЗаполнено(ЭтотОбъект.НепринятыйДокумент); 
	
	МассивТитульныеЗаписи = КредитныеИстории.СформироватьТитульныеЗаписиПоДолжникам(тчКорректировка.ВыгрузитьКолонку("Должник"));
	МассивПоручители = КредитныеИстории.СформироватьТитульныеЗаписиПоПоручителям(тчКорректировка.ВыгрузитьКолонку("ОбъектУчета"));
	МассивНаследники = КредитныеИстории.СформироватьТитульныеЗаписиПоНаследникам(тчКорректировка.ВыгрузитьКолонку("ОбъектУчета"));
	
	ПараметрыТитульники = новый Структура;
	ПараметрыТитульники.Вставить("ТитульныеЗаписиДолжника", МассивТитульныеЗаписи);
	ПараметрыТитульники.Вставить("ТитульныеЗаписиПоручителя", МассивПоручители);
	ПараметрыТитульники.Вставить("ТитульныеЗаписиНаследника", МассивНаследники);
	
	ОснованиеДляКорректировки = тчКорректировка.Выгрузить();

    ТаблицаСтрок = КредитныеИсторииИзменения.СформироватьТелоОтчетаКорректировка(КоличествоОбъектовУчета, КоличествоГруппБлоков, НастройкаВыгрузки, ОснованиеДляКорректировки, ПараметрыТитульники, ДатаОтчета, СсылкаНаДокумент); 
	
	Для каждого стр из ТаблицаСтрок Цикл 
		ТекстовыйДок.ДобавитьСтроку(стр.Строка);	
	КонецЦикла;	
	КоличествоГруппБлоков = КоличествоГруппБлоков - 1; 
		
	ТекстСообщения = ТекстСообщения + " Скорректированных записей: " + Строка(КоличествоГруппБлоков) + Символы.ПС; 
	
	СтрокаПодвал = "TRAILER" + Символы.Таб + СтрЗаменить(Строка(КоличествоОбъектовУчета), Символы.НПП, "") + Символы.Таб + СтрЗаменить(Строка(КоличествоГруппБлоков), Символы.НПП, "");
	ТекстовыйДок.ДобавитьСтроку(СтрокаПодвал);    
	
		
	Возврат ТекстовыйДок;

КонецФункции  


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НБКИДокументКорректировкаRUTDF") Тогда
		// Заполнение шапки
		НастройкаВыгрузки = ДанныеЗаполнения.НастройкаВыгрузки;
		Принято = Перечисления.СтатусыОтчетаНБКИ.ВОбработке;
		НепринятыйДокумент = ДанныеЗаполнения.Ссылка;
		ИмяПользователя = НастройкаВыгрузки.ИмяПользователяНБКИ;
		ИмяФайла = Строка(ИмяПользователя) + "_" + КредитныеИстории.СформироватьСтрокуДаты(ТекущаяДатаСеанса());
		ЭтоКорректировкаРанееОтправленогоДокумента = Истина;
		Для Каждого ТекСтрокаОбъекты Из ДанныеЗаполнения.Объекты Цикл
			НоваяСтрока = Объекты.Добавить();
			НоваяСтрока.Объект = ТекСтрокаОбъекты.Объект;
		КонецЦикла;
		Для Каждого текСтрокаКорректировка Из ДанныеЗаполнения.тчКорректировка Цикл
			НоваяСтрока = тчКорректировка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, текСтрокаКорректировка); 	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьДатуИмяОтказа(СтрокаЗаголовокОтказа) Экспорт 
	
	МассивСловЗаголовка = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаЗаголовокОтказа, Символы.Таб, Ложь, Ложь);
	
	Если МассивСловЗаголовка.Количество() > 0 Тогда
		ДатаФайлаОтказа = МассивСловЗаголовка[4];
		ИмяФайлаОтказа =  МассивСловЗаголовка[3];
	КонецЕсли;
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЭтотОбъект.Принято = Перечисления.СтатусыОтчетаНБКИ.Принято Тогда 
		Для Каждого Заголовок Из ЭтотОбъект.СтруктураВыгрузки Цикл 
			Заголовок.Принято = Истина;
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры


