
Процедура ОбработатьRejectФайл() Экспорт
	ТипФайлаОтказа = ОпределитьПолныйЧастичныйОтказ(ТекстФайлаОтказа);
	Если ТипФайлаОтказа = Перечисления.НБКИ_ТипыОтказов.Полный Тогда
		ПроставитьДокументуНеПринято();
	ИначеЕсли ТипФайлаОтказа =  Перечисления.НБКИ_ТипыОтказов.Частичный Тогда	
		тзМассивДанных = СформироватьТаблицуОшибок(ТекстФайлаОтказа); 
		ПроставитьЗаписямНепринято(тзМассивДанных);
	Иначе
		Сообщить("Ошибка чтения файла-отказа!");
	КонецЕсли;
КонецПроцедуры 

Функция ОпределитьПолныйЧастичныйОтказ(RejectФайл) Экспорт  
	МассивСтрок = СтрРазделить(Строка(RejectФайл), Символы.ПС, Ложь);
	Для Каждого стр Из МассивСтрок Цикл  
		ТипОтказа =  Перечисления.НБКИ_ТипыОтказов.Частичный; 
		Если СтрНайти(стр, "ERROR	HEADER") > 0 ИЛИ СтрНайти(стр, "ERROR	0_GROUPHEADER	M") > 0 
				ИЛИ СтрНайти(стр, "ERROR	0_GROUPHEADER	NUM") > 0 ИЛИ СтрНайти(стр, "ERROR	TRAILER") > 0 Тогда 
			ТипОтказа = Перечисления.НБКИ_ТипыОтказов.Полный;
			Прервать;
		КонецЕсли; 
	КонецЦикла;     
	
	ЗаполнитьДатуИмяОтказа(МассивСтрок[0]);
	
	Возврат ТипОтказа;
КонецФункции  

Процедура ПроставитьДокументуНеПринято() Экспорт
	
КонецПроцедуры 

Процедура ПроставитьЗаписямНепринято(тзИдентификаторовИСобытий) Экспорт
	Если тзИдентификаторовИСобытий  = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
КонецПроцедуры 

Функция СформироватьТаблицуОшибок(RejectФайл) Экспорт
	СтруктураМассивов = Новый Структура;
	ТаблицаОшибочныхЗаписей = Новый ТаблицаЗначений;
	ТаблицаОшибочныхЗаписей.Колонки.Добавить("Идентификатор");
	ТаблицаОшибочныхЗаписей.Колонки.Добавить("Событие");
	ТаблицаОшибочныхЗаписей.Колонки.Добавить("Операция");
	ТаблицаОшибочныхЗаписей.Колонки.Добавить("ДатаСобытия");
	МассивСтрок = СтрРазделить(Строка(RejectФайл), Символы.ПС, Ложь);
	Для Каждого стр Из МассивСтрок Цикл 
		Если СтрНайти(стр, "0_GROUPHEADER") > 0 Тогда  
			Подстроки = СтрРазделить(стр, Символы.Таб, Ложь);
			ПодстрокаСобытие = Подстроки[2];
			ПодстрокаОперация = Подстроки[3];
			Попытка
				ПодстрокаДата = Дата(Подстроки[4] + " 00:00:00");
			Исключение
				ПодстрокаДата = Дата(Подстроки[5] + " 00:00:00");
			КонецПопытки;
			Событие = Справочники.КредитныеИсторииСобытияСделки.НайтиПоРеквизиту("КодНБКИ", ПодстрокаСобытие);
			Если Не ЗначениеЗаполнено(Событие) Тогда
				Событие = Справочники.КредитныеИсторииСобытияСубъекта.НайтиПоРеквизиту("КодНБКИ", ПодстрокаСобытие);
			КонецЕсли;
			
			Операция = Перечисления.ВидыОперацийОтчетаRUTDF[ПодстрокаОперация];
			
			Нстр = ТаблицаОшибочныхЗаписей.Добавить();
			Нстр.Событие = Событие;
			Нстр.Операция = Операция; 
			Нстр.ДатаСобытия = ПодстрокаДата;
			Продолжить;
		Иначе	
			Если СтрНайти(стр, "C4_ID") > 0 Тогда  
				Если СтрНайти(стр, "ERROR") = 0 Тогда
					АЙДИ = СтрЗаменить(стр, Символы.Таб, ""); 
					АЙДИ = СтрЗаменить(АЙДИ, "C4_ID", "");
					Идентификатор  = Лев(АЙДИ, 38);
					Нстр.Идентификатор = СокрЛП(Идентификатор);  
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если СтрНайти(стр, "B3_REGNUM") > 0 Тогда 
				Идентификатор = СтрЗаменить(стр, "B3_REGNUM	", "");
				Идентификатор = СтрЗаменить(Идентификатор, Символы.Таб, " "); 
				Если СтрНайти(Идентификатор, "ERROR") = 0 Тогда
					Нстр.Идентификатор = СокрЛП(Идентификатор); 
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если СтрНайти(стр, "C17_UID") > 0 ИЛИ СтрНайти(стр, "B10_UID") > 0 Тогда 
				Идентификатор = СтрЗаменить(стр, "C17_UID	", "");
				Идентификатор = СтрЗаменить(Идентификатор, "B10_UID	", "");
				Если СтрНайти(Идентификатор, "ERROR") = 0 Тогда
					Нстр.Идентификатор = СокрЛП(Идентификатор);
					Продолжить;
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли;
	КонецЦикла; 
	
	Возврат ТаблицаОшибочныхЗаписей;
КонецФункции  	

Функция СформироватьФайлыКорректировкиRUTDF(ТекстСообщения) Экспорт  
	
	Если ЭтотОбъект.Ссылка.Пустая() Тогда
		ДокОтчетСсылка = Документы.НБКИДокументКорректировкаRUTDF.ПустаяСсылка(); 
		ЭтотОбъект.УстановитьСсылкуНового(ДокОтчетСсылка);   
		ЭтотОбъект.УстановитьНовыйНомер();
		ЭтотОбъект.Записать();
	КонецЕсли;	    
	
	СсылкаНаДокумент = ЭтотОбъект.Ссылка;

	ДатаОтчета = Дата; 
	
	ТекстовыйДок = Новый ТекстовыйДокумент;
	СтрокаЗаголовок = КредитныеИстории.СформироватьТекстЗаголовкаHEADER(НастройкаВыгрузки, ИмяФайла, ДатаОтчета, НепринятыйДокумент);
	ТекстовыйДок.ДобавитьСтроку(СтрокаЗаголовок);
	
	КоличествоОбъектовУчета = 0;
	КоличествоГруппБлоков = 0; 
	
	ЭтоКорректировка = ЗначениеЗаполнено(ЭтотОбъект.НепринятыйДокумент); 
	
	МассивТитульныеЗаписи = КредитныеИстории.СформироватьТитульныеЗаписиПоДолжникам(тчКорректировка.ВыгрузитьКолонку("Должник"));
	МассивПоручители = КредитныеИстории.СформироватьТитульныеЗаписиПоПоручителям(тчКорректировка.ВыгрузитьКолонку("ОбъектУчета"));
	МассивНаследники = КредитныеИстории.СформироватьТитульныеЗаписиПоНаследникам(тчКорректировка.ВыгрузитьКолонку("ОбъектУчета"));
	
	ПараметрыТитульники = новый Структура;
	ПараметрыТитульники.Вставить("ТитульныеЗаписиДолжника", МассивТитульныеЗаписи);
	ПараметрыТитульники.Вставить("ТитульныеЗаписиПоручителя", МассивПоручители);
	ПараметрыТитульники.Вставить("ТитульныеЗаписиНаследника", МассивНаследники);
	
	ОснованиеДляКорректировки = тчКорректировка.Выгрузить();

    ТаблицаСтрок = КредитныеИсторииИзменения.СформироватьТелоОтчетаКорректировка(КоличествоОбъектовУчета, КоличествоГруппБлоков, НастройкаВыгрузки, ОснованиеДляКорректировки, ПараметрыТитульники, ДатаОтчета, СсылкаНаДокумент); 
	
	Для каждого стр из ТаблицаСтрок Цикл 
		ТекстовыйДок.ДобавитьСтроку(стр.Строка);	
	КонецЦикла;	
	КоличествоГруппБлоков = КоличествоГруппБлоков - 1; 
		
	ТекстСообщения = ТекстСообщения + " Скорректированных записей: " + Строка(КоличествоГруппБлоков) + Символы.ПС; 
	
	СтрокаПодвал = "TRAILER" + Символы.Таб + СтрЗаменить(Строка(КоличествоОбъектовУчета), Символы.НПП, "") + Символы.Таб + СтрЗаменить(Строка(КоличествоГруппБлоков), Символы.НПП, "");
	ТекстовыйДок.ДобавитьСтроку(СтрокаПодвал);    
	
		
	Возврат ТекстовыйДок;

КонецФункции  

Процедура ОбработкаУдаленияПроведения(Отказ)
	
КонецПроцедуры 

Процедура ПроставитьЗаписямСтатус() Экспорт
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НБКИДокументКорректировкаRUTDF") Тогда
		// Заполнение шапки
		НастройкаВыгрузки = ДанныеЗаполнения.НастройкаВыгрузки;
		Принято = Перечисления.СтатусыОтчетаНБКИ.ВОбработке;
		НепринятыйДокумент = ДанныеЗаполнения.Ссылка;
		ИмяПользователя = НастройкаВыгрузки.ИмяПользователяНБКИ;
		ИмяФайла = Строка(ИмяПользователя) + "_" + КредитныеИстории.СформироватьСтрокуДаты(ТекущаяДатаСеанса());
		ЭтоКорректировкаРанееОтправленогоДокумента = Истина;
		Для Каждого ТекСтрокаОбъекты Из ДанныеЗаполнения.Объекты Цикл
			НоваяСтрока = Объекты.Добавить();
			НоваяСтрока.Объект = ТекСтрокаОбъекты.Объект;
		КонецЦикла;
		Для Каждого текСтрокаКорректировка Из ДанныеЗаполнения.тчКорректировка Цикл
			НоваяСтрока = тчКорректировка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, текСтрокаКорректировка); 	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьДатуИмяОтказа(СтрокаЗаголовокОтказа) Экспорт 
	
	МассивСловЗаголовка = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаЗаголовокОтказа, Символы.Таб, Ложь, Ложь);
	
	Если МассивСловЗаголовка.Количество() > 0 Тогда
		ДатаФайлаОтказа = МассивСловЗаголовка[4];
		ИмяФайлаОтказа =  МассивСловЗаголовка[3];
	КонецЕсли;
КонецПроцедуры 
	

