
Функция ПолучитьДОПоДолжнику(ДолжникСсылка) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 2
	                      |	ДолговыеОбязательства.Ссылка
	                      |ИЗ
	                      |	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	                      |ГДЕ
	                      |	ДолговыеОбязательства.Владелец = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДолжникСсылка);	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 1 Тогда
		Возврат Таблица[0].Ссылка;
	Иначе
		Возврат Справочники.ДолговыеОбязательства.ПустаяСсылка();
	КонецЕсли;	
КонецФункции
