
&НаКлиенте
Процедура НумераторПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	
КонецПроцедуры


&НаКлиенте
Процедура СвязанныйДокументПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Запись.СвязанныйДокумент) Тогда 
		Запись.СвязанныйДокумент = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура СвязанныйДокументНачалоВыбораПродолжение(Результат, Параметры) Экспорт 
	
	Если Результат <> Неопределено Тогда 
		ПараметрыФормы = Новый Структура("ТекущаяСтрока", Запись.СвязанныйДокумент);
		ОткрытьФорму(Результат.Значение, ПараметрыФормы, Параметры.Элемент);
	КонецЕсли;	
	
КонецПроцедуры