
Процедура ОбработатьНастройку(Соответствие, НастройкаЗагрузки, ТабличныйДокумент) Экспорт

	Обработки.ЗагрузкаРеестров.Создать()
		.ЗаполнитьБазовыеЗначения(НастройкаЗагрузки)
		.ЗагрузитьСоответствия(Соответствие)
		.Загрузить(ТабличныйДокумент)
	;

КонецПроцедуры

Функция ОбщиеСведения(Соответствие) Экспорт

	Возврат Обработки.ЗагрузкаРеестров.ОбщиеСведения();

КонецФункции // ()

Функция ОбработатьОшибку(ИнформацияОбОшибке) Экспорт

	ОписаниеОшибки = УправленияСообщениями.СформироватьТекстОшибки(
		ИнформацияОбОшибке,
		"Ошибка при загрузке файла"
	);
	
	Данные = Новый Массив;
	Данные.Добавить(ОписаниеОшибки["Выражение"]);
	
	Логер = БЛогер_Логирование.Создать();
	БЛогер_Логирование.Добавить(
		Логер,
		ОписаниеОшибки["Стек"],
		Перечисления.БЛогер_Уровни.Ошибка
	);
	
	Возврат Данные;

КонецФункции // ()
