
#Область ПрограммныйИнтерфейс

#Область КонфигурацияЛогер

Функция ИспользуемыйЛогер() Экспорт

	#Если Сервер Тогда
		Возврат БЛогер_ЛогерПоУмолчанию;
	#КонецЕсли
	
	#Если Клиент Тогда
		Возврат БЛогер_ЛогерПоУмолчаниюКлиент;
	#КонецЕсли

КонецФункции // ()

#КонецОбласти

#Область ИнтерфейсПарсингДокументов

Функция ПолучитьПарсингДокументовСтадии(Конфигурация = Неопределено) Экспорт

	Если Конфигурация = Неопределено Тогда
	
		Конфигурация = ПарсингДокументовСтадии();
	
	КонецЕсли;
	
	Возврат ПарсингДокументовОбщийКлиентСервер.ОпределитьСтадииПарсинга(
		Конфигурация.Получить("Предварительная подготовка"),
		Конфигурация.Получить("Конвернаци Word в PDF (Не рекомендуется)"),
		Конфигурация.Получить("Подготовить Текстовый документ"),
		Конфигурация.Получить("Подготовить мини изображения"),
		Конфигурация.Получить("Обработать текстовые документы")
	);

КонецФункции // ()

Функция ПарсингДокументовМакеты() Экспорт

	Макеты = Новый Структура;
	Если ПарсингДокументовОбщийКлиентСервер.ЭтоLinux() Тогда
	
		Макеты.Вставить("Конвертер",      "ConverterLinux");
		Макеты.Вставить("Распознаватель", "ParserLinux");
		Макеты.Вставить("Уменьшатель",    "ResaizerLinux");
	
	КонецЕсли;
	Если ПарсингДокументовОбщийКлиентСервер.ЭтоWindows() Тогда
	
		Макеты.Вставить("Конвертер",      "ConverterWindows");
		Макеты.Вставить("Распознаватель", "ParserWindows");
		Макеты.Вставить("Уменьшатель",    "ResaizerWindows");
	
	КонецЕсли;
		
	Возврат Макеты;

КонецФункции // ()

Функция ПарсингДокументовИсполнимыеФайлы() Экспорт

	Описание = Новый Структура;
	Если ПарсингДокументовОбщийКлиентСервер.ЭтоLinux() Тогда
	
		Описание.Вставить("Конвертер",      "Converter.sh");
		Описание.Вставить("Распознаватель", "Tesseract.sh");
		Описание.Вставить("Уменьшатель",    "Resaizer.sh");
	
	КонецЕсли;
	Если ПарсингДокументовОбщийКлиентСервер.ЭтоWindows() Тогда
	
		Описание.Вставить("Конвертер",      "Converter.ps1");
		Описание.Вставить("Распознаватель", "Tesseract.ps1");
		Описание.Вставить("Уменьшатель",    "Resaizer.ps1");
	
	КонецЕсли;
		
	Возврат Описание;

КонецФункции // ()

#КонецОбласти

#Область КонфигурацияПарсингДокументов

Функция ПарсингДокументовСтадии(МиниИзображения = Истина) Экспорт

	ВключитьСтадии = Новый Соответствие;
	ВключитьСтадии.Вставить("Предварительная подготовка",               Истина);
	ВключитьСтадии.Вставить("Конвернаци Word в PDF (Не рекомендуется)", Ложь);
	ВключитьСтадии.Вставить("Подготовить Текстовый документ",           Истина);
	ВключитьСтадии.Вставить("Подготовить мини изображения",             МиниИзображения);
	ВключитьСтадии.Вставить("Обработать текстовые документы",           Ложь);

	Возврат ВключитьСтадии;
	
КонецФункции // ()

#КонецОбласти

#КонецОбласти
