
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
КонецПроцедуры


Процедура ВыполнитьДействия() Экспорт
	Для Каждого Строка Из ЭтотОбъект.Объекты Цикл
		Если Строка.Результат = Неопределено Тогда
			Строка.Результат = ОбъектыСервер.ВычислитьФункцию(ЭтотОбъект.Действие.Функция, Строка.Объект, ,);
		Иначе
			Сообщить("По объекту " + Строка.Объект.Наименование + " действие уже было выполнено");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	Для Каждого Строка Из ЭтотОбъект.Объекты Цикл
		Строка.Результат = Неопределено;
	КонецЦикла;
КонецПроцедуры

