Процедура ПередЗаписью(Отказ)	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗСообщений.ТипСообщения КАК ТипСообщения,
	|	ТЗСообщений.ДатаСообщения КАК ДатаСообщения
	|ПОМЕСТИТЬ ВТ_ТЗСообщений
	|ИЗ
	|	&ТЗСообщений КАК ТЗСообщений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_ТЗСообщений.ТипСообщения КАК ТипСообщения
	|ИЗ
	|	ВТ_ТЗСообщений КАК ВТ_ТЗСообщений
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТЗСообщений.ДатаСообщения УБЫВ";
	
	Запрос.УстановитьПараметр("ТЗСообщений", ЭтотОбъект.СообщенияОБанкротстве.Выгрузить());
	Выборка =  Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтатусДелаОБанкротстве = Выборка.ТипСообщения;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДелоОБанкротствеСообщенияОБанкротстве.Ссылка КАК Доб,
		|	ДелоОБанкротствеСообщенияОБанкротстве.ДатаСообщения КАК Период,
		|	ДелоОБанкротствеСообщенияОБанкротстве.Сообщение КАК Сообщение,
		|	ДелоОБанкротствеСообщенияОБанкротстве.ТипСообщения КАК ТипСообщения,
		|	ДелоОБанкротствеСообщенияОБанкротстве.Ссылка.Контрагент КАК Контрагент,
		|	ДелоОБанкротствеСообщенияОБанкротстве.Ссылка.НомерСудебногоДела КАК НомерСудебногоДела,
		|	ДелоОБанкротствеСообщенияОБанкротстве.ТипСудебногоРешения КАК ТипСудебногоРешения
		|ИЗ
		|	Справочник.ДелоОБанкротстве.СообщенияОБанкротстве КАК ДелоОБанкротствеСообщенияОБанкротстве
		|ГДЕ
		|	ДелоОБанкротствеСообщенияОБанкротстве.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.СостояниеДоБ.СоздатьМенеджерЗаписи();	
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	КонтрагентОб = Контрагент.ПолучитьОбъект();
	КонтрагентОб.ЕстьДанныеОБанкротстве = Истина;
	КонтрагентОб.Записать();
	
КонецПроцедуры
