
Процедура ПередЗаписью(Отказ)   
	Если Не ЗначениеЗаполнено(НомерРешенияСуда) Или Не ЗначениеЗаполнено(ДатаРешенияСуда) Тогда
		Сообщить("Заполните номер и дату решения!");
		Отказ = Истина;
	КонецЕсли;	
	ЭтотОбъект.Наименование = НомерРешенияСуда + " от " + Строка(ДатаРешенияСуда);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		ЭтотОбъект.Владелец = ДанныеЗаполнения.Ссылка;
		ЭтотОбъект.Наименование = "Новое Дело...";
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	СобытиеЗафиксировано = КредитныеИстории.СобытиеСубъектаЗафиксированоИсточником(ЭтотОбъект.Владелец, ЭтотОбъект.Ссылка, "1.10");
	Если Не СобытиеЗафиксировано Тогда
		КредитныеИстории.ЗаписатьСобытиеСубъекта(ЭтотОбъект.Владелец, ЭтотОбъект.ДатаРешенияСуда, ЭтотОбъект.Ссылка, "1.10");   
	КонецЕсли;       
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		СобытиеЗафиксировано = КредитныеИстории.СобытиеСубъектаЗафиксированоИсточником(ЭтотОбъект.Владелец, ЭтотОбъект.Ссылка, "1.10"); 
		Если СобытиеЗафиксировано Тогда 
			КредитныеИстории.УдалитьСобытияИсточникаСубъекта(ЭтотОбъект.Владелец, ЭтотОбъект.Ссылка);  
		КонецЕсли;
	КонецЕсли;	
	
	
КонецПроцедуры
