
&НаКлиенте
Процедура Отправить(Команда)
	// Отправить сообщение через API	
	UWP = Новый Файл("C:\Program Files\WindowsApps\5319275A.WhatsAppDesktop_2.2322.2.0_x64__cv1g1gvanyjgm\WhatsApp.exe");
	UWP2 = Новый Файл("C:\Program Files\WindowsApps\5319275A.WhatsAppDesktop_2.2323.2.0_x64__cv1g1gvanyjgm\WhatsApp.exe");
	Если UWP.Существует() ИЛИ UWP2.Существует() Тогда
		Для Счетчик = 1 По 100 Цикл
			Состояние("Отправка сообщения", Счетчик, "Пожалуйста, подождите...", БиблиотекаКартинок.NC_ПодсистемаИнтеграцияСWhatsApp);
		КонецЦикла;
		КомандаОтправить = "whatsapp://send/?phone="+Номер+"&text="+Сообщение;
		ЗапуститьПриложение(КомандаОтправить);
		Оповестить("ШаблонИзмененВЦ");
	Иначе
		Ответ = Вопрос("Клиент WhatsApp не установлен на данном ПК. Установить?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Интеграция с WhatsApp");
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ФормаУстановкиИОбновленияВЦ = ПолучитьФорму("ОбщаяФорма.УстановкаИОбновлениеWhatsApp");
			ФормаУстановкиИОбновленияВЦ.Открыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоискДолжника(Команда) Экспорт
	// Найти контакт через API
	UWP = Новый Файл("C:\Program Files\WindowsApps\5319275A.WhatsAppDesktop_2.2322.2.0_x64__cv1g1gvanyjgm\WhatsApp.exe");
	UWP2 = Новый Файл("C:\Program Files\WindowsApps\5319275A.WhatsAppDesktop_2.2323.2.0_x64__cv1g1gvanyjgm\WhatsApp.exe");
	Если UWP.Существует() ИЛИ UWP2.Существует() Тогда
		КомандаПоиск = "whatsapp://send/?phone="+Номер;
		ЗапуститьПриложение(КомандаПоиск);
	Иначе
		Ответ = Вопрос("Клиент WhatsApp не установлен на данном ПК. Установить?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Интеграция с WhatsApp");
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ФормаУстановкиИОбновленияВЦ = ПолучитьФорму("ОбщаяФорма.УстановкаИОбновлениеWhatsApp");
			ФормаУстановкиИОбновленияВЦ.Открыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Шаблоны(Команда)
	// Открыть форму списка шаблонов
	ФормаСпискаШаблонов = ПолучитьФорму("Справочник.ШаблоныТекстаДляАвтоинформирования.Форма.ФормаСписка");
	ФормаСпискаШаблонов.СкрытоеПолеНомерДО = ЭтаФорма.Договор;
	ФормаСпискаШаблонов.Открыть();
КонецПроцедуры