
&НаКлиенте
Процедура Отправить(Команда)
	// Отправить сообщение через API
	Shell = Новый COMОбъект("WScript.Shell");
	USERPROFILE = Shell.ExpandEnvironmentStrings("%USERPROFILE%");
	EXE = Новый Файл(USERPROFILE + "\AppData\Local\WhatsApp\WhatsApp.exe");
	Если EXE.Существует() Тогда
		Для Счетчик = 1 По 100 Цикл
			Состояние("Отправка сообщения", Счетчик, "Пожалуйста, подождите...", БиблиотекаКартинок.NC_ПодсистемаИнтеграцияСWhatsApp);
		КонецЦикла;
		КомандаОтправить = "whatsapp://send/?phone="+Номер+"&text="+Сообщение;
		ЗапуститьПриложение(КомандаОтправить);
		Оповестить("ШаблонИзмененВЦ");
	Иначе
		Ответ = Вопрос("Клиент WhatsApp не установлен на данном ПК. Установить?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Интеграция с WhatsApp");
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ФормаУстановкиИОбновленияВЦ = ПолучитьФорму("ОбщаяФорма.УстановкаИОбновлениеWhatsApp");
			ФормаУстановкиИОбновленияВЦ.Открыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоискДолжника(Команда) Экспорт
	// Найти контакт через API
	Shell = Новый COMОбъект("WScript.Shell");
	USERPROFILE = Shell.ExpandEnvironmentStrings("%USERPROFILE%");
	EXE = Новый Файл(USERPROFILE + "\AppData\Local\WhatsApp\WhatsApp.exe");
	Если EXE.Существует() Тогда
		КомандаПоиск = "whatsapp://send/?phone="+Номер;
		ЗапуститьПриложение(КомандаПоиск);
	Иначе
		Ответ = Вопрос("Клиент WhatsApp не установлен на данном ПК. Установить?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Интеграция с WhatsApp");
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ФормаУстановкиИОбновленияВЦ = ПолучитьФорму("ОбщаяФорма.УстановкаИОбновлениеWhatsApp");
			ФормаУстановкиИОбновленияВЦ.Открыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Шаблоны(Команда)
	// Открыть форму списка шаблонов
	ФормаСпискаШаблонов = ПолучитьФорму("Справочник.ШаблоныТекстаДляАвтоинформирования.Форма.ФормаСписка");
	ФормаСпискаШаблонов.СкрытоеПолеНомерДО = ЭтаФорма.Договор;
	ФормаСпискаШаблонов.Открыть();
КонецПроцедуры
