
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Проверить установку UWP клиента
	UWP = Новый Файл("C:\Program Files\WindowsApps\5319275A.WhatsAppDesktop_2.2322.2.0_x64__cv1g1gvanyjgm\WhatsApp.exe");
	UWP2 = Новый Файл("C:\Program Files\WindowsApps\5319275A.WhatsAppDesktop_2.2323.2.0_x64__cv1g1gvanyjgm\WhatsApp.exe");
	UWP3 = Новый Файл("C:\Program Files\WindowsApps\5319275A.WhatsAppDesktop_2.2324.6.0_x64__cv1g1gvanyjgm\WhatsApp.exe");
	Если UWP.Существует() ИЛИ UWP2.Существует() ИЛИ UWP3.Существует() Тогда
		Возврат;
	Иначе
		Ответ = Вопрос("Клиент WhatsApp не установлен на данном ПК. Установить?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Интеграция с WhatsApp");
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ФормаУстановкиИОбновленияВЦ = ПолучитьФорму("ОбщаяФорма.УстановкаИОбновлениеWhatsApp");
			ФормаУстановкиИОбновленияВЦ.Открыть();
		ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	Если ЗначениеЗаполнено(ЭтаФорма.Номер) И ЗначениеЗаполнено(ЭтаФорма.Сообщение) Тогда
		// Отправить сообщение через API	
		Для Счетчик = 1 По 100 Цикл
			Состояние("Отправка сообщения", Счетчик, "Пожалуйста, подождите...", БиблиотекаКартинок.NC_ПодсистемаИнтеграцияСWhatsApp);
		КонецЦикла;
		КомандаОтправить = "whatsapp://send/?phone="+Номер+"&text="+Сообщение;
		ЗапуститьПриложение(КомандаОтправить);
		Оповестить("ШаблонИзмененВЦ");
		//
	Иначе
		Предупреждение("Не заполнены обязательные поля!",,"Интеграция с WhatsApp");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоискДолжника(Команда) Экспорт
	// Проверить установку UWP клиента
	UWP = Новый Файл("C:\Program Files\WindowsApps\5319275A.WhatsAppDesktop_2.2322.2.0_x64__cv1g1gvanyjgm\WhatsApp.exe");
	UWP2 = Новый Файл("C:\Program Files\WindowsApps\5319275A.WhatsAppDesktop_2.2323.2.0_x64__cv1g1gvanyjgm\WhatsApp.exe");
	UWP3 = Новый Файл("C:\Program Files\WindowsApps\5319275A.WhatsAppDesktop_2.2324.6.0_x64__cv1g1gvanyjgm\WhatsApp.exe");
	Если UWP.Существует() ИЛИ UWP2.Существует() ИЛИ UWP3.Существует() Тогда
		// Найти контакт через API
		КомандаПоиск = "whatsapp://send/?phone="+Номер;
		ЗапуститьПриложение(КомандаПоиск);
		//
	Иначе
		Ответ = Вопрос("Клиент WhatsApp не установлен на данном ПК. Установить?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Интеграция с WhatsApp");
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ФормаУстановкиИОбновленияВЦ = ПолучитьФорму("ОбщаяФорма.УстановкаИОбновлениеWhatsApp");
			ФормаУстановкиИОбновленияВЦ.Открыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Шаблоны(Команда)
	// Открыть форму списка шаблонов
	ФормаСпискаШаблонов = ПолучитьФорму("Справочник.ШаблоныТекстаДляАвтоинформирования.Форма.ФормаСписка");
	ФормаСпискаШаблонов.СкрытоеПолеНомерДО = ЭтаФорма.Договор;
	ФормаСпискаШаблонов.Открыть();
КонецПроцедуры
