
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектыСервер.ОграничитьТипОбъекта(Элементы.ОбъектыОбъект);
	
	//
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
		Если Не Константы.УчетПоТипамСотрудников.Получить() Тогда
			Объект.НеНазначатьСотрудников = Истина;
		КонецЕсли;
	КонецЕсли;
		
	Если Объект.Ссылка.Пустая() И Параметры.Основание = "ОбработкаРаспределения" Тогда
		Объект.СотрудникПринимающий = Параметры.СотрудникПринимающий; 
		Объект.Объекты.Загрузить(Параметры.ТЗДолговыеОбязательства);
	КонецЕсли;
	
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
	
	Если Не Константы.УчетПоТипамСотрудников.Получить() Тогда
		Элементы.НазначитьГлавнымГруппы.Видимость = Ложь;
        Элементы.БылГлавнымГруппы.Видимость = Ложь;
		Элементы.НеНазначатьСотрудников.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ОбъектыПодборПоНастройкам.Видимость = Константы.ИспользоватьНастройкиПодбораОбъектовУчета.Получить();
	
	УстановитьЗащитуОтПерепроведения();
	
КонецПроцедуры 

&НаСервере
Процедура ПодборВтаблЧасть(Результат)
	Об = РеквизитФормыВЗначение("Объект");		
	РаботаСДокументами.ЗанестиРезультатПодбораВТабличнуюЧасть(Об.Объекты, Результат);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПринимающееПриИзменении(Элемент)
	//Элементы.СотрудникПередающий.Доступность = Объект.ПодразделениеПередающее.Пустая() И 
	//		Объект.ПодразделениеПринимающее.Пустая();
	//Если Объект.ПодразделениеПередающее = Объект.ПодразделениеПринимающее Тогда
	//	Объект.СотрудникПередающий = Неопределено;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПередающееПриИзменении(Элемент)
	//Элементы.СотрудникПередающий.Доступность = Объект.ПодразделениеПередающее.Пустая() И 
	//		Объект.ПодразделениеПринимающее.Пустая();
	//Если Объект.ПодразделениеПередающее = Объект.ПодразделениеПринимающее Тогда
	//	Объект.СотрудникПередающий = Неопределено;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Объекты.Очистить();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
	
	УстановитьЗащитуОтПерепроведения();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элементы.ОбъектыОбъект.ВыбиратьТип = (Элементы.Объекты.ТекущиеДанные.Объект = Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Элементы.ОбъектыОбъект.ВыбиратьТип = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПолеПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтрокуОбъект(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура УстановитьЗащитуОтПерепроведения()	
	Если Объект.ИзменялРС Тогда
		Элементы.ГруппаНомера.ТолькоПросмотр = Истина;
	    Элементы.Организация.ТолькоПросмотр = Истина;		
		Элементы.ГруппаПередает.ТолькоПросмотр = Истина;
		Элементы.ГруппаПринимает.ТолькоПросмотр = Истина;
		Элементы.Объекты.ТолькоПросмотр = Истина;
		Элементы.Комментарий.ТолькоПросмотр = Истина;
		Элементы.ОбъектыПодбор.Доступность = Ложь;
    Иначе
		Элементы.ГруппаНомера.ТолькоПросмотр = Ложь;
	    Элементы.Организация.ТолькоПросмотр = Ложь;		
		Элементы.ГруппаПередает.ТолькоПросмотр = Ложь;
		Элементы.ГруппаПринимает.ТолькоПросмотр = Ложь;
		Элементы.Объекты.ТолькоПросмотр = Ложь;
		Элементы.Комментарий.ТолькоПросмотр = Ложь;
		Элементы.ОбъектыПодбор.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ТипЗначенияВладельца = ТипЗнч(ЭтаФорма.ВладелецФормы);
	Если ТипЗначенияВладельца = Тип("УправляемаяФорма") тогда
		Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Задача.Мероприятие.Форма.ФормаМероприятия" Тогда
			ЭтаФорма.ВладелецФормы.Объект.СвязанныйДокумент = Объект.Ссылка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоНастройкам(Команда)
	ОбъектыКлиент.ПодборПоНастройкам(ЭтаФорма);
КонецПроцедуры

// Получить значения с сервера

&НаСервере
Процедура ПриОткрытииНаСервере()
	ЭтаФорма.Авторизованный = ПользователиКлиентСервер.АвторизованныйПользователь();
КонецПроцедуры

//

// Клиентская процедура при открытии формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.СотрудникПередающий) = Ложь Тогда
		ЭтаФорма.Объект.СотрудникПередающий = ЭтаФорма.Авторизованный;
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Объект.СотрудникПринимающий) = Ложь Тогда
		ЭтаФорма.Объект.СотрудникПринимающий = ЭтаФорма.Авторизованный;
	КонецЕсли;
КонецПроцедуры

//

&НаКлиенте
Процедура СоздатьОтменуАкта(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Основание", Объект.Ссылка);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
	ОткрытьФорму("Документ.АктПередачи.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры


