
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Источник = "https://oplata-fssp.ru/search/fssp?document_type=fio_birth_date_requisite&document_value[fio]="
	+ Строка(ЭтаФорма.Должник) + "&document_value[region_id]=" + Строка(ОбъектыСервер.ПолучитьЗначениеСвойства(Должник, "0188"))
	+ "&document_value[birth_date]=" + Строка(СтрЗаменить(Формат(ОбъектыСервер.ПолучитьЗначениеСвойства(Должник, "0043"), "ДФ=yyyy-MM-dd"), " 0:00:00", ""))
	+ "&additional_fields[full_name_from_gis]=false&owner_name=" + Строка(Должник) + "&lead_source_id=search&lead_source_id_ext=all_docs_additional_offer";
	ПодключитьПарсер();
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьПарсер()
	ПодключитьОбработчикОжидания("ВыполнитьПарсингФССП", 10, Истина);  
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПарсингФССП() 
	Документ = ЭтаФорма.Элементы.Источник.Документ;
	Попытка
		СписокИП = Документ.querySelector(".search-page__wrap__box");
	Исключение
		СписокИП = Неопределено;
	КонецПопытки;
	Если СписокИП <> Неопределено Тогда
		Результат = СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(СписокИП.innerHTML);
		// Преобразоавать
		Результат = СтрЗаменить(Результат, "Оплатить частично", "");
		Результат = СтрЗаменить(Результат, "Реквизиты платежа", "");
		Результат = СтрЗаменить(Результат, "&nbsp;", " ");
		РезультатВБазу(Результат);
	Иначе
		ПустойРезультатВБазу();
	КонецЕсли;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура РезультатВБазу(Результат)
	ФССПСлужебный.УдалитьСтарыеИП(ЭтаФорма.Должник);
	// Записать ИП в регистр сведений
	МенеджерЗаписи = РегистрыСведений.ИсполнительныеПроизводства.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Должник = ЭтаФорма.Должник;
	МенеджерЗаписи.ДатаПроверки = ТекущаяДата();
	МенеджерЗаписи.РезультатПроверки = Результат;
	МенеджерЗаписи.Записать();
	// Записать признак наличия ИП
	ДолжникОбъект = ЭтаФорма.Должник.ПолучитьОбъект();
	Если Не ДолжникОбъект.ЕстьИП Тогда
		ДолжникОбъект.ЕстьИП = Истина;
		ДолжникОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПустойРезультатВБазу()
	ФССПСлужебный.УдалитьСтарыеИП(ЭтаФорма.Должник);
	// Записать ИП в регистр сведений
	МенеджерЗаписи = РегистрыСведений.ИсполнительныеПроизводства.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Должник = ЭтаФорма.Должник;
	МенеджерЗаписи.ДатаПроверки = ТекущаяДата();
	УИДЗапроса = Новый УникальныйИдентификатор();
	МенеджерЗаписи.РезультатПроверки = "Исполнительные производства не найдены " + "(" + УИДЗапроса + ")";
	МенеджерЗаписи.Записать();
КонецПроцедуры
