
&НаСервере
Процедура ПриСозданииНаСервере()
	// Записать текущую версию конфигурации
	Константы.ВерсияКонфигурацииNC.Установить("3.4.2");
	// Записать настройку отображения списка
	Константы.ПоказыватьСписокИзменений.Установить(Истина);
КонецПроцедуры

&НаСервере
Процедура ОтключитьПоказСпискаНаСервере()
	// Записать настройку отображения списка
	Константы.ПоказыватьСписокИзменений.Установить(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьПоказСписка(Команда)
	// Записать настройку отображения списка
	ОтключитьПоказСпискаНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры
