
&НаСервере
Процедура ПриОткрытииНаСервере()
	// Получим непредопредленное значение с сервера
	ЭтаФорма.РольАБД = РольДоступна("АБД");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();	
	Если ЭтаФорма.РольАБД = Истина Тогда
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСохранитьНастройки.Доступность = Истина;
		ЭтаФорма.Элементы.ГруппаНастройки.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	// Записать текущие настройки редактирования
	ПоказатьОповещениеПользователя("Шаблоны сообщений",,"Настройки редактирования сохранены",БиблиотекаКартинок.NC_Сохранено);
	ЭтаФорма.Записать();
КонецПроцедуры

