
&НаСервере
Процедура ПриОткрытииНаСервере()
	// Получим непредопредленное значение с сервера
	ЭтаФорма.РольАБД = РольДоступна("АБД");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();	
	Если ЭтаФорма.РольАБД = Истина Тогда
		ЭтаФорма.Элементы.НастройкиРедактирования.Доступность = Истина;
		ЭтаФорма.Элементы.РазрешитьРедактированиеШаблоновСМС.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	// Записать текущие настройки редактирования
	ЭтаФорма.Записать();
КонецПроцедуры

