
&НаКлиенте
Процедура ОткрытьФайл(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл загрузки...";
	Диалог.ПолноеИмяФайла = "";
	Диалог.ПредварительныйПросмотр = Ложь;
	//Диалог.Каталог = ТекКаталог;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "XML (*.xml)|*.xml";
	
	Если Диалог.Выбрать() Тогда
		Док.Прочитать(Диалог.ПолноеИмяФайла);
		Стр = Док.ПолучитьТекст();
		Стр = СтрЗаменить(Стр, Символы.ПС, Символы.ПС + "|");
		Стр = СтрЗаменить(Стр, """", """""");
		Док.УстановитьТекст("""" + Стр + """");
	КонецЕсли;
КонецПроцедуры
