

&НаСервере
Процедура РассчитатьГрафикНаСервере()
	//ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
	//ЗначениеОбъект.ЗагрузитьГрафикНачислений();
	//ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
	
	Объект.ГрафикИндексации.Загрузить(РасчетЗадолженностиСудопроизводство.РассчитатьГрафикИндексации(Объект, Объект.ИсторияПлатежей.Выгрузить()));
	
	ЗаполнитьПодвал();
	к = Объект.ГрафикИндексации.Количество();
	Попытка
		Объект.СуммаИндексации = Объект.ГрафикИндексации[к-1].ОстаткиПроценты; 
	Исключение
		Объект.ИсключитьКрайниеМесяцы = Ложь;
		Объект.ГрафикИндексации.Загрузить(РасчетЗадолженностиСудопроизводство.РассчитатьГрафикИндексации(Объект, Объект.ИсторияПлатежей.Выгрузить()));
		ЗаполнитьПодвал();
		к = Объект.ГрафикИндексации.Количество();
		Объект.СуммаИндексации = Объект.ГрафикИндексации[к-1].ОстаткиПроценты;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодвал()
	к = Объект.ГрафикИндексации.Количество();
	Если к > 0 Тогда
		Элементы.ГрафикНачисленияИПогашенияКУплате.ТекстПодвала = Строка(Объект.ГрафикИндексации[к-1].Куплате);
		Элементы.ГрафикНачисленияИПогашенияОстаткиОсновнойДолг.ТекстПодвала = Строка(Объект.ГрафикИндексации[к-1].ОстаткиОсновнойДолг);
		Элементы.ГрафикНачисленияИПогашенияОстаткиПроценты.ТекстПодвала = Строка(Объект.ГрафикИндексации[к-1].ОстаткиПроценты);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьГрафик(Команда)
	Если Не ЗначениеЗаполнено(Объект.ДатаРешения) Тогда
		Сообщить("Заполните дату решения!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.СуммаЗадолженности) Тогда
		Сообщить("Заполните сумму решения!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ДатаРасчета) Тогда
		Сообщить("Заполните дату расчета!");
		Возврат;
	КонецЕсли;	
	РассчитатьГрафикНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	ИнициализироватьСписокТерриторийФССП(Элементы.Территория.СписокВыбора);
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Территория = "Российская Федерация";
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
	ЗаполнитьПодвал();
КонецПроцедуры  

&НаСервере
Процедура ИнициализироватьСписокТерриторийФССП(Список)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФССП_СлужбыСудебныхПриставов.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ФССП_СлужбыСудебныхПриставов КАК ФССП_СлужбыСудебныхПриставов
		|ГДЕ
		|	ФССП_СлужбыСудебныхПриставов.ЭтоГруппа
		|	И НЕ ФССП_СлужбыСудебныхПриставов.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	
	Для каждого Стр из РезультатЗапроса Цикл
		Позиция = стрНайти(Стр.Наименование, " - ",,,);
		Если Позиция > 0 Тогда
			Стр.Наименование = СокрЛП(Лев(Стр.Наименование,Позиция));
		КонецЕсли;
	КонецЦикла;
	РезультатЗапроса.Свернуть("Наименование");
	Для каждого Стр из РезультатЗапроса Цикл
		Список.Добавить(Стр.Наименование);
	КонецЦикла;	
	Список.Добавить("Российская Федерация");
КонецПроцедуры



&НаСервере
Процедура ЗаймПриИзмененииНаСервере()

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИсторияПлатежей.Период КАК ДатаПлатежа,
	                      |	ИсторияПлатежей.Задолженность КАК СуммаПлатежа
	                      |ИЗ
	                      |	РегистрНакопления.ИсторияПлатежей КАК ИсторияПлатежей
	                      |ГДЕ
	                      |	ИсторияПлатежей.Объект = &Объект");
	Запрос.УстановитьПараметр("Объект", Объект.Займ);
	Результат = Запрос.Выполнить().Выгрузить();
	Объект.ИсторияПлатежей.Загрузить(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ЗаймПриИзменении(Элемент)
//	Объект.СуммаЗадолженности = ЭтаФорма.ВладелецФормы.Объект.ЦенаИска;
//	Объект.ДатаРешения = НачалоДня(ЭтаФорма.ВладелецФормы.Объект.Дата);
	ЗаймПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстатки(ДО)
	//Запрос = Новый Запрос();
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгДООстаток КАК ОсновнойДолгДООстаток,
	//               |	ЗадолженностьПоОбъектамОстатки.ПроцентыДООстаток КАК ПроцентыДООстаток,
	//               |	ЗадолженностьПоОбъектамОстатки.ШтрафыДООстаток КАК ШтрафыДООстаток
	//               |ИЗ
	//               |	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки КАК ЗадолженностьПоОбъектамОстатки
	//               |ГДЕ
	//               |	ЗадолженностьПоОбъектамОстатки.Объект = &Объект";
	//Запрос.УстановитьПараметр("Объект",ДО);
	//Рез = Запрос.Выполнить().Выбрать();
	//Пока Рез.Следующий() Цикл
	//	Объект.ОстаткиОД = Рез.ОсновнойДолгДООстаток;
	//	Объект.ОстаткиПросроченныеПроценты = Рез.ШтрафыДООстаток;
	//	Объект.ОстаткиПроценты = Рез.ПроцентыДООстаток;
	//КонецЦикла;	
	
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()
	Объект.ИсторияПлатежей.Сортировать("ДатаПлатежа");
	Если ЗначениеЗаполнено(Объект.Займ) Тогда
		ЗаймПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаймПриИзменении(Неопределено);
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Попытка
		ЭтаФорма.ВладелецФормы.Объект.Расчет208 = Объект.Ссылка;
		ЭтаФорма.ВладелецФормы.Объект.ИскСуммаИндексации208 = Объект.СуммаИндексации;
	Исключение
		
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьУЭД(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог для сохранения документа...";
	Диалог.МножественныйВыбор = Ложь;
	

	Если Диалог.Выбрать() Тогда
		
		
		ТабДок = Новый ТабличныйДокумент;
		
		ПечатьНаСервере(ТабДок);
		
		Каталог = Диалог.Каталог + "\";            
		ИмяФайла = Каталог + "Расчет индексации по 208 ГПК РФ " + Строка(Объект.Займ) + ".xlsx";
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
		
		ЗапуститьПриложение(ИмяФайла);
		
	КонецЕсли;
	
	
	//Сообщить("Расчет индексации произведен");


КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере(ТабДок)
	РасчетЗадолженностиСудопроизводство.ПечатнаяФорма208(ТабДок, Объект, Объект.ГрафикИндексации.Выгрузить());
КонецПроцедуры
	
	

