Процедура ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийИП,МассивСуммИПредметов,ТаблицаДвиженийЗадолженность) Экспорт
	Если МассивСуммИПредметов.количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	ТаблицаСуммИПредметов = ОбъектыСервер.ПреобразоватьМассивВТаблицуЗначений(МассивСуммИПредметов);   
	
	ТаблицаСуммИПредметов = объектыСервер.ТипизированнаяТаблицаЗначений(ТаблицаСуммИПредметов);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Таблица.ИП КАК ID,
	                      |	Таблица.СтатусИП КАК Статус
	                      |ПОМЕСТИТЬ ТаблицаДвижений
	                      |ИЗ
	                      |	&Таблица КАК Таблица
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ID
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(Предметы.ИП КАК Справочник.ФССП_ИсполнительноеПроизводство) КАК ИсполнительноеПроизводство,
	                      |	ВЫРАЗИТЬ(Предметы.Предмет КАК Справочник.ФССП_ПредметыИП) КАК Предмет,
	                      |	ВЫРАЗИТЬ(Предметы.Сумма КАК ЧИСЛО(10, 2)) КАК Сумма
	                      |ПОМЕСТИТЬ Предметы
	                      |ИЗ
	                      |	&Предметы КАК Предметы
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ИсполнительноеПроизводство,
	                      |	Предмет
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаДвижений.ID КАК ИсполнительноеПроизводство,
	                      |	ТаблицаДвижений.Статус КАК Статус,
	                      |	ФССП_ЗадолженностьПоПредметамИПОстатки.СуммаОстаток КАК СуммаОстаток,
	                      |	Предметы.Сумма КАК СуммаДокумент,
	                      |	ЕСТЬNULL(Предметы.Сумма, 0) - ЕСТЬNULL(ФССП_ЗадолженностьПоПредметамИПОстатки.СуммаОстаток, 0) КАК Сумма,
	                      |	Предметы.Предмет КАК Предмет
	                      |ПОМЕСТИТЬ ДвиженияЗадолженность
	                      |ИЗ
	                      |	Предметы КАК Предметы
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ФССП_ЗадолженностьПоПредметамИП.Остатки(&МоментДО) КАК ФССП_ЗадолженностьПоПредметамИПОстатки
	                      |		ПО Предметы.ИсполнительноеПроизводство = ФССП_ЗадолженностьПоПредметамИПОстатки.ИсполнительноеПроизводство
	                      |			И Предметы.Предмет = ФССП_ЗадолженностьПоПредметамИПОстатки.Предмет
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДвижений КАК ТаблицаДвижений
	                      |		ПО Предметы.ИсполнительноеПроизводство = ТаблицаДвижений.ID
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	&Период КАК Период,
	                      |	ДвиженияЗадолженность.ИсполнительноеПроизводство КАК ИсполнительноеПроизводство,
	                      |	&Ссылка КАК Регистратор,
	                      |	ВЫБОР
	                      |		КОГДА ДвиженияЗадолженность.Сумма > 0
	                      |			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                      |		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                      |	КОНЕЦ КАК ВидДвижения,
	                      |	ВЫБОР
	                      |		КОГДА ДвиженияЗадолженность.Статус = &БезИсполнения
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК НеПлатеж,
	                      |	ВЫБОР
	                      |		КОГДА ДвиженияЗадолженность.Сумма > 0
	                      |			ТОГДА ДвиженияЗадолженность.Сумма
	                      |		ИНАЧЕ -ДвиженияЗадолженность.Сумма
	                      |	КОНЕЦ КАК Сумма,
	                      |	ВЫБОР
	                      |		КОГДА ДвиженияЗадолженность.Сумма > 0
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ФССП_ВидДвиженияЗадолженности.Начисление)
	                      |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ФССП_ВидДвиженияЗадолженности.Списание)
	                      |	КОНЕЦ КАК ВидДвиженияЗадолженности,
	                      |	ДвиженияЗадолженность.Предмет КАК Предмет
	                      |ИЗ
	                      |	ДвиженияЗадолженность КАК ДвиженияЗадолженность
	                      |ГДЕ
	                      |	ДвиженияЗадолженность.Сумма <> 0");
	
    Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("МоментДо", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Таблица", ТаблицаДвиженийИП); 
	Запрос.УстановитьПараметр("Предметы", ТаблицаСуммИПредметов);
	Запрос.УстановитьПараметр("БезИсполнения",Перечисления.ФССП_СтатусыИП.ОконченоБезИсполнения);
		
	ТаблицаДвиженийЗадолженность = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры 

процедура СтарыйОбработчик()
		//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	Таблица.ИП КАК ID,
	//                      |	Таблица.Сумма1 КАК Сумма1,
	//                      |	Таблица.Сумма2 КАК Сумма2,
	//                      |	Таблица.Сумма3 КАК Сумма3,
	//                      |	Таблица.Сумма4 КАК Сумма4,
	//                      |	Таблица.Сумма5 КАК Сумма5,
	//                      |	Таблица.СтатусИП КАК Статус
	//                      |ПОМЕСТИТЬ ТаблицаДвижений
	//                      |ИЗ
	//                      |	&Таблица КАК Таблица
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ТаблицаДвижений.ID КАК ID,
	//                      |	1 КАК Предмет,
	//                      |	ТаблицаДвижений.Сумма1 КАК Сумма,
	//                      |	ТаблицаДвижений.Статус КАК Статус
	//                      |ПОМЕСТИТЬ ТаблицаЗадолженность
	//                      |ИЗ
	//                      |	ТаблицаДвижений КАК ТаблицаДвижений
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	ТаблицаДвижений.ID,
	//                      |	2,
	//                      |	ТаблицаДвижений.Сумма2,
	//                      |	ТаблицаДвижений.Статус
	//                      |ИЗ
	//                      |	ТаблицаДвижений КАК ТаблицаДвижений
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	ТаблицаДвижений.ID,
	//                      |	3,
	//                      |	ТаблицаДвижений.Сумма3,
	//                      |	ТаблицаДвижений.Статус
	//                      |ИЗ
	//                      |	ТаблицаДвижений КАК ТаблицаДвижений
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	ТаблицаДвижений.ID,
	//                      |	4,
	//                      |	ТаблицаДвижений.Сумма4,
	//                      |	ТаблицаДвижений.Статус
	//                      |ИЗ
	//                      |	ТаблицаДвижений КАК ТаблицаДвижений
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	ТаблицаДвижений.ID,
	//                      |	5,
	//                      |	ТаблицаДвижений.Сумма5,
	//                      |	ТаблицаДвижений.Статус
	//                      |ИЗ
	//                      |	ТаблицаДвижений КАК ТаблицаДвижений
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ТаблицаЗадолженность.ID КАК ID,
	//                      |	ТаблицаЗадолженность.Предмет КАК Предмет,
	//                      |	ТаблицаЗадолженность.Сумма - ЕСТЬNULL(ЗадолженностьПоИПОстатки.СуммаОстаток, 0) КАК Сумма,
	//                      |	ТаблицаЗадолженность.Статус КАК Статус
	//                      |ПОМЕСТИТЬ ДвиженияЗадолженность
	//                      |ИЗ
	//                      |	ТаблицаЗадолженность КАК ТаблицаЗадолженность
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ФССП_ЗадолженностьПоИП.Остатки(&МоментДО, ) КАК ЗадолженностьПоИПОстатки
	//                      |		ПО ТаблицаЗадолженность.ID = ЗадолженностьПоИПОстатки.ID
	//                      |			И ТаблицаЗадолженность.Предмет = ЗадолженностьПоИПОстатки.Предмет
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	&Период КАК Период,
	//                      |	ВЫБОР
	//                      |		КОГДА ДвиженияЗадолженность.Сумма > 0
	//                      |			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//                      |		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//                      |	КОНЕЦ КАК ВидДвижения,
	//                      |	ВЫБОР
	//                      |		КОГДА ДвиженияЗадолженность.Статус = &БезИсполнения
	//                      |			ТОГДА ИСТИНА
	//                      |		ИНАЧЕ ЛОЖЬ
	//                      |	КОНЕЦ КАК НеПлатеж,
	//                      |	ДвиженияЗадолженность.ID КАК ID,
	//                      |	ДвиженияЗадолженность.Предмет КАК Предмет,
	//                      |	ВЫБОР
	//                      |		КОГДА ДвиженияЗадолженность.Сумма > 0
	//                      |			ТОГДА ДвиженияЗадолженность.Сумма
	//                      |		ИНАЧЕ -ДвиженияЗадолженность.Сумма
	//                      |	КОНЕЦ КАК Сумма
	//                      |ИЗ
	//                      |	ДвиженияЗадолженность КАК ДвиженияЗадолженность
	//                      |ГДЕ
	//                      |	ДвиженияЗадолженность.Сумма <> 0");
	
	// КОГДА ДвиженияЗадолженность.Статус = Значение(Перечисление.ФССП_СтатусыИП.ОконченоБезИсполнения)
	
	//Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	//Запрос.УстановитьПараметр("МоментДо", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	//Запрос.УстановитьПараметр("Автор", ЭтотОбъект.Автор);
	//Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	//Запрос.УстановитьПараметр("Таблица", ТаблицаДвиженийИП);
	//Запрос.УстановитьПараметр("БезИсполнения",Перечисления.ФССП_СтатусыИП.ОконченоБезИсполнения);

	Конецпроцедуры

