#Область ПрограммныйИнтерфейс

Функция УниверсальнаяДатаИзМилесекунд(Значение) Экспорт

	ДатаGMT0 = Неопределено;
	Если ТипЗнч(Значение) = Тип("Число") Тогда
	
		ДатаGMT0 = Дата(1970, 1, 1) + Значение;
	
	КонецЕсли;
	Если ТипЗнч(Значение) = Тип("Дата") Тогда
	
		ДатаGMT0 = УниверсальноеВремя(Значение);
	
	КонецЕсли;
	
	Возврат ДатаGMT0;

КонецФункции // ()

Процедура УстановитьДату(Сообщение, ДатаСообщения) Экспорт

	Сообщение["Дата"] = УниверсальноеВремя(ДатаСообщения);

КонецПроцедуры

#Область РаботаСИсторией

Функция ЕстьСообщения(История) Экспорт

	Если История["Количество"] = 0 Тогда
	
		Возврат Ложь;
	
	КонецЕсли;
	
	Если История["Позиция"] >= История["Количество"] Тогда
	
		Возврат Ложь;
	
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // ()

Функция СледующееСообщение(История) Экспорт

	Позиция = История["Позиция"];
	
	Сообщения = История["Сообщения"];
	
	Элемент = Сообщения[Позиция];
	
	История["Позиция"] = История["Позиция"] + 1;
	
	Возврат Элемент;

КонецФункции // ()

Процедура ДобавитьСообщение(История, Сообщение) Экспорт

	Сообщения = История["Сообщения"];
	Сообщения.Добавить(Сообщение);
	
	История["Количество"] = История["Количество"] + 1;

КонецПроцедуры

Процедура СброситьПозицию(История) Экспорт

	История["Позиция"] = 0;

КонецПроцедуры

#КонецОбласти

#Область РаботаСНаборомФайлов

Функция ЕстьФайлы(Набор) Экспорт

	Если Набор["Количество"] = 0 Тогда
	
		Возврат Ложь;
	
	КонецЕсли;
	
	Если Набор["Позиция"] >= Набор["Количество"] Тогда
	
		Возврат Ложь;
	
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // ()

Функция СледующийФайл(Набор) Экспорт

	Позиция = Набор["Позиция"];
	
	Файлы = Набор["Файлы"];
	
	Элемент = Файлы[Позиция];
	
	Набор["Позиция"] = Набор["Позиция"] + 1;
	
	Возврат Элемент;

КонецФункции // ()

Процедура ДобавитьФайл(Набор, ПрисланыйФайл) Экспорт

	Файлы = Набор["Файлы"];
	Файлы.Добавить(ПрисланыйФайл);
	
	Набор["Количество"] = Набор["Количество"] + 1;

КонецПроцедуры

Функция ПрисланныйФайл(Сообщение, ТипФайла) Экспорт

	Файл = НовыйПрисланыйФайл();
	Файл["ТипФайла"] = ТипФайла;
	
	

КонецФункции // ()

Процедура ДобавитьВНабор(Набор, Сообщение, ТипФайла) Экспорт

	Файл = ПрисланныйФайл(Сообщение, ТипФайла);
	
	ДобавитьФайл(Набор, Файл);

КонецПроцедуры

#КонецОбласти

#Область РаботаССообщениями



#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыеСведенияФайла() Экспорт

	Описание = Новый Структура;
	Описание.Вставить("Данные", Неопределено);
	Описание.Вставить("Имя", Неопределено);
	
	Возврат Описание;

КонецФункции // ()

Функция НовоеСообщение() Экспорт

	Описание = Новый Структура;
	Описание.Вставить("Отправитель", Неопределено);
	Описание.Вставить("Клиент", Неопределено);
	Описание.Вставить("Сотрудник", Неопределено);
	Описание.Вставить("Дата", Неопределено);
	Описание.Вставить("Текст", Неопределено);
	Описание.Вставить("Файл", Неопределено);
	Описание.Вставить("Изображение", Неопределено);
	Описание.Вставить("Видео", Неопределено);
	Описание.Вставить("Звук", Неопределено);
	Описание.Вставить("Мессенджер", Неопределено);
	Описание.Вставить("ОписаниеОтправителя", Неопределено);
	
	Возврат Описание;

КонецФункции // ()

Функция НоваяИстория() Экспорт

	Описание = Новый Структура;
	Описание.Вставить("Количество", 0);
	Описание.Вставить("Позиция", 0);
	Описание.Вставить("Сообщения", Новый Массив);
	
	Возврат Описание;

КонецФункции // ()

Функция НовыйПрисланыйФайл() Экспорт

	Описание = Новый Структура;
	Описание.Вставить("ТипФайла", Неопределено);
	Описание.Вставить("Размер", Неопределено);
	Описание.Вставить("Имя", Неопределено);
	Описание.Вставить("Данные", Неопределено);
	
	Возврат Описание;

КонецФункции // ()

Функция НовыйНаборФайлов() Экспорт

	Описание = Новый Структура;
	Описание.Вставить("Количество", 0);
	Описание.Вставить("Позиция", 0);
	Описание.Вставить("Файлы", Новый Массив);
	
	Возврат Описание;

КонецФункции // ()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти