////////////////////////////////////////////////////////////////////////////////
// Общиее функции для обработки заполнения форм, в том числе правила и 
//   ограничения заполнения полей.
//

#Область ТехническийИнтерфейс

// Добавление дополнительных реквизитов на форму
//
// Параметры:
//  ЭтаФорма  - Форма - Форма на которую выводятся реквизиты
//                 <продолжение описания параметра>
//
Процедура ДобавитьДополнительныеРеквизиты(ЭтаФорма) Экспорт

	Требуется = ВозможнаОбработка(ЭтаФорма);
	Если Не Требуется Тогда
	
		Возврат;
	
	КонецЕсли;
	
	УправлениеСвойствами.ДобавитьДополнительныеРеквизиты(ЭтаФорма);

КонецПроцедуры

// Получает ПредставлениеОбъекта, если представление не заполнено
//   возвращает синоним
//
// Параметры:
//  Объект  - Справочник, Документ - Ссылка или Объект
//
// Возвращаемое значение:
//   Строка   - 
//
Функция ПолучитьПредставлениеОбъекта(Объект) Экспорт

	МетаданныеОбъекта = Объект.Метаданные();

	Представление = МетаданныеОбъекта.ПредставлениеОбъекта;
	Если ЗначениеЗаполнено(Представление) Тогда
	
		Возврат Представление
	
	КонецЕсли;

	Возврат МетаданныеОбъекта.Синоним;

КонецФункции // ()


#КонецОбласти

Функция ВозможнаОбработка(ЭтаФорма)

	СоставПути = СтрРазделить(ЭтаФорма.ИмяФормы, ".", Истина);
	Если СоставПути.Количество() < 2 Тогда
	
		Возврат Ложь;
	
	КонецЕсли;
	ИмяМенеджера = СоставПути[1];
	Попытка
	
		Результат = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения["ДополнительныеРеквизиты_" + ИмяМенеджера];
	
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;

КонецФункции // ()



