
Процедура ДобавитьДополнительныеРеквизиты(ЭтаФорма) Экспорт

	Требуется = ВозможнаОбработка(ЭтаФорма);
	Если Не Требуется Тогда
	
		Возврат;
	
	КонецЕсли;
	
	УправлениеСвойствами.ДобавитьДополнительныеРеквизиты(ЭтаФорма);

КонецПроцедуры

Функция ВозможнаОбработка(ЭтаФорма)

	СоставПути = СтрРазделить(ЭтаФорма.ИмяФормы, ".", Истина);
	Если СоставПути.Количество() < 2 Тогда
	
		Возврат Ложь;
	
	КонецЕсли;
	ИмяМенеджера = СоставПути[1];
	Попытка
	
		Результат = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения["ДополнительныеРеквизиты_" + ИмяМенеджера];
	
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;

КонецФункции // ()
