
&НаКлиенте
Процедура Добавить(Команда)
	Массив = Элементы.Список.ВыделенныеСтроки;
	Для Каждого Эл Из Массив Цикл		
		Ссылка = Элементы.Список.ДанныеСтроки(Эл).Ссылка;
		НоваяЗапись = ЭтаФорма.СписокРассылки.Добавить();
		НоваяЗапись.ДО = Ссылка;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	Если Не ЭтаФорма.Шаблон.Пустая() Тогда
		Сч = 0;
		Пока Сч < ЭтаФорма.СписокРассылки.Количество() Цикл
			Стр = ЭтаФорма.СписокРассылки.Получить(Сч);
			Если Контроль230ФЗ(Стр.ДО) Тогда
				Сообщить("ДО " + Стр.ДО + " удалено — нарушение 230-ФЗ");
				ЭтаФорма.СписокРассылки.Удалить(Стр);
			Иначе
				Сч = Сч + 1;
			КонецЕсли;
		КонецЦикла;
		Шаблон = ЭтаФорма.Шаблон;
		ПараметрыФормы = Новый Структура("Ключ", Шаблон);
		Ном = 1;
		Для Каждого Стр Из СписокРассылки Цикл
			Состояние("Отправка СМС", Цел(Ном * 100 / (СписокРассылки.Количество() + 1)), "Пожалуйста, подождите...", БиблиотекаКартинок.NC_СМС);
			Ном = Ном + 1;
			// Заполнение и отправка
			ФормаОтправки = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОтправкаСМС");
			ФормаОтправки.МассоваяОтправка = Истина;
			ФормаОтправки.Отправитель = "DGFinance";
			ФормаОтправки.НомерПолучателя = ПолучитьНомерДолжника(Стр.ДО);
			ФормаОтправки.Договор = Стр.ДО;
			Если ФормаОтправки.НомерПолучателя <> Неопределено Тогда
				Стр.Номер = ФормаОтправки.НомерПолучателя;
				ФормаШаблона = ПолучитьФорму("Справочник.ШаблоныТекстаДляАвтоинформирования.Форма.ФормаЭлемента", ПараметрыФормы);
				ФормаШаблона.МассоваяОтправка = Истина;
				ФормаШаблона.НаПримереОбъект = Стр.ДО;
				ФормаШаблона.ЗаполнитьШаблон(Неопределено);
				ФормаОтправки.ТекстСМС = ФормаШаблона.ПримерТекста;
				Стр.Текст = ФормаОтправки.ТекстСМС;
				ФормаОтправки.Отправить(Неопределено);
				Стр.Отправлено = Истина;
				СоздатьМероприятиеОтправки(Стр.ДО, Стр.Номер, Стр.Текст);
			Иначе
				Стр.Отправлено = Ложь;
			КонецЕсли;
		КонецЦикла;
		Состояние("Отправка СМС", 100, "Пожалуйста, подождите...", БиблиотекаКартинок.NC_СМС);
	Иначе
		Предупреждение("Не выбран шаблон!",,"Отправка СМС");
	КонецЕсли;
КонецПроцедуры

Функция Контроль230ФЗ(ДО);
	// Проверка на нарушение 230-ФЗ
	Если КонтрольСобытий.КонтрольЧасовогоПояса(ДО.Должник) Или КонтрольСобытий.КонтрольСМС(ДО.Должник) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ПолучитьНомерДолжника(ДО);
	// Пробуем подобрать по совпадению должника и КЛ
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтрагентыТелефоны.Номер КАК Номер
	|ИЗ
	|	Справочник.Контрагенты.Телефоны КАК КонтрагентыТелефоны
	|ГДЕ
	|	ВРЕГ(КонтрагентыТелефоны.КонтактноеЛицо.Наименование) = &КонтактноеЛицо";	
	Запрос.УстановитьПараметр("КонтактноеЛицо", ВРег(ДО.Должник.Наименование));	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Номер;
	Иначе
		// Возвращаем первый номер с типом "Мобильный"
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтрагентыТелефоны.Номер КАК Номер
		|ИЗ
		|	Справочник.Контрагенты.Телефоны КАК КонтрагентыТелефоны
		|ГДЕ
		|	КонтрагентыТелефоны.ВидТелефона = &ВидТелефона
		|	И КонтрагентыТелефоны.Ссылка = &Ссылка";	
		Запрос.УстановитьПараметр("ВидТелефона", Справочники.ВидыТелефонов.Мобильный);
		Запрос.УстановитьПараметр("Ссылка", ДО.Должник);	
		РезультатЗапроса = Запрос.Выполнить();	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
			ВыборкаДетальныеЗаписи.Следующий();
			Возврат ВыборкаДетальныеЗаписи.Номер;
		Иначе
			// Ничего не возвращаем
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция СоздатьМероприятиеОтправки(ДО, Номер, Текст)
	// Создать мероприятие отправки
	НовоеМероприятие = Задачи.Мероприятие.СоздатьЗадачу();	
	НовоеМероприятие.Автор = ПараметрыСеанса.ТекущийПользователь;
	НовоеМероприятие.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	НовоеМероприятие.Дата = ТекущаяДата();
	НовоеМероприятие.ВремяСоздания = ТекущаяДата();
	НовоеМероприятие.ПланируемаяДата = ТекущаяДата();
	НовоеМероприятие.ДатаВыполнения = ТекущаяДата();
	НовоеМероприятие.ФактическаяДата = ТекущаяДата();
	НовоеМероприятие.ДлительностьРазговора = "0:00:00";
	НовоеМероприятие.Объект = ДО;
	НовоеМероприятие.Контакт = Номер;
	НовоеМероприятие.Комментарий = Текст;
	НовоеМероприятие.ТипМероприятия = Справочники.ТипыМероприятий.ОтправкаСМС;
	НовоеМероприятие.Результат = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Отправлено");
	НовоеМероприятие.Выполнена = Истина;
	НовоеМероприятие.Записать();
КонецФункции
