
Функция НайтиСчет(НомерСчета) Экспорт

	Возврат РезультатПоискаПоНомеру(НомерСчета);

КонецФункции // ()

Функция Создать(ДанныеСчета) Экспорт

	Счет = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(Счет, ДанныеСчета);
	
	Возврат Счет;

КонецФункции // ()


Функция РезультатПоискаПоНомеру(НомерСчета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Счета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Счета КАК Счета
		|ГДЕ
		|	Счета.Наименование = &Наименование
		|	И Счета.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", НомерСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
	
		Возврат ПустаяСсылка();
	
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить()[0].Ссылка;

КонецФункции // ()
