
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Получить непредопредленное значение с сервера
	ПодключитьАхантер(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Ахантер = "https://www.ahunter.ru/site/demo/address";  
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьАхантер(Команда)
	ПодключитьОбработчикОжидания("ВыполнитьЗапросАхантер", 3, Истина);  
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапросАхантер() 
	document = ЭтаФорма.Элементы.Ахантер.Документ;
	adress = document.querySelector("#js-AddressField");
	adress.value = ЭтаФорма.Адрес;
	searchbutton = document.querySelector(".u-ButtonGrey");
	searchbutton.click();
	ПодключитьОбработчикОжидания("ПолучитьРегион", 1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРегион()
	document = ЭтаФорма.Элементы.Ахантер.Документ;
	Попытка
		region = document.querySelector(".b-Table:nth-child(8) > .b-Row:nth-child(3) > .b-LPaddingStd").firstChild.nodeValue;
	Исключение
		Предупреждение("Не удалось определить регион должника! Выполнение запроса прервано",,"Адаптер ФССП");
		ЭтаФорма.Закрыть();
		Возврат;
	КонецПопытки;
	ЭтаФорма.Результат = Лев(region, 2);
	РезультатВКонстанту();
	ВыполнитьЗапрос();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура РезультатВКонстанту()
	Константы.АхантерРегион.Установить(ЭтаФорма.Результат);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗапрос()
ПреобразованнаяДата = СтрЗаменить(Формат(ЭтаФорма.ДатаРождения, "ДФ=yyyy-MM-dd"), " 0:00:00", "");
ЗапросыФССП.ПолучитьИП(ЭтаФорма.Должник, ПреобразованнаяДата, ЭтаФорма.Код);
КонецПроцедуры
