 
Процедура НастройкаИЗапускIVR() Экспорт
	 // Формирование списков IVR
	 
	 // IVR (дальние регионы)
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR ПЕР (дальние регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/McMurdo"", ""Antarctica/Casey"", ""AET"", ""Asia/Chita"", ""Asia/Brunei"", ""Antarctica/Davis"")
	|	И ДолговыеОбязательства.Кредитор.Код = ""F00000160""";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR ФМ (дальние регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/McMurdo"", ""Antarctica/Casey"", ""AET"", ""Asia/Chita"", ""Asia/Brunei"", ""Antarctica/Davis"")
	|	И ДолговыеОбязательства.Кредитор.Код = ""F00000236""";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR МК (дальние регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/McMurdo"", ""Antarctica/Casey"", ""AET"", ""Asia/Chita"", ""Asia/Brunei"", ""Antarctica/Davis"")
	|	И ДолговыеОбязательства.Кредитор.Код = ""F00062598""";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR ГК (дальние регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/McMurdo"", ""Antarctica/Casey"", ""AET"", ""Asia/Chita"", ""Asia/Brunei"", ""Antarctica/Davis"")
	|	И ДолговыеОбязательства.Кредитор.Код = ""F00114343""";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR цессия (дальние регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Автоответчик""
	|	И ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Цессия""
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/McMurdo"", ""Antarctica/Casey"", ""AET"", ""Asia/Chita"", ""Asia/Brunei"", ""Antarctica/Davis"")";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	// IVR (основные регионы)
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR ПЗ (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/Vostok"", ""Antarctica/Mawson"", ""Asia/Baku"", ""Antarctica/Syowa"", ""EET"")
	|	И (ДолговыеОбязательства.Кредитор.Код = ""F00000091""
	|			ИЛИ ДолговыеОбязательства.Кредитор.Код = ""F00114342"")";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR ПЕР (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/Vostok"", ""Antarctica/Mawson"", ""Asia/Baku"", ""Antarctica/Syowa"", ""EET"")
	|	И ДолговыеОбязательства.Кредитор.Код = ""F00000160""";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR ФМ (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/Vostok"", ""Antarctica/Mawson"", ""Asia/Baku"", ""Antarctica/Syowa"", ""EET"")
	|	И ДолговыеОбязательства.Кредитор.Код = ""F00000236""";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR КМ (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/Vostok"", ""Antarctica/Mawson"", ""Asia/Baku"", ""Antarctica/Syowa"", ""EET"")
	|	И ДолговыеОбязательства.Кредитор.Код = ""F00001401""";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR МК (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/Vostok"", ""Antarctica/Mawson"", ""Asia/Baku"", ""Antarctica/Syowa"", ""EET"")
	|	И ДолговыеОбязательства.Кредитор.Код = ""F00062598""";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR ГК (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/Vostok"", ""Antarctica/Mawson"", ""Asia/Baku"", ""Antarctica/Syowa"", ""EET"")
	|	И ДолговыеОбязательства.Кредитор.Код = ""F00114343""";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR цессия (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Автоответчик""
	|	И ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Цессия""
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/Vostok"", ""Antarctica/Mawson"", ""Asia/Baku"", ""Antarctica/Syowa"", ""EET"")";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	// Выбор списков
	ВыбратьСпискиДляIVR();
	// Запуск задач
	ЗапуститьЗадачиIVR();
КонецПроцедуры

Процедура ВыбратьСпискиДляIVR()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	autodialer.Ссылка КАК Ссылка,
	|	autodialer.name КАК name
	|ИЗ
	|	ВнешнийИсточникДанных.BITPBX.Таблица.autodialer КАК autodialer";
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		Маска = СтрЗаменить(Выборка.name, " - ", " (") + ")";
		phonelist_id = IDSQLПоМаске(Маска);
		Задача = Выборка.Ссылка.ПолучитьОбъект();
		Задача.phonelist_id = phonelist_id;
		Задача.Записать();
	КонецЦикла;
КонецПроцедуры

Функция IDSQLПоМаске(Маска)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокДляАвтообзвона.IDSQL КАК IDSQL
	|ИЗ
	|	Справочник.СписокДляАвтообзвона КАК СписокДляАвтообзвона
	|ГДЕ
	|	СписокДляАвтообзвона.Наименование ПОДОБНО &Наименование";
	Запрос.УстановитьПараметр("Наименование", "%" + Маска + "%");
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл	
		IDSQL = Выборка.IDSQL;
	КонецЦикла;
	Возврат IDSQL;
КонецФункции

Процедура ЗапуститьЗадачиIVR() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	autodialer.id КАК id,
	|	autodialer.active КАК active
	|ИЗ
	|	ВнешнийИсточникДанных.BITPBX.Таблица.autodialer КАК autodialer
	|ГДЕ
	|	autodialer.name ПОДОБНО &name";
	Запрос.УстановитьПараметр("name", "%" + "IVR" + "%");
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		Если Выборка.active = 0 Тогда
			// Если задача остановлена, то выполняет запуск
			ФоновыеЗаданияМодуль.ОстановитьЗадачу(Выборка.id);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
