 
Процедура НастройкаИЗапускIVR() Экспорт
	 // Формирование списков IVR
	 
	 // IVR (дальние регионы)
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR ПЕР (дальние регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК НомерСтроки,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10) КАК Строка,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.АнализируетсяБлокировщиком) КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Дано
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	|		ПО ДолговыеОбязательства.Ссылка = Мероприятие.Объект
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/McMurdo"", ""Antarctica/Casey"", ""AET"", ""Asia/Chita"", ""Asia/Brunei"", ""Antarctica/Davis"")
	|	И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|	И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|	И (ДолговыеОбязательства.Кредитор.Код = ""F00000160"")	
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10),
	|	Мероприятие.Результат.АнализируетсяБлокировщиком
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера И
	|	МАКСИМУМ(Мероприятие.Результат.АнализируетсяБлокировщиком) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК С,
	|	1 КАК П
	|ПОМЕСТИТЬ Р16
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1,
	|	10
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2,
	|	100
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3,
	|	1000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4,
	|	10000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5,
	|	100000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6,
	|	1000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7,
	|	10000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8,
	|	100000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9,
	|	1000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	10,
	|	10000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	11,
	|	100000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	12,
	|	1000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	13,
	|	10000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	14,
	|	100000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	15,
	|	1000000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	16,
	|	10000000000000000
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Дано.НомерСтроки КАК НомерСтроки,
	|	СУММА(А.П * Б.С * ВЫБОР
	|			КОГДА ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА 10
	|			ИНАЧЕ 1
	|		КОНЕЦ) / МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА А.П
	|			ИНАЧЕ 100000000000000000
	|		КОНЕЦ) КАК Ответ,
	|	Дано.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	Дано КАК Дано,
	|	Р16 КАК А,
	|	Р16 КАК Б
	|ГДЕ
	|	Б.С < 10
	|	И ПОДСТРОКА(Дано.Строка, 17 - А.С, 1) = ПОДСТРОКА(""0123456789"", Б.С + 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Дано.НомерСтроки,
	|	Дано.РезультатАнализируетсяБлокировщиком
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2600
	|	Результат.НомерСтроки КАК Ссылка,
	|	Результат.Ответ КАК Ответ,
	|	(ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 0))) - (ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 5))) КАК Поле1,
	|	Результат.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ИЗ
	|	Результат КАК Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Результат.НомерСтроки.ДатаСоздания УБЫВ";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR ФМ (дальние регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК НомерСтроки,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10) КАК Строка,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.АнализируетсяБлокировщиком) КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Дано
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	|		ПО ДолговыеОбязательства.Ссылка = Мероприятие.Объект
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/McMurdo"", ""Antarctica/Casey"", ""AET"", ""Asia/Chita"", ""Asia/Brunei"", ""Antarctica/Davis"")
	|	И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|	И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|	И (ДолговыеОбязательства.Кредитор.Код = ""F00000236"")	
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10),
	|	Мероприятие.Результат.АнализируетсяБлокировщиком
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера И
	|	МАКСИМУМ(Мероприятие.Результат.АнализируетсяБлокировщиком) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК С,
	|	1 КАК П
	|ПОМЕСТИТЬ Р16
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1,
	|	10
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2,
	|	100
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3,
	|	1000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4,
	|	10000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5,
	|	100000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6,
	|	1000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7,
	|	10000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8,
	|	100000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9,
	|	1000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	10,
	|	10000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	11,
	|	100000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	12,
	|	1000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	13,
	|	10000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	14,
	|	100000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	15,
	|	1000000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	16,
	|	10000000000000000
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Дано.НомерСтроки КАК НомерСтроки,
	|	СУММА(А.П * Б.С * ВЫБОР
	|			КОГДА ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА 10
	|			ИНАЧЕ 1
	|		КОНЕЦ) / МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА А.П
	|			ИНАЧЕ 100000000000000000
	|		КОНЕЦ) КАК Ответ,
	|	Дано.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	Дано КАК Дано,
	|	Р16 КАК А,
	|	Р16 КАК Б
	|ГДЕ
	|	Б.С < 10
	|	И ПОДСТРОКА(Дано.Строка, 17 - А.С, 1) = ПОДСТРОКА(""0123456789"", Б.С + 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Дано.НомерСтроки,
	|	Дано.РезультатАнализируетсяБлокировщиком
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2600
	|	Результат.НомерСтроки КАК Ссылка,
	|	Результат.Ответ КАК Ответ,
	|	(ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 0))) - (ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 5))) КАК Поле1,
	|	Результат.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ИЗ
	|	Результат КАК Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Результат.НомерСтроки.ДатаСоздания УБЫВ";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR МК (дальние регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК НомерСтроки,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10) КАК Строка,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.АнализируетсяБлокировщиком) КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Дано
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	|		ПО ДолговыеОбязательства.Ссылка = Мероприятие.Объект
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/McMurdo"", ""Antarctica/Casey"", ""AET"", ""Asia/Chita"", ""Asia/Brunei"", ""Antarctica/Davis"")
	|	И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|	И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|	И (ДолговыеОбязательства.Кредитор.Код = ""F00062598"")	
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10),
	|	Мероприятие.Результат.АнализируетсяБлокировщиком
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера И
	|	МАКСИМУМ(Мероприятие.Результат.АнализируетсяБлокировщиком) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК С,
	|	1 КАК П
	|ПОМЕСТИТЬ Р16
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1,
	|	10
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2,
	|	100
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3,
	|	1000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4,
	|	10000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5,
	|	100000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6,
	|	1000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7,
	|	10000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8,
	|	100000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9,
	|	1000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	10,
	|	10000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	11,
	|	100000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	12,
	|	1000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	13,
	|	10000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	14,
	|	100000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	15,
	|	1000000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	16,
	|	10000000000000000
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Дано.НомерСтроки КАК НомерСтроки,
	|	СУММА(А.П * Б.С * ВЫБОР
	|			КОГДА ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА 10
	|			ИНАЧЕ 1
	|		КОНЕЦ) / МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА А.П
	|			ИНАЧЕ 100000000000000000
	|		КОНЕЦ) КАК Ответ,
	|	Дано.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	Дано КАК Дано,
	|	Р16 КАК А,
	|	Р16 КАК Б
	|ГДЕ
	|	Б.С < 10
	|	И ПОДСТРОКА(Дано.Строка, 17 - А.С, 1) = ПОДСТРОКА(""0123456789"", Б.С + 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Дано.НомерСтроки,
	|	Дано.РезультатАнализируетсяБлокировщиком
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2600
	|	Результат.НомерСтроки КАК Ссылка,
	|	Результат.Ответ КАК Ответ,
	|	(ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 0))) - (ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 5))) КАК Поле1,
	|	Результат.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ИЗ
	|	Результат КАК Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Результат.НомерСтроки.ДатаСоздания УБЫВ";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR ГК (дальние регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК НомерСтроки,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10) КАК Строка,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.АнализируетсяБлокировщиком) КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Дано
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	|		ПО ДолговыеОбязательства.Ссылка = Мероприятие.Объект
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/McMurdo"", ""Antarctica/Casey"", ""AET"", ""Asia/Chita"", ""Asia/Brunei"", ""Antarctica/Davis"")
	|	И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|	И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|	И (ДолговыеОбязательства.Кредитор.Код = ""F00114343"")	
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10),
	|	Мероприятие.Результат.АнализируетсяБлокировщиком
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера И
	|	МАКСИМУМ(Мероприятие.Результат.АнализируетсяБлокировщиком) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК С,
	|	1 КАК П
	|ПОМЕСТИТЬ Р16
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1,
	|	10
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2,
	|	100
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3,
	|	1000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4,
	|	10000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5,
	|	100000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6,
	|	1000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7,
	|	10000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8,
	|	100000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9,
	|	1000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	10,
	|	10000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	11,
	|	100000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	12,
	|	1000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	13,
	|	10000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	14,
	|	100000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	15,
	|	1000000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	16,
	|	10000000000000000
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Дано.НомерСтроки КАК НомерСтроки,
	|	СУММА(А.П * Б.С * ВЫБОР
	|			КОГДА ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА 10
	|			ИНАЧЕ 1
	|		КОНЕЦ) / МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА А.П
	|			ИНАЧЕ 100000000000000000
	|		КОНЕЦ) КАК Ответ,
	|	Дано.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	Дано КАК Дано,
	|	Р16 КАК А,
	|	Р16 КАК Б
	|ГДЕ
	|	Б.С < 10
	|	И ПОДСТРОКА(Дано.Строка, 17 - А.С, 1) = ПОДСТРОКА(""0123456789"", Б.С + 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Дано.НомерСтроки,
	|	Дано.РезультатАнализируетсяБлокировщиком
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2600
	|	Результат.НомерСтроки КАК Ссылка,
	|	Результат.Ответ КАК Ответ,
	|	(ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 0))) - (ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 5))) КАК Поле1,
	|	Результат.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ИЗ
	|	Результат КАК Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Результат.НомерСтроки.ДатаСоздания УБЫВ";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR цессия (дальние регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК НомерСтроки,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10) КАК Строка,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.АнализируетсяБлокировщиком) КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Дано
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	|		ПО ДолговыеОбязательства.Ссылка = Мероприятие.Объект
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Автоответчик""
	|	И ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Цессия""
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/McMurdo"", ""Antarctica/Casey"", ""AET"", ""Asia/Chita"", ""Asia/Brunei"", ""Antarctica/Davis"")
	|	И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|	И Мероприятие.Ссылка ЕСТЬ НЕ NULL	
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10),
	|	Мероприятие.Результат.АнализируетсяБлокировщиком
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера И
	|	МАКСИМУМ(Мероприятие.Результат.АнализируетсяБлокировщиком) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК С,
	|	1 КАК П
	|ПОМЕСТИТЬ Р16
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1,
	|	10
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2,
	|	100
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3,
	|	1000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4,
	|	10000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5,
	|	100000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6,
	|	1000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7,
	|	10000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8,
	|	100000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9,
	|	1000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	10,
	|	10000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	11,
	|	100000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	12,
	|	1000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	13,
	|	10000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	14,
	|	100000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	15,
	|	1000000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	16,
	|	10000000000000000
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Дано.НомерСтроки КАК НомерСтроки,
	|	СУММА(А.П * Б.С * ВЫБОР
	|			КОГДА ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА 10
	|			ИНАЧЕ 1
	|		КОНЕЦ) / МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА А.П
	|			ИНАЧЕ 100000000000000000
	|		КОНЕЦ) КАК Ответ,
	|	Дано.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	Дано КАК Дано,
	|	Р16 КАК А,
	|	Р16 КАК Б
	|ГДЕ
	|	Б.С < 10
	|	И ПОДСТРОКА(Дано.Строка, 17 - А.С, 1) = ПОДСТРОКА(""0123456789"", Б.С + 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Дано.НомерСтроки,
	|	Дано.РезультатАнализируетсяБлокировщиком
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2600
	|	Результат.НомерСтроки КАК Ссылка,
	|	Результат.Ответ КАК Ответ,
	|	(ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 0))) - (ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 5))) КАК Поле1,
	|	Результат.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ИЗ
	|	Результат КАК Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Результат.НомерСтроки.ДатаСоздания УБЫВ";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	// IVR (основные регионы)
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR ПЗ (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК НомерСтроки,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10) КАК Строка,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.АнализируетсяБлокировщиком) КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Дано
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	|		ПО ДолговыеОбязательства.Ссылка = Мероприятие.Объект
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/Vostok"", ""Antarctica/Mawson"", ""Asia/Baku"", ""Antarctica/Syowa"", ""EET"")
	|	И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|	И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|	И (ДолговыеОбязательства.Кредитор.Код = ""F00000091""
	|	ИЛИ ДолговыеОбязательства.Кредитор.Код = ""F00114342"")	
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10),
	|	Мероприятие.Результат.АнализируетсяБлокировщиком
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера И
	|	МАКСИМУМ(Мероприятие.Результат.АнализируетсяБлокировщиком) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК С,
	|	1 КАК П
	|ПОМЕСТИТЬ Р16
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1,
	|	10
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2,
	|	100
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3,
	|	1000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4,
	|	10000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5,
	|	100000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6,
	|	1000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7,
	|	10000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8,
	|	100000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9,
	|	1000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	10,
	|	10000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	11,
	|	100000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	12,
	|	1000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	13,
	|	10000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	14,
	|	100000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	15,
	|	1000000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	16,
	|	10000000000000000
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Дано.НомерСтроки КАК НомерСтроки,
	|	СУММА(А.П * Б.С * ВЫБОР
	|			КОГДА ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА 10
	|			ИНАЧЕ 1
	|		КОНЕЦ) / МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА А.П
	|			ИНАЧЕ 100000000000000000
	|		КОНЕЦ) КАК Ответ,
	|	Дано.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	Дано КАК Дано,
	|	Р16 КАК А,
	|	Р16 КАК Б
	|ГДЕ
	|	Б.С < 10
	|	И ПОДСТРОКА(Дано.Строка, 17 - А.С, 1) = ПОДСТРОКА(""0123456789"", Б.С + 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Дано.НомерСтроки,
	|	Дано.РезультатАнализируетсяБлокировщиком
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2600
	|	Результат.НомерСтроки КАК Ссылка,
	|	Результат.Ответ КАК Ответ,
	|	(ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 0))) - (ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 5))) КАК Поле1,
	|	Результат.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ИЗ
	|	Результат КАК Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Результат.НомерСтроки.ДатаСоздания УБЫВ";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR ПЕР (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК НомерСтроки,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10) КАК Строка,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.АнализируетсяБлокировщиком) КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Дано
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	|		ПО ДолговыеОбязательства.Ссылка = Мероприятие.Объект
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/Vostok"", ""Antarctica/Mawson"", ""Asia/Baku"", ""Antarctica/Syowa"", ""EET"")
	|	И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|	И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|	И (ДолговыеОбязательства.Кредитор.Код = ""F00000160"")	
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10),
	|	Мероприятие.Результат.АнализируетсяБлокировщиком
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера И
	|	МАКСИМУМ(Мероприятие.Результат.АнализируетсяБлокировщиком) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК С,
	|	1 КАК П
	|ПОМЕСТИТЬ Р16
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1,
	|	10
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2,
	|	100
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3,
	|	1000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4,
	|	10000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5,
	|	100000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6,
	|	1000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7,
	|	10000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8,
	|	100000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9,
	|	1000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	10,
	|	10000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	11,
	|	100000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	12,
	|	1000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	13,
	|	10000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	14,
	|	100000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	15,
	|	1000000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	16,
	|	10000000000000000
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Дано.НомерСтроки КАК НомерСтроки,
	|	СУММА(А.П * Б.С * ВЫБОР
	|			КОГДА ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА 10
	|			ИНАЧЕ 1
	|		КОНЕЦ) / МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА А.П
	|			ИНАЧЕ 100000000000000000
	|		КОНЕЦ) КАК Ответ,
	|	Дано.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	Дано КАК Дано,
	|	Р16 КАК А,
	|	Р16 КАК Б
	|ГДЕ
	|	Б.С < 10
	|	И ПОДСТРОКА(Дано.Строка, 17 - А.С, 1) = ПОДСТРОКА(""0123456789"", Б.С + 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Дано.НомерСтроки,
	|	Дано.РезультатАнализируетсяБлокировщиком
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2600
	|	Результат.НомерСтроки КАК Ссылка,
	|	Результат.Ответ КАК Ответ,
	|	(ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 0))) - (ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 5))) КАК Поле1,
	|	Результат.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ИЗ
	|	Результат КАК Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Результат.НомерСтроки.ДатаСоздания УБЫВ";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR ФМ (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК НомерСтроки,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10) КАК Строка,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.АнализируетсяБлокировщиком) КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Дано
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	|		ПО ДолговыеОбязательства.Ссылка = Мероприятие.Объект
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/Vostok"", ""Antarctica/Mawson"", ""Asia/Baku"", ""Antarctica/Syowa"", ""EET"")
	|	И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|	И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|	И (ДолговыеОбязательства.Кредитор.Код = ""F00000236"")	
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10),
	|	Мероприятие.Результат.АнализируетсяБлокировщиком
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера И
	|	МАКСИМУМ(Мероприятие.Результат.АнализируетсяБлокировщиком) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК С,
	|	1 КАК П
	|ПОМЕСТИТЬ Р16
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1,
	|	10
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2,
	|	100
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3,
	|	1000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4,
	|	10000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5,
	|	100000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6,
	|	1000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7,
	|	10000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8,
	|	100000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9,
	|	1000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	10,
	|	10000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	11,
	|	100000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	12,
	|	1000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	13,
	|	10000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	14,
	|	100000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	15,
	|	1000000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	16,
	|	10000000000000000
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Дано.НомерСтроки КАК НомерСтроки,
	|	СУММА(А.П * Б.С * ВЫБОР
	|			КОГДА ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА 10
	|			ИНАЧЕ 1
	|		КОНЕЦ) / МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА А.П
	|			ИНАЧЕ 100000000000000000
	|		КОНЕЦ) КАК Ответ,
	|	Дано.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	Дано КАК Дано,
	|	Р16 КАК А,
	|	Р16 КАК Б
	|ГДЕ
	|	Б.С < 10
	|	И ПОДСТРОКА(Дано.Строка, 17 - А.С, 1) = ПОДСТРОКА(""0123456789"", Б.С + 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Дано.НомерСтроки,
	|	Дано.РезультатАнализируетсяБлокировщиком
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2600
	|	Результат.НомерСтроки КАК Ссылка,
	|	Результат.Ответ КАК Ответ,
	|	(ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 0))) - (ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 5))) КАК Поле1,
	|	Результат.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ИЗ
	|	Результат КАК Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Результат.НомерСтроки.ДатаСоздания УБЫВ";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR КМ (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК НомерСтроки,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10) КАК Строка,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.АнализируетсяБлокировщиком) КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Дано
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	|		ПО ДолговыеОбязательства.Ссылка = Мероприятие.Объект
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/Vostok"", ""Antarctica/Mawson"", ""Asia/Baku"", ""Antarctica/Syowa"", ""EET"")
	|	И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|	И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|	И (ДолговыеОбязательства.Кредитор.Код = ""F00001401"")	
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10),
	|	Мероприятие.Результат.АнализируетсяБлокировщиком
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера И
	|	МАКСИМУМ(Мероприятие.Результат.АнализируетсяБлокировщиком) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК С,
	|	1 КАК П
	|ПОМЕСТИТЬ Р16
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1,
	|	10
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2,
	|	100
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3,
	|	1000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4,
	|	10000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5,
	|	100000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6,
	|	1000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7,
	|	10000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8,
	|	100000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9,
	|	1000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	10,
	|	10000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	11,
	|	100000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	12,
	|	1000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	13,
	|	10000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	14,
	|	100000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	15,
	|	1000000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	16,
	|	10000000000000000
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Дано.НомерСтроки КАК НомерСтроки,
	|	СУММА(А.П * Б.С * ВЫБОР
	|			КОГДА ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА 10
	|			ИНАЧЕ 1
	|		КОНЕЦ) / МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА А.П
	|			ИНАЧЕ 100000000000000000
	|		КОНЕЦ) КАК Ответ,
	|	Дано.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	Дано КАК Дано,
	|	Р16 КАК А,
	|	Р16 КАК Б
	|ГДЕ
	|	Б.С < 10
	|	И ПОДСТРОКА(Дано.Строка, 17 - А.С, 1) = ПОДСТРОКА(""0123456789"", Б.С + 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Дано.НомерСтроки,
	|	Дано.РезультатАнализируетсяБлокировщиком
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2600
	|	Результат.НомерСтроки КАК Ссылка,
	|	Результат.Ответ КАК Ответ,
	|	(ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 0))) - (ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 5))) КАК Поле1,
	|	Результат.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ИЗ
	|	Результат КАК Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Результат.НомерСтроки.ДатаСоздания УБЫВ";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR МК (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК НомерСтроки,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10) КАК Строка,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.АнализируетсяБлокировщиком) КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Дано
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	|		ПО ДолговыеОбязательства.Ссылка = Мероприятие.Объект
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/Vostok"", ""Antarctica/Mawson"", ""Asia/Baku"", ""Antarctica/Syowa"", ""EET"")
	|	И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|	И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|	И (ДолговыеОбязательства.Кредитор.Код = ""F00062598"")	
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10),
	|	Мероприятие.Результат.АнализируетсяБлокировщиком
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера И
	|	МАКСИМУМ(Мероприятие.Результат.АнализируетсяБлокировщиком) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК С,
	|	1 КАК П
	|ПОМЕСТИТЬ Р16
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1,
	|	10
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2,
	|	100
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3,
	|	1000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4,
	|	10000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5,
	|	100000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6,
	|	1000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7,
	|	10000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8,
	|	100000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9,
	|	1000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	10,
	|	10000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	11,
	|	100000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	12,
	|	1000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	13,
	|	10000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	14,
	|	100000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	15,
	|	1000000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	16,
	|	10000000000000000
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Дано.НомерСтроки КАК НомерСтроки,
	|	СУММА(А.П * Б.С * ВЫБОР
	|			КОГДА ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА 10
	|			ИНАЧЕ 1
	|		КОНЕЦ) / МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА А.П
	|			ИНАЧЕ 100000000000000000
	|		КОНЕЦ) КАК Ответ,
	|	Дано.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	Дано КАК Дано,
	|	Р16 КАК А,
	|	Р16 КАК Б
	|ГДЕ
	|	Б.С < 10
	|	И ПОДСТРОКА(Дано.Строка, 17 - А.С, 1) = ПОДСТРОКА(""0123456789"", Б.С + 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Дано.НомерСтроки,
	|	Дано.РезультатАнализируетсяБлокировщиком
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2600
	|	Результат.НомерСтроки КАК Ссылка,
	|	Результат.Ответ КАК Ответ,
	|	(ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 0))) - (ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 5))) КАК Поле1,
	|	Результат.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ИЗ
	|	Результат КАК Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Результат.НомерСтроки.ДатаСоздания УБЫВ";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR ГК (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК НомерСтроки,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10) КАК Строка,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.АнализируетсяБлокировщиком) КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Дано
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	|		ПО ДолговыеОбязательства.Ссылка = Мероприятие.Объект
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование В (""Автоответчик"")
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/Vostok"", ""Antarctica/Mawson"", ""Asia/Baku"", ""Antarctica/Syowa"", ""EET"")
	|	И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|	И Мероприятие.Ссылка ЕСТЬ НЕ NULL 
	|	И (ДолговыеОбязательства.Кредитор.Код = ""F00114343"")	
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10),
	|	Мероприятие.Результат.АнализируетсяБлокировщиком
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера И
	|	МАКСИМУМ(Мероприятие.Результат.АнализируетсяБлокировщиком) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК С,
	|	1 КАК П
	|ПОМЕСТИТЬ Р16
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1,
	|	10
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2,
	|	100
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3,
	|	1000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4,
	|	10000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5,
	|	100000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6,
	|	1000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7,
	|	10000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8,
	|	100000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9,
	|	1000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	10,
	|	10000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	11,
	|	100000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	12,
	|	1000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	13,
	|	10000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	14,
	|	100000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	15,
	|	1000000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	16,
	|	10000000000000000
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Дано.НомерСтроки КАК НомерСтроки,
	|	СУММА(А.П * Б.С * ВЫБОР
	|			КОГДА ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА 10
	|			ИНАЧЕ 1
	|		КОНЕЦ) / МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА А.П
	|			ИНАЧЕ 100000000000000000
	|		КОНЕЦ) КАК Ответ,
	|	Дано.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	Дано КАК Дано,
	|	Р16 КАК А,
	|	Р16 КАК Б
	|ГДЕ
	|	Б.С < 10
	|	И ПОДСТРОКА(Дано.Строка, 17 - А.С, 1) = ПОДСТРОКА(""0123456789"", Б.С + 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Дано.НомерСтроки,
	|	Дано.РезультатАнализируетсяБлокировщиком
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2600
	|	Результат.НомерСтроки КАК Ссылка,
	|	Результат.Ответ КАК Ответ,
	|	(ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 0))) - (ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 5))) КАК Поле1,
	|	Результат.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ИЗ
	|	Результат КАК Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Результат.НомерСтроки.ДатаСоздания УБЫВ";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	СписокАвтообзвона = Справочники.СписокДляАвтообзвона.СоздатьЭлемент();
	СписокАвтообзвона.Наименование = "IVR цессия (основные регионы) " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	// Установить параметры в отдельной процедуре
	ФоновыеЗаданияМодуль.ФормированиеСписковАвтообзвонаПараметры(Запрос);
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК НомерСтроки,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10) КАК Строка,
	|	КОЛИЧЕСТВО(Мероприятие.Результат.АнализируетсяБлокировщиком) КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Дано
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	|		ПО ДолговыеОбязательства.Ссылка = Мероприятие.Объект
	|ГДЕ
	|	ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование =""Автоответчик""
	|	И ДолговыеОбязательства.ДополнительныеРеквизиты.Значение.Наименование = ""Цессия""
	|	И ДолговыеОбязательства.Должник.ЧасовойПояс В (""Antarctica/Vostok"", ""Antarctica/Mawson"", ""Asia/Baku"", ""Antarctica/Syowa"", ""EET"")
	|	И ДолговыеОбязательства.ЗапретАвтообзвона = ЛОЖЬ
	|	И Мероприятие.Ссылка ЕСТЬ НЕ NULL	
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолговыеОбязательства.Ссылка,
	|	ПОДСТРОКА(ДолговыеОбязательства.Код, 0, 10),
	|	Мероприятие.Результат.АнализируетсяБлокировщиком
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Мероприятие.Дата) < &Вчера И
	|	МАКСИМУМ(Мероприятие.Результат.АнализируетсяБлокировщиком) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК С,
	|	1 КАК П
	|ПОМЕСТИТЬ Р16
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1,
	|	10
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2,
	|	100
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3,
	|	1000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4,
	|	10000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5,
	|	100000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6,
	|	1000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7,
	|	10000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8,
	|	100000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9,
	|	1000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	10,
	|	10000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	11,
	|	100000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	12,
	|	1000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	13,
	|	10000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	14,
	|	100000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	15,
	|	1000000000000000
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	16,
	|	10000000000000000
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Дано.НомерСтроки КАК НомерСтроки,
	|	СУММА(А.П * Б.С * ВЫБОР
	|			КОГДА ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА 10
	|			ИНАЧЕ 1
	|		КОНЕЦ) / МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
	|				ТОГДА А.П
	|			ИНАЧЕ 100000000000000000
	|		КОНЕЦ) КАК Ответ,
	|	Дано.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	Дано КАК Дано,
	|	Р16 КАК А,
	|	Р16 КАК Б
	|ГДЕ
	|	Б.С < 10
	|	И ПОДСТРОКА(Дано.Строка, 17 - А.С, 1) = ПОДСТРОКА(""0123456789"", Б.С + 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Дано.НомерСтроки,
	|	Дано.РезультатАнализируетсяБлокировщиком
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2600
	|	Результат.НомерСтроки КАК Ссылка,
	|	Результат.Ответ КАК Ответ,
	|	(ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 0))) - (ВЫРАЗИТЬ(Результат.Ответ / &РандомайзерСлужебный КАК ЧИСЛО(10, 5))) КАК Поле1,
	|	Результат.РезультатАнализируетсяБлокировщиком КАК РезультатАнализируетсяБлокировщиком
	|ИЗ
	|	Результат КАК Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Результат.НомерСтроки.ДатаСоздания УБЫВ";
	
	ФоновыеЗаданияМодуль.ВыгрузкаВСписокАвтообзвона(Запрос, СписокАвтообзвона);
	
	// Выбор списков
	ВыбратьСпискиДляIVR();
	// Запуск задач
	ЗапуститьЗадачиIVR();
КонецПроцедуры

Процедура ВыбратьСпискиДляIVR()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	autodialer.Ссылка КАК Ссылка,
	|	autodialer.name КАК name
	|ИЗ
	|	ВнешнийИсточникДанных.BITPBX.Таблица.autodialer КАК autodialer";
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		Маска = СтрЗаменить(Выборка.name, " - ", " (") + ")";
		phonelist_id = IDSQLПоМаске(Маска);
		Задача = Выборка.Ссылка.ПолучитьОбъект();
		Задача.phonelist_id = phonelist_id;
		Задача.Записать();
	КонецЦикла;
КонецПроцедуры

Функция IDSQLПоМаске(Маска)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокДляАвтообзвона.IDSQL КАК IDSQL
	|ИЗ
	|	Справочник.СписокДляАвтообзвона КАК СписокДляАвтообзвона
	|ГДЕ
	|	СписокДляАвтообзвона.Наименование ПОДОБНО &Наименование";
	Запрос.УстановитьПараметр("Наименование", "%" + Маска + "%");
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл	
		IDSQL = Выборка.IDSQL;
	КонецЦикла;
	Возврат IDSQL;
КонецФункции

Процедура ЗапуститьЗадачиIVR() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	autodialer.id КАК id,
	|	autodialer.active КАК active
	|ИЗ
	|	ВнешнийИсточникДанных.BITPBX.Таблица.autodialer КАК autodialer
	|ГДЕ
	|	autodialer.name ПОДОБНО &name";
	Запрос.УстановитьПараметр("name", "%" + "IVR" + "%");
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		Если Выборка.active = 0 Тогда
			// Если задача остановлена, то выполняет запуск
			ФоновыеЗаданияМодуль.ОстановитьЗадачу(Выборка.id);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
