

&НаСервере
Процедура РассчитатьГрафикНаСервере()
	Объект.РезультатДниПросрочки = 0;
	Объект.РезультатОсновнойДолг = 0;
	Объект.РезультатПроценты = 0;
	Объект.РезультатПросроченныеПроценты = 0;
	Объект.РезультатШтрафы = 0;
	Объект.РезультатПени = 0;
	Объект.РезультатКУплате = 0;
		
	ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
	ЗначениеОбъект.ЗагрузитьГрафикНачислений();
	ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
	
	к = Объект.ГрафикНачисленияИПогашения.Количество();
	Если к > 0 Тогда
		стр = Объект.ГрафикНачисленияИПогашения[к-1];
		Объект.РезультатДниПросрочки = стр.ДниПросрочки;
		Объект.РезультатКУплате = стр.КУплате;
		Объект.РезультатОсновнойДолг = стр.ОстаткиОсновнойДолг;
		Объект.РезультатПроценты = стр.ОстаткиПроценты;
		Объект.РезультатПросроченныеПроценты = стр.ОстаткиПросроченныеПроценты;
		Объект.РезультатШтрафы = стр.ОстаткиШтрафы;
		Объект.РезультатПени = стр.ОстаткиПени;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьГрафик(Команда)
	РассчитатьГрафикНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДатаВыдачиЗайма = ТекущаяДатаСеанса();
	Объект.ДатаДоговора = ТекущаяДатаСеанса();
	Объект.ДатаПогашения = ТекущаяДатаСеанса() + 10 * 24 * 3600;
	Объект.ДатаРасчета = ТекущаяДатаСеанса() + 20 * 24 * 3600;
	Объект.СуммаВыданногоЗайма = 10000;
	Объект.ПроцентнаяСтавка = 1;
	//Сообщить("Тест");
	УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	Элементы.СпособПогашения.ТолькоПросмотр = (Объект.ВидПлатежа = Перечисления.ВидыПлатежей.Аннуитетный) ИЛИ (Объект.ВидПлатежа = Перечисления.ВидыПлатежей.Индивидуальный);	
	Элементы.ВидПроцентнойСтавки.ТолькоПросмотр = Истина;
	Элементы.ДатаПогашенияЗадолженности.ТолькоПросмотр = Истина;
	Элементы.ПериодичностьСрокаЗайма.ТолькоПросмотр = (Объект.ВидПлатежа = Перечисления.ВидыПлатежей.Индивидуальный);	
КонецПроцедуры

&НаСервере
Процедура ЗаймПриИзмененииНаСервере()
	ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
	ЗначениеОбъект.ЗаполнитьДанные();
	ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ЗаймПриИзменении(Элемент)
	ЗаймПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстатки(ДО)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгДООстаток КАК ОсновнойДолгДООстаток,
	               |	ЗадолженностьПоОбъектамОстатки.ПроцентыДООстаток КАК ПроцентыДООстаток,
	               |	ЗадолженностьПоОбъектамОстатки.ШтрафыДООстаток КАК ШтрафыДООстаток
	               |ИЗ
	               |	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(, (ВЫРАЗИТЬ(Объект КАК Справочник.ДолговыеОбязательства)) = &Объект) КАК ЗадолженностьПоОбъектамОстатки";
	Запрос.УстановитьПараметр("Объект", ДО);
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Объект.ОстаткиОД = Рез.ОсновнойДолгДООстаток;
		Объект.ОстаткиПросроченныеПроценты = Рез.ШтрафыДООстаток;
		Объект.ОстаткиПроценты = Рез.ПроцентыДООстаток;
	КонецЦикла;	
	
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()  
	Если НЕ ЗначениеЗаполнено(Объект.ДатаРасчета) Тогда 
		Объект.ДатаРасчета = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	Объект.ТекущийДоговор = РасчетЗадолженностиМФО.ПолучитьТекущийДоговор(Объект.Займ, НачалоДня(ТекущаяДатаСеанса()));
	Список = РасчетЗадолженностиМФО.СписокРеквизитовДоговорМикрозайма();
	Для Каждого Реквизит Из Список Цикл
		Попытка
			Объект[Реквизит] = Объект.ТекущийДоговор[Реквизит];
		Исключение
			
		КонецПопытки;
	КонецЦикла;
	Если Объект.ТекущийДоговор <> Неопределено Тогда 
		Объект.ИсторияПлатежей.Загрузить(РасчетЗадолженностиМФО.ПолучитьИсториюПлатежей(Объект.ТекущийДоговор));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Попытка
		ЭтаФорма.ВладелецФормы.Объект.РасчетИсковыхТребований = Объект.Ссылка;
		ЭтаФорма.ВладелецФормы.Объект.ИскОсновнойДолг = Объект.РезультатОсновнойДолг;
		ЭтаФорма.ВладелецФормы.Объект.ИскПроценты = Объект.РезультатПросроченныеПроценты + Объект.РезультатПроценты;
		ЭтаФорма.ВладелецФормы.Объект.ИскШтрафы = Объект.РезультатШтрафы;
		ЭтаФорма.ВладелецФормы.Объект.ИскПени = Объект.РезультатПени;
		ЭтаФорма.ВладелецФормы.Объект.ЦенаИска = Объект.РезультатКУплате;
	Исключение
		
	КонецПопытки;
КонецПроцедуры


