////////////////////////////////////////////////////////////////////////////////
// Регламентные задания (Контур.Фокус)
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура ВыполнитьЗадание(
	Знач Параметр1 = Неопределено, 
	Знач Параметр2 = Неопределено, 
	Знач Параметр3 = Неопределено, 
	Знач Параметр4 = Неопределено,
	Знач Параметр5 = Неопределено,
	Знач Параметр6 = Неопределено, 
	Знач Параметр7 = Неопределено,
	Знач Параметр8 = Неопределено,
	Знач Параметр9 = Неопределено,
	Знач Параметр10 = Неопределено) Экспорт
	
	Попытка
		
		локМодульФокус = Фокус_ПовторыйВызов.МодульФокус();
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
			"КонтурФокус.ВыполнитьЗадание",
			УровеньЖурналаРегистрации.Ошибка,,,
			"Не удалось инициализировать в фоне модуль Контур.Фокус: "+ОписаниеОшибки());
			
		локМодульФокус = Неопределено;
		
		Возврат;
		
	КонецПопытки;
	
	Попытка
		
		локМодульФокус.РегламентныеЗаданияВыполнитьЗадание(
		Параметр1, Параметр2, Параметр3, 
		Параметр4, Параметр5, Параметр6, 
		Параметр7, Параметр8, Параметр9, 
		Параметр10);
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
			"КонтурФокус.ВыполнитьЗадание",
			УровеньЖурналаРегистрации.Ошибка,,,
			ОписаниеОшибки());
			
	КонецПопытки;	
	
	локМодульФокус.ФинализироватьПодключаемыеМодули();
	локМодульФокус = Неопределено;
	
КонецПроцедуры

Процедура КонтурФокус_ВыполнитьПроверкуДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт 

	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НадоВыполнятьПроверкуДокументовПередЗаписью() Тогда
		
		Попытка
			
			локМодульФокус = Фокус_ПовторыйВызов.МодульФокус();
			
		Исключение
			
			ЗаписьЖурналаРегистрации("КонтурФокус.ВыполнитьЗадание",
										УровеньЖурналаРегистрации.Ошибка,,,
										"Не удалось инициализировать в фоне модуль Контур.Фокус: " + ОписаниеОшибки());
			локМодульФокус = Неопределено;
			
			Возврат;
			
		КонецПопытки;
		
		локМодульФокус.Фокус_ПроверкаДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);
		
	КонецЕсли;
	
КонецПроцедуры

Функция НадоВыполнятьПроверкуДокументовПередЗаписью()
	
	Результат = Ложь;
	
	Если ПравоДоступа("Чтение", Метаданные.Константы.КонтурФокус_ИспользоватьПроверкуДокументовПередЗаписью)
			И Константы.КонтурФокус_ИспользоватьПроверкуДокументовПередЗаписью.Получить()
			И РольДоступна("Фокус_Пользователь") Тогда
			
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
