
&НаКлиенте
Процедура Команда_Сформировать(Команда)
	 Сформировать_НаСервере();
КонецПроцедуры

&НАСервере
Процедура Сформировать_НаСервере()
	
	Результат.Очистить();
	От = РеквизитФормыВЗначение("Отчет");
	От.СкомпоноватьРезультат(Результат);
	
	СгруппироватьПоДате();
	Результат.Показать();
	
КонецПроцедуры

&НаСервере
Процедура СгруппироватьПоДате()
	
	//ТД = Результат;
	//
	//ИменованнаяОбласть = ТабДок.Область("Шапка");
	//Ячейка = ТабДок.Область("R2C5");
	//ПрямоугольнаяОбластьЯчеек = ТабДок.Область("R2C2:R3C5");
	//ОбластьСтрока = ТабДок.Область("R2");
	//ОбластьСтрок = ТабДок.Область("R2:R4");
	//ОбластьКолонка = ТабДок.Область("C4");
	//ОбластьКолонок = ТабДок.Область("C4:C5");
	
	//Ячейка = Результат.НайтиЗначение("30.05.2013");
	//Ячейка = Результат.НайтиЗначение(Результат.Область("R1C2").Текст)
	//Результат.Область("R1C1").Текст	
	//ААА = НайтиЗначение(<Значение>, <Начало>, <Где>, <ИскатьПоСтрокам>, <ИскатьВперед>) 
	
	// Ищем начало шапки отчета
	
	Кол_Начало = 2;
	Кол_Конец = 2;
	Счетчик = 2;
	
	Ячейка_Дата = Результат.Область("R1C" + Строка(Счетчик)).Текст;
	
	
	Для Счетчик=2 ПО Результат.ШиринаТаблицы Цикл 
		ЗначениеТекущейЯчейки = Результат.Область("R1C" + Строка(Счетчик)).Текст;
		Если Ячейка_Дата = ЗначениеТекущейЯчейки Тогда
			Кол_Конец = Счетчик;
			Продолжить;
		Иначе
			ОбластьДляОбъединения = Результат.Область("R1C" + Строка(Кол_Начало) + ":R1C" + Строка(Кол_Конец));	
			ОбластьДляОбъединения.Объединить();
			
			
			Кол_Начало = Счетчик;
			Кол_Конец = Счетчик;
			Ячейка_Дата = Результат.Область("R1C" + Строка(Счетчик)).Текст;
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	////Для й=1 По 100 Цикл
	////	Если Результат.Область("R"+Строка(й)+"C1").Текст = "Тип мероприятия" Тогда
	////		Прервать;			
	////	КонецЕсли;
	////КонецЦикла;
	////										
	////Ячейка = Результат.НайтиТекст("Тип мероприятия");
	////// Нашли начала поиска
	////Ячейка = Результат.Область("R"+Строка(й)+"C2");
	////НачальноеЗначениеДаты = Ячейка.Текст;
	//////Пока Ячейка<>"" Цикл
	//////	
	//////	
	//////КонецЦикла;
	
КонецПроцедуры