
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УбратьВидимость();	
	Элементы.МероприятияВыполнить.Доступность = Ложь;
	
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		Попытка 
			ЭтаФорма.Пользователь =	ЭтаФорма.ВладелецФормы.Пользователь; 
			ЭтаФорма.ТипМероприятия = ЭтаФорма.ВладелецФормы.ВыбранныйТипМероприятия; 
			ВариантКод.Очистить();
			ДопРекКод.Очистить();
			Сформировать();
			//ПользовательПриИзменении("");
			//ТипМероприятияПриИзменении("");
		Исключение
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УбратьВидимость()
	Элементы.МероприятияОбъектТЧ.Видимость = Ложь;
	Для Сч = 1 По 10 Цикл
		Элементы["МероприятияВариант" + Формат(Сч, "ЧН=; ЧГ=")].Видимость = Ложь;
	КонецЦикла;	
	Для Сч = 1 По 5 Цикл
		Элементы["МероприятияДопРек" + Формат(Сч, "ЧН=; ЧГ=")].Видимость = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	Объект.Мероприятия.Очистить();
	ВариантКод.Очистить();
	ДопРекКод.Очистить();
	Сформировать();
КонецПроцедуры

&НаКлиенте
Процедура ТипМероприятияПриИзменении(Элемент)
	Объект.Мероприятия.Очистить();
	ВариантКод.Очистить();
	ДопРекКод.Очистить();
	Сформировать();	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать()
	Если Не ЗаполненыРеквизиты() Тогда
		Элементы.МероприятияВыполнить.Доступность = Ложь;
		Возврат;			
	Иначе
		Элементы.МероприятияВыполнить.Доступность = Истина;
	КонецЕсли;
	Если ЗаполнитьМероприятия() Тогда
		Возврат;	
	КонецЕсли;
	
	//
	Если Этаформа.ВладелецФормы = Неопределено ИЛИ 
			Этаформа.ВладелецФормы.ИмяФормы <> "Обработка.ПланированиеМероприятий2.Форма.Форма" Тогда
		ЗаполнитьТаблЧасть();
	Иначе
		ТЗ_КА = Этаформа.ВладелецФормы.Объект.Контрагент;
		МассивКА = Новый Массив();
		Для Каждого Эл Из Этаформа.ВладелецФормы.Элементы.Контрагенты.ВыделенныеСтроки Цикл
			МассивКА.Добавить(ТЗ_КА.НайтиПоИдентификатору(Эл).КонтрагентСсылка);
		КонецЦикла;
	    ЗаполнитьТаблЧастьПоКА(МассивКА);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ЗаполненыРеквизиты()
	// Вывод сообщений отменён до просьб заказчика.
	ОчиститьСообщения();
	Проверка = Истина;
	Если Пользователь.Пустая() Тогда
		//Сообщение = Новый СообщениеПользователю; 
		//Сообщение.Текст = "Необходимо заполнить поле ""Пользователь"""; 
		//Сообщение.Поле = "Пользователь"; //"Имя ПоляФормы";   
		//Сообщение.УстановитьДанные(ЭтаФорма);
		//Сообщение.Сообщить();
		Проверка = Ложь;
	КонецЕсли;  
	Если ТипМероприятия.Пустая() Тогда
		//Сообщение = Новый СообщениеПользователю; 
		//Сообщение.Текст = "Необходимо заполнить поле ""ТипМероприятия"""; 
		//Сообщение.Поле = "ТипМероприяти,я"; //"Имя ПоляФормы";  
		//Сообщение.УстановитьДанные(ЭтаФорма);
		//Сообщение.Сообщить();
		Проверка = Ложь;	
	КонецЕсли; 
	Если Не Проверка Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ЗаполнитьМероприятия()
	Отказ = Ложь;
	УбратьВидимость();	
	// Переименовываем колонки, имена берем из запроса.
	// Для не используемых колонкок убиваем видимость для пользователя.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РезультатыМероприятий.Ссылка
	                      |ИЗ
	                      |	Справочник.РезультатыМероприятий КАК РезультатыМероприятий
	                      |ГДЕ
	                      |	РезультатыМероприятий.Владелец = &ТипМероприятия
	                      |	И РезультатыМероприятий.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	РезультатыМероприятий.Наименование");
	Запрос.УстановитьПараметр("ТипМероприятия", ТипМероприятия);
	Результат = Запрос.Выполнить().Выбрать();
	
	Сч = 1; 
	// Каждая колонка является по сути одним из результатов справочника РезультатыМероприятий.
	// ВариантКод служит, чтобы по выбранному флажку определить ссылку элемента справочника РезультатыМероприятий. 
	Если Результат.Количество() > 10 Тогда
		Сообщить("Вариантов результата у данного типа мероприятия более 10, работа невозможна.");
		Отказ = Истина;
		Возврат Отказ;	
	КонецЕсли;
	Пока Результат.Следующий() Цикл
		Элементы["МероприятияВариант" + Строка(Сч)].Заголовок = Результат.Ссылка;
		Элементы["МероприятияВариант" + Строка(Сч)].Видимость = Истина;
		ВариантКод.Добавить(Результат.Ссылка, "Вариант" + Строка(Сч));
		Сч = Сч + 1;	
	КонецЦикла;	
	
	//
	Запрос.Текст = "ВЫБРАТЬ
	               |	РезультатыМероприятийДополнительныеРеквизиты.Свойство
	               |ИЗ
	               |	Справочник.РезультатыМероприятий.ДополнительныеРеквизиты КАК РезультатыМероприятийДополнительныеРеквизиты
	               |ГДЕ
	               |	РезультатыМероприятийДополнительныеРеквизиты.Ссылка.Владелец = &ТипМероприятия
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РезультатыМероприятийДополнительныеРеквизиты.Свойство
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СРЕДНЕЕ(РезультатыМероприятийДополнительныеРеквизиты.НомерСтроки)";
	Результат = Запрос.Выполнить().Выбрать();
	Сч = 1; 
	Если Результат.Количество() > 5 Тогда
		Сообщить("У данного типа мероприятия более 5 дополнительных реквизитов.");
		Отказ = Истина;
		Возврат Отказ;	
	КонецЕсли;
	Пока Результат.Следующий() Цикл
		Элементы["МероприятияДопРек" + Строка(Сч)].Заголовок = Результат.Свойство;
		Элементы["МероприятияДопРек" + Строка(Сч)].Видимость = Истина; 
		Элементы["МероприятияДопРек" + Строка(Сч)].ОграничениеТипа = Результат.Свойство.ТипЗначения; 
		ДопРекКод.Добавить(Результат.Свойство, "ДопРек" + Строка(Сч));
		Сч = Сч + 1;	
	КонецЦикла;
	
	Возврат Отказ;
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблЧасть()
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//					  |	ОбъектыВРаботеОстатки.Объект КАК Объект
	//					  |ПОМЕСТИТЬ ВТ_ОбъектыВРаботе
	//					  |ИЗ
	//					  |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник = &Сотрудник) КАК ОбъектыВРаботеОстатки
	//					  |
	//					  |СГРУППИРОВАТЬ ПО
	//					  |	ОбъектыВРаботеОстатки.Объект
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Объект
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	Мероприятие.Ссылка КАК Мероприятие,
	//					  |	Мероприятие.БизнесПроцесс КАК БизнесПроцесс,
	//					  |	ВТ_ОбъектыВРаботе.Объект,
	//					  |	Мероприятие.ТипМероприятия,
	//					  |	Мероприятие.Ответственный КАК ТипСотрудника
	//					  |ПОМЕСТИТЬ ВТ_БезБП
	//					  |ИЗ
	//					  |	ВТ_ОбъектыВРаботе КАК ВТ_ОбъектыВРаботе
	//					  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	//					  |		ПО ВТ_ОбъектыВРаботе.Объект = Мероприятие.Объект
	//					  |ГДЕ
	//					  |	Мероприятие.Выполнена = ЛОЖЬ
	//					  |	И Мероприятие.ПометкаУдаления = ЛОЖЬ
	//					  |	И Мероприятие.ТипМероприятия = &ТипМероприятия
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Мероприятие,
	//					  |	БизнесПроцесс
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	ВТ_БезБП.Мероприятие КАК Мероприятие,
	//					  |	ВТ_БезБП.Объект КАК Объект,
	//					  |	ВТ_БезБП.ТипМероприятия КАК ТипМероприятия,
	//					  |	ВТ_БезБП.ТипСотрудника
	//					  |ПОМЕСТИТЬ Контр_С_Отображать
	//					  |ИЗ
	//					  |	ВТ_БезБП КАК ВТ_БезБП
	//					  |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	//					  |		ПО ВТ_БезБП.БизнесПроцесс = БизнесПроцессы.Ссылка
	//					  |ГДЕ
	//					  |	(БизнесПроцессы.Ссылка ЕСТЬ NULL 
	//					  |			ИЛИ БизнесПроцессы.Завершен = ЛОЖЬ
	//					  |				И БизнесПроцессы.ПометкаУдаления = ЛОЖЬ)
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	ТипМероприятия
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	Контр_С_Отображать.Мероприятие,
	//					  |	Контр_С_Отображать.ТипМероприятия,
	//					  |	Контр_С_Отображать.ТипСотрудника,
	//					  |	Контр_С_Отображать.Объект КАК Объект
	//					  |ПОМЕСТИТЬ Контр_Все
	//					  |ИЗ
	//					  |	Контр_С_Отображать КАК Контр_С_Отображать
	//					  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыМероприятий КАК ТипыМероприятий
	//					  |		ПО Контр_С_Отображать.ТипМероприятия = ТипыМероприятий.Ссылка
	//					  |ГДЕ
	//					  |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Объект
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	ОтветственныеСотрудники.Объект КАК Объект,
	//					  |	ОтветственныеСотрудники.ТипСотрудника,
	//					  |	ОтветственныеСотрудники.Пользователь
	//					  |ПОМЕСТИТЬ ОтветственныеСотрудники
	//					  |ИЗ
	//					  |	РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	//					  |
	//					  |ОБЪЕДИНИТЬ ВСЕ
	//					  |
	//					  |ВЫБРАТЬ
	//					  |	СотрудникиВПомощь.Объект,
	//					  |	СотрудникиВПомощь.ТипСотрудника,
	//					  |	СотрудникиВПомощь.Пользователь
	//					  |ИЗ
	//					  |	РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Объект
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	Контр_Все.Мероприятие,
	//					  |	Контр_Все.Объект,
	//					  |	Контр_Все.ТипСотрудника КАК ТипСотрудника,
	//					  |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника1,
	//					  |	ОтветственныеСотрудники.Пользователь
	//					  |ПОМЕСТИТЬ БезГлубины
	//					  |ИЗ
	//					  |	Контр_Все КАК Контр_Все
	//					  |		ЛЕВОЕ СОЕДИНЕНИЕ ОтветственныеСотрудники КАК ОтветственныеСотрудники
	//					  |		ПО Контр_Все.Объект = ОтветственныеСотрудники.Объект
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	ТипСотрудника,
	//					  |	ТипСотрудника1
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	БезГлубины.Объект,
	//					  |	БезГлубины.Мероприятие КАК Мероприятие,
	//					  |	БезГлубины.Пользователь,
	//					  |	ТипыСотрудников1.Глубина КАК Глубина1
	//					  |ПОМЕСТИТЬ С_Глубиной
	//					  |ИЗ
	//					  |	БезГлубины КАК БезГлубины
	//					  |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	//					  |		ПО БезГлубины.ТипСотрудника = ТипыСотрудников.Ссылка
	//					  |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников1
	//					  |		ПО БезГлубины.ТипСотрудника1 = ТипыСотрудников1.Ссылка
	//					  |ГДЕ
	//					  |	ТипыСотрудников.Родители ПОДОБНО ТипыСотрудников1.РодителиШаблон
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Глубина1,
	//					  |	Мероприятие
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	С_Глубиной.Мероприятие КАК Мероприятие,
	//					  |	МАКСИМУМ(С_Глубиной.Глубина1) КАК Глубина1
	//					  |ПОМЕСТИТЬ Глубина_Макс
	//					  |ИЗ
	//					  |	С_Глубиной КАК С_Глубиной
	//					  |
	//					  |СГРУППИРОВАТЬ ПО
	//					  |	С_Глубиной.Мероприятие
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Мероприятие,
	//					  |	Глубина1
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ
	//					  |	С_Глубиной.Объект,
	//					  |	С_Глубиной.Мероприятие КАК Ссылка
	//					  |ИЗ
	//					  |	Глубина_Макс КАК Глубина_Макс
	//					  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ С_Глубиной КАК С_Глубиной
	//					  |		ПО (С_Глубиной.Мероприятие = Глубина_Макс.Мероприятие)
	//					  |			И (С_Глубиной.Глубина1 = Глубина_Макс.Глубина1)
	//					  |ГДЕ
	//					  |	С_Глубиной.Пользователь = &Сотрудник");
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОбъектыВРаботеОстатки.Объект КАК Объект,
	                      |	ВЫБОР
	                      |		КОГДА ОбъектыВРаботеОстатки.Объект ССЫЛКА Справочник.Контрагенты
	                      |			ТОГДА ОбъектыВРаботеОстатки.Объект
	                      |		ИНАЧЕ ОбъектыВРаботеОстатки.Объект.Должник
	                      |	КОНЕЦ КАК Должник
	                      |ПОМЕСТИТЬ ВТ_ОбъектыВРаботе
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, ) КАК ОбъектыВРаботеОстатки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ОбъектыВРаботеОстатки.Объект,
	                      |	ВЫБОР
	                      |		КОГДА ОбъектыВРаботеОстатки.Объект ССЫЛКА Справочник.Контрагенты
	                      |			ТОГДА ОбъектыВРаботеОстатки.Объект
	                      |		ИНАЧЕ ОбъектыВРаботеОстатки.Объект.Должник
	                      |	КОНЕЦ,
	                      |	ВЫБОР
	                      |		КОГДА ОбъектыВРаботеОстатки.Объект ССЫЛКА Справочник.Контрагенты
	                      |			ТОГДА ОбъектыВРаботеОстатки.Объект.Код
	                      |		ИНАЧЕ ОбъектыВРаботеОстатки.Объект.Должник.Код
	                      |	КОНЕЦ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Мероприятие.Ссылка КАК Мероприятие,
	                      |	Мероприятие.БизнесПроцесс КАК БизнесПроцесс,
	                      |	ВТ_ОбъектыВРаботе.Объект КАК Объект,
	                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	                      |	ВЫБОР
	                      |		КОГДА Мероприятие.Ответственный ССЫЛКА Справочник.Пользователи
	                      |			ТОГДА Мероприятие.Ответственный.ТипСотрудника
	                      |		ИНАЧЕ Мероприятие.Ответственный
	                      |	КОНЕЦ КАК ТипСотрудника,
	                      |	ВТ_ОбъектыВРаботе.Должник КАК Должник,
	                      |	Мероприятие.Комментарий КАК Комментарий
	                      |ПОМЕСТИТЬ ВТ_БезБП
	                      |ИЗ
	                      |	ВТ_ОбъектыВРаботе КАК ВТ_ОбъектыВРаботе
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	                      |		ПО ВТ_ОбъектыВРаботе.Объект = Мероприятие.Объект
	                      |ГДЕ
	                      |	Мероприятие.Выполнена = ЛОЖЬ
	                      |	И Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И Мероприятие.ТипМероприятия = &ТипМероприятия
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Мероприятие,
	                      |	БизнесПроцесс
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВТ_БезБП.Мероприятие КАК Мероприятие,
	                      |	ВТ_БезБП.Объект КАК Объект,
	                      |	ВТ_БезБП.ТипМероприятия КАК ТипМероприятия,
	                      |	ВТ_БезБП.ТипСотрудника КАК ТипСотрудника,
	                      |	ВТ_БезБП.Должник КАК Должник,
	                      |	ВТ_БезБП.Комментарий КАК Комментарий
	                      |ПОМЕСТИТЬ Контр_С_Отображать
	                      |ИЗ
	                      |	ВТ_БезБП КАК ВТ_БезБП
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	                      |		ПО ВТ_БезБП.БизнесПроцесс = БизнесПроцессы.Ссылка
	                      |ГДЕ
	                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
	                      |			ИЛИ БизнесПроцессы.Завершен = ЛОЖЬ
	                      |				И БизнесПроцессы.ПометкаУдаления = ЛОЖЬ)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипМероприятия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Контр_С_Отображать.Мероприятие КАК Мероприятие,
	                      |	Контр_С_Отображать.ТипМероприятия КАК ТипМероприятия,
	                      |	Контр_С_Отображать.ТипСотрудника КАК ТипСотрудника,
	                      |	Контр_С_Отображать.Объект КАК Объект,
	                      |	Контр_С_Отображать.Должник КАК Должник,
	                      |	Контр_С_Отображать.Комментарий КАК Комментарий
	                      |ПОМЕСТИТЬ Контр_Все
	                      |ИЗ
	                      |	Контр_С_Отображать КАК Контр_С_Отображать
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыМероприятий КАК ТипыМероприятий
	                      |		ПО Контр_С_Отображать.ТипМероприятия = ТипыМероприятий.Ссылка
	                      |ГДЕ
	                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОтветственныеСотрудники.Объект КАК Объект,
	                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	                      |	ОтветственныеСотрудники.Пользователь КАК Пользователь
	                      |ПОМЕСТИТЬ ОтветственныеСотрудники
	                      |ИЗ
	                      |	РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	СотрудникиВПомощь.Объект,
	                      |	СотрудникиВПомощь.ТипСотрудника,
	                      |	СотрудникиВПомощь.Пользователь
	                      |ИЗ
	                      |	РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Контр_Все.Мероприятие КАК Мероприятие,
	                      |	Контр_Все.Объект КАК Объект,
	                      |	Контр_Все.ТипСотрудника КАК ТипСотрудника,
	                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника1,
	                      |	ОтветственныеСотрудники.Пользователь КАК Пользователь,
	                      |	Контр_Все.Должник КАК Должник,
	                      |	Контр_Все.Комментарий КАК Комментарий
	                      |ПОМЕСТИТЬ БезГлубины
	                      |ИЗ
	                      |	Контр_Все КАК Контр_Все
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |		ПО Контр_Все.Объект = ОтветственныеСотрудники.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипСотрудника,
	                      |	ТипСотрудника1
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	БезГлубины.Объект КАК Объект,
	                      |	БезГлубины.Мероприятие КАК Мероприятие,
	                      |	БезГлубины.Пользователь КАК Пользователь,
	                      |	ТипыСотрудников1.Глубина КАК Глубина1,
	                      |	БезГлубины.Должник КАК Должник,
	                      |	БезГлубины.Комментарий КАК Комментарий
	                      |ПОМЕСТИТЬ С_Глубиной
	                      |ИЗ
	                      |	БезГлубины КАК БезГлубины
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	                      |		ПО БезГлубины.ТипСотрудника = ТипыСотрудников.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников1
	                      |		ПО БезГлубины.ТипСотрудника1 = ТипыСотрудников1.Ссылка
	                      |ГДЕ
	                      |	ТипыСотрудников.Родители ПОДОБНО ТипыСотрудников1.РодителиШаблон
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Глубина1,
	                      |	Мероприятие
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	С_Глубиной.Мероприятие КАК Мероприятие,
	                      |	МАКСИМУМ(С_Глубиной.Глубина1) КАК Глубина1,
	                      |	С_Глубиной.Должник КАК Должник
	                      |ПОМЕСТИТЬ Глубина_Макс
	                      |ИЗ
	                      |	С_Глубиной КАК С_Глубиной
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	С_Глубиной.Мероприятие,
	                      |	С_Глубиной.Должник
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Мероприятие,
	                      |	Глубина1
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	С_Глубиной.Объект КАК Объект,
	                      |	С_Глубиной.Мероприятие КАК Ссылка,
	                      |	Глубина_Макс.Должник КАК Должник,
	                      |	Глубина_Макс.Должник.КодКонтрагента КАК КодДолжника,
	                      |	С_Глубиной.Комментарий КАК Комментарий
	                      |ПОМЕСТИТЬ ОбычныйПакет
	                      |ИЗ
	                      |	Глубина_Макс КАК Глубина_Макс
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ С_Глубиной КАК С_Глубиной
	                      |		ПО (С_Глубиной.Мероприятие = Глубина_Макс.Мероприятие)
	                      |			И (С_Глубиной.Глубина1 = Глубина_Макс.Глубина1)
	                      |ГДЕ
	                      |	С_Глубиной.Пользователь = &Сотрудник
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОбычныйПакет.Объект КАК Объект,
	                      |	ОбычныйПакет.Ссылка КАК Ссылка,
	                      |	ОбычныйПакет.Комментарий КАК Комментарий
	                      |ИЗ
	                      |	ОбычныйПакет КАК ОбычныйПакет
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОбычныйПакет.Объект КАК Объект,
	                      |	ОбычныйПакет.Ссылка КАК Ссылка,
	                      |	ОбычныйПакет.Должник КАК Должник,
	                      |	ОбычныйПакет.КодДолжника КАК КодДолжника
	                      |ИЗ
	                      |	ОбычныйПакет КАК ОбычныйПакет
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &ИспользоватьОтборПоУчастку = ИСТИНА
	                      |				ТОГДА ПОДСТРОКА(ОбычныйПакет.КодДолжника, 3, 4) В (&КодУчастка)
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ДолговыеОбязательстваКонтрагенты.Ссылка КАК ДО,
	                      |	ДолговыеОбязательстваКонтрагенты.Значение КАК Д
	                      |ПОМЕСТИТЬ Табл_ДО
	                      |ИЗ
	                      |	Справочник.ДолговыеОбязательства.Контрагенты КАК ДолговыеОбязательстваКонтрагенты
	                      |ГДЕ
	                      |	ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Должник)
	                      |	И ДолговыеОбязательстваКонтрагенты.Значение В
	                      |			(ВЫБРАТЬ
	                      |				ааа.Должник
	                      |			ИЗ
	                      |				ОбычныйПакет КАК ааа)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Табл_ДО.Д КАК Д,
	                      |	СУММА(ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток) КАК СуммаДООстаток
	                      |ПОМЕСТИТЬ ДО_Задолженность
	                      |ИЗ
	                      |	Табл_ДО КАК Табл_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
	                      |		ПО Табл_ДО.ДО = ОбъектыВРаботеОстатки.Объект
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки КАК ЗадолженностьПоОбъектамОстатки
	                      |		ПО Табл_ДО.ДО = ЗадолженностьПоОбъектамОстатки.Объект
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Табл_ДО.Д
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОбычныйПакет.Объект КАК Объект,
	                      |	ОбычныйПакет.Ссылка КАК Ссылка,
	                      |	ОбычныйПакет.Должник КАК Должник,
	                      |	ДО_Остатки.СуммаДООстаток КАК СуммаДООстаток,
	                      |	ОбычныйПакет.КодДолжника КАК КодДолжника,
	                      |	ОбычныйПакет.Комментарий КАК Комментарий
	                      |ИЗ
	                      |	ОбычныйПакет КАК ОбычныйПакет
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ДО_Задолженность КАК ДО_Остатки
	                      |		ПО ОбычныйПакет.Должник = ДО_Остатки.Д
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &ИспользоватьОтборПоУчастку = ИСТИНА
	                      |				ТОГДА ПОДСТРОКА(ОбычныйПакет.КодДолжника, 3, 4) В (&КодУчастка)
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |	И ВЫБОР
	                      |			КОГДА &ИспользоватьОтборПоСумме = ИСТИНА
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА &Между = ИСТИНА
	                      |							ТОГДА ДО_Остатки.СуммаДООстаток > &От
	                      |									И ДО_Остатки.СуммаДООстаток < &До
	                      |						КОГДА &Больше = ИСТИНА
	                      |							ТОГДА ДО_Остатки.СуммаДООстаток > &От
	                      |						КОГДА &Меньше = ИСТИНА
	                      |							ТОГДА ДО_Остатки.СуммаДООстаток < &До
	                      |					КОНЕЦ
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ");					  
	Запрос.УстановитьПараметр("Сотрудник", Пользователь);
	Запрос.УстановитьПараметр("ТипМероприятия", ТипМероприятия);
	
	// Если установлен отбор УЧАСТКУ для Герольда, то:
	Запрос.УстановитьПараметр("ИспользоватьОтборПоУчастку", (ЗначениеЗаполнено(МассивУчастков)));
	М = Новый Массив;
	Для Каждого Стр ИЗ МассивУчастков Цикл
		М.Добавить(Стр.Значение.Код);	
	КонецЦикла;
	Запрос.УстановитьПараметр("КодУчастка", М);
	
	// Если установлен отбор ПО СУММЕ ЗАДОЛЖЕННОСТИ для Герольда, то
	Запрос.УстановитьПараметр("ИспользоватьОтборПоСумме", (ЗначениеЗаполнено(От) ИЛИ ЗначениеЗаполнено(До)));
	Запрос.УстановитьПараметр("Между", (ЗначениеЗаполнено(От) И ЗначениеЗаполнено(До)));
	Запрос.УстановитьПараметр("Больше", (ЗначениеЗаполнено(От) И НЕ ЗначениеЗаполнено(До)));
	Запрос.УстановитьПараметр("Меньше", (НЕ ЗначениеЗаполнено(От) И ЗначениеЗаполнено(До)));
	Запрос.УстановитьПараметр("От", От);
	Запрос.УстановитьПараметр("До", До);
						  
	// Простой пакет 
	РасширенныйЗапрос = Ложь;
	Если НЕ ЗначениеЗаполнено(МассивУчастков) И НЕ ЗначениеЗаполнено(От) И НЕ ЗначениеЗаполнено(До) И НЕ ВключитьОтборПоГерольду Тогда
		Результат = Запрос.ВыполнитьПакет()[9].Выбрать();
	ИначеЕсли ВключитьОтборПоГерольду Тогда
		Результат = Запрос.ВыполнитьПакет()[13].Выбрать();   
		РасширенныйЗапрос = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Результат.Количество() = 0 Тогда
		Сообщить("""Мероприятия"" с заданными критериями отсутствуют");	
		Элементы.МероприятияВыполнить.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	Элементы.МероприятияОбъектТЧ.Видимость = Истина;
	Объект.Мероприятия.Очистить();
    Пока Результат.Следующий() Цикл
   		Эл = Объект.Мероприятия.Добавить();
		Эл.Мероприятие = Результат.Ссылка;
		Эл.ОбъектТЧ = Результат.Объект;
		Эл.ОбъектТЧСсылка = Результат.Объект;
		Эл.Комментарий = Результат.Комментарий;
		
		Для Каждого ЭлДР Из Результат.Ссылка.ДополнительныеРеквизиты Цикл
			ЭлСЗ = ДопРекКод.НайтиПоЗначению(ЭлДР.Свойство);
			Если ЭлСЗ <> Неопределено Тогда
				Эл[ЭлСЗ.Представление] = ЭлДР.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Если РасширенныйЗапрос Тогда
			Эл.Должник = Результат.Должник;
			Эл.КодДолжника = Результат.КодДолжника;
			Эл.СуммаДолга = Результат.СуммаДООстаток;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблЧастьПоКА(МассивКА)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОбъектыВРаботеОстатки.Объект КАК Объект,
	                      |	ВЫБОР
	                      |		КОГДА ОбъектыВРаботеОстатки.Объект ССЫЛКА Справочник.Контрагенты
	                      |			ТОГДА ОбъектыВРаботеОстатки.Объект
	                      |		ИНАЧЕ ОбъектыВРаботеОстатки.Объект.Должник
	                      |	КОНЕЦ КАК Должник
	                      |ПОМЕСТИТЬ ВТ_ОбъектыВРаботе
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	                      |			,
	                      |			(ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.Контрагенты)
	                      |					И Объект В (&МассивКА)
	                      |				ИЛИ ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.ДолговыеОбязательства)
	                      |					И Объект.Должник В (&МассивКА))
	                      |				И Сотрудник = &Сотрудник) КАК ОбъектыВРаботеОстатки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ОбъектыВРаботеОстатки.Объект,
	                      |	ВЫБОР
	                      |		КОГДА ОбъектыВРаботеОстатки.Объект ССЫЛКА Справочник.Контрагенты
	                      |			ТОГДА ОбъектыВРаботеОстатки.Объект
	                      |		ИНАЧЕ ОбъектыВРаботеОстатки.Объект.Должник
	                      |	КОНЕЦ,
	                      |	ВЫБОР
	                      |		КОГДА ОбъектыВРаботеОстатки.Объект ССЫЛКА Справочник.Контрагенты
	                      |			ТОГДА ОбъектыВРаботеОстатки.Объект.Код
	                      |		ИНАЧЕ ОбъектыВРаботеОстатки.Объект.Должник.Код
	                      |	КОНЕЦ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Мероприятие.Ссылка КАК Мероприятие,
	                      |	Мероприятие.БизнесПроцесс КАК БизнесПроцесс,
	                      |	ВТ_ОбъектыВРаботе.Объект КАК Объект,
	                      |	Мероприятие.ТипМероприятия КАК ТипМероприятия,
	                      |	Мероприятие.Ответственный КАК ТипСотрудника,
	                      |	ВТ_ОбъектыВРаботе.Должник КАК Должник
	                      |ПОМЕСТИТЬ ВТ_БезБП
	                      |ИЗ
	                      |	ВТ_ОбъектыВРаботе КАК ВТ_ОбъектыВРаботе
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	                      |		ПО ВТ_ОбъектыВРаботе.Объект = Мероприятие.Объект
	                      |ГДЕ
	                      |	Мероприятие.Выполнена = ЛОЖЬ
	                      |	И Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И Мероприятие.ТипМероприятия = &ТипМероприятия
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Мероприятие,
	                      |	БизнесПроцесс
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВТ_БезБП.Мероприятие КАК Мероприятие,
	                      |	ВТ_БезБП.Объект КАК Объект,
	                      |	ВТ_БезБП.ТипМероприятия КАК ТипМероприятия,
	                      |	ВТ_БезБП.ТипСотрудника КАК ТипСотрудника,
	                      |	ВТ_БезБП.Должник КАК Должник
	                      |ПОМЕСТИТЬ Контр_С_Отображать
	                      |ИЗ
	                      |	ВТ_БезБП КАК ВТ_БезБП
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	                      |		ПО ВТ_БезБП.БизнесПроцесс = БизнесПроцессы.Ссылка
	                      |ГДЕ
	                      |	(БизнесПроцессы.Ссылка ЕСТЬ NULL
	                      |			ИЛИ БизнесПроцессы.Завершен = ЛОЖЬ
	                      |				И БизнесПроцессы.ПометкаУдаления = ЛОЖЬ)
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипМероприятия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Контр_С_Отображать.Мероприятие КАК Мероприятие,
	                      |	Контр_С_Отображать.ТипМероприятия КАК ТипМероприятия,
	                      |	Контр_С_Отображать.ТипСотрудника КАК ТипСотрудника,
	                      |	Контр_С_Отображать.Объект КАК Объект,
	                      |	Контр_С_Отображать.Должник КАК Должник,
	                      |	ТипыМероприятий.Комментарий КАК Комментарий
	                      |ПОМЕСТИТЬ Контр_Все
	                      |ИЗ
	                      |	Контр_С_Отображать КАК Контр_С_Отображать
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыМероприятий КАК ТипыМероприятий
	                      |		ПО Контр_С_Отображать.ТипМероприятия = ТипыМероприятий.Ссылка
	                      |ГДЕ
	                      |	ТипыМероприятий.НеОтображатьВПланировщике = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОтветственныеСотрудники.Объект КАК Объект,
	                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	                      |	ОтветственныеСотрудники.Пользователь КАК Пользователь
	                      |ПОМЕСТИТЬ ОтветственныеСотрудники
	                      |ИЗ
	                      |	РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	СотрудникиВПомощь.Объект,
	                      |	СотрудникиВПомощь.ТипСотрудника,
	                      |	СотрудникиВПомощь.Пользователь
	                      |ИЗ
	                      |	РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Контр_Все.Мероприятие КАК Мероприятие,
	                      |	Контр_Все.Объект КАК Объект,
	                      |	Контр_Все.ТипСотрудника КАК ТипСотрудника,
	                      |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника1,
	                      |	ОтветственныеСотрудники.Пользователь КАК Пользователь,
	                      |	Контр_Все.Должник КАК Должник,
	                      |	Контр_Все.Комментарий КАК Комментарий
	                      |ПОМЕСТИТЬ БезГлубины
	                      |ИЗ
	                      |	Контр_Все КАК Контр_Все
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |		ПО Контр_Все.Объект = ОтветственныеСотрудники.Объект
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ТипСотрудника,
	                      |	ТипСотрудника1
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	БезГлубины.Объект КАК Объект,
	                      |	БезГлубины.Мероприятие КАК Мероприятие,
	                      |	БезГлубины.Пользователь КАК Пользователь,
	                      |	ТипыСотрудников1.Глубина КАК Глубина1,
	                      |	БезГлубины.Должник КАК Должник,
	                      |	БезГлубины.Комментарий КАК Комментарий
	                      |ПОМЕСТИТЬ С_Глубиной
	                      |ИЗ
	                      |	БезГлубины КАК БезГлубины
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	                      |		ПО БезГлубины.ТипСотрудника = ТипыСотрудников.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников1
	                      |		ПО БезГлубины.ТипСотрудника1 = ТипыСотрудников1.Ссылка
	                      |ГДЕ
	                      |	ТипыСотрудников.Родители ПОДОБНО ТипыСотрудников1.РодителиШаблон
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Глубина1,
	                      |	Мероприятие
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	С_Глубиной.Мероприятие КАК Мероприятие,
	                      |	МАКСИМУМ(С_Глубиной.Глубина1) КАК Глубина1,
	                      |	С_Глубиной.Должник КАК Должник
	                      |ПОМЕСТИТЬ Глубина_Макс
	                      |ИЗ
	                      |	С_Глубиной КАК С_Глубиной
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	С_Глубиной.Мероприятие,
	                      |	С_Глубиной.Должник
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Мероприятие,
	                      |	Глубина1
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	С_Глубиной.Объект КАК Объект,
	                      |	С_Глубиной.Мероприятие КАК Ссылка,
	                      |	Глубина_Макс.Должник КАК Должник,
	                      |	Глубина_Макс.Должник.КодКонтрагента КАК КодДолжника,
	                      |	С_Глубиной.Комментарий КАК Комментарий
	                      |ПОМЕСТИТЬ ОбычныйПакет
	                      |ИЗ
	                      |	Глубина_Макс КАК Глубина_Макс
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ С_Глубиной КАК С_Глубиной
	                      |		ПО (С_Глубиной.Мероприятие = Глубина_Макс.Мероприятие)
	                      |			И (С_Глубиной.Глубина1 = Глубина_Макс.Глубина1)
	                      |ГДЕ
	                      |	С_Глубиной.Пользователь = &Сотрудник
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОбычныйПакет.Объект КАК Объект,
	                      |	ОбычныйПакет.Ссылка КАК Ссылка,
	                      |	ОбычныйПакет.Комментарий КАК Комментарий
	                      |ИЗ
	                      |	ОбычныйПакет КАК ОбычныйПакет
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОбычныйПакет.Объект КАК Объект,
	                      |	ОбычныйПакет.Ссылка КАК Ссылка,
	                      |	ОбычныйПакет.Должник КАК Должник,
	                      |	ОбычныйПакет.КодДолжника КАК КодДолжника
	                      |ИЗ
	                      |	ОбычныйПакет КАК ОбычныйПакет
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &ИспользоватьОтборПоУчастку = ИСТИНА
	                      |				ТОГДА ПОДСТРОКА(ОбычныйПакет.КодДолжника, 3, 4) В (&КодУчастка)
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ДолговыеОбязательстваКонтрагенты.Ссылка КАК ДО,
	                      |	ДолговыеОбязательстваКонтрагенты.Значение КАК Д
	                      |ПОМЕСТИТЬ Табл_ДО
	                      |ИЗ
	                      |	Справочник.ДолговыеОбязательства.Контрагенты КАК ДолговыеОбязательстваКонтрагенты
	                      |ГДЕ
	                      |	ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Должник)
	                      |	И ДолговыеОбязательстваКонтрагенты.Значение В
	                      |			(ВЫБРАТЬ
	                      |				ааа.Должник
	                      |			ИЗ
	                      |				ОбычныйПакет КАК ааа)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Табл_ДО.Д КАК Д,
	                      |	СУММА(ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток) КАК СуммаДООстаток
	                      |ПОМЕСТИТЬ ДО_Задолженность
	                      |ИЗ
	                      |	Табл_ДО КАК Табл_ДО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
	                      |		ПО Табл_ДО.ДО = ОбъектыВРаботеОстатки.Объект
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки КАК ЗадолженностьПоОбъектамОстатки
	                      |		ПО Табл_ДО.ДО = ЗадолженностьПоОбъектамОстатки.Объект
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Табл_ДО.Д
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОбычныйПакет.Объект КАК Объект,
	                      |	ОбычныйПакет.Ссылка КАК Ссылка,
	                      |	ОбычныйПакет.Должник КАК Должник,
	                      |	ДО_Остатки.СуммаДООстаток КАК СуммаДООстаток,
	                      |	ОбычныйПакет.КодДолжника КАК КодДолжника,
	                      |	ОбычныйПакет.Комментарий КАК Комментарий
	                      |ИЗ
	                      |	ОбычныйПакет КАК ОбычныйПакет
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ДО_Задолженность КАК ДО_Остатки
	                      |		ПО ОбычныйПакет.Должник = ДО_Остатки.Д
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &ИспользоватьОтборПоУчастку = ИСТИНА
	                      |				ТОГДА ПОДСТРОКА(ОбычныйПакет.КодДолжника, 3, 4) В (&КодУчастка)
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |	И ВЫБОР
	                      |			КОГДА &ИспользоватьОтборПоСумме = ИСТИНА
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА &Между = ИСТИНА
	                      |							ТОГДА ДО_Остатки.СуммаДООстаток > &От
	                      |									И ДО_Остатки.СуммаДООстаток < &До
	                      |						КОГДА &Больше = ИСТИНА
	                      |							ТОГДА ДО_Остатки.СуммаДООстаток > &От
	                      |						КОГДА &Меньше = ИСТИНА
	                      |							ТОГДА ДО_Остатки.СуммаДООстаток < &До
	                      |					КОНЕЦ
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ");					  
	Запрос.УстановитьПараметр("Сотрудник", Пользователь);
	Запрос.УстановитьПараметр("ТипМероприятия", ТипМероприятия);
	Запрос.УстановитьПараметр("МассивКА", МассивКА);
	
	// Если установлен отбор УЧАСТКУ для Герольда, то:
	Запрос.УстановитьПараметр("ИспользоватьОтборПоУчастку", ЗначениеЗаполнено(МассивУчастков));
	М = Новый Массив;
	Для Каждого Стр ИЗ МассивУчастков Цикл
		М.Добавить(Стр.Значение.Код);	
	КонецЦикла;
	Запрос.УстановитьПараметр("КодУчастка", М);
	
	// Если установлен отбор ПО СУММЕ ЗАДОЛЖЕННОСТИ для Герольда, то
	Запрос.УстановитьПараметр("ИспользоватьОтборПоСумме", ЗначениеЗаполнено(От) ИЛИ ЗначениеЗаполнено(До));
	Запрос.УстановитьПараметр("Между", ЗначениеЗаполнено(От) И ЗначениеЗаполнено(До));
	Запрос.УстановитьПараметр("Больше", ЗначениеЗаполнено(От) И НЕ ЗначениеЗаполнено(До));
	Запрос.УстановитьПараметр("Меньше", НЕ ЗначениеЗаполнено(От) И ЗначениеЗаполнено(До));
	Запрос.УстановитьПараметр("От", От);
	Запрос.УстановитьПараметр("До", До);
						  
	// Простой пакет 
	РасширенныйЗапрос = Ложь;
	Если НЕ ЗначениеЗаполнено(МассивУчастков) И НЕ ЗначениеЗаполнено(От) И НЕ ЗначениеЗаполнено(До) И НЕ ВключитьОтборПоГерольду Тогда
		Результат = Запрос.ВыполнитьПакет()[9].Выбрать();
	ИначеЕсли ВключитьОтборПоГерольду Тогда
		Результат = Запрос.ВыполнитьПакет()[13].Выбрать();   
		РасширенныйЗапрос = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Результат.Количество() = 0 Тогда
		//Лебедева, 13102021 Ищем те, которые назначило Пакетное создание 
		
		
		ЗапросСотрудник = Новый Запрос;
		ЗапросСотрудник.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыВРаботеОстатки.Объект КАК Объект
		|ПОМЕСТИТЬ ДОДолжников
		|ИЗ
		|	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
		|ГДЕ
		|	ОбъектыВРаботеОстатки.Объект.Должник В(&МассивКА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбъектыВРаботеОстатки.Объект
		|ИЗ
		|	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
		|ГДЕ
		|	ОбъектыВРаботеОстатки.Объект В(&МассивКА)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДОДолжников.Объект КАК Объект,
		|	Мероприятие.Ссылка КАК Ссылка,
		|	Мероприятие.Комментарий КАК Комментарий
		|ИЗ
		|	ДОДолжников КАК ДОДолжников
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
		|		ПО ДОДолжников.Объект = Мероприятие.Объект
		|ГДЕ
		|	Мероприятие.ТипМероприятия = &ТипМероприятия
		|	И Мероприятие.Выполнена = ЛОЖЬ
		|	И Мероприятие.ПометкаУдаления = ЛОЖЬ
		|	И Мероприятие.Ответственный = &Сотрудник";
				
		
		ЗапросСотрудник.УстановитьПараметр("Сотрудник", Пользователь);
		ЗапросСотрудник.УстановитьПараметр("ТипМероприятия", ТипМероприятия);
		ЗапросСотрудник.УстановитьПараметр("МассивКА", МассивКА);
		
		Результат = ЗапросСотрудник.Выполнить().Выбрать();
	КонецЕсли;   
	
	Если Результат.Количество() = 0 Тогда
		Сообщить("""Мероприятия"" с заданными критериями отсутствуют");	
		Элементы.МероприятияВыполнить.Доступность = Ложь;
		Возврат;
	КонецЕсли;

	
	Элементы.МероприятияОбъектТЧ.Видимость = Истина;
	Объект.Мероприятия.Очистить();
    Пока Результат.Следующий() Цикл
   		Эл = Объект.Мероприятия.Добавить();
		Эл.Мероприятие = Результат.Ссылка;
		Эл.ОбъектТЧ = Результат.Объект;
		Эл.ОбъектТЧСсылка = Результат.Объект;
		Эл.Комментарий = Результат.Комментарий;
		
		Для Каждого ЭлДР Из Результат.Ссылка.ДополнительныеРеквизиты Цикл
			ЭлСЗ = ДопРекКод.НайтиПоЗначению(ЭлДР.Свойство);
			Если ЭлСЗ <> Неопределено Тогда
				Эл[ЭлСЗ.Представление] = ЭлДР.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Если РасширенныйЗапрос Тогда
			Эл.Должник = Результат.Должник;
			Эл.КодДолжника = Результат.КодДолжника;
			Эл.СуммаДолга = Результат.СуммаДООстаток;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьТЧ(Команда)
	Если Вопрос("Подтверждаете выполнение выбранных мероприятий?", РежимДиалогаВопрос.ОКОтмена,, 
			КодВозвратаДиалога.Отмена) = КодВозвратаДиалога.ОК Тогда
		ВыполнитьТЧ_Сервер();	
	КонецЕсли;			
КонецПроцедуры

// Процедура подставляет выбранный вариант (флажком) результата в мероприятие.
&НаСервере
Процедура ВыполнитьТЧ_Сервер()
	Для Каждого Эл Из Объект.Мероприятия Цикл
		Если Эл.Пометка Тогда
			Сч = 1;
			Пока Сч <= ВариантКод.Количество() Цикл
				Если Вычислить("Эл.Вариант" + Строка(Сч)) Тогда
					ЭлОбъект = Эл.Мероприятие.ПолучитьОбъект();
					ЭлОбъект.Результат = ВариантКод[Сч - 1].Значение;
					ЭлОбъект.Комментарий = Эл.Комментарий;
					//Заполнение доп рек
					Для Каждого ЭлСв Из ЭлОбъект.Результат.ДополнительныеРеквизиты Цикл
						СвСЗ = ДопРекКод.НайтиПоЗначению(ЭлСв.Свойство);
						Стр = ЭлОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ЭлСв.Свойство));
						Если Стр.Количество() = 0 Тогда
							Стр = ЭлОбъект.ДополнительныеРеквизиты.Добавить();
							Стр.Свойство = ЭлСв.Свойство;
							Стр.Значение = Эл[СвСЗ.Представление];
						Иначе
							Стр[0].Значение = Эл[СвСЗ.Представление];
						КонецЕсли;
					КонецЦикла;

					//
					ЭлОбъект.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
					ЭлОбъект.ФактическаяДата = ТекущаяДата();
					Отказ = Ложь;
					//ЭлОбъект.ВыполнитьМероприятиеКакНеАктуальное(Отказ);
					Справочники.ФункцииДополнительныхРеквизитов.ВычислитьФункцию(ЭлОбъект.Результат.ФункцияДопРеквизитов.Функция, ЭлОбъект, Неопределено, Отказ);
					ЭлОбъект.ВыполнитьМероприятие(Отказ);

					//ЭлОбъект.ВыполнитьЗадачу();
				КонецЕсли;
				Сч = Сч + 1;	
			КонецЦикла;		
		КонецЕсли;
	КонецЦикла;
	Объект.Мероприятия.Очистить();
	ВариантКод.Очистить();
	ДопРекКод.Очистить();
	ЗаполнитьМероприятия();
	ЗаполнитьТаблЧасть();
КонецПроцедуры

// Процедура оставляет выбранным только один флажок, для одной строки.
// Событие отрабатывает при изменении любого из флажков строки.
&НаКлиенте
Процедура ВариантПриИзменении(Элемент)
	ЭлВыбранный = Сред(Элемент.Имя, 12);
	ТекДанные = Элементы.Мероприятия.ТекущиеДанные;
	ФлажокЭлВыбранный = Ложь;
	Выполнить("ФлажокЭлВыбранный = ТекДанные." + ЭлВыбранный + ";");	
	Сч = 1;
	Пока Сч <= ВариантКод.Количество() Цикл		
		Выполнить("ТекДанные.Вариант" + Строка(Сч)+ " = Ложь;");
		Сч = Сч + 1;	
	КонецЦикла;	
	Выполнить("ТекДанные." + Строка(ЭлВыбранный) + " = ФлажокЭлВыбранный;");
	ТекДанные.Пометка = ФлажокЭлВыбранный;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)	
	Имя = Элементы.Мероприятия.ТекущийЭлемент.Имя;	
	Если Имя = "МероприятияКомментарий" ИЛИ Лев(Имя, 17) = "МероприятияДопРек" Тогда		
		Имя = Сред(Имя, 12);  
		Значение = Элементы.Мероприятия.ТекущиеДанные[Имя];
		Для Каждого Эл Из Объект.Мероприятия Цикл
			Эл[Имя] = Значение;	
		КонецЦикла;	
		Возврат;
	КонецЕсли;
	
	//
	Если ВариантКод.Количество() > 1 И Лев(Элементы.Мероприятия.ТекущийЭлемент.Имя, 18) <> "МероприятияВариант" Тогда
		Вопрос("Необходимо выставить фокус в колонку с результатом!", РежимДиалогаВопрос.ОК);
		Возврат;
	КонецЕсли;
	
	Если ВариантКод.Количество() < 2 Тогда
		Для Каждого Эл Из Объект.Мероприятия Цикл
			Выполнить("Эл.Вариант1 = Истина;");
			Эл.Пометка = Истина;
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Для Каждого Эл Из Объект.Мероприятия Цикл
		Сч = 1;
		Пока Сч <= ВариантКод.Количество() Цикл
			Выполнить("Эл.Вариант" + Формат(Сч, "ЧН=; ЧГ=")+ " = Ложь;");
	        Сч = Сч + 1;
		КонецЦикла;
		
		Выполнить("Эл." + Сред(Элементы.Мероприятия.ТекущийЭлемент.Имя, 12) + " = Истина;");
		Эл.Пометка = Истина;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Эл Из Объект.Мероприятия Цикл
		Сч = 1;
		Пока Сч <= ВариантКод.Количество() Цикл
			Выполнить("Эл.Вариант" + Строка(Сч) + " = Ложь;");
	        Сч = Сч + 1;
		КонецЦикла;
		Эл.Пометка = Ложь;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьОчистку(Элемент, СтандартнаяОбработка)
	Объект.Мероприятия.Очистить();
	ЗаполнитьТаблЧасть();		
КонецПроцедуры


Процедура СтарыйЗапрос()
	Запрос = Новый Запрос();
	Запрос.Текст = 		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               		|	Мероприятие2.Ссылка КАК Ссылка,
	               		|	Мероприятие2.Объект КАК Объект
	               		|ИЗ
	               		|	(ВЫБРАТЬ
	               		|		Мероприятие.Ссылка КАК Ссылка,
	               		|		ВЫБОР
	               		|			КОГДА ТИПЗНАЧЕНИЯ(Мероприятие.Объект) = ТИП(Справочник.ИсполнительныеДокументы)
	               		|					ИЛИ ТИПЗНАЧЕНИЯ(Мероприятие.Объект) = ТИП(Справочник.УслугиПоДоговору)
	               		|				ТОГДА Мероприятие.Объект.Владелец
	               		|			ИНАЧЕ Мероприятие.Объект
	               		|		КОНЕЦ КАК Объект2,
	               		|		МАКСИМУМ(ТипыСотрудников.Глубина) КАК Глубина
	               		|	ИЗ
	               		|		РегистрНакопления.ОбъектыВРаботе.Остатки(
	               		|				,
	               		|				Сотрудник = &Сотрудник
	               		|					ИЛИ Подразделение = &Подразделение) КАК ОбъектыВРаботеОстатки
	               		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	               		|			ПО (ОбъектыВРаботеОстатки.Объект = Мероприятие.Объект
	               		|					ИЛИ ОбъектыВРаботеОстатки.Объект = Мероприятие.Объект.Владелец)
	               		|				И (Мероприятие.Выполнена = ЛОЖЬ)
	               		|				И (НЕ Мероприятие.ПометкаУдаления)
	               		|				И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	               		|					ИЛИ НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления)
	               		|				И (НЕ Мероприятие.ТипМероприятия.НеОтображатьВПланировщике)
	               		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	               		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	               		|				ПО ОтветственныеСотрудники.ТипСотрудника = ТипыСотрудников.Ссылка
	               		|			ПО (ОтветственныеСотрудники.Объект = ОбъектыВРаботеОстатки.Объект)
	               		|	ГДЕ
	               		|		НЕ Мероприятие.ПометкаУдаления
	               		|		И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	               		|				ИЛИ НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления)
	               		|		И (Мероприятие.Ответственный.Родители ПОДОБНО ТипыСотрудников.РодителиШаблон
	               		|				ИЛИ ТИПЗНАЧЕНИЯ(Мероприятие.Ответственный) = ТИП(Справочник.Пользователи))
	               		|	
	               		|	СГРУППИРОВАТЬ ПО
	               		|		Мероприятие.Ссылка,
	               		|		ВЫБОР
	               		|			КОГДА ТИПЗНАЧЕНИЯ(Мероприятие.Объект) = ТИП(Справочник.ИсполнительныеДокументы)
	               		|					ИЛИ ТИПЗНАЧЕНИЯ(Мероприятие.Объект) = ТИП(Справочник.УслугиПоДоговору)
	               		|				ТОГДА Мероприятие.Объект.Владелец
	               		|			ИНАЧЕ Мероприятие.Объект
	               		|		КОНЕЦ) КАК ОтвМакс
	               		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники2
	               		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников2
	               		|			ПО ОтветственныеСотрудники2.ТипСотрудника = ТипыСотрудников2.Ссылка
	               		|		ПО (ОтветственныеСотрудники2.Объект = ОтвМакс.Объект2)
	               		|			И (ТипыСотрудников2.Глубина = ОтвМакс.Глубина)
	               		|			И (&Сотрудник = НЕОПРЕДЕЛЕНО
	               		|				ИЛИ ОтветственныеСотрудники2.Пользователь = &Сотрудник)
	               		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие2
	               		|		ПО ОтвМакс.Ссылка = Мероприятие2.Ссылка
	               		|ГДЕ
	               		|	Мероприятие2.ТипМероприятия = &ТипМероприятия";
						  
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеПретензионногоПисьма(Команда)
	НоваяФорма = ПолучитьФорму("Документ.ФормированиеПретензионногоПисьма.Форма.ФормаДокумента");
	Если ЗначениеЗаполнено(ОбъектыСервер.РазыменоватьСсылку(ТипМероприятия, "ПечатнаяФорма")) Тогда		
		Печатать = ОбъектыСервер.РазыменоватьСсылку(ТипМероприятия, "КнопкаПечать");
		ПрикрепитьФайлы = ОбъектыСервер.РазыменоватьСсылку(ТипМероприятия, "КнопкаПрикрепитьФайл");
		ТекущийШаблон = ОбъектыСервер.РазыменоватьСсылку(ТипМероприятия, "ПечатнаяФорма");
		НоваяФорма.Объект.Шаблон = ТекущийШаблон;
		НоваяФорма.Объект.СоздатьПрикреплениеФайлов = ПрикрепитьФайлы;		
	КонецЕсли;
	ТабЧасть = НоваяФорма.Объект.Объекты;
	Для Каждого Эл Из Объект.Мероприятия Цикл
		Если Эл.Пометка Тогда
			НовСтр                        = ТабЧасть.Добавить();
			НовСтр.Объект                 = Эл.ОбъектТЧСсылка;
			НовСтр.ДоговорКонтрагента     = Эл.ОбъектТЧСсылка;
			НовСтр.ДолговоеОбязательство  = Эл.ОбъектТЧСсылка;
			НовСтр.ИсполнительныйДокумент = Эл.ОбъектТЧСсылка;
			НовСтр.Контрагент             = Эл.ОбъектТЧСсылка;
		КонецЕсли;	
	КонецЦикла;	
	//Чуров
	ОткрытьФорму(НоваяФорма);	
	//НоваяФорма.Открыть();	
КонецПроцедуры

&НаКлиенте
Процедура РасчетПени(Команда)
	НоваяФорма = ПолучитьФорму("Обработка.РасчетПени.Форма");
	ТабЧасть = НоваяФорма.Объект.Объекты;
	Для Каждого Эл Из Объект.Мероприятия Цикл
		Если Эл.Пометка Тогда
			НовСтр                        = ТабЧасть.Добавить();
			НовСтр.Объект                 = Эл.ОбъектТЧСсылка;
			НовСтр.ДоговорКонтрагента     = Эл.ОбъектТЧСсылка;
			НовСтр.ДолговоеОбязательство  = Эл.ОбъектТЧСсылка;
			НовСтр.ИсполнительныйДокумент = Эл.ОбъектТЧСсылка;
			НовСтр.Контрагент             = Эл.ОбъектТЧСсылка;
		КонецЕсли;	
	КонецЦикла;	
	//Чуров
	ОткрытьФорму(НоваяФорма );
	//НоваяФорма.Открыть();	
КонецПроцедуры

&НаКлиенте
Процедура МероприятияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Лев(Поле.Имя, 18) = "МероприятияВариант" Тогда
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли Поле.Имя <> "МероприятияКомментарий" И Лев(Поле.Имя, 17) <> "МероприятияДопРек" Тогда
		Попытка
			Если Сред(Поле.Имя, 12) = "ОбъектТЧ" Тогда
			    ОткрытьЗначение(Элемент.ТекущиеДанные[Сред(Поле.Имя, 12) + "Ссылка"]);
			Иначе
				ОткрытьЗначение(Элемент.ТекущиеДанные[Сред(Поле.Имя, 12)]);
			КонецЕсли;
			СтандартнаяОбработка = Ложь;
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоУчасткамНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Ф = ПолучитьФорму("Обработка.ПакетноеВыполнениеМероприятий.Форма.ФормаВыбораУчастка");
	Ф.СписокУчастков = МассивУчастков;
	МассивУчастков = Ф.ОткрытьМодально();
	ЗаполнитьСтрокуОтбораУчастка();
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьСтрокуОтбораУчастка()
	
	Если ЗначениеЗаполнено(МассивУчастков) Тогда
		ОтборПоУчасткам = "";
		Для Каждого Стр Из МассивУчастков Цикл
			ОтборПоУчасткам = ОтборПоУчасткам + СокрЛП(Строка(Стр.Значение.Код)) + "; "
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоУчасткамОчистка(Элемент, СтандартнаяОбработка)
	
	МассивУчастков.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтборПоГерольдуПриИзменении(Элемент)
	
	ЭтаФорма.Элементы.Группа_ОтборПоГерольду.Видимость = ВключитьОтборПоГерольду;
	ЭтаФорма.Элементы.Мероприятия.ПодчиненныеЭлементы.МероприятияДолжник.Видимость = ВключитьОтборПоГерольду;
	ЭтаФорма.Элементы.Мероприятия.ПодчиненныеЭлементы.МероприятияКодДолжника.Видимость = ВключитьОтборПоГерольду;
	ЭтаФорма.Элементы.Мероприятия.ПодчиненныеЭлементы.МероприятияСуммаДолга.Видимость = ВключитьОтборПоГерольду;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачуДляАвтоинформирвоания(Команда)
	
	М = СоздатьЗадачуДляАвтоинформирвоания_НаСервере();
	
	Ф = ПолучитьФорму("Документ.ЗаданияДляАвтоинформирования.ФормаОбъекта");
	Ф.Объект.Дата = ТекущаяДата();
	Ф.Объект.Автор = ПолучитьПараметрыСеанса().ТекущийПользователь;
	Ф.Объект.Комментарий = "Пакетное выполнение мероприятий";
	Ф.Объект.Организация = ПолучитьПараметрыСеанса().Организация;
	Ф.Объект.ВидКИ = НайтиКИ("000000001");
	
	МассивД = СоздатьЗадачуДляАвтоинформирвоания_НаСервере();
	Для Каждого Стр Из МассивД ЦИкл
		НС = Ф.Объект.Объекты.ДОбавить();
		НС.Объект = Стр;
	КонецЦикла;
	//Чуров
	ОткрытьФорму(Ф);
	//Ф.Открыть();
 
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыСеанса()
	
	С = Новый Структура;
	С.Вставить("ТекущийПользователь",ПараметрыСеанса.ТекущийПользователь);
	С.Вставить("Организация",ПараметрыСеанса.ТекущийПользователь.Организация);
	Возврат С;
	
КонецФункции

&НаСервере
Функция НайтиКИ(Код)
	Возврат Справочники.ПоследовательностиКИ.НайтиПоКоду(Код);
КонецФункции


&НаСервере
Функция СоздатьЗадачуДляАвтоинформирвоания_НаСервере()
	// Формируем таблицу с Дожниками для автоинформирования
	Запрос = Новый Запрос("ВЫБРАТЬ
						|	ТЧ.Должник,
						|	ТЧ.СуммаДолга
						|ПОМЕСТИТЬ ТаблЧасть
						|ИЗ
						|	&ТЧ КАК ТЧ
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ТаблЧасть.Должник КАК Объект,
						|	МАКСИМУМ(ТаблЧасть.СуммаДолга) КАК СуммаДолга
						//|	,&Свойство КАК ВидКИ
						|ИЗ
						|	ТаблЧасть КАК ТаблЧасть
						|
						|СГРУППИРОВАТЬ ПО
						|	ТаблЧасть.Должник");
	Запрос.УстановитьПараметр("ТЧ", Объект.Мероприятия.Выгрузить());	
	Результат = Запрос.Выполнить().Выгрузить();
	М = Результат.ВыгрузитьКолонку("Объект");	
	Возврат М;   	
КонецФункции


&НаКлиенте
Процедура ОбновитьСписок(Команда)
	Сформировать();	
КонецПроцедуры

&НаСервере
Функция ПодобратьШаблон(ТипПисьма)
	Если ТипПисьма.ПечатныеФормы.Количество() > 0 Тогда
		Возврат ТипПисьма.ПечатныеФормы[0].ПечатнаяФорма;
	Иначе 
		Возврат Справочники.тсВидыПечатныхДокументов.ПустаяСсылка();
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ФормированиеИсходящейКорреспонденции(Команда)
	ТипПисьма  = ОбъектыСервер.РазыменоватьСсылку(ТипМероприятия, "ИсходящаяКорреспонденция");
	Если ЗначениеЗаполнено(ТипПисьма) Тогда
		НоваяФорма = ПолучитьФорму("Документ.ПакетноеСозданиеИсходящейКорреспонденции.Форма.ФормаДокумента");
		НоваяФорма.Объект.ТипПисьма = ТипПисьма;
		НоваяФорма.Объект.Шаблон = ПодобратьШаблон(ТипПисьма);
		ТабЧасть = НоваяФорма.Объект.Объекты;
		Для Каждого Эл Из Объект.Мероприятия Цикл
			Если Эл.Пометка Тогда
				НовСтр = ТабЧасть.Добавить();
				НовСтр.Объект = Эл.ОбъектТЧСсылка;
			КонецЕсли;	
		КонецЦикла;	
		ОткрытьФорму(НоваяФорма);		
	Иначе
		Сообщить("Для данного мероприятия не назначен тип письма!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДействияПоОбъектам(Команда)
	//1. Открывать форму
	
	НоваяФорма = ПолучитьФорму("Документ.ДействияПоОбъектам.Форма.ФормаДокумента");
	ТабЧасть = НоваяФорма.Объект.Объекты;
	Для Каждого Эл Из Объект.Мероприятия Цикл
		Если Эл.Пометка Тогда
			НовСтр                        = ТабЧасть.Добавить();
			НовСтр.Объект                 = Эл.ОбъектТЧСсылка;
			НовСтр.ДоговорКонтрагента     = Эл.ОбъектТЧСсылка;
			НовСтр.ДолговоеОбязательство  = Эл.ОбъектТЧСсылка;
			НовСтр.ИсполнительныйДокумент = Эл.ОбъектТЧСсылка;
			НовСтр.Контрагент             = Эл.ОбъектТЧСсылка;
		КонецЕсли;	
	КонецЦикла;	
	//Чуров
	ОткрытьФорму(НоваяФорма);	
	//НоваяФорма.Открыть();	

	
	//2. Если результат предполагает заполнение судебных дел, тогда
	
	//А. Запоминать документ Действие
	
	//Б. Искать все созданные Этим докуметом Суд.дела = Действия по объектам - автор.
	
	//В. Прокидывать созданные СудДела в Мероприятия
КонецПроцедуры
