
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("УправляемаяФорма") Тогда
		Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Справочник.Должники.Форма.ФормаЭлемента" Тогда
			ТаблицаЗначений = ЭтаФорма.ВладелецФормы.ТаблицаЗначенийДолговыхОбязательств;
			ЗаполнитьТабличнуюЧасть(ТаблицаЗначений);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧасть(ТаблицаЗначений)
	Объект.ДолговыеОбязательства.Загрузить(ТаблицаЗначений.Выгрузить());	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие(Команда)	
	Записать();
	ВыполнитьДействиеНаСервере();
	Записать();	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДействиеНаСервере()
	Рекв = РеквизитФормыВЗначение("Объект");
	Рекв.ВыполнитьДействия();
	ЗначениеВРеквизитФормы(Рекв, "Объект");	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектыСервер.ОграничитьТипОбъекта(Элементы.ОбъектыОбъект);
	
	//
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
	
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПолеПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтрокуОбъект(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элементы.ОбъектыОбъект.ВыбиратьТип = (Элементы.Объекты.ТекущиеДанные.Объект = Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Элементы.ОбъектыОбъект.ВыбиратьТип = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры
