
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Скрыть сумму АВ до конца расчетов
	ЭтаФорма.Элементы.АгентскоеВознаграждение.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	// Проверить правильность заполнения и произвести расчет
	Если СуммаПлатежа = 0 ИЛИ ДнейНаДатуПередачи = 0 Тогда
		Предупреждение("Не заданы параметры платежа!");
		Возврат;
	ИначеЕсли КвикМани = Ложь
		И Микроклад = Ложь
		И ПраймЗайм = Ложь
		И ГлавколлектФастМани = Ложь Тогда
		Предупреждение("Не выбран кредитор!");
	ИначеЕсли СуммаПлатежа > 0 И ДнейНаДатуПередачи > 0 Тогда
		ЭтаФорма.Элементы.АгентскоеВознаграждение.Видимость = Истина;
	КонецЕсли;
	
	Если КвикМани = Истина Тогда
		СуммаАВ = СуммаПлатежа * 0.20
	КонецЕсли;
	
	Если Микроклад = Истина и ДнейНаДатуПередачи >= 0 и ДнейНаДатуПередачи <= 15 Тогда
		СуммаАВ = СуммаПлатежа * 0.08
	КонецЕсли;
	Если Микроклад = Истина и ДнейНаДатуПередачи >= 16 и ДнейНаДатуПередачи <= 30 Тогда
		СуммаАВ = СуммаПлатежа * 0.12
	КонецЕсли;
	Если Микроклад = Истина и ДнейНаДатуПередачи >= 31 и ДнейНаДатуПередачи <= 90 Тогда
		СуммаАВ = СуммаПлатежа * 0.16
	КонецЕсли;
	Если Микроклад = Истина и ДнейНаДатуПередачи >= 91 и ДнейНаДатуПередачи <= 120 Тогда
		СуммаАВ = СуммаПлатежа * 0.21
	КонецЕсли;
	Если Микроклад = Истина и ДнейНаДатуПередачи >= 121 и ДнейНаДатуПередачи <= 180 Тогда
		СуммаАВ = СуммаПлатежа * 0.23
	КонецЕсли;
	Если Микроклад = Истина и ДнейНаДатуПередачи >= 181 и ДнейНаДатуПередачи <= 360 Тогда
		СуммаАВ = СуммаПлатежа * 0.25
	КонецЕсли;
	Если Микроклад = Истина и ДнейНаДатуПередачи >= 361 и ДнейНаДатуПередачи <=720 Тогда
		СуммаАВ = СуммаПлатежа * 0.27
	КонецЕсли;
	Если Микроклад = Истина и ДнейНаДатуПередачи >= 721 Тогда
		СуммаАВ = СуммаПлатежа * 0.29
	КонецЕсли;
	
	Если ПраймЗайм = Истина и ДнейНаДатуПередачи >= 15 и ДнейНаДатуПередачи <= 30 Тогда
		СуммаАВ = СуммаПлатежа * 0.09
	КонецЕсли;
	Если ПраймЗайм = Истина и ДнейНаДатуПередачи >= 31 и ДнейНаДатуПередачи <= 65 Тогда
		СуммаАВ = СуммаПлатежа * 0.11
	КонецЕсли;
	Если ПраймЗайм = Истина и ДнейНаДатуПередачи >= 66 и ДнейНаДатуПередачи <= 180 Тогда
		СуммаАВ = СуммаПлатежа * 0.13
	КонецЕсли;
	Если ПраймЗайм = Истина и ДнейНаДатуПередачи >= 181 и ДнейНаДатуПередачи <= 360 Тогда
		СуммаАВ = СуммаПлатежа * 0.25
	КонецЕсли;
	Если ПраймЗайм = Истина и ДнейНаДатуПередачи >= 361 Тогда
		СуммаАВ = СуммаПлатежа * 0.30
	КонецЕсли;
	
	Если ГлавколлектФастМани = Истина и ДнейНаДатуПередачи >= 15 и ДнейНаДатуПередачи <= 60 Тогда
		СуммаАВ = СуммаПлатежа * 0.06
	КонецЕсли;
	Если ГлавколлектФастМани = Истина и ДнейНаДатуПередачи >= 61 и ДнейНаДатуПередачи <= 90 Тогда
		СуммаАВ = СуммаПлатежа * 0.07
	КонецЕсли;
	Если ГлавколлектФастМани = Истина и ДнейНаДатуПередачи >= 91 и ДнейНаДатуПередачи <= 150 Тогда
		СуммаАВ = СуммаПлатежа * 0.10
	КонецЕсли;
	Если ГлавколлектФастМани = Истина и ДнейНаДатуПередачи >= 151 и ДнейНаДатуПередачи <= 180 Тогда
		СуммаАВ = СуммаПлатежа * 0.13
	КонецЕсли;
	Если ГлавколлектФастМани = Истина и ДнейНаДатуПередачи >= 181 и ДнейНаДатуПередачи <= 210 Тогда
		СуммаАВ = СуммаПлатежа * 0.16
	КонецЕсли;
	Если ГлавколлектФастМани = Истина и ДнейНаДатуПередачи >= 211 и ДнейНаДатуПередачи <= 300 Тогда
		СуммаАВ = СуммаПлатежа * 0.20
	КонецЕсли;
	Если ГлавколлектФастМани = Истина и ДнейНаДатуПередачи >= 301 и ДнейНаДатуПередачи <= 360 Тогда
		СуммаАВ = СуммаПлатежа * 0.23
	КонецЕсли; 
	Если ГлавколлектФастМани = Истина и ДнейНаДатуПередачи >= 361 и ДнейНаДатуПередачи <= 720 Тогда
		СуммаАВ = СуммаПлатежа * 0.28
	КонецЕсли;
	Если ГлавколлектФастМани = Истина и ДнейНаДатуПередачи >= 721 Тогда
		СуммаАВ = СуммаПлатежа * 0.33
	КонецЕсли;
	
КонецПроцедуры