
// Для тонкого клиента
&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитаНаСервере(ИмяОбъекта, ИмяРеквизита)
Возврат ИмяОбъекта[ИмяРеквизита];
КонецФункции
//

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Получить код кредитора
	ЭтаФорма.СкрытоеПолеКодКредитора = ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Кредитор, "Код");
	// Установить доступность элементов
	ЭтаФорма.Элементы.ГруппаАгентскоеВознаграждение.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	// Проверить правильность заполнения и произвести расчет
	Если СуммаПлатежа = 0 ИЛИ ДнейНаДатуПередачи = 0 Тогда
		Предупреждение("Не задана сумма платежа!",,"Расчет АВ");
		Возврат;
	ИначеЕсли СуммаПлатежа > 0 И ДнейНаДатуПередачи > 0 Тогда
		ЭтаФорма.Элементы.ГруппаАгентскоеВознаграждение.Доступность = Истина;
	КонецЕсли;
	
	Если ЭтаФорма.СкрытоеПолеКодКредитора = "F00114343"
		И ДнейНаДатуПередачи >= 15 И ДнейНаДатуПередачи <= 60
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000160"
		И ДнейНаДатуПередачи >= 15 И ДнейНаДатуПередачи <= 60
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000236"
		И ДнейНаДатуПередачи >= 15 И ДнейНаДатуПередачи <= 60 Тогда
		СуммаАВ = СуммаПлатежа * 0.06
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00114343"
		И ДнейНаДатуПередачи >= 61 И ДнейНаДатуПередачи <= 90
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000160"
		И ДнейНаДатуПередачи >= 61 И ДнейНаДатуПередачи <= 90
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000236"
		И ДнейНаДатуПередачи >= 61 И ДнейНаДатуПередачи <= 90 Тогда
		СуммаАВ = СуммаПлатежа * 0.07
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00114343"
		И ДнейНаДатуПередачи >= 91 И ДнейНаДатуПередачи <= 150
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000160"
		И ДнейНаДатуПередачи >= 91 И ДнейНаДатуПередачи <= 150
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000236"
		И ДнейНаДатуПередачи >= 91 И ДнейНаДатуПередачи <= 150 Тогда
		СуммаАВ = СуммаПлатежа * 0.10
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00114343"
		И ДнейНаДатуПередачи >= 151 И ДнейНаДатуПередачи <= 180
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000160"
		И ДнейНаДатуПередачи >= 151 И ДнейНаДатуПередачи <= 180
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000236"
		И ДнейНаДатуПередачи >= 151 И ДнейНаДатуПередачи <= 180 Тогда
		СуммаАВ = СуммаПлатежа * 0.13
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00114343"
		И ДнейНаДатуПередачи >= 181 И ДнейНаДатуПередачи <= 210
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000160"
		И ДнейНаДатуПередачи >= 181 И ДнейНаДатуПередачи <= 210
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000236"
		И ДнейНаДатуПередачи >= 181 И ДнейНаДатуПередачи <= 210 Тогда
		СуммаАВ = СуммаПлатежа * 0.16
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00114343"
		И ДнейНаДатуПередачи >= 211 И ДнейНаДатуПередачи <= 300
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000160"
		И ДнейНаДатуПередачи >= 211 И ДнейНаДатуПередачи <= 300
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000236"
		И ДнейНаДатуПередачи >= 211 И ДнейНаДатуПередачи <= 300 Тогда
		СуммаАВ = СуммаПлатежа * 0.20
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00114343"
		И ДнейНаДатуПередачи >= 301 И ДнейНаДатуПередачи <= 360
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000160"
		И ДнейНаДатуПередачи >= 301 И ДнейНаДатуПередачи <= 360
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000236"
		И ДнейНаДатуПередачи >= 301 И ДнейНаДатуПередачи <= 360 Тогда
		СуммаАВ = СуммаПлатежа * 0.23
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00114343"
		И ДнейНаДатуПередачи >= 361 И ДнейНаДатуПередачи <= 720
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000160"
		И ДнейНаДатуПередачи >= 361 И ДнейНаДатуПередачи <= 720
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000236"
		И ДнейНаДатуПередачи >= 361 И ДнейНаДатуПередачи <= 720 Тогда
		СуммаАВ = СуммаПлатежа * 0.28
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00114343"
		И ДнейНаДатуПередачи >= 721
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000160"
		И ДнейНаДатуПередачи >= 721
		ИЛИ ЭтаФорма.СкрытоеПолеКодКредитора = "F00000236"
		И ДнейНаДатуПередачи >= 721 Тогда
		СуммаАВ = СуммаПлатежа * 0.33
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00062598" И ДнейНаДатуПередачи >= 0 И ДнейНаДатуПередачи <= 15 Тогда
		СуммаАВ = СуммаПлатежа * 0.08
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00062598" И ДнейНаДатуПередачи >= 16 И ДнейНаДатуПередачи <= 30 Тогда
		СуммаАВ = СуммаПлатежа * 0.12
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00062598" И ДнейНаДатуПередачи >= 31 И ДнейНаДатуПередачи <= 90 Тогда
		СуммаАВ = СуммаПлатежа * 0.16
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00062598" И ДнейНаДатуПередачи >= 91 И ДнейНаДатуПередачи <= 120 Тогда
		СуммаАВ = СуммаПлатежа * 0.21
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00062598" И ДнейНаДатуПередачи >= 121 И ДнейНаДатуПередачи <= 180 Тогда
		СуммаАВ = СуммаПлатежа * 0.23
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00062598" И ДнейНаДатуПередачи >= 181 И ДнейНаДатуПередачи <= 360 Тогда
		СуммаАВ = СуммаПлатежа * 0.25
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00062598" И ДнейНаДатуПередачи >= 361 И ДнейНаДатуПередачи <=720 Тогда
		СуммаАВ = СуммаПлатежа * 0.27
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00062598" И ДнейНаДатуПередачи >= 721 Тогда
		СуммаАВ = СуммаПлатежа * 0.29
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00001401" = Истина Тогда
		СуммаАВ = СуммаПлатежа * 0.20
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00000091" И ДнейНаДатуПередачи >= 15 И ДнейНаДатуПередачи <= 30 Тогда
		СуммаАВ = СуммаПлатежа * 0.09
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00000091" И ДнейНаДатуПередачи >= 31 И ДнейНаДатуПередачи <= 65 Тогда
		СуммаАВ = СуммаПлатежа * 0.11
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00000091" = Истина И ДнейНаДатуПередачи >= 66 И ДнейНаДатуПередачи <= 180 Тогда
		СуммаАВ = СуммаПлатежа * 0.13
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00000091" И ДнейНаДатуПередачи >= 181 И ДнейНаДатуПередачи <= 360 Тогда
		СуммаАВ = СуммаПлатежа * 0.25
		
	ИначеЕсли ЭтаФорма.СкрытоеПолеКодКредитора = "F00000091" И ДнейНаДатуПередачи >= 361 Тогда
		СуммаАВ = СуммаПлатежа * 0.30
		
	Иначе
		ЭтаФорма.Элементы.ГруппаАгентскоеВознаграждение.Доступность = Ложь;
		Предупреждение("Выбран неверный объект расчета!",,"Расчет АВ");
	КонецЕсли;	
КонецПроцедуры