
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Владелец = Неопределено;
	Если Параметры.Отбор.Свойство("Владелец", Владелец) И ЗначениеЗаполнено(Владелец) Тогда
		Элементы.Ссылка.Заголовок = Владелец.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	ПроверитьВозможностьВыбора(Элемент, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ПроверитьВозможностьВыбора(Элемент, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьВыбора(Элемент, СтандартнаяОбработка)	
	Если Элемент.ТекущиеДанные <> Неопределено И 
			ОбъектыСервер.РазыменоватьСсылку(Элемент.ТекущиеДанные.Ссылка, "ЭтоГруппа") Тогда
		СтандартнаяОбработка = Ложь;
		//Чуров
		ПоказатьПредупреждение(,НСтр("ru = 'Выбор групп значений не поддерживается'"));
		//Предупреждение(НСтр("ru = 'Выбор групп значений не поддерживается'"));
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	Попытка
		Значение = ЭтаФорма.ВладелецФормы.Родитель.ТекущиеДанные.Наименование;
		Если Не (ТипЗнч(Значение) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения")) Тогда
			Значение = Неопределено;
		КонецЕсли;
	Исключение
		Значение = Неопределено;
	КонецПопытки;
	
	Если ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("ТаблицаФормы") Тогда
		Значение = ЭтаФорма.ВладелецФормы.ТекущиеДанные.Свойство;	
	КонецЕсли;
	
	Если Значение <> Неопределено Тогда
		УстановитьОтбор("Владелец", Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор(Поле, Значение)
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(Поле);
	Если Список.Отбор.Элементы.Количество() = 0 Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки;
	КонецЕсли;	 
	Для Каждого ЭлементОтбораСобытий Из Список.Отбор.Элементы Цикл		
		Если ЭлементОтбораСобытий.ЛевоеЗначение = ПолеКомпоновки Тогда
			ЭлементОтбораСобытий.ПравоеЗначение = Значение;
			ЭлементОтбораСобытий.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбораСобытий.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
