
#Область СлужебныйПрограммныйИнтерфейс

Процедура Вывести(Запись) Экспорт

	Действие = ДанныеДействия(Запись);
	ВывестиСообщение(Действие, Запись["Текст"]);

КонецПроцедуры

Функция ТекстСообщения(Запись) Экспорт

	Возврат ФорматированныйТекст(Запись);

КонецФункции // ()

Процедура Записать(Запись) Экспорт

	Вывести(Запись);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДействия(Запись)

	Возврат Формат(Запись["Дата"], "ДФ='yyyy-MM-dd HH:mm:ss'") + " | " + Запись["Статус"];

КонецФункции // ()

Функция ФорматированныйТекст(Запись)

	Возврат СтрШаблон(
		"[%1] [%2] - %3",
		Формат(Запись["Дата"], "ДФ='yyyy-MM-dd HH:mm:ss'"),
		Запись["Статус"],
		Запись["Текст"]
	);

КонецФункции // ()

Функция ВывестиСообщение(Действие, Текст)

	УправленияСообщениямиКлиентСервер.СообщениеЛогер(
		Действие,
		Текст
	);

КонецФункции // ()

#КонецОбласти