
// Для работы в режиме тонкого клиента

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитаНаСервере(ИмяОбъекта, ИмяРеквизита)
Возврат ИмяОбъекта[ИмяРеквизита];
КонецФункции

//

// Получить значения с сервера

&НаСервере
Процедура ПриОткрытииНаСервере(Отказ)
	ЭтаФорма.РольРКЦ = РольДоступна("РКЦ");
	ЭтаФорма.РольАБД = РольДоступна("АБД");
	ДО = ЭтаФорма.Объект;
	Архив = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Архив");
	Категория = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО, "0181");
	Если Категория = Архив Тогда
		ЭтаФорма.ПредупреждениеАрхив = Истина;
	КонецЕсли;
КонецПроцедуры

//

// Клиентская процедура при открытии формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Проверить состояние блокировки
	Если ЭтаФорма.Доступность = Ложь Тогда
		ЭтаФорма.Закрыть();
		ПоказатьОповещениеПользователя("Договор заблокирован",,"Договор уже открыт другим сотрудником", БиблиотекаКартинок.NC_Заблокировано);
	КонецЕсли;
	ПриОткрытииНаСервере(Отказ);
	// Проверка на архив
	Если ЭтаФорма.ПредупреждениеАрхив = Истина Тогда
		Предупреждение("Договор в архиве",,"Предупреждение");
		Если ЭтаФорма.РольРКЦ = Ложь И ЭтаФорма.РольАБД = Ложь Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	// Отобрать историю работы
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.АктыПередачи, "Объекты.Объект", ЭтаФорма.Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.АктыПередачи, "СотрудникПередающий",, ВидСравненияКомпоновкиДанных.Заполнено, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.АктыПередачи, "СотрудникПринимающий",, ВидСравненияКомпоновкиДанных.Заполнено, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	// Отобрать файлы
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.Файлы, "Объект", ЭтаФорма.Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	// Отобрать документы
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.ЗапросыДокументов, "Договор", ЭтаФорма.Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	// Отобрать ИП
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.НайденныеИП, "Должник", ЭтаФорма.Объект.Должник, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	// Отобрать банкротные дела
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.НайденныеДелаОБанкротстве, "Должник", ЭтаФорма.Объект.Должник, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	// Отобрать условия
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.ДисконтИРестрктуризация, "Договор", ЭтаФорма.Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	// Отобрать события КИ
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.СобытияКИ, "Сделка", ЭтаФорма.Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );	
	// Отобрать отчеты КИ
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.ЖурналВыгрузокНБКИ, "ОбъектУчета", ЭтаФорма.Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
	// Проверить доступность служебных функций
	Если ЭтаФорма.РольРКЦ = Ложь И ЭтаФорма.РольАБД = Ложь Тогда
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаГруппаСлужебные.Доступность = Ложь;
	КонецЕсли;
	Если ЭтаФорма.РольАБД = Ложь Тогда
		ЭтаФорма.Элементы.СобытияКИ.Доступность = Ложь;
		ЭтаФорма.Элементы.ЖурналВыгрузокНБКИ.Доступность = Ложь;
	КонецЕсли;
	Если ЭтаФорма.РольРКЦ = Ложь И ЭтаФорма.РольАБД = Ложь Тогда
		ЭтаФорма.Элементы.Наименование.ТолькоПросмотр = Истина;
		ЭтаФорма.Элементы.Должник.ТолькоПросмотр = Истина;
		ЭтаФорма.Элементы.Кредитор.ТолькоПросмотр = Истина;
		ЭтаФорма.Элементы.ТипДолговогоОбязательства.ТолькоПросмотр = Истина;
		ЭтаФорма.Элементы.ВалютаДоговора.ТолькоПросмотр = Истина;
	КонецЕсли;
	// Запросить информацию о ДоБ из реестров
	Если ЕстьДоБ() Или ЕстьИП() Тогда
		ПоказатьОповещениеПользователя("Розыск должника",,"Есть банкротство или ИП",БиблиотекаКартинок.NC_Предупреждение);
	КонецЕсли;
КонецПроцедуры

//

Функция ЕстьДоБ()
	Возврат ЭтаФорма.Объект.Должник.ЕстьДоБ;
КонецФункции

Функция ЕстьИП()
	Возврат ЭтаФорма.Объект.Должник.ЕстьИП;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

//ГруппаСтадии = ЭтаФорма.Элементы.Добавить("Стадиипроизводства", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ГруппаСтадииПроизводства);

#Область Стандартные

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтоНовыйОбъект = Параметры.Ключ.Пустая();
	
	Если ЭтоНовыйОбъект Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
	
	ДополнительныеРеквизиты.Загрузить(Объект.ДополнительныеРеквизиты.Выгрузить());
	Если Не Константы.УчетПоСтадиям.Получить() Тогда
		УправлениеЗаполнением.ДобавитьДополнительныеРеквизиты(ЭтаФорма);
	Иначе
		СтадииПроизводства.ДобавитьСтадииПроизводства(ЭтаФорма);
		СтадииПроизводства.ДобавитьДополнительныеРеквизиты(ЭтаФорма);
	КонецЕсли;

	ВладельцыДО = ПолучитьИменаРеквизитовВладельцев();
	Для каждого ВладелецДО Из ВладельцыДО Цикл
	
		НастройкаРедактированияТекстаВладельцев(ВладелецДО);
	
	КонецЦикла;
	
	// Не используется?
	Услуга = ?(Объект.Услуги.Количество() > 1, Объект.ВладелецУслуга, Объект.Услуга);	
	Элементы.Услуга.РедактированиеТекста = (Объект.Услуги.Количество() <= 1);
	
	Элементы.Услуга.Видимость = Константы.УчетПоУслугам.Получить();
	Элементы.События.Видимость = Не Константы.УчетПоСтадиям.Получить();
	
	УстановитьОтбор("Объект", Объект.Ссылка);
	
	// Переменная управляет вариантом отчета по ДО. По умолчанию - "Истина"
	НовыйВид = Ложь;
	ЗаполнитьТабличныйДокумент();
	ДолжникТелефоны.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Должник);
	
	Если Не Объект.Ссылка.Пустая() И Не КонтрольСобытий.ДоступностьДанных(Объект.Ссылка) Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		// Необновляемая область
		Элементы.ФормаДолжникТелефоныИсходящийЗвонокТЧ.Доступность = Ложь;
		Элементы.ФормаДолжникТелефоныОтправитьСМС.Доступность = Ложь;
		//
	КонецЕсли;
		
	ДС_ИсполнительныеПроизводства.Параметры.УстановитьЗначениеПараметра("ДолговоеОбязательствоИП", Объект.Ссылка);
	
	ИспользоватьФССП = Константы.ИспользоватьИнтеграциюФССП.Получить();
	Если НЕ ИспользоватьФССП Тогда
		Элементы.ГруппаИсполПроизводство.Видимость = Ложь;
		Элементы.ФормаЗапросВФССП.Видимость = Ложь;
	КонецЕсли;
	
	КонстантаРН = Константы.РасчетНачислений.Получить();
	ПоказыватьРасчетныеДанные = РасчетЗадолженностиМФО_Переопределяемый.ПроизводитьРасчетыПоДанномуДолговомуОбязательству(Объект.Ссылка);
	ОтображатьРасчетныеДанные = КонстантаРН И ПоказыватьРасчетныеДанные;
	
	Если Не ОтображатьРасчетныеДанные Тогда
		Элементы.ГруппаРасчетныеДанные.Видимость = Ложь;
	КонецЕсли;
	Если ОтображатьРасчетныеДанные Тогда
		РасчетЗадолженностиМФО.ЗаполнитьДекорацииОбъекта(ЭтаФорма);
	КонецЕсли;
	
	ИспользоватьБанкротство = Константы.ИспользоватьИнтеграциюФедРесурсБанкротство.Получить();
	Если НЕ ИспользоватьБанкротство Тогда
		Элементы.ФормаЗапросНаБанкротство.Видимость = Ложь;
	КонецЕсли;
	Если НЕ Объект.Должник.ЕстьДанныеОБанкротстве Тогда
		Элементы.ГруппаДанныеОБанкротстве.Видимость = Ложь;
	Иначе
		ДС_ДанныеОБанкротстве.Параметры.УстановитьЗначениеПараметра("Контрагент",Объект.Должник);
	КонецЕсли;
	
	// Cчитает количество дней в агенстве и общее количество дней по задолженности
	ДатаПередачиВАгентство = ОбъектыСервер.ПолучитьЗначениеСвойства(Объект,"0138     ");
	Если ДатаПередачиВАгентство <> Неопределено И ДатаПередачиВАгентство <> Дата("00010101") Тогда
	
		Значение = (НачалоДня(ТекущаяДата()) - НачалоДня(ДатаПередачиВАгентство))/(3600 * 24);
		ОбъектыСервер.ЗаписатьЗначениеСвойства(Объект.Ссылка,"0140     ", Значение);
	    ДнейПросрочки = ОбъектыСервер.ПолучитьЗначениеСвойства(Объект, "0139     ");
		Если ДнейПросрочки <> Неопределено Тогда
			ВсегоДней = ДнейПросрочки + Значение;
			ОбъектыСервер.ЗаписатьЗначениеСвойства(Объект.Ссылка,"0141     ", ВсегоДней);
		КонецЕсли;
	Иначе
		ОбъектыСервер.ЗаписатьЗначениеСвойства(Объект.Ссылка,"0141     ", 0);
		ОбъектыСервер.ЗаписатьЗначениеСвойства(Объект.Ссылка,"0140     ", 0);
	КонецЕсли;
	//
	// Заблокировать мероприятие для редактирования другими пользователями
	Попытка
		ЭтаФорма.ЗаблокироватьДанныеФормыДляРедактирования();
	Исключение
		ЭтаФорма.Доступность = Ложь;
	КонецПопытки;
КонецПроцедуры
#КонецОбласти

#Область НастройкаЭлементовФормы

Процедура НастройкаРедактированияТекстаВладельцев(ИмяРеквизита)

	КолВо = Объект.Контрагенты.НайтиСтроки(
		Новый Структура("ВидКонтрагента", Перечисления.ВидыКонтрагентов[ИмяРеквизита])
	).Количество();
	ЭтаФорма[ИмяРеквизита] = ?(
		КолВо > 1,
		Объект["Владелец" + ИмяРеквизита],
		Объект[ИмяРеквизита]
	);
	Элементы[ИмяРеквизита].РедактированиеТекста = (КолВо <= 1);

КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьИПпоДО(Долговое)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФССП_ИсполнительноеПроизводство.Ссылка КАК НомерИП,
	                      |	ФССП_СостояниеИПСрезПоследних.ДатаВозбуждения КАК ДатаВозбуждения,
	                      |	ФССП_СостояниеИПСрезПоследних.СтатусИП КАК СтатусИП,
	                      |	ФССП_СостояниеИПСрезПоследних.ОтделСудебныхПриставов КАК ОтделСудебныхПриставов,
	                      |	ФССП_СостояниеИПСрезПоследних.СудебныйПриставИсполнитель КАК СудебныйПриставИсполнитель
	                      |ИЗ
	                      |	Справочник.ФССП_ИсполнительноеПроизводство КАК ФССП_ИсполнительноеПроизводство
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФССП_СостояниеИП.СрезПоследних(&ТекущаяДата) КАК ФССП_СостояниеИПСрезПоследних
	                      |		ПО ФССП_СостояниеИПСрезПоследних.ИП = ФССП_ИсполнительноеПроизводство.Ссылка
	                      |ГДЕ
	                      |	ФССП_ИсполнительноеПроизводство.ПометкаУдаления = ЛОЖЬ
	                      |	И ФССП_ИсполнительноеПроизводство.УдалитьДолговоеОбязательствоИП = &ДолговоеОбязательствоИП");
	Запрос.УстановитьПараметр("ДолговоеОбязательствоИП", Долговое);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Выборка = Запрос.Выполнить().Выгрузить();
	Возврат Выборка;
		
КонецФункции


&НаСервере
Процедура ЗаполнитьТабличныйДокумент() 
	Если НовыйВид И Константы.ИспользоватьСудебныйБлок.Получить() Тогда
		
		ВыводимыеОтчеты = ПолучитьВыводимыеОтчеты();
		
		Для каждого ВыводимыйОтчет Из ВыводимыеОтчеты Цикл
			
			ДанныеВывода = ВыводимыйОтчет.Ключ;
			Если ДанныеВывода <> Справочники.ХранилищеВнешнихОтчетов.ПустаяСсылка() Тогда
				
				ДокументВывода = ВыводимыйОтчет.Значение;
				ВывестиОтчетВТабличныйДокумент(ДокументВывода, ДанныеВывода.ИмяОтчета);
				
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		
		ОбъектыСервер.ЗаполнитьОтчетОбъекта(Объект.Ссылка, ТабличныйДокумент, Константы.ОтчетДляДО);	
	КонецЕсли;
КонецПроцедуры

Процедура ВывестиОтчетВТабличныйДокумент(ЗаполняемыйТД, ИмяОтчета)

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ДолговоеОбязательство", Объект.Ссылка);

	ЭтаФорма[ЗаполняемыйТД] = УправлениеСКД.ПолучитьТабличныйДокумент(
		ИмяОтчета,
		"ОсновнаяСхемаКомпоновкиДанных",
		ПараметрыОтчета
	);
	
	РазмерыДиаграмм = ПолучитьРазмерыДиаграмм();
	ЗадатьРазмерДиаграммы(
		ЭтаФорма[ЗаполняемыйТД],
		РазмерыДиаграмм["Ширина"],
		РазмерыДиаграмм["Высота"]
	);

КонецПроцедуры

&НаСервере
Процедура ЗадатьРазмерДиаграммы(ТабличныйДокументСДиаграммой, Ширина, Высота)

	Для каждого Рисунок Из ТабличныйДокументСДиаграммой.Рисунки Цикл
	
		Если Строка(Рисунок.ТипРисунка) = "Диаграмма" Тогда
		
			Рисунок.Ширина = Ширина;
			Рисунок.Высота = Высота;
		
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор(Поле, Значение, Использование = Истина)
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(Поле);
	Для Каждого ЭлементОтбораСобытий Из События.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбораСобытий.ЛевоеЗначение = ПолеКомпоновки Тогда
			Если ЭлементОтбораСобытий.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
				Запрос = Новый Запрос("ВЫБРАТЬ
				                      |	ИсполнительныеДокументы.Ссылка
				                      |ИЗ
				                      |	Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
				                      |ГДЕ
				                      |	ИсполнительныеДокументы.Владелец = &ДО");
				Запрос.УстановитьПараметр("ДО", Значение);
				Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
				Массив.Добавить(Значение);
				
				ЭлементОтбораСобытий.ПравоеЗначение = Массив;
			Иначе
				ЭлементОтбораСобытий.ПравоеЗначение = Значение;
			КонецЕсли;
			
			Если Использование <> Неопределено Тогда
				ЭлементОтбораСобытий.Использование = Использование;
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущуюЗадолженность()
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.НадписьТекущийОстаток.Видимость = Ложь;
	Иначе
		Элементы.НадписьТекущийОстаток.Видимость = Истина;
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗадолженностьПоДолговомуОбязательствуОстатки.СуммаРеглОстаток,
		                      |	ЗадолженностьПоДолговомуОбязательствуОстатки.СуммаДООстаток
		                      |ИЗ
		                      |	РегистрНакопления.ЗадолженностьПоДолговомуОбязательству.Остатки(&ТекущаяДата, ДолговоеОбязательство = &ДолговоеОбязательство) КАК ЗадолженностьПоДолговомуОбязательствуОстатки");
		Запрос.УстановитьПараметр("ДолговоеОбязательство", Объект.Ссылка);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			СуммаРеглОстаток = Результат.СуммаРеглОстаток;
			СуммаДООстаток = Результат.СуммаДООстаток;
		Иначе
			СуммаРеглОстаток = 0;
			СуммаДООстаток = 0;
		КонецЕсли;
		
		Элементы.НадписьТекущийОстаток.Заголовок = "Текущая задолженность: " + СуммаРеглОстаток + " " + 
				Константы.ВалютаРегламентированногоУчета.Получить().Наименование;
		Если Объект.ВалютаДоговора <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда
			Элементы.НадписьТекущийОстаток.Заголовок = Элементы.НадписьТекущийОстаток.Заголовок + "  (" + 
					СуммаДООстаток + " " + Объект.ВалютаДоговора.Наименование + ")";
		КонецЕсли;
		Элементы.НадписьТекущийОстаток.Заголовок = Элементы.НадписьТекущийОстаток.Заголовок + ";";		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	УправлениеСвойствами.ПередЗаписьюНаСервере2(ЭтаФорма, ТекущийОбъект, Отказ);
	УправлениеСвойствами.КонтрольУникальности(Справочники.ДолговыеОбязательства, ТекущийОбъект, "Наименование", ТекущийОбъект.Наименование, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧат(Команда)
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить(
		"Клиент",
		Объект.Ссылка);
	
	ОткрытьФорму(
		"Обработка.ИсторияЧатов.Форма",
		ПараметрыДиалога,
		,
		ПараметрыДиалога["Клиент"].УникальныйИдентификатор());
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ МЕХАНИЗМА СВОЙСТВ

&НаСервере
Функция ПолучитьТекущегоПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаКлиенте
Процедура ТипДолговогоОбязательстваПриИзменении(Элемент)
	ДобавитьДополнительныеРеквизиты();
КонецПроцедуры

&НаСервере
Процедура ДобавитьДополнительныеРеквизиты()

	СтадииПроизводства.ДобавитьДополнительныеРеквизиты(ЭтаФорма);
КонецПроцедуры

// Удаленная процедура ИсходящийЗвонок(Команда)

&НаКлиенте
Процедура СобытияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//ОткрытьЗначение(Элемент.ТекущиеДанные[Поле.Имя]);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//ОбъектыКлиент.ОбщаяДополнительныеРеквизитыНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка,ДополнительныеРеквизиты,ЭтаФорма);
	Свойство = Неопределено;
	СвойствоВидСтроки = Неопределено;
	Код = Сред(Элемент.Имя, Найти(Элемент.Имя, "_") + 1);
	УправлениеСвойствами.ПолучитьСвойствоПоКоду(СтрЗаменить(Код, "_", " "), Свойство, СвойствоВидСтроки);
	
	Если СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Адрес") ИЛИ
			СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Телефон") Тогда
	    Строки = ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Свойство));
		ТекСтрокаПараметры = Строки[0].Параметры;
						
		СписокСтрок = СтрЗаменить(ТекСтрокаПараметры, ";", Символы.ПС);
		ЗначенияПолей = Новый СписокЗначений();
		Если СтрЧислоСтрок(СписокСтрок) > 1 Тогда
			Для Индекс = 1 По СтрЧислоСтрок(СписокСтрок) Цикл
				Стр = СтрПолучитьСтроку(СписокСтрок, Индекс);
				Если Стр <> "" Тогда 
					СписокПодстрок = СтрЗаменить(Стр, "=", Символы.ПС);
					ЗначенияПолей.Добавить(СтрПолучитьСтроку(СписокПодстрок, 2), СтрПолучитьСтроку(СписокПодстрок, 1));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;			
		Если СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Адрес") Тогда
			ИмяФормыРедактирования = "ОбщаяФорма.ВводАдреса";
		ИначеЕсли СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.Телефон") Тогда
			ИмяФормыРедактирования = "ОбщаяФорма.ВводТелефона";
		КонецЕсли;
			
		Пар = Новый Структура;
		Пар.Вставить("ЗначенияПолей",                ЗначенияПолей);
		Пар.Вставить("Вид",                          ""); //"Адрес");
		Пар.Вставить("БылиВнесеныИзменения",         Ложь);
		Пар.Вставить("Представление",                Элемент.ТекстРедактирования);
		Пар.Вставить("РедактированиеТолькоВДиалоге", Не Элемент.РедактированиеТекста);
		Пар.Вставить("АдресТолькоРоссийский",        Ложь);
			
		//Чуров
		Результат = ОткрытьФорму(ИмяФормыРедактирования, Пар);	
		//Результат = ОткрытьФормуМодально(ИмяФормыРедактирования, Пар);	
		Если ТипЗнч(Результат) = Тип("Структура") Тогда
			Строки[0].Значение = Результат.Представление;
			ЭтаФорма[Элемент.Имя] = Результат.Представление;
			ЗначенияПолей = Результат.ЗначенияПолей;
			Модифицированность = Истина;
			
			РезультатЗначение = "";
			Для Каждого Элемент Из ЗначенияПолей Цикл
				РезультатЗначение = РезультатЗначение + Элемент.Представление + "=" + Элемент.Значение + ";"; 
			КонецЦикла;
			
			Строки[0].Параметры = РезультатЗначение;
		КонецЕсли;
	ИначеЕсли СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.АдресФИАС") Тогда 
		
		Строки = ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Свойство)); 
		ТекСтрока = Строки[0]; 
		
		ИмяФормыРедактирования = "Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса"; 
		Если ТекСтрока.Параметры = "" Тогда 
			ЗнПолей = ""; 
		Иначе 
			ЗнПолей = бит_АдресныйКлассификатор.ПолучитьJSONИзXML(ТекСтрока.Параметры); 
		КонецЕсли; 
		Пар = Новый Структура; 
		Пар.Вставить("ЗначенияПолей", ЗнПолей); 
		Пар.Вставить("Вид", ""); //"Адрес"); 
		Пар.Вставить("БылиВнесеныИзменения", Ложь); 
		Пар.Вставить("Представление", Элемент.ТекстРедактирования); 
		Пар.Вставить("РедактированиеТолькоВДиалоге", Не Элемент.РедактированиеТекста); 
		Пар.Вставить("АдресТолькоРоссийский", Ложь); 
		
		Результат = ОткрытьФормуМодально(ИмяФормыРедактирования, Пар); 
		
		Если ТипЗнч(Результат) = Тип("Структура") Тогда 
			Строки[0].Значение = Результат.Представление; 
			ЭтаФорма[Элемент.Имя] = Результат.Представление; 
			Модифицированность = Истина; 
			СтрокаJSON = Результат.Значение; 
			
			Если СтрокаJSON = "" Тогда 
				СтрокаJSON = бит_АдресныйКлассификатор.ПолучитьJSONИзXML(СтрокаJSON); 
			КонецЕсли; 
			
			Строки[0].Параметры = бит_АдресныйКлассификатор.ПолучитьСтрокуXML(СтрокаJSON); 
		КонецЕсли;
		
	ИначеЕсли СвойствоВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыТипаСтрока.ПутьКФайлу") Тогда	
		#Если Не ВебКлиент Тогда
			СтандартнаяОбработка = Ложь;
			Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
			Диалог.Заголовок = "Выберите файл";
			Диалог.ПолноеИмяФайла = ЭтаФорма[Элемент.Имя];
			Диалог.МножественныйВыбор = Ложь;
			Если Диалог.Выбрать() Тогда
				ЭтаФорма[Элемент.Имя] = Диалог.ПолноеИмяФайла;
			КонецЕсли;	
		#Иначе	
			СтандартнаяОбработка = Ложь;
			Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
			Диалог.Заголовок = "Выберите файл";
			Диалог.ПолноеИмяФайла = ЭтаФорма[Элемент.Имя];
			//Фильтр = "EXE (*.exe)|*.exe"; 
			//Диалог.Фильтр = Фильтр; 
			Диалог.МножественныйВыбор = Ложь;
			//Диалог.Каталог = "F:\";
			Диалог.Показать(Новый ОписаниеОповещения("ДополнительныеРеквизитыНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Диалог, Элемент", Диалог, Элемент)));
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	Элемент = ДополнительныеПараметры.Элемент;
	
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ЭтаФорма[Элемент.Имя] = Диалог.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаЗапуска = "";
	Попытка
		Стр = СтрЗаменить(Элемент.Имя, "Реквизит_", "РеквизитСвойство_");
		Строки = ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Вычислить(Стр)));	
	Исключение		
		Стр = СтрЗаменить(Элемент.Имя, "Реквизит_", "РеквизитСвойство_");
		Строки = ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ОбъектыСервер.ПолучитьДопРиСПоКоду(
				СтрЗаменить(Сред(Элемент.Имя, 10), "_", " "))));
	КонецПопытки;
	Если Строки.Количество() > 0 Тогда
		СтрокаЗапуска = Строки[0].Значение;
	КонецЕсли;
		
	Попытка
		ЗапуститьПриложение(СтрокаЗапуска);
	Исключение
		#Если ВебКлиент Тогда
			ПоказатьЗначение(,СтрокаЗапуска);
		#КонецЕсли
		//Чуров
		//ПоказатьЗначение(,СтрокаЗапуска);
		ОткрытьЗначение(СтрокаЗапуска);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ВладелецПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ВладелецПриИзмененииНаСервере()
	Объект.Организация = Объект.Владелец.Организация;
	Объект.Контрагент = Объект.Владелец.Контрагент;
	Если Объект.Владелец.ЮрФизЛицо = Справочники.ЮрФизЛицо.ЮрЛицо Тогда
		Объект.ТипДолговогоОбязательства = Справочники.ТипыДолговыхОбязательств.СЮрЛицом;
	ИначеЕсли
		Объект.Владелец.ЮрФизЛицо = Справочники.ЮрФизЛицо.ФизЛицо Тогда
		Объект.ТипДолговогоОбязательства = Справочники.ТипыДолговыхОбязательств.СФизЛицом;
	КонецЕсли;
	
	ДополнительныеРеквизиты.Загрузить(Объект.ДополнительныеРеквизиты.Выгрузить());	
	УправлениеЗаполнением.ДобавитьДополнительныеРеквизиты(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьУЭД(Команда)
	#Если Вебклиент Тогда
		Сообщить("Данные функционал недоступен на Веб-Клиенте!");
	#Иначе	
		ОткрытиеФормКлиент.ОткрытьФормуПечати(ЭтаФорма, Объект.Ссылка);
	#КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//////ЗаполнитьТекущуюЗадолженность();
	
	Если ЭтоНовыйОбъект И Константы.ДетализацияПоДО.Получить() Тогда
		//Принятие в работу Организации
		ДокОбъект = Документы.ПринятиеВРаботуОрганизации.СоздатьДокумент();	
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		ДокОбъект.Автор = УдалитьОбщегоНазначения.ТекущийПользователь();		
		ДокОбъект.Организация = ДокОбъект.Автор.Организация;

		ДокОбъект.Объекты.Добавить().Объект = ТекущийОбъект.Ссылка;
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(ОписаниеОшибки());
			Отказ = Истина;
			Возврат;
		КонецПопытки;
				
		ЭтоНовыйОбъект = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВыгрузитьТаблицу(ИмяТаблицы)
	Результат = Неопределено;
	Выполнить("Результат = Объект." + ИмяТаблицы + ".Выгрузить();");
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗагрузитьТаблицу(ИмяТаблицы, ТаблицаЗначений)
	Выполнить("Объект." + ИмяТаблицы + ".Загрузить(ТаблицаЗначений);");
	Модифицированность = Истина;
КонецПроцедуры

/////////////
&НаКлиенте
Функция ПроверитьТаблицу(Имя)
	МнЧисло = ПолучитьМножественноеЧисло(Имя);	
	Стр = Неопределено;
	Если Имя <> "Услуга" Тогда
		Выполнить("Стр = Новый Структура(""ВидКонтрагента"", ПредопределенноеЗначение(""Перечисление.ВидыКонтрагентов." +
				Имя + """));"); 
		ТЗ = Объект.Контрагенты.НайтиСтроки(Стр);
	Иначе
		ТЗ = Объект.Услуги;
	КонецЕсли;
	
			
	Если ТЗ.Количество() > 1 Тогда
		Выполнить("Элементы." + Имя + ".РедактированиеТекста = Ложь;");
		Стр = "";	
		Для Каждого Элемент Из ТЗ Цикл
			Стр = Стр + "; " + Строка(Элемент.Значение); //По хорошему надо разъименовать до Наименования, 
					                                     // но на сервер не охото ходить, поидее так сойдет
		КонецЦикла; 
		Выполнить("Объект." + Имя + " = ТЗ[0].Значение;");
		Возврат Сред(Стр, 3);
		
	ИначеЕсли ТЗ.Количество() = 1 Тогда
		Выполнить("Элементы." + Имя + ".РедактированиеТекста = Истина;");
		Выполнить("Объект." + Имя + " = ТЗ[0].Значение;");
        Возврат ТЗ[0].Значение;
		
	Иначе 
		Выполнить("Элементы." + Имя + ".РедактированиеТекста = Истина;");
		ИмяСправочника = ПолучитьИмяСтравочника(Имя);  
		Выполнить("Объект." + Имя + " = ПредопределенноеЗначение(""Справочник." + ИмяСправочника + ".ПустаяСсылка"");");
		Возврат ПредопределенноеЗначение("Справочник." + ИмяСправочника + ".ПустаяСсылка");
	КонецЕсли;	
КонецФункции

/////////////
&НаКлиенте
Процедура ПолеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	МнЧисло = ПолучитьМножественноеЧисло(Элемент.Имя);
	ИмяСправочника = ПолучитьИмяСтравочника(Элемент.Имя);
	
	Если ИмяСправочника <> "УслугиПоДоговору" Тогда	
		Стр = Неопределено;                                 
		Выполнить("Стр = Новый Структура(""ВидКонтрагента"", ПредопределенноеЗначение(""Перечисление.ВидыКонтрагентов." + 
				Элемент.Имя + """));");
		Строки = Объект.Контрагенты.НайтиСтроки(Стр);
		Массив = Новый Массив();
		Для Каждого Элем Из Строки Цикл
			Массив.Добавить(Элем.Значение);
		КонецЦикла;	
		
		ПараметрыФормы = Новый Структура("Таблица, Имя, ИмяТипа", Массив, Элемент.Имя, 
				"СправочникСсылка." + ИмяСправочника);
		
		Форма = ПолучитьФорму("Справочник.ДолговыеОбязательства.Форма.ФормаНабора", ПараметрыФормы);
		//Чуров
		Результат = ОткрытьФорму(Форма);
		//Результат = Форма.ОткрытьМодально();

		Если Результат <> Неопределено Тогда
			МнЧисло = ПолучитьМножественноеЧисло(Элемент.Имя);
			
			Для Каждого Элем Из Строки Цикл
				Объект.Контрагенты.Удалить(Элем);
			КонецЦикла;
			
			Для Каждого Элем Из Результат Цикл
				Нов = Объект.Контрагенты.Добавить();
				Нов.Значение = Элем;
				Выполнить("Нов.ВидКонтрагента = ПредопределенноеЗначение(""Перечисление.ВидыКонтрагентов." + Элемент.Имя + """);");
			КонецЦикла;
			
			Выполнить(Элемент.Имя + " = ПроверитьТаблицу(Элемент.Имя);");
			Модифицированность = Истина;
		КонецЕсли;
		
	Иначе
		Массив = Новый Массив();
		Для Каждого Элем Из Объект.Услуги Цикл
			Массив.Добавить(Элем.Значение);
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура("Таблица, Имя, ИмяТипа", Массив, Элемент.Имя, 
				"СправочникСсылка." + ИмяСправочника);
		
		Форма = ПолучитьФорму("Справочник.ДолговыеОбязательства.Форма.ФормаНабора", ПараметрыФормы);
		//Чуров
		Результат = ОткрытьФорму(Форма);
		//Результат = Форма.ОткрытьМодально();
		Если Результат <> Неопределено Тогда
			МнЧисло = ПолучитьМножественноеЧисло(Элемент.Имя);
			Объект.Услуги.Очистить();
						
			Для Каждого Элем Из Результат Цикл
				Объект.Услуги.Добавить().Значение = Элем;
			КонецЦикла;
			
			Выполнить(Элемент.Имя + " = ПроверитьТаблицу(Элемент.Имя);");
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ПолеПриИзменении(Элемент)
	МнЧисло = ПолучитьМножественноеЧисло(Элемент.Имя);	
	Флаг = Неопределено;
	
	Если Элемент.Имя <> "Услуга" Тогда
		Стр = Неопределено;  
		Выполнить("Стр = Новый Структура(""ВидКонтрагента"", ПредопределенноеЗначение(""Перечисление.ВидыКонтрагентов." + 
				Элемент.Имя + """));");
		
		Для Каждого Элем Из Объект.Контрагенты.НайтиСтроки(Стр) Цикл
			Объект.Контрагенты.Удалить(Элем);
		КонецЦикла;
		
		//Выполнить("Объект." + МнЧисло + ".Очистить();");
		Выполнить("Флаг = " + Элемент.Имя + ".Пустая();");
		Выполнить("Объект." + Элемент.Имя + " = " + Элемент.Имя + ";");
		Если Не Флаг Тогда
			//Выполнить("Объект." + МнЧисло + ".Добавить().Значение = " + Элемент.Имя + ";");
			Нов = Объект.Контрагенты.Добавить();
			//Выполнить("Нов.Значение = " + Элемент.Имя + ";");
			Нов.Значение = ЭтаФорма[Элемент.Имя];
			//Выполнить("Нов.ВидКонтрагента = ПредопределенноеЗначение(""Перечисление.ВидыКонтрагентов." + Элемент.Имя + """);");
			Нов.ВидКонтрагента = ПредопределенноеЗНачение("Перечисление.ВидыКонтрагентов." + Элемент.Имя);
		КонецЕсли;
		
	Иначе
		Объект.Услуги.Очистить();
		Флаг = Услуга.Пустая();
		Объект.Услуга = Услуга;
		Если Не Флаг Тогда
			Объект.Услуги.Добавить().Значение = Услуга;		
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОткрытие(Элемент, СтандартнаяОбработка)
	Строки = Объект.Контрагенты.НайтиСтроки(Новый Структура("ВидКонтрагента", 
			ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов." + Элемент.Имя)));
		
	Если Строки.Количество() > 1 Тогда
		СтандартнаяОбработка = Ложь;
		//Чуров
		//ПоказатьЗначение(,Строки[0].Значение);
		ОткрытьЗначение(Строки[0].Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МнЧисло = ПолучитьМножественноеЧисло(Элемент.Имя);
	
	Выполнить(Элемент.Имя + " = ПредопределенноеЗначение(""Справочник." + МнЧисло + ".ПустаяСсылка"");");
	Выполнить("Объект." + МнЧисло + ".Очистить();");
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМножественноеЧисло(Имя)
	Если Имя = "Услуга" Тогда
		Возврат "Услуги";
	ИначеЕсли Имя = "Должник" Тогда
		Возврат "Должники";
	ИначеЕсли Имя = "Контрагент" Тогда
		Возврат "Контрагенты";
	ИначеЕсли Имя = "Кредитор" Тогда
		Возврат "Кредиторы";
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПолучитьИмяСтравочника(Имя)
	Если Имя = "Услуга" Тогда
		Возврат "УслугиПоДоговору";
	ИначеЕсли Имя = "Должник" Тогда
		Возврат "Контрагенты";
	ИначеЕсли Имя = "Контрагент" Тогда
		Возврат "Контрагенты";
	ИначеЕсли Имя = "Кредитор" Тогда
		Возврат "Контрагенты";
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	////Если ЭтоНовыйОбъект Тогда
	////	Результат = Вопрос("Принять в работу текущего сотрудника?", РежимДиалогаВопрос.ДаНетОтмена);
	////	Если Результат = КодВозвратаДиалога.Отмена Тогда
	////		Отказ = Истина;
	////	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
	////		ЭтоНовыйОбъект = Ложь;
	////	КонецЕсли;
	////КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	//ОбъектыСервер.УдалитьПометкуОбИзменении(Отказ, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлы(Команда)
//	Сообщить(СтрЗаменить(Команда.Имя, "ОткрытьФайлы_", ""));
	
	Эл = Элементы["ДокументСтадия" + СтрЗаменить(Команда.Имя, "ОткрытьФайлы_", "")];
	
	Если Эл.ВыделенныеСтроки.Количество() = 0 Тогда 		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной строки, или список пуст!";
		Сообщение.Сообщить();	
		Возврат;
	КонецЕсли;
	
	
	Если Не РазыменоватьСсылку("Константы.ХранитьПрикрепляемыеФайлыНаСервере.Получить()") Тогда	
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	    Диалог.Заголовок = "Выберите каталог";
		Диалог.МножественныйВыбор = Ложь;
	    Если Диалог.Выбрать() Тогда
			Для Каждого ВыделСтрока Из Эл.ВыделенныеСтроки Цикл
			    Данные = СписокВыборНаСервере(ВыделСтрока);
		        ИмяФайла = Эл.ДанныеСтроки(ВыделСтрока).ИмяФайла;
			    Файл = Новый Файл(Диалог.Каталог + "\" + ИмяФайла);
			    Если Файл.Существует() Тогда 
				    КнопкиДиалога = Новый СписокЗначений;
				    КнопкиДиалога.Добавить(1, "Перезаписать");
				    КнопкиДиалога.Добавить(2, "Переименовать");
				    Ответ = Вопрос("Файл " + Файл.Имя + " уже существует", КнопкиДиалога,,, "Файл существует");
					Если Ответ = 1 Тогда
					  	Данные.Записать(Диалог.Каталог + "\" + Файл.Имя);
						ЗапуститьПриложение(Диалог.Каталог + "\" + Файл.Имя);
					Иначе
						НовоеИмяФайла = ОткрытьФормуМодально("РегистрСведений.ПрикрепляемыеФайлы.Форма.ФормаПереименования");
						Данные.Записать(Диалог.Каталог + "\" + НовоеИмяФайла + Файл.Расширение);
						ЗапуститьПриложение(Диалог.Каталог + "\" + НовоеИмяФайла + Файл.Расширение);
					КонецЕсли;
				Иначе
					Данные.Записать(Диалог.Каталог + "\" + Файл.Имя);
					ЗапуститьПриложение(Диалог.Каталог + "\" + Файл.Имя);
				КонецЕсли;
		    КонецЦикла;
		КонецЕсли;
		
	Иначе
		Для Каждого ВыделСтрока Из Эл.ВыделенныеСтроки Цикл
		    Данные = СписокВыборНаСервере(ВыделСтрока, Истина);		
			Файл = Новый Файл(Элементы.Список.ДанныеСтроки(ВыделСтрока).ИмяФайла);
			Каталог = РазыменоватьСсылку("Константы.КаталогХраненияПрикрепляемыхФайловНаСервере.Получить()");
			Если Прав(Каталог, 1) <> "\" Тогда
				Каталог = Каталог + "\";
			КонецЕсли;
		    ЗапуститьПриложение(Каталог + Данные + Файл.Расширение);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазыменоватьСсылку(Стр)
	Возврат Вычислить(Стр);
КонецФункции

&НаСервере
Функция СписокВыборНаСервере(ВыбраннаяСтрока, ПолучитьУИД = Ложь)
    Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                          |	ПрикрепитьФайлыФайлы.Хранилище,
                          |	ПрикрепитьФайлыФайлы.УИД
                          |ИЗ
                          |	Документ.ПрикрепитьФайлы.Файлы КАК ПрикрепитьФайлыФайлы
                          |ГДЕ
                          |	ПрикрепитьФайлыФайлы.Ссылка = &Ссылка
                          |	И ПрикрепитьФайлыФайлы.НомерСтроки = &НомерСтроки");
	Запрос.УстановитьПараметр("Ссылка", ВыбраннаяСтрока.Регистратор);
	Запрос.УстановитьПараметр("НомерСтроки", ВыбраннаяСтрока.НомерСтроки_);
	Результат = Запрос.Выполнить().Выгрузить();
	Если ПолучитьУИД Тогда
		Возврат Результат[0].УИД;
	Иначе
		Возврат Результат[0].Хранилище.Получить();
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПрикрепитьФайлы(Команда)
	Форма = ПолучитьФорму("Документ.ПрикрепитьФайлы.Форма.ФормаДокумента",,ЭтаФорма);
	      
	//Если Список.Отбор.Элементы.Количество() > 0 Тогда
	Форма.Объект.Объект = Объект.Ссылка;
	//КонецЕсли;	
	//Чуров
	ОткрытьФорму(Форма);
	//Форма.Открыть();
КонецПроцедуры

// Область взаимодействий

&НаКлиенте
Процедура ИсходящийЗвонокТЧ(Команда)
	Если Объект.Ссылка.Пустая() Тогда	
		Предупреждение("Сначала запишите объект!");		
		Возврат;
	КонецЕсли; 
	
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ДолжникТелефоны И Элементы.ДолжникТелефоны.ТекущиеДанные <> Неопределено Тогда
		
		// Проверка на нарушение 230-ФЗ
		
		Если ОбъектыСервер.ПолучитьЗначениеКонстанты("ОтзывПерсональныхДанных") И ОбъектыСервер.РазыменоватьСсылку(Объект.Должник, "ОтзывПерсональныхДанных") Тогда
			Предупреждение("У должника отозваны персональные данные!",,"Отзыв персональных данных");
			Возврат;
		КонецЕсли;	
		
		Если КонтрольСобытий.КонтрольЧасовогоПояса(Объект.Должник) Тогда
			Предупреждение("Действие приведет к нарушению 230-ФЗ!",,"Контроль часового пояса");
			Возврат;
		КонецЕсли;
		
		Если КонтрольСобытий.РезультативныеЗвонки(Объект.Должник) Тогда
			Ответ = Вопрос("Действие приведет к нарушению 230-ФЗ! Вы уверены?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Контроль звонков");
			Если Ответ = КодВозвратаДиалога.Да Тогда
				// Создать новую запись в регистре нарушений 230-ФЗ
				ЗаписатьНарушениеПоЗвонкам();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		// Если ОбъектыСервер.ПолучитьЗначениеКонстанты("ЗапретТелефонныхНомеров") И КонтрольСобытий.ЗапретЗвонка(Элементы.ДолжникТелефоны.ТекущиеДанные.ЗапретЗвонка, Элементы.ДолжникТелефоны.ТекущиеДанные.НачалоЗапретаЗвонка, Элементы.ДолжникТелефоны.ТекущиеДанные.КонецЗапретаЗвонка) Тогда
		//	Предупреждение("Внимание! Для данного номера установлен запрет исходящих звонков");
		//	Возврат;
		// КонецЕсли;
		
		// Обход ограничений при использовании обработчиков
		ВидТелефонии = Бит_ТелефонияСерверПереопределяемый.ПолучитьВидТелефонии();
		Если ВидТелефонии = ПредопределенноеЗначение("Перечисление.ВидыТелефонии.БИТФон") Тогда
			Ф = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
			// Проверить состояние Битфона
			Если Ф.Открыта() = Ложь Тогда
				Ф.Открыть();
				Ф.кнНеБеспокоить(Неопределено);
			ИначеЕсли Ф.Открыта() = Истина И Ф.СтатусНеБеспокоить = Ложь И Ф.ИдетРазговор = Ложь Тогда
				Ф.кнНеБеспокоить(Неопределено);
			ИначеЕсли Ф.Открыта() = Истина И Ф.СтатусПодключен = Истина И Ф.ИдетРазговор = Истина
				ИЛИ Ф.Открыта() = Истина И Ф.СтатусНеБеспокоить = Истина И Ф.ИдетРазговор = Истина Тогда
				Предупреждение("На канале уже идет разговор!",,"БИТ.Phone");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		НовоеМероприятие = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", Объект.Ссылка),,Новый УникальныйИдентификатор());
		НовоеМероприятие.Объект.Объект = ЭтаФорма.Объект.Ссылка;
		НовоеМероприятие.Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокИсходящий");
		НовоеМероприятие.Объект.Контакт = Элементы.ДолжникТелефоны.ТекущиеДанные.Номер;
		НовоеМероприятие.КонтрагентКЛ = ЭтаФорма.Должник;
		НовоеМероприятие.УстановленСтатусНеБеспокоить = Истина;
		НовоеМероприятие.Элементы.ПозвонитьДолжнику.ЦветФона = WebЦвета.СветлоЗеленый;
		// Указать источник создания
		НовоеМероприятие.СозданоИзДО = Истина;
		НовоеМероприятие.Открыть();
		// Передать управление обработчику ожидания
		ПодключитьОбработчикОжидания("НовоеМероприятиеСоздано", 1, Истина);
	Иначе
		Предупреждение("Не выбран контакт!",,"Исходящий звонок");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНарушениеПоЗвонкам()
	МенеджерЗаписи = РегистрыСведений.ЖурналНарушений.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Дата = ТекущаяДата();
	МенеджерЗаписи.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Договор = ЭтаФорма.Объект.Ссылка;
	МенеджерЗаписи.ТипНарушения = Перечисления.ТипыНарушений230ФЗ.ПревышениеКоличестваЗвонков;
	
	МенеджерЗаписи.Записать();
КонецПроцедуры

&НаКлиенте
Процедура НовоеМероприятиеСоздано()
	// Получить мероприятие по УИД
	НовоеМероприятие = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", Объект.Ссылка),,Новый УникальныйИдентификатор);
	НовоеМероприятие.КлючУникальности = Новый УникальныйИдентификатор;
	Ф = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
	Ф.ФормаМероприятие = НовоеМероприятие.КлючУникальности;
	// Передать управление обработчикам
	ПодключитьОбработчикОжидания("УстановленСтатусНеБеспокоить", 5, Истина);
	ПодключитьОбработчикОжидания("ПроверитьСостояниеБИТФон", 1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура УстановленСтатусНеБеспокоить()
	// Получить мероприятие по УИД
	НовоеМероприятие = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", Объект.Ссылка),,Новый УникальныйИдентификатор);
	ПоказатьОповещениеПользователя("БИТ.Phone",,"Набор выбранного номера...",БиблиотекаКартинок.NC_ИсходящийЗвонок);
	Ф = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
	Ф.НомерЛиния1 = ЭтаФорма.Элементы.ДолжникТелефоны.ТекущиеДанные.Номер;
	Ф.НомерЛиния2 = Ф.НомерЛиния1;
	Ф.НомерЛиния3 = Ф.НомерЛиния1;
	Ф.НомерЛиния4 = Ф.НомерЛиния1;
	Ф.НачатьРазговорКл(Неопределено);
	// Сбросить служебные флаги
	Оповестить("ОтменитьСтатусНеБеспокоить");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСостояниеБИТФон()
	// Получить мероприятие по УИД
	НовоеМероприятие = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", Объект.Ссылка),,Новый УникальныйИдентификатор);
	ФормаНабора = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
	Если ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусПодключен = Истина И ФормаНабора.МикрофонВключен = Истина
		ИЛИ ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусНеБеспокоить = Истина И ФормаНабора.МикрофонВключен = Истина Тогда
		НовоеМероприятие.Элементы.ОтключитьМикрофон.ЦветФона = Новый Цвет();
	ИначеЕсли ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусПодключен = Истина И ФормаНабора.МикрофонВключен = Ложь
		ИЛИ ФормаНабора.Открыта() = Истина И ФормаНабора.СтатусНеБеспокоить = Истина И ФормаНабора.МикрофонВключен = Ложь Тогда
		// Исправить произвольное включение микрофона, если получено значение Ложь
		ФормаНабора.КнОМик(Неопределено);
		ФормаНабора.КнОМик(Неопределено);
		//
		НовоеМероприятие.Элементы.ОтключитьМикрофон.ЦветФона = WebЦвета.Красный;
	ИначеЕсли ФормаНабора.Открыта() = Ложь ИЛИ ФормаНабора.СтатусПодключен = Ложь Тогда
		НовоеМероприятие.Элементы.ОтключитьМикрофон.ЦветФона = Новый Цвет();
	КонецЕсли;	
КонецПроцедуры

//

&НаКлиенте 
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьДолжника" Тогда
		ЭтаФорма.Элементы.ДолжникТелефоны.Обновить();
		ЭтаФорма.ОбновитьОтображениеДанных(Элементы.ДолжникТелефоны);
		ЭтаФорма.ОбновитьОтображениеДанных();
	КонецЕсли; 

	Если ИмяСобытия = "ГрафикНачисленийПерерасчитан" Тогда

		ОбновитьДекорацииСервер();

	КонецЕсли;

КонецПроцедуры

&НаСервере 
Процедура ОбновитьДекорацииСервер()
	РасчетЗадолженностиМФО.ЗаполнитьДекорацииОбъекта(ЭтаФорма);
КонецПроцедуры

// Область взаимодействий

&НаСервере
Процедура ОтправитьСМСНаСервере()
	// Получить значения с сервера
	ЭтаФорма.РезультатОтправлено = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Отправлено");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ДолжникТелефоны И Элементы.ДолжникТелефоны.ТекущиеДанные <> Неопределено Тогда
		
		// Проверка на нарушение 230-ФЗ
		
		Если КонтрольСобытий.КонтрольЧасовогоПояса(Объект.Должник) Тогда
			Предупреждение("Действие приведет к нарушению 230-ФЗ!",,"Контроль часового пояса");
			Возврат;
		КонецЕсли;
		
		Если КонтрольСобытий.КонтрольСМС(Объект.Должник) Тогда
			Ответ = Вопрос("Действие приведет к нарушению 230-ФЗ! Вы уверены?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Контроль СМС");
			Если Ответ = КодВозвратаДиалога.Да Тогда
				// Создать новую запись в регистре нарушений 230-ФЗ
				ЗаписатьНарушениеПоСообщениямСМС();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ФормаСМС = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОтправкаСМС");
		// ФормаСМС.ВладелецФормы = ЭтаФорма;
		стрСМСЛогин = "";
		стрСМСПароль = "";
		стрОтправитель = "";
		Автоинформирование.ПолучитьПараметрыОтправкиСМС(стрСМСЛогин, стрСМСПароль, стрОтправитель);
		ФормаСМС.СМСЛогин = стрСМСЛогин;
		ФормаСМС.СМСПароль = стрСМСПароль;
		Если ЗначениеЗаполнено(стрОтправитель) Тогда
			ФормаСМС.Элементы.Отправитель.СписокВыбора.Добавить(стрОтправитель);
			ФормаСМС.Отправитель = стрОтправитель;
		КонецЕсли;
		
		// Обход ограничений при использовании модальности
		Ф = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
		Если Ф.Открыта() = Истина И Ф.СтатусНеБеспокоить = Ложь И Ф.ИдетРазговор = Ложь Тогда
			Ф.кнНеБеспокоить(Неопределено);
		КонецЕсли;
		
		ФормаСМС.НомерПолучателя = Элементы.ДолжникТелефоны.ТекущиеДанные.Номер;
		ФормаСМС.Договор = ЭтаФорма.Объект.Ссылка; 
		ФормаСМС.ТекстСМС = Автоинформирование.ПолучитьПодсказку(Объект.Ссылка, ОбъектыСервер.РазыменоватьСсылку(ПредопределенноеЗначение("Справочник.ТипыМероприятий.ОтправкаСМС"), "ШаблонСМС"));
		ОтправитьСМСНаСервере();	
		
		НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", Объект.Ссылка),,Новый УникальныйИдентификатор());
		НоваяЗадача.Объект.Объект = ЭтаФорма.Объект.Ссылка;
		НоваяЗадача.Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ОтправкаСМС");
		НоваяЗадача.Объект.Результат = РезультатОтправлено;
		НоваяЗадача.Объект.Контакт = Элементы.ДолжникТелефоны.ТекущиеДанные.Номер;
		НоваяЗадача.КонтрагентКЛ = ЭтаФорма.Объект.Должник;
		// Указать источник создания
		НоваяЗадача.СозданоИзДО = Истина;
		НоваяЗадача.НеОбрабатыватьСтатусБитФона = Истина;
		НоваяЗадача.Открыть();
		ФормаСМС.ОткрытьМодально();
	Иначе
		Предупреждение("Не выбран контакт для отправки!",,"Отправка СМС");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНарушениеПоСообщениямСМС()
	МенеджерЗаписи = РегистрыСведений.ЖурналНарушений.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Дата = ТекущаяДата();
	МенеджерЗаписи.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Договор = ЭтаФорма.Объект.Ссылка;
	МенеджерЗаписи.ТипНарушения = Перечисления.ТипыНарушений230ФЗ.ПревышениеКоличестваСообщенийСМС;
	
	МенеджерЗаписи.Записать();
КонецПроцедуры

//

&НаКлиенте
Процедура ЗапросВФССП(Команда)

	СсылкиНаДокументы = ЗапуститьРобота();
	Для Каждого ДокСсылка Из СсылкиНаДокументы Цикл
		
		ОткрытьЗначение(ДокСсылка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗапросФССПСервер(Должник,Фамилия,Имя,Отчество,ДР,Регион)	
	бит_ФССП_Переопределяемый.ЗаполнитьЗапрос(Должник,Фамилия,Имя,Отчество,ДР,Регион);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.КодДО = Объект.Наименование;
КонецПроцедуры

// Необновляемая область

&НаКлиенте
Процедура ОтправитьEmail(Команда)
	ФормаМаил = ПолучитьФорму("ОбщаяФорма.ФормаОтправкиEmailизКарточки");
	ФормаМаил.ВладелецФормы = ЭтаФорма;
	ФормаМаил.Открыть();	
КонецПроцедуры

//

&НаСервере
Процедура КалькуляторНаСервере(Калькулятор)
	
КонецПроцедуры

&НаКлиенте
Процедура Калькулятор(Команда)
	Форма = ПолучитьФорму("Обработка.РасчетГрафикаПлатежейИНачислений.Форма.Форма");
	Форма.Объект.Займ = Объект.Ссылка;
	ОткрытьФорму(Форма);	
КонецПроцедуры

&НаСервере
Функция ПолучитьОперативнуюИнфо(ИП)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФССП_СостояниеИПСрезПоследних.Период КАК ДатаПоследнегоОбновления,
	                      |	ФССП_СостояниеИПСрезПоследних.ДатаВозбуждения КАК ДатаВозбуждения,
	                      |	ФССП_СостояниеИПСрезПоследних.СтатусИП КАК СтатусИсполнительногоПроизводства,
	                      |	ФССП_СостояниеИПСрезПоследних.НомерИД КАК НомерИсполнительногоДокумента,
	                      |	ФССП_СостояниеИПСрезПоследних.ОтделСудебныхПриставов КАК ОтделСудебныхПриставов,
	                      |	ФССП_СостояниеИПСрезПоследних.СудебныйПриставИсполнитель КАК СудебныйПриставИсполнитель
	                      |ИЗ
	                      |	Справочник.ФССП_ИсполнительноеПроизводство КАК ФССП_ИсполнительноеПроизводство
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФССП_СостояниеИП.СрезПоследних(&ТекущаяДата) КАК ФССП_СостояниеИПСрезПоследних
	                      |		ПО (ФССП_СостояниеИПСрезПоследних.ИП = ФССП_ИсполнительноеПроизводство.Ссылка)
	                      |ГДЕ
	                      |	ФССП_ИсполнительноеПроизводство.ПометкаУдаления = ЛОЖЬ
	                      |	И ФССП_ИсполнительноеПроизводство.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ИП);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Выборка = Запрос.Выполнить().Выгрузить();
	Возврат Выборка;
КонецФункции


&НаКлиенте
Процедура ДС_ИсполнительныеПроизводстваПриАктивизацииСтроки(Элемент)
	//ПодключитьОбработчикОжидания("ВывестиДанныеТекущегоЭлемента", 0.1, Истина);
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Попытка
			НомерИП = ТекДанные.НомерИП;
		Исключение
			НомерИП = Неопределено;
		КонецПопытки;	
	Иначе
		НомерИП = Неопределено;
	КонецЕсли;
	Отбор_ИП(НомерИП);	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиДанныеТекущегоЭлемента()
	ТекДанные = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Попытка
			НомерИП = ТекДанные.НомерИП;
		Исключение
			НомерИП = Неопределено;
		КонецПопытки;	
	Иначе
		НомерИП = Неопределено;
	КонецЕсли;

	Отбор_ИП(НомерИП);
	ОтключитьОбработчикОжидания("ВывестиДанныеТекущегоЭлемента")
КонецПроцедуры


&НаСервере
Процедура Отбор_ИП(НомерИП)
	
	ТекИП = НомерИП;	
		
	Выборка = ПолучитьОперативнуюИнфо(ТекИП);
	ТаблицаОпераций = ПоследняяОперацияПоПредметам(ТекИП);
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	ДС_ОперативнаяИнформацияИП.Очистить();
	Для Каждого стр из Выборка Цикл
		Для Каждого Колонка из Выборка.Колонки Цикл
				НСтрока = ДС_ОперативнаяИнформацияИП.Добавить();
				ПреобразованноеИмяКолонки = ИменаКолонок(Колонка.Имя); 
				НСтрока.Параметр = ПреобразованноеИмяКолонки;
				Нстрока.ЗначениеПараметра =?(Колонка.Имя = "ДатаВозбуждения",Формат(Стр[Колонка.Имя],"ДФ=dd.MM.yyyy; ДЛФ=D"),Стр[Колонка.Имя]);
		КонецЦикла;
		Если ТаблицаОпераций.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого строкаОперация из ТаблицаОпераций Цикл 
			НСтрока = ДС_ОперативнаяИнформацияИП.Добавить();
			НСтрока.Параметр = "Тек." + Строка(строкаОперация.Предмет);
			Нстрока.ЗначениеПараметра = Формат(строкаОперация.СуммаОстаток,"ЧЦ=10; ЧДЦ=2");
			НСтрока = ДС_ОперативнаяИнформацияИП.Добавить();
			НСтрока.Параметр = Строка(строкаОперация.Предмет)+Строка(строкаОперация.Операция);
			Нстрока.ЗначениеПараметра = Формат(строкаОперация.Сумма,"ЧЦ=10; ЧДЦ=2");
			
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ИменаКолонок(Исходная)
	//Исходная="ВесИОбъемToBeOrNotToBe";
	Конечная=Лев(Исходная,1);
	Для Индекс=2 по СтрДлина(Исходная) цикл
		Символ=Сред(Исходная,Индекс,1);
		Конечная=Конечная+?(ВРег(Символ)=Символ," "+НРег(Символ),Символ);
	КонецЦикла;
	Возврат Конечная;
КонецФункции


&НаСервере
Функция ПоследняяОперацияПоПредметам(ИП)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МАКСИМУМ(ФССП_ЗадолженностьПоПредметамИП.Период) КАК Период,
	                      |	ФССП_ЗадолженностьПоПредметамИП.ИсполнительноеПроизводство КАК ИсполнительноеПроизводство,
	                      |	ФССП_ЗадолженностьПоПредметамИП.Предмет КАК Предмет
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	РегистрНакопления.ФССП_ЗадолженностьПоПредметамИП КАК ФССП_ЗадолженностьПоПредметамИП
	                      |ГДЕ
	                      |	ФССП_ЗадолженностьПоПредметамИП.ИсполнительноеПроизводство = &ИсполнительноеПроизводство
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ФССП_ЗадолженностьПоПредметамИП.ИсполнительноеПроизводство,
	                      |	ФССП_ЗадолженностьПоПредметамИП.Предмет
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Период,
	                      |	ИсполнительноеПроизводство,
	                      |	Предмет
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ФССП_ЗадолженностьПоПредметамИП.Предмет КАК Предмет,
	                      |	ФССП_ЗадолженностьПоПредметамИП.Сумма КАК Сумма,
	                      |	ВЫБОР
	                      |		КОГДА ФССП_ЗадолженностьПоПредметамИП.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                      |			ТОГДА "", начисление""
	                      |		ИНАЧЕ "", оплата""
	                      |	КОНЕЦ КАК Операция,
	                      |	ФССП_ЗадолженностьПоПредметамИПОстатки.СуммаОстаток КАК СуммаОстаток
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ФССП_ЗадолженностьПоПредметамИП КАК ФССП_ЗадолженностьПоПредметамИП
	                      |		ПО ВТ.Период = ФССП_ЗадолженностьПоПредметамИП.Период
	                      |			И ВТ.ИсполнительноеПроизводство = ФССП_ЗадолженностьПоПредметамИП.ИсполнительноеПроизводство
	                      |			И ВТ.Предмет = ФССП_ЗадолженностьПоПредметамИП.Предмет
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ФССП_ЗадолженностьПоПредметамИП.Остатки(&ТекущаяДата) КАК ФССП_ЗадолженностьПоПредметамИПОстатки
	                      |		ПО ВТ.ИсполнительноеПроизводство = ФССП_ЗадолженностьПоПредметамИПОстатки.ИсполнительноеПроизводство
	                      |			И ВТ.Предмет = ФССП_ЗадолженностьПоПредметамИПОстатки.Предмет");
	Запрос.УстановитьПараметр("ИсполнительноеПроизводство", ИП);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Выборка = Запрос.Выполнить().Выгрузить();
	Возврат Выборка;
КонецФункции

&НаКлиенте
Процедура ДС_ОперативнаяИнформацияИПВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДС_ОперативнаяИнформацияИПВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// Вынес дублирование перед дерективами
	Попытка
		
		ЗначениеЭлемента = Элемент.ТекущиеДанные[Сред(Поле.Имя, 27)];
		ЭтоСправочник = ПроверкаТипа(ЗначениеЭлемента);

	Исключение
		ЭтоСправочник = Ложь;
	КонецПопытки;
	
	Если НЕ ЭтоСправочник Тогда
	
		Возврат;
	
	КонецЕсли;
	
	#Если ВебКлиент Тогда

		ПоказатьЗначение(, ЗначениеЭлемента);

	#Иначе
		
		ОткрытьЗначение(ЗначениеЭлемента);

	#КонецЕсли
КонецПроцедуры 

&НаСервере
Функция ПроверкаТипа(Эл)
	Возврат Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Эл));
КонецФункции

// Не используется
&НаСервере
Процедура ОбновитьИсковоеПроизводствоСервер()
	Если Справочники.СтадииПроизводства.ИсковоеПроизводство.Используется Тогда
		СтадииПроизводства.ЗаполнитьИсковоеПроизводство(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОперацииПлатежныхСистем(Команда)
	
	псМандарин = объектыСервер.ПолучитьЗначениеКонстанты("ИспользоватьMandarin");
	
	Если псМандарин Тогда
		Форма = ПолучитьФорму("Обработка.MandarinОперации.Форма.Форма",,ЭтаФорма);
		Форма.Объект.ОбъектУчета = Объект.Ссылка;		
		ОткрытьФорму(Форма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДС_ДанныеОБанкротствеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ТекущиеДанные.ДоБ);
	ОткрытьФорму("Справочник.ДелоОБанкротстве.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаСервере
Процедура ЗапросНаБанкротствоНаСервере()
	БанкротствоСервер.СоздатьДоБ(Объект.Должник);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросНаБанкротство(Команда)
	ЗапросНаБанкротствоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтчетЗадолженностиНаСервере()
	ЗаполнитьТабличныйДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтчетЗадолженности(Команда)
	ОбновитьОтчетЗадолженностиНаСервере();
КонецПроцедуры

&НаСервере
Функция ЗапуститьРобота()
	МассивДокументов = Обработки.ФССП_Робот.ЕдиничныйЗапрос(Объект.Должник);

	Возврат МассивДокументов;
КонецФункции

#Область Конфигурация

&НаСервере
Функция ПолучитьВыводимыеОтчеты()

	ВыводимыеОтчеты = Новый Соответствие;
	ВыводимыеОтчеты.Вставить(Константы.ОтчетДляДО.Получить(), "ТабличныйДокумент");
	ВыводимыеОтчеты.Вставить(Константы.ОтчетДляДОПлатежи.Получить(), "ТабличныеПлатежи");
	
	Возврат ВыводимыеОтчеты;

КонецФункции // ()

&НаСервере
Функция ПолучитьРазмерыДиаграмм()

	Размеры = Новый Структура;
	Размеры.Вставить("Ширина", 110);
	Размеры.Вставить("Высота", 70);
	
	Возврат Размеры;

КонецФункции // ()

&НаСервере
Функция ПолучитьИменаРеквизитовВладельцев()

	Набор = Новый Массив;
	Набор.Добавить("Должник");
	Набор.Добавить("Контрагент");
	Набор.Добавить("Кредитор");
	
	Возврат Набор;

КонецФункции // ()

&НаКлиенте
Процедура НовыйВидПриИзменении(Элемент)
	ЗаполнитьТабличныйДокумент();
КонецПроцедуры

#КонецОбласти

// Область взаимодействий

&НаСервере
Процедура НаписатьВВЦНаСервере()
	ЭтаФорма.ТипВЦ = Справочники.ТипыМероприятий.НайтиПоНаименованию("WhatsApp");
	ЭтаФорма.РезультатОтправлено = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Отправлено");
КонецПроцедуры

&НаСервере
Процедура НаписатьВВайберНаСервере()
	ЭтаФорма.ТипВайбер = Справочники.ТипыМероприятий.НайтиПоНаименованию("Viber");
	ЭтаФорма.РезультатОтправлено = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Отправлено");
КонецПроцедуры

&НаКлиенте
Процедура НайтиВВЦ(Команда)
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ДолжникТелефоны И Элементы.ДолжникТелефоны.ТекущиеДанные <> Неопределено Тогда
		// Найти контакт через API
		ПоказатьОповещениеПользователя("Интеграция с WhatsApp",,"Поиск номера...",БиблиотекаКартинок.NC_ПодсистемаИнтеграцияСWhatsApp);
		ФормаВЦ = ПолучитьФорму("ОбщаяФорма.ОтправкаНаWhatsApp",,,Новый УникальныйИдентификатор());
		ФормаВЦ.Номер = СтрСоединить(СтрРазделить(Элементы.ДолжникТелефоны.ТекущиеДанные.Номер, "+( )"), "");
		ФормаВЦ.Договор = ЭтаФорма.Объект.Ссылка;
		ФормаВЦ.ПоискДолжника(Неопределено);
	Иначе
		Предупреждение("Не выбран контакт для поиска!",,"Интеграция с WhatsApp");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаписатьВВЦ(Команда)
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ДолжникТелефоны И Элементы.ДолжникТелефоны.ТекущиеДанные <> Неопределено Тогда
		
		// Проверка на нарушение 230-ФЗ
		
		Если КонтрольСобытий.КонтрольЧасовогоПояса(Объект.Должник) Тогда
			Предупреждение("Действие приведет к нарушению 230-ФЗ!",,"Контроль часового пояса");
			Возврат;
		КонецЕсли;
		
		Если КонтрольСобытий.КонтрольСМС(Объект.Должник) Тогда
			Ответ = Вопрос("Действие приведет к нарушению 230-ФЗ! Вы уверены?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Контроль WhatsApp");
			Если Ответ = КодВозвратаДиалога.Да Тогда
				// Создать новую запись в регистре нарушений 230-ФЗ
				ЗаписатьНарушениеПоСообщениямВЦ();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		// Обход ограничений при использовании модальности
		Ф = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
		Если Ф.Открыта() = Истина И Ф.СтатусНеБеспокоить = Ложь И Ф.ИдетРазговор = Ложь Тогда
			Ф.кнНеБеспокоить(Неопределено);
		КонецЕсли;
		
		ФормаВЦ = ПолучитьФорму("ОбщаяФорма.ОтправкаНаWhatsApp");
		ФормаВЦ.Номер = СтрСоединить(СтрРазделить(Элементы.ДолжникТелефоны.ТекущиеДанные.Номер, "+( )"), "");
		ФормаВЦ.Договор = ЭтаФорма.Объект.Ссылка;
		НаписатьВВЦНаСервере();
		
		НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", Объект.Ссылка),,Новый УникальныйИдентификатор());
		НоваяЗадача.Объект.Объект = ЭтаФорма.Объект.Ссылка;
		НоваяЗадача.Объект.ТипМероприятия = ТипВЦ;
		НоваяЗадача.Объект.Результат = РезультатОтправлено;
		НоваяЗадача.Объект.Контакт = Элементы.ДолжникТелефоны.ТекущиеДанные.Номер;
		НоваяЗадача.КонтрагентКЛ = ЭтаФорма.Объект.Должник;
		// Указать источник создания
		НоваяЗадача.СозданоИзДО = Истина;
		НоваяЗадача.Открыть();
		ФормаВЦ.ОткрытьМодально();
		
        // Уменьшить число допустимых сообщений
		ЭтаФорма.НомерТелефонаИзТЧ = СтрСоединить(СтрРазделить(Элементы.ДолжникТелефоны.ТекущиеДанные.Номер, "+( )"), "");
		СоздатьСлужебноеСообщение();
	
	Иначе
		Предупреждение("Не выбран контакт для отправки!",,"Интеграция с WhatsApp");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьСлужебноеСообщение()
	СлужебнаяЗапись = РегистрыСведений.СообщенияСМС.СоздатьМенеджерЗаписи();
	
	СлужебнаяЗапись.GUID = Новый УникальныйИдентификатор();
	СлужебнаяЗапись.Объект = ЭтаФорма.Объект.Должник;
	СлужебнаяЗапись.Дата = ТекущаяДата();
	СлужебнаяЗапись.ТекстСообщения = "Корректировка количества допустимых сообщений по объекту";
	СлужебнаяЗапись.НомерТелефона = ЭтаФорма.НомерТелефонаИзТЧ;
	СлужебнаяЗапись.Статус = "Служебное";	
	
	СлужебнаяЗапись.Записать();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНарушениеПоСообщениямВЦ()
	МенеджерЗаписи = РегистрыСведений.ЖурналНарушений.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Дата = ТекущаяДата();
	МенеджерЗаписи.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Договор = ЭтаФорма.Объект.Ссылка;
	МенеджерЗаписи.ТипНарушения = Перечисления.ТипыНарушений230ФЗ.ПревышениеКоличестваСообщенийWhatsApp;
	
	МенеджерЗаписи.Записать();
КонецПроцедуры

&НаКлиенте
Процедура НаписатьВВайбер(Команда)
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ДолжникТелефоны И Элементы.ДолжникТелефоны.ТекущиеДанные <> Неопределено Тогда
		
		// Проверка на нарушение 230-ФЗ
		
		Если КонтрольСобытий.КонтрольЧасовогоПояса(Объект.Должник) Тогда
			Предупреждение("Действие приведет к нарушению 230-ФЗ!",,"Контроль часового пояса");
			Возврат;
		КонецЕсли;
		
		Если КонтрольСобытий.КонтрольСМС(Объект.Должник) Тогда
			Ответ = Вопрос("Действие приведет к нарушению 230-ФЗ! Вы уверены?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Контроль Viber");
			Если Ответ = КодВозвратаДиалога.Да Тогда
				// Создать новую запись в регистре нарушений 230-ФЗ
				ЗаписатьНарушениеПоСообщениямВайбер();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		// Обход ограничений при использовании модальности
		Ф = ПолучитьФорму("Обработка.бит_Битфон.Форма.ОсновнаяФорма");
		Если Ф.Открыта() = Истина И Ф.СтатусНеБеспокоить = Ложь И Ф.ИдетРазговор = Ложь Тогда
			Ф.кнНеБеспокоить(Неопределено);
		КонецЕсли;
		
		ФормаВайбер = ПолучитьФорму("ОбщаяФорма.ОтправкаНаViber");
		ФормаВайбер.Номер = СтрСоединить(СтрРазделить(Элементы.ДолжникТелефоны.ТекущиеДанные.Номер, "+( )"), "");
		ФормаВайбер.Договор = ЭтаФорма.Объект.Ссылка;
		НаписатьВВайберНаСервере();
		
		НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", Объект.Ссылка),,Новый УникальныйИдентификатор());
		НоваяЗадача.Объект.Объект = ЭтаФорма.Объект.Ссылка;
		НоваяЗадача.Объект.ТипМероприятия = ТипВайбер;
		НоваяЗадача.Объект.Результат = РезультатОтправлено;
		НоваяЗадача.Объект.Контакт = Элементы.ДолжникТелефоны.ТекущиеДанные.Номер;
		НоваяЗадача.КонтрагентКЛ = ЭтаФорма.Объект.Должник;
		// Указать источник создания
		НоваяЗадача.СозданоИзДО = Истина;
		НоваяЗадача.Открыть();
		ФормаВайбер.ОткрытьМодально();
		
        // Уменьшить число допустимых сообщений
		ЭтаФорма.НомерТелефонаИзТЧ = СтрСоединить(СтрРазделить(Элементы.ДолжникТелефоны.ТекущиеДанные.Номер, "+( )"), "");
		СоздатьСлужебноеСообщение();
		
	Иначе
		Предупреждение("Не выбран контакт для отправки!",,"Интеграция с Viber");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНарушениеПоСообщениямВайбер()
	МенеджерЗаписи = РегистрыСведений.ЖурналНарушений.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Дата = ТекущаяДата();
	МенеджерЗаписи.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Договор = ЭтаФорма.Объект.Ссылка;
	МенеджерЗаписи.ТипНарушения = Перечисления.ТипыНарушений230ФЗ.ПревышениеКоличестваСообщенийViber;
	
	МенеджерЗаписи.Записать();
КонецПроцедуры

//

// Область служебных функций

&НаСервере
Процедура ПолучитьОстатокНаСервере()
	// Получить значения с сервера
	НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ЭтаФорма.Объект.Ссылка);
	НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Сумма"));
	НаборЗаписей.Прочитать(); 
	Для каждого ЗаписьНабора из НаборЗаписей Цикл
		ЭтаФорма.ДолговоеОбязательствоСуммаОстатка = ЗаписьНабора.СуммаДО;
	КонецЦикла;
КонецПроцедуры
               
&НаКлиенте
Процедура РасчетУсловий(Команда)
    ФормаРасчетУсловий = ПолучитьФорму("ОбщаяФорма.РасчетУсловий",,,Новый УникальныйИдентификатор());
	// Получить кредитора
	ФормаРасчетУсловий.Кредитор = ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Объект.Ссылка, "Кредитор");
	// Получить сумму ДО
	ПолучитьОстатокНаСервере();
	ФормаРасчетУсловий.СуммаОстатка = ЭтаФорма.ДолговоеОбязательствоСуммаОстатка;
	// Получить номер ДО
	ФормаРасчетУсловий.СкрытоеПолеНомерДО = ЭтаФорма.Объект.Ссылка;
	ФормаРасчетУсловий.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьДокументНаНомер(Команда)
	ФормаДок = ПолучитьФорму("Документ.ЗапросДокументов.Форма.ФормаДокумента",,,Новый УникальныйИдентификатор());
	ФормаДок.Объект.Договор = ЭтаФорма.Объект.Ссылка;
	ФормаДок.Объект.Получатель = ЭтаФорма.Элементы.ДолжникТелефоны.ТекущиеДанные.Номер;
	ФормаДок.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФайлыИзДО(Неопределено);
КонецПроцедуры

&НаСервере
Функция ФайлыВыборНаСервере(ВыбраннаяСтрока, ПолучитьУИД = Ложь)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПрикрепитьФайлыФайлы.Хранилище,
	|	ПрикрепитьФайлыФайлы.УИД
	|ИЗ
	|	Документ.ПрикрепитьФайлы.Файлы КАК ПрикрепитьФайлыФайлы
	|ГДЕ
	|	ПрикрепитьФайлыФайлы.Ссылка = &Ссылка
	|	И ПрикрепитьФайлыФайлы.НомерСтроки = &НомерСтроки");
	Запрос.УстановитьПараметр("Ссылка", ВыбраннаяСтрока.Регистратор);
	Запрос.УстановитьПараметр("НомерСтроки", ВыбраннаяСтрока.НомерСтроки_);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если ПолучитьУИД Тогда
		Возврат Результат[0].УИД;
	Иначе
		Возврат Результат[0].Хранилище.Получить();
		//Сообщить(строка(Результат[0].Хранилище.Получить()));
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОткрытьФайлыИзДО(Команда)
	Для Каждого ВыделСтрока Из Элементы.Файлы.ВыделенныеСтроки Цикл
		Данные = ФайлыВыборНаСервере(ВыделСтрока, Истина);		
		Файл = Новый Файл(Элементы.Файлы.ДанныеСтроки(ВыделСтрока).ИмяФайла);
		Каталог = РазыменоватьСсылку("Константы.КаталогХраненияПрикрепляемыхФайловНаСервере.Получить()");
		Если Прав(Каталог, 1) <> "\" Тогда
			Каталог = Каталог + "\";
		КонецЕсли;
		ЗапуститьПриложение(Каталог + Данные + Файл.Расширение);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПередатьВБанкротныеНаСервере()
	ДО = ЭтаФорма.Объект.Ссылка;
	Код = "0181";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Архив");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0182";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Банкротство");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0183";
	Значение = "";
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение);
	// Обновить дату закрытия в агентстве
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, "0137", ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВБанкротные(Команда)
	ПередатьВБанкротныеНаСервере();
	ОповеститьОбИзменении(ЭтаФорма.Объект.Ссылка);
	ЭтаФорма.Закрыть();
	ПоказатьОповещениеПользователя("Служебные функции",,"Действие выполнено",БиблиотекаКартинок.NC_Выполнено);
КонецПроцедуры

&НаСервере
Процедура ПередатьВИзъятыеНаСервере()
	ДО = ЭтаФорма.Объект.Ссылка;
	Код = "0181";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Архив");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0182";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Изъятые банком");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0183";
	Значение = "";
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение);
	// Обновить дату закрытия в агентстве
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, "0137", ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВИзъятые(Команда)
	ПередатьВИзъятыеНаСервере();
	ОповеститьОбИзменении(ЭтаФорма.Объект.Ссылка);
	ЭтаФорма.Закрыть();
	ПоказатьОповещениеПользователя("Служебные функции",,"Действие выполнено",БиблиотекаКартинок.NC_Выполнено);
КонецПроцедуры

&НаСервере
Процедура ПередатьВНеконструктивныеНаСервере()
	ДО = ЭтаФорма.Объект.Ссылка;
	Код = "0181";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("СТОП");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0182";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Неконструктивен");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0183";
	Значение = "";
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение);
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВНеконструктивные(Команда)
	ПередатьВНеконструктивныеНаСервере();
	ОповеститьОбИзменении(ЭтаФорма.Объект.Ссылка);
	ЭтаФорма.Закрыть();
	ПоказатьОповещениеПользователя("Служебные функции",,"Действие выполнено",БиблиотекаКартинок.NC_Выполнено);
КонецПроцедуры

&НаСервере
Процедура ПередатьВПогашенныеНаСервере()
	ДО = ЭтаФорма.Объект.Ссылка;
	Код = "0181";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Архив");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0182";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Погашена");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0183";
	Значение = "";
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение);
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВПогашенные(Команда)
	ПередатьВПогашенныеНаСервере();
	ОповеститьОбИзменении(ЭтаФорма.Объект.Ссылка);
	ЭтаФорма.Закрыть();
	ПоказатьОповещениеПользователя("Служебные функции",,"Действие выполнено",БиблиотекаКартинок.NC_Выполнено);
КонецПроцедуры

&НаСервере
Процедура ПередатьВРаботуНаСервере()
	ДО = ЭтаФорма.Объект.Ссылка;
	Код = "0181";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("В работе");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0182";
	Значение = "";
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0183";
	Значение = "";
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение);
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВРаботу(Команда)
	ПередатьВРаботуНаСервере();
	ОповеститьОбИзменении(ЭтаФорма.Объект.Ссылка);
	ЭтаФорма.Закрыть();
	ПоказатьОповещениеПользователя("Служебные функции",,"Действие выполнено",БиблиотекаКартинок.NC_Выполнено);	
КонецПроцедуры

&НаСервере
Процедура ПередатьВоВременныйСТОПНаСервере()
	ДО = ЭтаФорма.Объект.Ссылка;
	Код = "0181";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("СТОП");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0182";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Временный СТОП");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0183";
	Значение = "";
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение);
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВоВременныйСТОП(Команда)
	ПередатьВоВременныйСТОПНаСервере();
	ОповеститьОбИзменении(ЭтаФорма.Объект.Ссылка);
	ЭтаФорма.Закрыть();
	ПоказатьОповещениеПользователя("Служебные функции",,"Действие выполнено",БиблиотекаКартинок.NC_Выполнено);
КонецПроцедуры

&НаСервере
Процедура ПередатьВПроцессБанкротстваНаСервере()
	ДО = ЭтаФорма.Объект.Ссылка;
	Код = "0181";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("СТОП");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0182";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Процесс банкротства");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0183";
	Значение = "";
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение);
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВПроцессБанкротства(Команда)
	ПередатьВПроцессБанкротстваНаСервере();
	ОповеститьОбИзменении(ЭтаФорма.Объект.Ссылка);
	ЭтаФорма.Закрыть();
	ПоказатьОповещениеПользователя("Служебные функции",,"Действие выполнено",БиблиотекаКартинок.NC_Выполнено);
КонецПроцедуры

&НаСервере
Процедура ПередатьПоОтказуОтВзаимодействияНаСервере()
	ДО = ЭтаФорма.Объект.Ссылка;
	Код = "0181";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Архив");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0182";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Отказ от взаимодействия");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0183";
	Значение = "";
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение);
КонецПроцедуры

&НаКлиенте
Процедура ПередатьПоОтказуОтВзаимодействия(Команда)
	ПередатьПоОтказуОтВзаимодействияНаСервере();
	ОповеститьОбИзменении(ЭтаФорма.Объект.Ссылка);
	ЭтаФорма.Закрыть();
	ПоказатьОповещениеПользователя("Служебные функции",,"Действие выполнено",БиблиотекаКартинок.NC_Выполнено);
КонецПроцедуры

&НаСервере
Процедура ПередатьПоПричинеСмертиНаСервере()
	ДО = ЭтаФорма.Объект.Ссылка;
	Код = "0181";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("СТОП");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0182";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Должник умер");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0183";
	Значение = "";
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение);
КонецПроцедуры

&НаКлиенте
Процедура ПередатьПоПричинеСмерти(Команда)
	ПередатьПоПричинеСмертиНаСервере();
	ОповеститьОбИзменении(ЭтаФорма.Объект.Ссылка);
	ЭтаФорма.Закрыть();
	ПоказатьОповещениеПользователя("Служебные функции",,"Действие выполнено",БиблиотекаКартинок.NC_Выполнено);
КонецПроцедуры

&НаСервере
Процедура ПередатьВЮДНаСервере()
	ДО = ЭтаФорма.Объект.Ссылка;
	Код = "0181";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("СТОП");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0182";
	Значение = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Передано в ЮД");
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение); 
	Код = "0183";
	Значение = "";
	ОбъектыСервер.ЗаписатьЗначениеСвойства(ДО, Код, Значение);
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВЮД(Команда)
	ПередатьВЮДНаСервере();
	ОповеститьОбИзменении(ЭтаФорма.Объект.Ссылка);
	ЭтаФорма.Закрыть();
	ПоказатьОповещениеПользователя("Служебные функции",,"Действие выполнено",БиблиотекаКартинок.NC_Выполнено);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСобытияКИНаСервере()
	ЭтаФорма.НастройкаВыгрузкиКИ = Справочники.НастройкиВыгрузкиНБКИ_RUTDF.НайтиПоКоду("000000001");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСобытияКИ(Команда)
	ЗаполнитьСобытияКИНаСервере();
	ФормаНастроек = ПолучитьФорму("Справочник.НастройкиВыгрузкиНБКИ_RUTDF.ФормаОбъекта", Новый Структура("Ключ", ЭтаФорма.НастройкаВыгрузкиКИ));
	ФормаНастроек.Договор = ЭтаФорма.Объект.Ссылка;
	ФормаНастроек.Должник = ЭтаФорма.Объект.Должник;
	ФормаНастроек.ПервичноеЗаполнениеПоОдномуДО(Неопределено);
	ПодключитьОбработчикОжидания("ОбновитьСобытияКИ", 1, Истина);
КонецПроцедуры

&НаСервере
Процедура ОбновитьИПНаСервере()
	ДатаРождения = СтрЗаменить(Формат(ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Должник, "0043"), "ДФ=yyyy-MM-dd"), " 0:00:00", "");
	КодРегиона = ФССПСлужебный.ПолучитьКодРегионаПоДолжнику(ЭтаФорма.Объект.Должник);
	Если КодРегиона <> Неопределено Тогда
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Должник");
		ТЗ.Колонки.Добавить("ДатаРождения");
		ТЗ.Колонки.Добавить("КодРегиона");	
		Стр = ТЗ.Добавить();
		Стр.Должник = ЭтаФорма.Объект.Должник.Наименование;
		Стр.ДатаРождения = ДатаРождения;
		Стр.КодРегиона = КодРегиона;
		ФССПСлужебный.ПолучитьИП(ТЗ);
		// Создать мероприятие розыска
		НовоеМероприятие = Задачи.Мероприятие.СоздатьЗадачу();	
		НовоеМероприятие.Автор = ПараметрыСеанса.ТекущийПользователь;
		НовоеМероприятие.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
		НовоеМероприятие.Дата = ТекущаяДата();
		НовоеМероприятие.ВремяСоздания = ТекущаяДата();
		НовоеМероприятие.ПланируемаяДата = ТекущаяДата();
		НовоеМероприятие.ДатаВыполнения = ТекущаяДата();
		НовоеМероприятие.ФактическаяДата = ТекущаяДата();
		НовоеМероприятие.ДлительностьРазговора = "0:00:00";
		НовоеМероприятие.Объект = ЭтаФорма.Объект.Ссылка;
		НовоеМероприятие.ТипМероприятия = Справочники.ТипыМероприятий.НайтиПоНаименованию("Розыск должника");
		НовоеМероприятие.Результат = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Запрос в ФССП");
		НовоеМероприятие.Выполнена = Истина;
		НовоеМероприятие.Записать();
	Иначе
		Сообщить("Не удалось определить регион должника! Проверьте корректность адреса регистрации");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИП(Команда)
	Состояние("Интеграция с ФССП",, "Получение данных...", БиблиотекаКартинок.NC_ПодсистемаФССП);
	ОбновитьИПНаСервере();
	ПоказатьОповещениеПользователя("Интеграция с ФССП",,"Данные обновлены",БиблиотекаКартинок.NC_ПодсистемаФССП);
	ЭтаФорма.Элементы.НайденныеИП.Обновить();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДелаОБанкротствеНаСервере()
	ЕФРСБСлужебный.ПолучитьСведения(ЭтаФорма.Объект.Должник.ФИО[0].ФИО, ЭтаФорма.Объект.Должник.Код);
	// Создать мероприятие розыска
	НовоеМероприятие = Задачи.Мероприятие.СоздатьЗадачу();	
	НовоеМероприятие.Автор = ПараметрыСеанса.ТекущийПользователь;
	НовоеМероприятие.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	НовоеМероприятие.Дата = ТекущаяДата();
	НовоеМероприятие.ВремяСоздания = ТекущаяДата();
	НовоеМероприятие.ПланируемаяДата = ТекущаяДата();
	НовоеМероприятие.ДатаВыполнения = ТекущаяДата();
	НовоеМероприятие.ФактическаяДата = ТекущаяДата();
	НовоеМероприятие.ДлительностьРазговора = "0:00:00";
	НовоеМероприятие.Объект = ЭтаФорма.Объект.Ссылка;
	НовоеМероприятие.ТипМероприятия = Справочники.ТипыМероприятий.НайтиПоНаименованию("Розыск должника");
	НовоеМероприятие.Результат = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Запрос в ЕФРСБ");
	НовоеМероприятие.Выполнена = Истина;
	НовоеМероприятие.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДелаОБанкротстве(Команда)
	Состояние("Интеграция с Федресурсом",, "Получение данных...", БиблиотекаКартинок.NC_ПодсистемаБанкротство);
	ОбновитьДелаОБанкротствеНаСервере();
	ПоказатьОповещениеПользователя("Интеграция с Федресурсом",,"Данные обновлены",БиблиотекаКартинок.NC_ПодсистемаБанкротство);
	ЭтаФорма.Элементы.НайденныеДелаОБанкротстве.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМероприятиеОтправкиНаНомер(Команда)
	ФормаОтправки = ПолучитьФорму("ОбщаяФорма.ВыборТипаДокументаНаОтправку");
	ФормаОтправки.ДО = ЭтаФорма.Объект.Ссылка;
	ФормаОтправки.Контакт = Элементы.ДолжникТелефоны.ТекущиеДанные.Номер;
	ФормаОтправки.Открыть();
КонецПроцедуры

//

