
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.Дата) = Ложь
		И ЗначениеЗаполнено(Запись.Время) = Ложь
		И ЗначениеЗаполнено(Запись.Сотрудник) = Ложь Тогда 
		Запись.Дата = ТекущаяДата();
		Запись.Время = ТекущаяДата();
		Запись.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ЭтаФорма.РольРКЦ = РольДоступна("РКЦ");
	ЭтаФорма.РольАБД = РольДоступна("АБД");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Проверить доступность служебных функций
	ПриОткрытииНаСервере();
	Если ЭтаФорма.РольРКЦ = Истина ИЛИ ЭтаФорма.РольАБД = Истина Тогда
		ЭтаФорма.Элементы.Время.ТолькоПросмотр = Ложь;
	КонецЕсли;
	ПодключитьОбработчикОжидания("ОбновитьВремя", 1);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ЭтаФорма.Запись.ТипЗадачи) = Ложь Тогда
		Предупреждение("Не задан тип задачи!",,"Ошибка создания задачи");
		Отказ = Истина;
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Запись.Состояние) = Ложь Тогда
		Предупреждение("Не задано состояние задачи!",,"Ошибка создания задачи");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВремя()
	Если ЗначениеЗаполнено(ЭтаФорма.ЭтотОбъект.Запись.Состояние) = Ложь Тогда
		Запись.Время = ТекущаяДата();
	КонецЕсли
КонецПроцедуры
