
&НаСервере
Процедура ОтладкаЗапросыНаСервере()    
	ОбъектМодуль = РеквизитФормыВЗначение("Объект");
	ОбъектМодуль.ЗапросыДашБорд(ДиаграммаКоличествоДоговоров, ДиаграммаКоличествоМероприятий, 
								ДиаграммаЗадолженностьСтадия, ДиаграммаЗадолженностьКредиторы);
КонецПроцедуры

&НаКлиенте
Процедура ОтладкаЗапросы(Команда)
	ОтладкаЗапросыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрКредиторПриИзменении(Элемент)
	ФильтрКредиторНаСервере();
КонецПроцедуры  

&НаСервере
Процедура ФильтрКредиторНаСервере()
	ОбъектМодуль = РеквизитФормыВЗначение("Объект");
	ОбъектМодуль.ЗапросыДашБордФильтрКредитор(ФильтрКредитор, ДиаграммаЗадолженностьФильтрКредитор, ДиаграммаКоличествоДоговоровФильтрКредитор);

КонецПроцедуры


&НаСервере
Процедура ФильтрБППриИзмененииНаСервере()
	ОбъектМодуль = РеквизитФормыВЗначение("Объект");
	ОбъектМодуль.ЗапросыДашБордФильтрБП(ФильтрБП, ДиаграммаКоличествоМероприятийФильтрБП);
КонецПроцедуры


&НаКлиенте
Процедура ФильтрБППриИзменении(Элемент)
	ФильтрБППриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбъектМодуль = РеквизитФормыВЗначение("Объект");
	ОбъектМодуль.ЗапросыДашБорд(ДиаграммаКоличествоДоговоров, ДиаграммаКоличествоМероприятий, 
								ДиаграммаЗадолженностьСтадия, ДиаграммаЗадолженностьКредиторы);
КонецПроцедуры


&НаКлиенте
Процедура ОтчетВРасшифровке(Команда)
	// УсловияОтбора = Новый Структура("Кредитор, ЭтапВзыскания", ФильтрКредитор, ФильтрБП);
	// ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	ОткрытьФорму("Отчет.ДашбордРасшифровка.Форма");
КонецПроцедуры


&НаКлиенте
Процедура ПоступлениеОплат(Команда)
	ОткрытьФорму("Отчет.ОтчетПоПлатежам.Форма");
КонецПроцедуры

