
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;    
	Попытка
		ОткрытьЗначение(Элемент.ТекущиеДанные.Регистратор);
	Исключение
		ОткрытьЗначение(Элемент.ТекущиеДанные.Объект);
	КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СисокСуфиксов = Новый СписокЗначений;
	СисокСуфиксов.Добавить("Регл");
	СисокСуфиксов.Добавить("ДО");
	КонтрольИменТиповЗадолженностиКлиент.УстановитьЗначениеКолонок(Элементы.Список.ПодчиненныеЭлементы, "Список", СисокСуфиксов);
КонецПроцедуры

