
Функция ПрикрепитьФайлы(Объект, Эл) Экспорт
	Документ = Документы.ПрикрепитьФайлы.СоздатьДокумент();
	Документ.Организация = ПараметрыСеанса.ТекущийПользователь.Организация;
	Документ.Автор = ПараметрыСеанса.ТекущийПользователь;
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.СудебноеДело") Тогда
		Документ.Объект = Объект.Займ;
	Иначе
		Документ.Объект = Объект;
	КонецЕсли;
	Документ.Дата = ТекущаяДата();
	Документ.Комментарий = "Автоматическое прикрепление";
	//Для Каждого Эл Из Таблица Цикл
		Если Эл.Прикреплять Тогда
			Стр = Документ.Файлы.Добавить();
			Стр.Загружен = Ложь;  
			Стр.Путь = Эл.Путь;
			Стр.ТипФайла = Эл.Шаблон.ТипПрикрепляемогоФайла;
			Стр.Размер = Эл.Размер;
			Стр.УИД = Эл.УИД;
			Стр.Хранилище = Эл.Хранилище;
		КонецЕсли;
	//КонецЦикла;	
	Документ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	//а = 0/0;
	Возврат Документ.Ссылка;
КонецФункции


Функция ОкруглитьРазмерФайла(СтрРазмер)
    Размер = Число(СтрРазмер);
	Если Размер > 1024 Тогда
		Размер = Окр(Размер/1024, 0);
		Стр = Строка(Размер) + " Кб";
	КонецЕсли;
	Если Размер > 1024 Тогда
		Размер = Окр(Размер/1024, 1);
		Стр = Строка(Размер) + " Мб";
	КонецЕсли;
	
	Возврат Стр;		
КонецФункции

Процедура ПакетноеПрикрепление(Организация, Автор, Таблица)
КонецПроцедуры

&НаСервере
Процедура ПоместитьВХранилище(МассивДанных, Таблица) Экспорт
	Индекс = 0;
	Для Каждого Элемент Из Таблица Цикл
		Если МассивДанных[Индекс] <> Неопределено Тогда
			Элемент.Хранилище = Новый ХранилищеЗначения(МассивДанных[Индекс], Новый СжатиеДанных(9));
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьКаталог() Экспорт
	Возврат Константы.КаталогХраненияПрикрепляемыхФайловНаСервере.Получить();
КонецФункции

Функция ПолучитьХранение() Экспорт
	Возврат Константы.ХранитьПрикрепляемыеФайлыНаСервере.Получить();
КонецФункции

