Функция СоздатьЭлементПоШаблонуПечатнойФормы(Шаблон) Экспорт

	Если ТипЗнч(Шаблон) <> Тип("СправочникСсылка.тсШаблоныПечатныхДокументов") Тогда
	
		ВызватьИсключение
			"Передан не правильный тип" + Символы.ПС
			+ "Тип параметра переданного в функцию: " + ТипЗнч(Шаблон);
	
	КонецЕсли;
	
	Если Шаблон.Пустая() Тогда
	
		ВызватьИсключение "Не заполнен шаблон";
	
	КонецЕсли;
	
	Если Шаблон.ТипПисьма.Пустая() Тогда
	
		ВызватьИсключение "Не заполнен тип письма";
	
	КонецЕсли;
	
	НовыйОбъект = СоздатьЭлемент();
	
	ЗаполнитьБазовыеПараметры(НовыйОбъект);
	НовыйОбъект.Подписант = ПолучитьПолписанта(НовыйОбъект);
	
	ЗаполнитьОписаниеПисьма(НовыйОбъект, Шаблон.ТипПисьма, Шаблон.ТемаПисьма);

	Возврат НовыйОбъект;

КонецФункции // ()

Процедура ЗаполнитьБазовыеПараметры(ОбъектВх)

	ОбъектВх.Автор = Пользователи.ТекущийПользователь();
	ОбъектВх.Организация = ОбъектВх.Автор.Организация;

КонецПроцедуры

Функция ПолучитьПолписанта(ОбъектВх)

	Возврат ОбъектВх.Автор;

КонецФункции // ()

Функция ЗаполнитьОписаниеПисьма(ОбъектВх, ТипПисьма, ТемаПисьма)

	ОбъектВх.ТипПисьма = ТипПисьма;
	ОбъектВх.Наименование = ТемаПисьма;

КонецФункции // ()

