
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
	Иначе
		ЭтотОбъект.Объект = ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.РегистрационныйНомер = "";
	ЭтотОбъект.ДатаРегистрации = Дата(1,1,1);
	ЭтотОбъект.НомерЗакреплен = Ложь;
	ЭтотОбъект.ПрикрепленныеФайлы.Очистить();
	ЭтотОбъект.ПодобранныеФайлы.Очистить();
	ЭтотОбъект.Наименование = "№";
	ЭтотОбъект.Комментарий = "";
	ЭтотОбъект.Автор = "";
КонецПроцедуры


