 
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		ОбъектОбязательства = ДанныеЗаполнения.Ссылка;
		Наименование = "Неденежное обязательство..."; 
	КонецЕсли;	 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		ОбъектОбязательства = ДанныеЗаполнения.Ссылка;  
	КонецЕсли;
КонецПроцедуры  

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбъектОбязательства) Или Не ЗначениеЗаполнено(ОбъектПредоставления) Тогда
		Сообщить("Заполните Объект обязательства и Объект предоставления!");
		Отказ = Истина;
	КонецЕсли;	
	Наименование = Строка(ОбъектПредоставления) + ": " + Строка(ОбъектОбязательства);
		
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КредитныеИстории.УдалитьСобытияИсточника(ОбъектОбязательства, ЭтотОбъект.Ссылка); 
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДатаОбращенияСубъекта >= НачалоДня(ТекущаяДатаСеанса()) Тогда
		
		
		Если ЗначениеЗаполнено(ДатаОбращенияСубъекта) И (Не ЗначениеЗаполнено(ДатаОдобренияИсточником) И Не ЗначениеЗаполнено(ДатаПередачиИмуществаСубъекту)) Тогда 
			СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектОбязательства, ЭтотОбъект.Ссылка, "1.1"); 
			Если Не СобытиеЗафиксировано Тогда 
				КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектОбязательства, ДатаОбращенияСубъекта, ЭтотОбъект.Ссылка, "1.1");  
			КонецЕсли;
		КонецЕсли;	
		
		
		Если (ЗначениеЗаполнено(ДатаОбращенияСубъекта) И ЗначениеЗаполнено(ДатаОдобренияИсточником)) И Не ЗначениеЗаполнено(ДатаПередачиИмуществаСубъекту) Тогда
			СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектОбязательства, ЭтотОбъект.Ссылка, "1.2"); 
			Если Не СобытиеЗафиксировано Тогда 
				КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектОбязательства, ДатаОбращенияСубъекта, ЭтотОбъект.Ссылка, "1.2");  
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(UIDНБКИ) И ЗначениеЗаполнено(ДатаПередачиИмуществаСубъекту) Тогда
			СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектОбязательства, ЭтотОбъект.Ссылка, "1.4"); 
			Если Не СобытиеЗафиксировано Тогда 
				КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектОбязательства, ДатаОбращенияСубъекта, ЭтотОбъект.Ссылка, "1.4");  
			КонецЕсли;
			
			СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектОбязательства, ЭтотОбъект.Ссылка, "2.2"); 
			Если Не СобытиеЗафиксировано Тогда 
				КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектОбязательства, ДатаОбращенияСубъекта, ЭтотОбъект.Ссылка, "2.2");  
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектОбязательства, ЭтотОбъект.Ссылка, "1.3"); 
		Если Не СобытиеЗафиксировано Тогда 
			КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектОбязательства, ДатаОбращенияСубъекта, ЭтотОбъект.Ссылка, "1.3");  
		КонецЕсли;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДатаФиксированияИзмений) и ЗначениеЗаполнено(UIDНБКИ) Тогда
		СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектОбязательства, ЭтотОбъект.Ссылка, "2.1"); 
		Если Не СобытиеЗафиксировано Тогда 
			КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектОбязательства, ДатаФиксированияИзмений, ЭтотОбъект.Ссылка, "2.1");  
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры


