Функция Создать(Владелец, Наименование = "") Экспорт

	Участок = СоздатьЭлемент();
	Участок.Наименование = Наименование;
	Участок.Владелец = Владелец;
	
	Возврат Участок;

КонецФункции // ()

Функция ПолучитьНовый(Наименование = Неопределено) Экспорт

	Наименование = ?(Наименование = Неопределено, "<>", Наименование);
	Участок = Создать(Наименование);
	Участок.Записать();
	
	Возврат Участок.Ссылка;

КонецФункции // ()

Процедура ИзменитьНаименование(ЗемельныеУчастки, Наименование) Экспорт

	Объект = ЗемельныеУчастки.ПолучитьОбъект();
	Объект.Наименование = Наименование;
	Объект.Записать();

КонецПроцедуры

// Возвращает набор типов имущества по которым определяются возможные свойства
//
// Возвращаемое значение:
//   Массив из ПланВидовХарактеристикСсылка.Имущество  - Допустимые типы для Свойств
//
Функция ДопустимыеВариантыСвойст() Экспорт

	Имущество = ПланыВидовХарактеристик.Имущество;
	Возврат Имущество.ПолучитьВарианты(Имущество.ЗемельныеУчастки);

КонецФункции // ()