
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.РезультатПроверкиИконка = БиблиотекаКартинок.ОформлениеКругЧерный;
	ЭтаФорма.Элементы.РезультатПроверки.ЦветТекста = WebЦвета.Серый;
	ЭтаФорма.РезультатПроверки = "Соединение не проверялось";
КонецПроцедуры

// Функция возвращает результат пинга указанного IP
Функция ping(IPАдрес)
	objShell = Новый COMОбъект("WScript.Shell") ;
	objScriptExec = objShell.Exec("ping.exe -n 1 " + IPАдрес) ;
	strPingResults = НРег(objScriptExec.StdOut.ReadAll());
	Возврат Найти(strPingResults, "ttl=");
КонецФункции
//

&НаКлиенте
Процедура ПроверкаПокдлючения(Команда)
	Ответ = ping("10.10.0.14");
	Если Ответ > 0 Тогда
		ЭтаФорма.РезультатПроверкиИконка = БиблиотекаКартинок.ОформлениеКругЗеленый;
		ЭтаФорма.Элементы.РезультатПроверки.ЦветТекста = WebЦвета.Зеленый;
		ЭтаФорма.РезультатПроверки = "Соединение установлено. Подключение стабильное";
	ИначеЕсли Ответ = 0 Тогда
		ЭтаФорма.РезультатПроверкиИконка = БиблиотекаКартинок.ОформлениеКругКрасный;
		ЭтаФорма.Элементы.РезультатПроверки.ЦветТекста = WebЦвета.Красный;
		ЭтаФорма.РезультатПроверки = "Соединение не установлено. Подключение отсутствует";
	КонецЕсли;
КонецПроцедуры
