
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.РезультатПроверкиИконка = БиблиотекаКартинок.ОформлениеКругЧерный;
	ЭтаФорма.Элементы.РезультатПроверки.ЦветТекста = WebЦвета.Серый;
	ЭтаФорма.РезультатПроверки = "Подключение не проверялось";
КонецПроцедуры

&НаСервере
Функция OEM2ANSI(СтрокаOEM)
	СтрокаURL = КодироватьСтроку(СтрокаOEM, СпособКодированияСтроки.URLВКодировкеURL, "cp1251");
	СтрокаANSI = РаскодироватьСтроку(СтрокаURL,СпособКодированияСтроки.URLВКодировкеURL, "cp866");
	Возврат СтрокаANSI;
КонецФункции

&НаКлиенте
Функция ПолучитьСтрокуТолькоЦифры(ВходнаяСтрока)     
	Результат = ВходнаяСтрока;   
	ИндексЭлемента = 1;  
	ДоступныеСимволы = "0123456789";
	Пока ИндексЭлемента <= СтрДлина(Результат) Цикл
		ПроверяемыйСимвол = Сред(Результат, ИндексЭлемента, 1);
		Если СтрНайти(ДоступныеСимволы, ПроверяемыйСимвол) = 0 Тогда
			Результат = СтрЗаменить(Результат, ПроверяемыйСимвол, "");
			Продолжить;
		КонецЕсли;
		ИндексЭлемента = ИндексЭлемента + 1;
	КонецЦикла;
	Возврат Результат;      
КонецФункции

&НаКлиенте
// Функция возвращает результат пинга указанного IP
Функция ping(IPАдрес)
	Shell = Новый COMОбъект("WScript.Shell");
	WSHShell = Shell.Exec("ping.exe -n 1 " + IPАдрес);
	РезультатПинга = WSHShell.StdOut.ReadAll();
	МассивСтрок = СтрРазделить(OEM2ANSI(РезультатПинга), " ");
	Возврат ПолучитьСтрокуТолькоЦифры(МассивСтрок.Получить(13));
КонецФункции
//	

&НаКлиенте
Процедура ПроверкаПокдлючения(Команда)
	Ответ = Число(ping("10.10.0.14"));
	ЭтаФорма.Активизировать();
	Если Ответ <= 39 Тогда
		ЭтаФорма.РезультатПроверкиИконка = БиблиотекаКартинок.ОформлениеКругЗеленый;
		ЭтаФорма.Элементы.РезультатПроверки.ЦветТекста = WebЦвета.Зеленый;
		ЭтаФорма.РезультатПроверки = "Подключение стабильное. Время ответа: " + Ответ + " мс";
	ИначеЕсли Ответ >= 40 И Ответ <= 50 Тогда
		ЭтаФорма.РезультатПроверкиИконка = БиблиотекаКартинок.ОформлениеКругЖелтый;
		ЭтаФорма.Элементы.РезультатПроверки.ЦветТекста = WebЦвета.Оранжевый;
		ЭтаФорма.РезультатПроверки = "Подключение удовлетворительное. Время ответа: " + Ответ + " мс";
	ИначеЕсли Ответ > 50 Тогда
		ЭтаФорма.РезультатПроверкиИконка = БиблиотекаКартинок.ОформлениеКругКрасный;
		ЭтаФорма.Элементы.РезультатПроверки.ЦветТекста = WebЦвета.Красный;
		ЭтаФорма.РезультатПроверки = "Подключение нестабильное. Время ответа: " + Ответ + " мс";
	КонецЕсли;
КонецПроцедуры
