
// Функция возвращает результат пинга указанного IPАдреса
Функция ping(IPАдрес)
	objShell = Новый COMОбъект("WScript.Shell") ;
	objScriptExec = objShell.Exec("ping.exe -n 1 " + IPАдрес) ;
	strPingResults = НРег(objScriptExec.StdOut.ReadAll());
	Возврат Найти(strPingResults, "ttl=");
КонецФункции
//

&НаКлиенте
Процедура ПроверкаПокдлючения(Команда)
	Ответ = ping("10.10.0.14");
	ЭтаФорма.РезультатПроверки = "Устанавливается связь с сервером...";
	Если Ответ > 0 Тогда
		ЭтаФорма.РезультатПроверки = "Соединение установлено. Подключение стабильное.";
		ЭтаФорма.Элементы.РезультатПроверки.ЦветТекста = WebЦвета.Зеленый;
	ИначеЕсли Ответ = 0 Тогда
		ЭтаФорма.РезультатПроверки = "Соединение не установлено. Подключение отсутствует.";
		ЭтаФорма.Элементы.РезультатПроверки.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
КонецПроцедуры
