
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("УправляемаяФорма") Тогда
		Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Справочник.Должники.Форма.ФормаЭлемента" Тогда
			ТаблицаЗначений = ЭтаФорма.ВладелецФормы.ТаблицаЗначенийДолговыхОбязательств;
			ЗаполнитьТабличнуюЧасть(ТаблицаЗначений);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧасть(ТаблицаЗначений)
	Объект.ДолговыеОбязательства.Загрузить(ТаблицаЗначений.Выгрузить());	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьУЭД(Команда)
	#Если ВебКлиент тогда
		Сообщить("Данные функционал недоступен на Веб-Клиенте!");
	#Иначе	
		Записать();
		
		ОБъект.Дата = ТекущаяДата();
		
		МассивОбъект = Новый Массив();
		Для Каждого Элемент Из Объект.Объекты Цикл
			МассивОбъект.Добавить(Элемент.Объект);
		КонецЦикла;
		Объект.ПутьКСформированнымДокументам = "";	
		
		Структура = Новый Структура;
		Структура.Вставить("Номер", Объект.Номер);
		Структура.Вставить("Дата", Объект.Дата);
		Структура.Вставить("СклеитьВОдинФайл", Объект.СклеитьВОдинФайл);
		Структура.Вставить("ПрикрепитьФайлы", Объект.СоздатьПрикреплениеФайлов);
		Структура.Вставить("Организация", Объект.Организация);
		Структура.Вставить("Автор", Объект.Автор);
		Структура.Вставить("НеПечататьПовторно",Объект.НеПечататьПовторно);
		
		ПечатьЭлектронныхДокументовКлиент.ПечатьОбъекты(МассивОбъект, Объект.Шаблон, Структура, Объект.ПутьКСформированнымДокументам, Объект.СоздатьПрикреплениеФайлов);
		
		Записать();	
	#КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ОбъектыСервер.ОграничитьТипОбъекта(Элементы.ОбъектыОбъект);
	
	//
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
	
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
	Элементы.ПодборПоНастройкам.Видимость = Константы.ИспользоватьНастройкиПодбораОбъектовУчета.Получить();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПолеПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтрокуОбъект(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элементы.ОбъектыОбъект.ВыбиратьТип = (Элементы.Объекты.ТекущиеДанные.Объект = Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Элементы.ОбъектыОбъект.ВыбиратьТип = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКСформированнымДокументамОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;        
	ЗапуститьПриложение(Объект.ПутьКСформированнымДокументам);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ПродолжитьРаботуПодбораПослеПечатнойФормы");
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоНастройкам(Команда)
	ОбъектыКлиент.ПодборПоНастройкам(ЭтаФорма);
КонецПроцедуры
