
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьПогашениеЗадолженности(Параметры.Ссылка);	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПогашениеЗадолженности(Ссылка)
	
	ПогашениеЗадолженности.Очистить();
	
	//////////////////////////////////////////////////////////////////
	//Построение таблицы 
	СписатьОсновнойДолг	  = 0;
	СписатьПроценты       = 0;
	СписатьШтрафы     	  = 0;
	ОсновнойДолг          = 0;
	Проценты              = 0;
	Штрафы                = 0;
	СталоОсновнойДолг	  = 0;
	СталоПроценты     	  = 0;
	СталоШтрафы      	  = 0;
	СталоСумма       	  = 0;
	Остаток          	  = 0;
	
	// Получаем документы загрузка задолженности.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗагрузкаЗадолженностиПоДолговымОбязательствамДанные.Ссылка КАК Регистратор,
		|	""Начислено"" КАК ВидДвижения,
		|	ЗагрузкаЗадолженностиПоДолговымОбязательствамДанные.Ссылка.Дата КАК ДатаДокумента,
		|	СУММА(ЗагрузкаЗадолженностиПоДолговымОбязательствамДанные.ОсновнойДолгРегл) КАК ОсновнойДолг,
		|	СУММА(ЗагрузкаЗадолженностиПоДолговымОбязательствамДанные.ПроцентыРегл) КАК Проценты,
		|	СУММА(ЗагрузкаЗадолженностиПоДолговымОбязательствамДанные.ШтрафыРегл) КАК Штрафы
		|ИЗ
		|	Документ.ЗагрузкаЗадолженностиПоДолговымОбязательствам.Данные КАК ЗагрузкаЗадолженностиПоДолговымОбязательствамДанные
		|ГДЕ
		|	ЗагрузкаЗадолженностиПоДолговымОбязательствамДанные.ДолговоеОбязательство = &ДолговоеОбязательство
		|	И ЗагрузкаЗадолженностиПоДолговымОбязательствамДанные.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗагрузкаЗадолженностиПоДолговымОбязательствамДанные.Ссылка,
		|	ЗагрузкаЗадолженностиПоДолговымОбязательствамДанные.Ссылка.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗагрузкаЗадолженностиПоДолговымОбязательствамДанные.Ссылка.Дата";

	Запрос.УстановитьПараметр("ДолговоеОбязательство", Ссылка);

	Результат = Запрос.Выполнить();

	ЗагрузкаЗадолженности = Результат.Выбрать();
	
	//Получаем документы Поступление платежей.
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеПлатежейПоДаннымКлиентаДолговыеОбязательства.Ссылка КАК Регистратор,
		|	СУММА(ПоступлениеПлатежейПоДаннымКлиентаДолговыеОбязательства.СуммаРегл) КАК Сумма,
		|	ПоступлениеПлатежейПоДаннымКлиентаДолговыеОбязательства.Ссылка.Дата КАК ДатаДокумента,
		|   ""Погашено"" КАК ВидДвижения
		|ИЗ
		|	Документ.ПоступлениеПлатежейПоДаннымКлиента.ДолговыеОбязательства КАК ПоступлениеПлатежейПоДаннымКлиентаДолговыеОбязательства
		|ГДЕ
		|	ПоступлениеПлатежейПоДаннымКлиентаДолговыеОбязательства.ДолговоеОбязательство = &ДолговоеОбязательство
		|	И ПоступлениеПлатежейПоДаннымКлиентаДолговыеОбязательства.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеПлатежейПоДаннымКлиентаДолговыеОбязательства.Ссылка,
		|	ПоступлениеПлатежейПоДаннымКлиентаДолговыеОбязательства.Ссылка.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПоступлениеПлатежейПоДаннымКлиентаДолговыеОбязательства.Ссылка.Дата";
		
	Запрос.УстановитьПараметр("ДолговоеОбязательство", Ссылка);
	Результат = Запрос.Выполнить();
	ПоступлениеПлатежей = Результат.Выбрать();

	Пока ЗагрузкаЗадолженности.Следующий() Цикл
		
		ОсновнойДолг = ЗагрузкаЗадолженности.ОсновнойДолг;
		Проценты = ЗагрузкаЗадолженности.Проценты;
		Штрафы = ЗагрузкаЗадолженности.Штрафы;
		
		Строка = ПогашениеЗадолженности.Добавить();
	    	
		ЗаполнитьЗначенияСвойств(Строка,ЗагрузкаЗадолженности);
		
		Строка.Период = ПолучитьПериод(Месяц(ЗагрузкаЗадолженности.ДатаДокумента)) + " " + 
			Формат(Год(ЗагрузкаЗадолженности.ДатаДокумента), "ЧГ=0");
			
		СталоОсновнойДолг = СталоОсновнойДолг + ЗагрузкаЗадолженности.ОсновнойДолг;
		СталоПроценты = СталоПроценты + ЗагрузкаЗадолженности.Проценты;
		СталоШтрафы = СталоШтрафы + ЗагрузкаЗадолженности.Штрафы;
		СталоСумма = СталоОсновнойДолг+СталоШтрафы+СталоПроценты;
		
		Строка.СталоОсновнойДолг = СталоОсновнойДолг;
		Строка.СталоПроценты = СталоПроценты;
		Строка.СталоСумма = СталоСумма;
		Строка.СталоШтрафы = СталоШтрафы;
		Долг = СталоСумма;
		
		
		Пока Долг > 0 Цикл
			
			Если Остаток = 0 Тогда
				Если ПоступлениеПлатежей.Следующий() Тогда
					Остаток = Остаток + ПоступлениеПлатежей.Сумма;	
				Иначе Прервать;
				КонецЕсли; 
				
			КонецЕсли;
			
			СписатьОсновнойДолг = ?((ОсновнойДолг - Остаток) <= 0, ОсновнойДолг, Остаток);
			ОсновнойДолг = ОсновнойДолг - СписатьОсновнойДолг;
			Остаток = Остаток - СписатьОсновнойДолг;
			
			СписатьПроценты = ?((Проценты - Остаток) <= 0, Проценты, Остаток);
			Проценты = Проценты - СписатьПроценты;
			Остаток = Остаток - СписатьПроценты;
			
			СписатьШтрафы = ?((Штрафы - Остаток) <= 0, Штрафы, Остаток);
			Штрафы = Штрафы - СписатьШтрафы;
			Остаток = Остаток - СписатьШтрафы;
			
			СталоОсновнойДолг = СталоОсновнойДолг - СписатьОсновнойДолг;
			СталоПроценты = СталоПроценты - СписатьПроценты;
			СталоШтрафы = СталоШтрафы - СписатьШтрафы;
			
			СталоСумма = СталоОсновнойДолг + СталоПроценты + СталоШтрафы;
			Долг = СталоСумма;
			
			Строка = ПогашениеЗадолженности.Добавить();
			ЗаполнитьЗначенияСвойств(Строка,ПоступлениеПлатежей);
			Строка.Период = ПолучитьПериод(Месяц(ЗагрузкаЗадолженности.ДатаДокумента)) + " " + 
				Формат(Год(ЗагрузкаЗадолженности.ДатаДокумента), "ЧГ=0");
				
			ЗаполнитьСтрокуДолга(Строка, СписатьОсновнойДолг, СписатьПроценты, СписатьШтрафы, 
				СталоОсновнойДолг, СталоПроценты, СталоШтрафы, СталоСумма);
				
			


		КонецЦикла;
				
	КонецЦикла;	


КонецПроцедуры

Функция ПолучитьПериод(Месяц)
	
	Если Месяц = 1 Тогда
		Возврат "Январь";
	ИначеЕсли Месяц = 2 Тогда
		Возврат "Февраль";
	ИначеЕсли Месяц = 3 Тогда
		Возврат "Март";
	ИначеЕсли Месяц = 4 Тогда
		Возврат "Апрель";
	ИначеЕсли Месяц = 5 Тогда
		Возврат "Май";
	ИначеЕсли Месяц = 6 Тогда
		Возврат "Июнь";
	ИначеЕсли Месяц = 7 Тогда
		Возврат "Июль";
	ИначеЕсли Месяц = 8 Тогда
		Возврат "Август";
	ИначеЕсли Месяц = 9 Тогда
		Возврат "Сентябрь";
	ИначеЕсли Месяц = 10 Тогда
		Возврат "Октябрь";
	ИначеЕсли Месяц = 11 Тогда
		Возврат "Ноябрь";
	ИначеЕсли Месяц = 12 Тогда
		Возврат "Декабрь";
	КонецЕсли;
	
КонецФункции // ПолучитьПериод()

Процедура ЗаполнитьСтрокуДолга(Строка, ОсновнойДолг, Проценты, Штрафы, СталоОснДолг,
	СталоПроценты, СталоШтрафы, СталоСумма)
	
	Строка.ОсновнойДолг = ОсновнойДолг;
	Строка.Проценты = Проценты;
	Строка.Штрафы = Штрафы;
	Строка.СталоОсновнойДолг = СталоОснДолг;
	Строка.Сталопроценты = СталоПроценты;
	Строка.СталоШтрафы = СталоШтрафы;
	Строка.СталоСумма = СталоСумма;
	

КонецПроцедуры



	
