// Проверяем все шаблоны печатных форм и находим шаблон у которого
//     Тип прикрепляемого файла со свойством Конверт. Если Конвертов
//     несколько, бросаем исключение
Функция НайтиШаблонКонверта(ТипПисьма) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(тсВидыПечатныхДокументовШаблоныПечатныхФорм.ШаблонПечатнойФормы КАК Справочник.тсШаблоныПечатныхДокументов) КАК ШаблонПечатнойФормы
		|ПОМЕСТИТЬ тсШаблоны
		|ИЗ
		|	Справочник.ТипыИсходящихПисем.ПечатныеФормы КАК ТипыИсходящихПисемПечатныеФормы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.тсВидыПечатныхДокументов.ШаблоныПечатныхФорм КАК тсВидыПечатныхДокументовШаблоныПечатныхФорм
		|		ПО ТипыИсходящихПисемПечатныеФормы.ПечатнаяФорма = тсВидыПечатныхДокументовШаблоныПечатныхФорм.Ссылка
		|ГДЕ
		|	ТипыИсходящихПисемПечатныеФормы.Ссылка = &ТипПисьма
		|	И тсВидыПечатныхДокументовШаблоныПечатныхФорм.ШаблонПечатнойФормы ССЫЛКА Справочник.тсШаблоныПечатныхДокументов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тсШаблоны.ШаблонПечатнойФормы КАК ШаблонПечатнойФормы,
		|	тсШаблоныПечатныхДокументов.ТипПрикрепляемогоФайла КАК ТипПрикрепляемогоФайла
		|ПОМЕСТИТЬ втТипШаблона
		|ИЗ
		|	тсШаблоны КАК тсШаблоны
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.тсШаблоныПечатныхДокументов КАК тсШаблоныПечатныхДокументов
		|		ПО тсШаблоны.ШаблонПечатнойФормы = тсШаблоныПечатныхДокументов.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТипШаблона.ШаблонПечатнойФормы КАК ШаблонПечатнойФормы
		|ИЗ
		|	втТипШаблона КАК втТипШаблона
		|ГДЕ
		|	втТипШаблона.ТипПрикрепляемогоФайла.Конверт = ИСТИНА";
	
	Запрос.УстановитьПараметр("ТипПисьма", ТипПисьма);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ШаблоныКонвертов = РезультатЗапроса.Выгрузить();
	
	Если ШаблоныКонвертов.Количество() > 1 Тогда
	
		ВызватьИсключение "Конвертов больше одного!";
	
	КонецЕсли;
	
	Если ШаблоныКонвертов.Количество() = 0 Тогда
	
		Возврат Справочники.тсШаблоныПечатныхДокументов.ПустаяСсылка();
	
	КонецЕсли;
	
	Возврат ШаблоныКонвертов[0].ШаблонПечатнойФормы;

КонецФункции // ()
