
&НаКлиенте
Процедура Подбор(Команда)
	#Если Не ТолстыйКлиентУправляемоеПриложение Тогда
		Сообщить("Данная опция доступна только под толстым клиентом!");
		Возврат;
	#КонецЕсли
	 
	ОбработкаПодбор = ПолучитьФорму("Обработка.ПодборДО.Форма"); 
		
	Поле = ОбработкаПодбор.Объект.ВыбранныеПоля.Добавить();
	Поле.Имя = "ДолговоеОбязательство";
	Поле.Представление = "Долговое обязательство";
	
	Поле = ОбработкаПодбор.Объект.ВыбранныеПоля.Добавить();
	Поле.Имя = "Должник";
	
	ФормаПодбор = ОбработкаПодбор;
	ФормаПодбор.Объект.ТекстЗапроса = "ВЫБРАТЬ
	                                  |	ДолговыеОбязательстваВРаботеОстатки.Должник КАК Должник,
	                                  |	ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство,
	                                  |	ЕСТЬNULL(ЗадолженностьПоДолговомуОбязательствуОстатки.СуммаРеглОстаток, 0) КАК Задолженность,
	                                  |	ДолговыеОбязательстваДополнительныеРеквизиты.Свойство КАК ДопСвойство,
	                                  |	ДолговыеОбязательстваДополнительныеРеквизиты.Значение КАК ДопЗначение,
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Скоринг, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСкоринга.ПустаяСсылка)) КАК Скоринг,
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Категория, ЗНАЧЕНИЕ(Справочник.Категории.ПустаяСсылка)) КАК Категория
	                                  |ИЗ
	                                  |	РегистрНакопления.ДолговыеОбязательстваВРаботе.Остатки(&Дата, Организация = &Организация) КАК ДолговыеОбязательстваВРаботеОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоДолговомуОбязательству.Остатки(&Дата, ) КАК ЗадолженностьПоДолговомуОбязательствуОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = ЗадолженностьПоДолговомуОбязательствуОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СостоянияПоКатегориям.Остатки(&Дата, ) КАК СостоянияПоКатегориямОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = СостоянияПоКатегориямОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДолговыеОбязательстваДополнительныеРеквизиты
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = ДолговыеОбязательстваДополнительныеРеквизиты.Ссылка
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ДолговыеОбязательстваВРаботеОстатки.Должник,
	                                  |	ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство,
	                                  |	ЕСТЬNULL(ЗадолженностьПоДолговомуОбязательствуОстатки.СуммаРеглОстаток, 0),
	                                  |	ДолжникиДополнительныеРеквизиты.Свойство,
	                                  |	ДолжникиДополнительныеРеквизиты.Значение,
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Скоринг, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСкоринга.ПустаяСсылка)),
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Категория, ЗНАЧЕНИЕ(Справочник.Категории.ПустаяСсылка))
	                                  |ИЗ
	                                  |	РегистрНакопления.ДолговыеОбязательстваВРаботе.Остатки(&Дата, Организация = &Организация) КАК ДолговыеОбязательстваВРаботеОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоДолговомуОбязательству.Остатки(&Дата, ) КАК ЗадолженностьПоДолговомуОбязательствуОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = ЗадолженностьПоДолговомуОбязательствуОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СостоянияПоКатегориям.Остатки(&Дата, ) КАК СостоянияПоКатегориямОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = СостоянияПоКатегориямОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должники.ДополнительныеРеквизиты КАК ДолжникиДополнительныеРеквизиты
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.Должник = ДолжникиДополнительныеРеквизиты.Ссылка
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ДолговыеОбязательстваВРаботеОстатки.Должник,
	                                  |	ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство,
	                                  |	ЕСТЬNULL(ЗадолженностьПоДолговомуОбязательствуОстатки.СуммаРеглОстаток, 0),
	                                  |	ДополнительныеСведенияД.Свойство,
	                                  |	ДополнительныеСведенияД.Значение,
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Скоринг, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСкоринга.ПустаяСсылка)),
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Категория, ЗНАЧЕНИЕ(Справочник.Категории.ПустаяСсылка))
	                                  |ИЗ
	                                  |	РегистрНакопления.ДолговыеОбязательстваВРаботе.Остатки(&Дата, Организация = &Организация) КАК ДолговыеОбязательстваВРаботеОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоДолговомуОбязательству.Остатки(&Дата, ) КАК ЗадолженностьПоДолговомуОбязательствуОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = ЗадолженностьПоДолговомуОбязательствуОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СостоянияПоКатегориям.Остатки(&Дата, ) КАК СостоянияПоКатегориямОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = СостоянияПоКатегориямОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияД
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.Должник = ДополнительныеСведенияД.Объект
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ДолговыеОбязательстваВРаботеОстатки.Должник,
	                                  |	ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство,
	                                  |	ЕСТЬNULL(ЗадолженностьПоДолговомуОбязательствуОстатки.СуммаРеглОстаток, 0),
	                                  |	ДополнительныеСведенияДО.Свойство,
	                                  |	ДополнительныеСведенияДО.Значение,
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Скоринг, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСкоринга.ПустаяСсылка)),
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Категория, ЗНАЧЕНИЕ(Справочник.Категории.ПустаяСсылка))
	                                  |ИЗ
	                                  |	РегистрНакопления.ДолговыеОбязательстваВРаботе.Остатки(&Дата, Организация = &Организация) КАК ДолговыеОбязательстваВРаботеОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоДолговомуОбязательству.Остатки(&Дата, ) КАК ЗадолженностьПоДолговомуОбязательствуОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = ЗадолженностьПоДолговомуОбязательствуОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СостоянияПоКатегориям.Остатки(&Дата, ) КАК СостоянияПоКатегориямОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = СостоянияПоКатегориямОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияДО
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = ДополнительныеСведенияДО.Объект";
	
	//Передаём в обработку параметры запроса.
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата", КонецДня(Объект.Дата));
	СтруктураПараметров.Вставить("Организация", Объект.Организация);
	//СтруктураПараметров.Вставить("ДокументОснование", Объект.ДокументОснование);
	ФормаПодбор.Объект.Параметры = СтруктураПараметров;
	ФормаПодбор.Элементы.ТабличноеПолеДанныеИсполнительныйЛист.Видимость = Ложь;
	
	Результат = ФормаПодбор.ОткрытьМодально();       
	//////РаботаСДокументами.ЗанестиРезультатПодбораВТабличнуюЧасть(Объект.РаспределениеДО, Результат);	
	Если Результат <> Неопределено Тогда
		Объект.ДолговыеОбязательства.Очистить();
		ПодборВтаблЧасть(Результат);
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ПодборВтаблЧасть(Результат)
	Об = РеквизитФормыВЗначение("Объект");		
	РаботаСДокументами.ЗанестиРезультатПодбораВТабличнуюЧасть(Об.ДолговыеОбязательства, Результат);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда 
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Повторов = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередСтартом(Отказ)
	Отказ = Истина;
	Объект.Стартован = Истина;
	Объект.Завершен = Ложь;
	//Чуров А.И
	//Объект.КодВЦКТ = СтартоватьВЦКТ();
	//
	Записать();
КонецПроцедуры

&НаСервере
Функция СтартоватьВЦКТ()
	ОбъектЦКТ = ПолучитьИзВременногоХранилища(РаботаСЦКТСервер.АдресОбъектаЦКТ());

	Объект.ВсеУчаствующиеОператоры.Очистить();	
	ОператорыСтрока = "";
	Если Не Объект.ГруппаОператоров.Пустая() Тогда
		Для Каждого Элемент Из Объект.ГруппаОператоров.Операторы Цикл
			Объект.ВсеУчаствующиеОператоры.Добавить().Оператор = Элемент.Оператор;
			ОператорыСтрока = ОператорыСтрока + "," + Формат(Элемент.Оператор.НомерОператора, "ЧГ=");
		КонецЦикла;
	КонецЕсли;	
	Для Каждого Элемент Из Объект.Операторы Цикл
		Если Объект.ВсеУчаствующиеОператоры.НайтиСтроки(Новый Структура("Оператор", Элемент.Оператор)).Количество() = 0 Тогда 
			Объект.ВсеУчаствующиеОператоры.Добавить().Оператор = Элемент.Оператор;
			ОператорыСтрока = ОператорыСтрока + "," + Формат(Элемент.Оператор.НомерОператора, "ЧГ=");		
		КонецЕсли;
	КонецЦикла;
	ОператорыСтрока = Сред(ОператорыСтрока, 2);
	
	
	НовыйБП = ОбъектЦКТ.БизнесПроцессы.КампанияОбзвона.СоздатьБизнесПроцесс();	
	НовыйБП.Дата = ТекущаяДатаСеанса();
	НовыйБП.Приоритет = Объект.Приоритет;
	НовыйБП.Повторов = Объект.Повторов;
	НовыйБП.Операторы = ОператорыСтрока;
	
	ЗапросСведения = Новый Запрос("ВЫБРАТЬ
	                              |	ДополнительныеСведения.Значение
	                              |ИЗ
	                              |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                              |ГДЕ
	                              |	(ДополнительныеСведения.Объект = &Должник
	                              |			ИЛИ ДополнительныеСведения.Объект = &ДО)
	                              |	И ДополнительныеСведения.Свойство = &Свойство");
	ЗапросСведения.УстановитьПараметр("Свойство", Объект.ВидКИ);
	ЗапросРеквизита = Новый Запрос("ВЫБРАТЬ
	                               |	ДолжникиДополнительныеРеквизиты.Значение
	                               |ИЗ
	                               |	Справочник.Должники.ДополнительныеРеквизиты КАК ДолжникиДополнительныеРеквизиты
	                               |ГДЕ
	                               |	ДолжникиДополнительныеРеквизиты.Ссылка = &Должник
	                               |	И ДолжникиДополнительныеРеквизиты.Свойство = &Свойство
	                               |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	ДолговыеОбязательстваДополнительныеРеквизиты.Значение
	                               |ИЗ
	                               |	Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДолговыеОбязательстваДополнительныеРеквизиты
	                               |ГДЕ
	                               |	ДолговыеОбязательстваДополнительныеРеквизиты.Ссылка = &ДО
	                               |	И ДолговыеОбязательстваДополнительныеРеквизиты.Свойство = &Свойство");
	ЗапросРеквизита.УстановитьПараметр("Свойство", Объект.ВидКИ);	
	
	
	Для Каждого Элемент Из Объект.ДолговыеОбязательства Цикл	
		Если Объект.ВидКИ.ЭтоДополнительноеСведение Тогда
			ЗапросСведения.УстановитьПараметр("Должник", Элемент.Должник);
			ЗапросСведения.УстановитьПараметр("ДО", Элемент.ДолговоеОбязательство);
			Результат = ЗапросСведения.Выполнить().Выбрать();
		Иначе	
			ЗапросРеквизита.УстановитьПараметр("Должник", Элемент.Должник);
			ЗапросРеквизита.УстановитьПараметр("ДО", Элемент.ДолговоеОбязательство);
			Результат = ЗапросРеквизита.Выполнить().Выбрать();
		КонецЕсли;	
		
		Элемент.Результат = "Нет КИ";
		Если Результат.Следующий() Тогда
			Телефон = Документы.ЗаданияДляАвтоинформирования.ПодготовитьТелефон(Результат.Значение);
			Если ЗначениеЗаполнено(Телефон) Тогда
				Элемент.Результат = "";
				Элемент.УИД = Новый УникальныйИдентификатор();	
				НоваяСтрока = НовыйБП.Абоненты.Добавить();	
				НоваяСтрока.УИАбонента = Строка(Элемент.УИД);
				НоваяСтрока.НомерТелефона = Телефон;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НовыйБП.Записать();
	НовыйБП.Старт();
	Возврат НовыйБП.Номер;
КонецФункции

&НаКлиенте
Процедура СтартоватьИЗакрыть(Команда)
	ПередСтартом(Неопределено);
	Закрыть();
КонецПроцедуры
